# %Z% %W% %I% %E% %U%
#
#   <copyright 
#   notice="oco-source" 
#   pids="5724-H72" 
#   years="2008,2017" 
#   crc="775383328" > 
#   IBM Confidential 
#    
#   OCO Source Materials 
#    
#   5724-H72,5655-R36,5655-L82,5724-L26, 
#    
#   (C) Copyright IBM Corp. 2008, 2017 
#    
#   The source code for the program is not published 
#   or otherwise divested of its trade secrets, 
#   irrespective of what has been deposited with the 
#   U.S. Copyright Office. 
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR

JMSCC0001 = Si \u00e8 verificato un errore interno. Non \u00e8 stato possibile istanziare una classe richiesta: ''{0}''.
JMSCC0001.useraction = Salvare tutti i file di output generati e utilizzare il sito dell'assistenza MQ: http://www.ibm.com/software/integration/wmq/support/, o l'ISA(IBM Support Assistant): http://www.ibm.com/software/support/isa/, per vedere se \u00e8 gi\u00e0 disponibile una soluzione.  In caso di impossibilit\u00e0 di trovare una corrispondenza, contattare il centro assistenza IBM.
JMSCC0001.inserts = XMSC_INSERT_EXCEPTION

JMSCC0002 = IBM MQ classes per JMS ha tentato di impostare un ID client non valido su una connessione.
JMSCC0002.explanation = Un'applicazione ha tentato di impostare la propriet\u00e0 ID client di una connessione valida su un valore nullo oppure ha tentato di impostare la propriet\u00e0 clientID di una connessione non valida.
JMSCC0002.useraction = La propriet\u00e0 clientId su una connessione pu\u00f2 solo essere impostata una volta, solo su un valore non nullo e solo prima che la connessione venga usata. Assicurarsi che la connessione sia valida e che il client ID non sia nullo.
JMSCC0002.exception = com.ibm.msg.client.jms.DetailedInvalidClientIDException

JMSCC0003 = Il valore specificato ''{1}'' non \u00e8 consentito per ''{0}''.
JMSCC0003.explanation = Il valore fornito non \u00e8 consentito per la propriet\u00e0 specificata.
JMSCC0003.useraction = Modificare il valore nel valore supportato per la propriet\u00e0.
JMSCC0003.inserts = XMSC_INSERT_NAME, XMSC_INSERT_VALUE
JMSCC0003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0004 = La chiamata a receive non restituir\u00e0 un messaggio per una connessione arrestata.
JMSCC0004.explanation = La specifica JMS dice che la chiamata al metodo receive() non deve restituire un messaggio se la connessione viene arrestata. La chiamata a receiveNoWait o receive con un timeout restituir\u00e0 il valore nullo quando il timeout scade. La chiamata a receive senza timeout ritorner\u00e0 finch\u00e9 la connessione non viene avviata o chiusa o l'applicazione termina.
JMSCC0004.useraction = Avviare la connessione chiamando javax.jms.Connection.start(). 

# JMSCC0005 is the same as JMSCC0003 except that JMSCC0003 throws a InvalidDestinationException
# whereas JMSCC0005 throws an JMSException.
JMSCC0005 = Il valore specificato ''{1}'' non \u00e8 consentito per ''{0}''.
JMSCC0005.explanation = Il valore fornito non \u00e8 consentito per la propriet\u00e0 specificata.
JMSCC0005.useraction = Modificare il valore nel valore supportato per la propriet\u00e0.
JMSCC0005.inserts = XMSC_INSERT_NAME, XMSC_INSERT_VALUE

JMSCC0007 = \u00c8 stata ricevuta un''eccezione durante la chiamata al metodo ''{1}'': ''{0}''.
JMSCC0007.explanation = \u00c8 stata emessa un'eccezione da un altro componente mentre era in esecuzione il metodo specificato.
JMSCC0007.useraction = Per ulteriori informazioni, vedere l'eccezione collegata.
JMSCC0007.inserts = XMSC_INSERT_EXCEPTION, XMSC_INSERT_METHOD

JMSCC0008 = La connessione \u00e8 chiusa.
JMSCC0008.explanation = Un'applicazione ha richiamato un metodo che non deve essere usato dopo che la connessione \u00e8 stata chiusa.
JMSCC0008.useraction = Assicurarsi che la connessione non sia stata chiusa prima della chiamata al metodo.
JMSCC0008.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0011 = Il metodo ''{0}'' non \u00e8 consentito in questo contenitore.
JMSCC0011.explanation = \u00c8 stato richiamato un metodo che non \u00e8 consentito nel contenitore corrente.
JMSCC0011.useraction = Rimuovere la chiamata al metodo.
JMSCC0011.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0011.inserts = XMSC_INSERT_METHOD

JMSCC0012 = Il metodo ''{0}'' non pu\u00f2 essere richiamato da un listener {1}.
JMSCC0012.explanation = \u00c8 stato richiamato un metodo che non \u00e8 consentito nel contesto corrente.
JMSCC0012.useraction = Rimuovere la chiamata al metodo.
JMSCC0012.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0012.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_NAME

JMSCC0014 = Non \u00e8 consentito chiamare il metodo ''{0}'' su una sessione non transacted.
JMSCC0014.explanation = L'applicazione ha richiamato un metodo che non deve essere richiamato su una sessione non transacted.
JMSCC0014.useraction = Modificare il programma dell'applicazione per rimuovere questo comportamento.
JMSCC0014.inserts = XMSC_INSERT_METHOD
JMSCC0014.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0020 = La sessione \u00e8 chiusa.
JMSCC0020.explanation = Un'applicazione ha richiamato un metodo che non deve essere usato dopo che la sessione \u00e8 stata chiusa.
JMSCC0020.useraction = Assicurarsi che la sessione non sia stata chiusa prima della chiamata al metodo.
JMSCC0020.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0021 = Non \u00e8 consentito chiamare il metodo ''{0}'' su una sessione transacted.
JMSCC0021.explanation = L'applicazione ha richiamato un metodo che non deve essere richiamato su una sessione transacted.
JMSCC0021.useraction = Modificare il programma dell'applicazione per rimuovere questo comportamento.
JMSCC0021.inserts = XMSC_INSERT_METHOD
JMSCC0021.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0026 = Il mittente del messaggio \u00e8 chiuso.
JMSCC0026.explanation = Un'applicazione ha richiamato un metodo che non deve essere usato dopo che il mittente del messaggio \u00e8 stato chiuso.
JMSCC0026.useraction = Assicurarsi che il mittente del messaggio non sia stato chiuso prima della chiamata al metodo.
JMSCC0026.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0029 = Deve essere specificata una destinazione durante l'invio da questo mittente.
JMSCC0029.explanation = Il mittente \u00e8 stato creato con una destinazione nulla e non \u00e8 stata fornita una destinazione sul metodo send.
JMSCC0029.useraction = Modificare l'applicazione in modo che venga usato un metodo send() che specifica una destinazione oppure specificare una destinazione quando si crea il mittente.
JMSCC0029.exception = java.lang.UnsupportedOperationException

JMSCC0030 = Non \u00e8 consentito specificare una destinazione durante l'invio da questo mittente.
JMSCC0030.explanation = Il mittente \u00e8 stato creato con una destinazione specificata, non \u00e8 consentito specificare nuovamente una destinazione durante l'invio di un messaggio.
JMSCC0030.useraction = Modificare l'applicazione in modo che venga usato un metodo send che non specifica una destinazione oppure specificare una destinazione nulla quando si crea il mittente.
JMSCC0030.exception = java.lang.UnsupportedOperationException

JMSCC0031 = Non \u00e8 consentito specificare un listener di completamento nullo.
JMSCC0031.explanation = La chiamata al metodo send includeva un listener di completamento, ma il listener era nullo.
JMSCC0031.useraction = Modificare l'applicazione in modo che venga usato un metodo send che non specifica un listener di completamento oppure specificare un listener di completamento non nullo quando si effettua la chiamata send.
JMSCC0031.exception = java.lang.IllegalArgumentException

JMSCC0032 = Il ricevente del messaggio \u00e8 chiuso.
JMSCC0032.explanation = Un'applicazione ha richiamato un metodo che non deve essere usato dopo che il ricevente del messaggio \u00e8 stato chiuso.
JMSCC0032.useraction = Assicurarsi che il ricevente del messaggio non sia stato chiuso prima della chiamata al metodo.
JMSCC0032.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0033 = Non \u00e8 consentita la chiamata a un metodo sincrono quando una sessione viene utilizzata in modalit\u00e0 asincrona: ''{0}''.
JMSCC0033.explanation = La specifica JMS non consente di utilizzare una sessione per metodi sincroni quando \u00e8 in esecuzione la consegna asincrona dei messaggi.
JMSCC0033.useraction = Creare una sessione separata se si desidera utilizzare contemporaneamente sia i metodi sincroni sia la consegna asincrona.
JMSCC0033.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0033.inserts = XMSC_INSERT_METHOD

JMSCC0034 = Il meccanismo di recapito asincrono si trova in uno stato incongruente nel metodo: ''{0}''.
JMSCC0034.explanation = \u00c8 stata rilevata una sequenza di eventi non prevista durante il recapito di messaggi a un MDB (message-driven bean). Ci\u00f2 potrebbe essere causato da errori dell'applicazione di programmazione client.
JMSCC0034.useraction = Controllare il file di log del server delle applicazioni per altri problemi associati a MDB. Salvare tutti i file di output generati e utilizzare il sito dell'assistenza WMQ: http://www.ibm.com/software/integration/wmq/support/, o l'ISA(IBM Support Assistant): http://www.ibm.com/software/support/isa/, per vedere se \u00e8 gi\u00e0 disponibile una soluzione.  In caso di impossibilit\u00e0 di trovare una corrispondenza, contattare il centro assistenza IBM.
JMSCC0034.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0034.inserts = XMSC_INSERT_METHOD

JMSCC0037 = \u00c8 stata emessa un'eccezione dal metodo MessageListener.onMessage().
JMSCC0037.explanation = Un ricevente di messaggi con un listener di messaggi registrati ha ricevuto un'eccezione dal metodo onMessage().
JMSCC0037.useraction = Il metodo onMessage() deve essere modificato in modo da evitare l'emissione di eccezioni.

JMSCC0038 = L'utente non dispone dell'autorizzazione per eseguire questa operazione. Per ulteriori dettagli, fare riferimento all'eccezione collegata.
JMSCC0038.explanation = L'eccezione collegata contiene dettagli dell'autorizzazione richiesta per eseguite questa operazione.
JMSCC0038.useraction = L'amministratore deve concedere l'autorizzazione necessaria al relativo utente.

JMSCC0039 = Il tipo ''{0}'' non \u00e8 valido da utilizzare come propriet\u00e0 ''{1}'' dell''oggetto.
JMSCC0039.explanation = Un'applicazione ha provato a impostare una propriet\u00e0 dell'oggetto utilizzando un tipo oggetto non permesso dalla specifica JMS.
JMSCC0039.useraction = Utilizzare un tipo di oggetto permesso. Le classi di wrapper primitivi e gli oggetti String sono tipi di oggetti consentiti.
JMSCC0039.inserts = XMSC_INSERT_TYPE, XMSC_INSERT_PROPERTY
JMSCC0039.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0040 = Si \u00e8 verificata un''eccezione durante la ricezione di un messaggio: ''{0}''.
JMSCC0040.explanation = Durante la ricezione di un messaggio \u00e8 stata emessa un'eccezione che ha causato la non riuscita dell'operazione.
JMSCC0040.useraction = Per ulteriori informazioni, esaminare l'eccezione specificata e l'oggetto dell'eccezione collegata.
JMSCC0040.inserts = XMSC_INSERT_EXCEPTION
JMSCC0040.exception = com.ibm.msg.client.jms.internal.JmsQueueBrowserImpl.MessageConversionFailed

JMSCC0041 = La conversione dell''elemento ''{0}'' dal tipo ''{1}'' al tipo ''{2}'' non \u00e8 consentita.
JMSCC0041.explanation = La conversione tra i due tipi di dati specificati non \u00e8 consentita dalla specifica JMS.
JMSCC0041.useraction = Richiamare l'elemento denominato utilizzando una delle conversioni consentite.
JMSCC0041.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE

JMSCC0042 = Il campo ''{0}'' del messaggio non \u00e8 stato impostato.
JMSCC0042.explanation = Un'applicazione ha tentato di richiamare il valore di un campo che non \u00e8 stato impostato.
JMSCC0042.useraction = Impostare il valore del campo prima di richiamarlo.
JMSCC0042.inserts = XMSC_INSERT_FIELD

JMSCC0043 = Non \u00e8 consentito un nome campo nullo o stringa vuota.
JMSCC0043.explanation = Un'applicazione utente ha tentato di impostare un campo che utilizza un nome non valido, ad esempio, la stringa nulla o vuota.
JMSCC0043.useraction = Utilizzare un nome campo valido.
JMSCC0043.exception = java.lang.IllegalArgumentException

JMSCC0044 = Non \u00e8 consentito chiamare il metodo ''{0}'' sul messaggio perch\u00e9 il testo del messaggio \u00e8 di sola lettura.
JMSCC0044.explanation = Un'applicazione utente ha tentato di impostare un testo del messaggio di sola lettura.
JMSCC0044.useraction = Modificare il programma dell'applicazione per rimuovere questo comportamento oppure chiamare prima il metodo clearBody().
JMSCC0044.inserts = XMSC_INSERT_METHOD
JMSCC0044.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSCC0045 = Non \u00e8 consentito chiamare il metodo ''{0}'' sul messaggio perch\u00e9 le propriet\u00e0 del messaggio sono di sola lettura.
JMSCC0045.explanation = Un'applicazione utente ha tentato di impostare una propriet\u00e0 del messaggio di sola lettura.
JMSCC0045.useraction = Modificare il programma dell'applicazione per rimuovere questo comportamento oppure chiamare prima il metodo clearProperties().
JMSCC0045.inserts = XMSC_INSERT_METHOD
JMSCC0045.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSCC0046 = Non \u00e8 consentito chiamare il metodo ''{0}'' sul messaggio perch\u00e9 il testo del messaggio \u00e8 di sola scrittura.
JMSCC0046.explanation = Un'applicazione utente ha tentato di leggere un testo del messaggio di sola scrittura.
JMSCC0046.useraction = Modificare il programma dell'applicazione per rimuovere questo comportamento oppure chiamare prima il metodo reset().
JMSCC0046.inserts = XMSC_INSERT_METHOD
JMSCC0046.exception = com.ibm.msg.client.jms.DetailedMessageNotReadableException

JMSCC0048 = Si \u00e8 verificato un errore durante il tentativo di creare il messaggio. Per ulteriori dettagli, vedere l'eccezione collegata.
JMSCC0048.explanation = Non \u00e8 stato possibile creare il messaggio a causa di un errore.
JMSCC0048.useraction = Per dettagli sull'errore, esaminare l'eccezione collegata.

JMSCC0049 = Il nome propriet\u00e0 ''{0}'' non \u00e8 un identificativo Java(tm) valido.
JMSCC0049.explanation = Il nome della propriet\u00e0 fornito non \u00e8 conforme al formato consentito descritto nella specifica JMS.
JMSCC0049.useraction = Verificare i caratteri utilizzati nel nome della propriet\u00e0 e modificare secondo necessit\u00e0.
JMSCC0049.inserts = XMSC_INSERT_PROPERTY
JMSCC0049.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0050 = Il nome propriet\u00e0 ''{0}'' \u00e8 riservato e non pu\u00f2 essere impostato.
JMSCC0050.explanation = Il nome propriet\u00e0 fornito comincia con il prefisso JMS ma non \u00e8 tra le propriet\u00e0 supportate o impostabili.
JMSCC0050.useraction = Verificare il nome propriet\u00e0 e correggere gli errori.
JMSCC0050.inserts = XMSC_INSERT_PROPERTY
JMSCC0050.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0051 = La propriet\u00e0 ''{0}'' deve essere impostata utilizzando il tipo ''{1}'' e non ''{2}''.
JMSCC0051.explanation = Le propriet\u00e0 JMS_IBM possono solo essere impostate mediante un tipo variabile specifico.
JMSCC0051.useraction = Correggere il codice dell'applicazione in modo che utilizzi il tipo di variabile richiesto quando si imposta questa propriet\u00e0 JMS_IBM.
JMSCC0051.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE
JMSCC0051.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0052 = Si \u00e8 verificata un''eccezione durante la serializzazione dell''oggetto: ''{0}''.
JMSCC0052.explanation = Non \u00e8 stato possibile serializzare l'oggetto a causa dell'eccezione.
JMSCC0052.useraction = Per dettagli sull'errore, esaminare l'eccezione collegata.
JMSCC0052.inserts = XMSC_INSERT_EXCEPTION
JMSCC0052.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0053 = Si \u00e8 verificata un''eccezione durante la deserializzazione di un messaggio, eccezione: ''{0}''.
JMSCC0053.explanation = Non \u00e8 stato possibile deserializzare l'oggetto a causa dell'eccezione mostrata.
JMSCC0053.useraction = Per dettagli sull'errore, esaminare l'eccezione collegata.
JMSCC0053.inserts = XMSC_INSERT_EXCEPTION
JMSCC0053.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0054 = Il browser code non ha messaggi disponibili.
JMSCC0054.explanation = Un'applicazione utente ha richiesto un messaggio da un browser code quando non ve ne erano di disponibili.
JMSCC0054.useraction = Assicurarsi che l'applicazione non chiami questo metodo quando non vi sono messaggi disponibili oppure gestisca l'eccezione.
JMSCC0054.exception = java.util.NoSuchElementException

JMSCC0055 = Il browser code \u00e8 chiuso.
JMSCC0055.explanation = Un'applicazione ha richiamato un metodo che non deve essere usato dopo che il browser code \u00e8 stato chiuso.
JMSCC0055.useraction = Assicurarsi che il browser code non sia stato chiuso prima della chiamata al metodo.
JMSCC0055.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0059 = Il buffer di lettura \u00e8 nullo.
JMSCC0059.explanation = \u00c8 stato passato un riferimento nullo al metodo StreamMessage.readBytes(), quindi non \u00e8 stato possibile restituire alcun dato.
JMSCC0059.useraction = Passare un buffer di dimensione opportuna nel metodo readBytes().
JMSCC0059.exception = java.lang.NullPointerException

JMSCC0060 = \u00c8 stata raggiunta la fine del flusso del messaggio.
JMSCC0060.explanation = \u00c8 stata raggiunta la fine del contenuto del messaggio. Ci\u00f2 \u00e8 normale se l'applicazione di lettura non conosce la quantit\u00e0 di dati previsti.
JMSCC0060.useraction = Nessuna azione richiesta.
JMSCC0060.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCC0061 = L'array di byte StreamMessage non \u00e8 stato letto completamente.
JMSCC0061.explanation = \u00c8 stato fatto un tentativo di leggere il campo successivo dal flusso sebbene un array di byte sia stato letto parzialmente.
JMSCC0061.useraction = Assicurarsi che il codice utente completi la lettura degli array di byte prima di tentare la lettura del campo successivo.
JMSCC0061.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0062 = Non \u00e8 possibile restituire il valore nullo come carattere.
JMSCC0062.explanation = \u00c8 stato fatto un tentativo di leggere un campo StreamMessage nullo mediante il metodo readChar().
JMSCC0062.useraction = Evitare di leggere i valori nulli utilizzando il metodo readChar().
JMSCC0062.exception = java.lang.NullPointerException

JMSCC0063 = La codifica non \u00e8 valida per la stringa ''{0}''.
JMSCC0063.explanation = Il valore fornito non ha una codifica conosciuta.
JMSCC0063.useraction = Assicurarsi che l'applicazione fornisca un valore dall'elenco definito di codifiche.
JMSCC0063.inserts = JMS_IBM_Encoding

JMSCC0064 = Si \u00e8 verificato un errore interno durante la scrittura nel flusso di dati.
JMSCC0064.explanation = Si \u00e8 verificato un problema con i flussi di dati utilizzati per la conversione di formato dei valori float e double.
JMSCC0064.useraction = Salvare tutti i file di output generati e utilizzare il sito dell'assistenza WMQ: http://www.ibm.com/software/integration/wmq/support/, o l'ISA(IBM Support Assistant): http://www.ibm.com/software/support/isa/, per vedere se \u00e8 gi\u00e0 disponibile una soluzione.  In caso di impossibilit\u00e0 di trovare una corrispondenza, contattare il centro assistenza IBM.

JMSCC0065 = \u00c8 stato fatto un tentativo di leggere oltre la fine del messaggio.
JMSCC0065.explanation = \u00c8 stato fatto un tentativo di leggere oltre la fine del messaggio. Questa pu\u00f2 essere una condizione normale se un'applicazione \u00e8 stata codificata per leggere dati a lunghezza variabile utilizzando la specifica JMS 1.0.2.
JMSCC0065.useraction = Se necessario, riscrivere il codice dell'applicazione in modo che utilizzi il nuovo metodo getBodyLength().
JMSCC0065.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCC0066 = Conversione UTF-8 non riuscita.
JMSCC0066.explanation = Si \u00e8 verificato un problema durante la lettura o scrittura di una stringa UTF-8. La causa pi\u00f9 comune \u00e8 il tentativo di scrivere una stringa pi\u00f9 lunga di 65535 caratteri.
JMSCC0066.useraction = Per ulteriori informazioni vedere l'eccezione collegata.
JMSCC0066.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0067 = Si \u00e8 verificato un errore interno. Problema nella scrittura nel messaggio.
JMSCC0067.explanation = Si \u00e8 verificato un errore durante il tentativo di scrivere un elemento nel messaggio.
JMSCC0067.useraction = Salvare tutti i file di output generati e utilizzare il sito dell'assistenza WMQ: http://www.ibm.com/software/integration/wmq/support/, o l'ISA(IBM Support Assistant): http://www.ibm.com/software/support/isa/, per vedere se \u00e8 gi\u00e0 disponibile una soluzione.  In caso di impossibilit\u00e0 di trovare una corrispondenza, contattare il centro assistenza IBM.
JMSCC0067.exception = com.ibm.msg.client.jms.DetailedResourceAllocationException

JMSCC0068 = La propriet\u00e0 ''{0}'' deve essere impostata utilizzando un valore di tipo ''{1}'', o un tipo convertibile in questo tipo, come indicato dalla specifica JMS. Non \u00e8 possibile eseguire la conversione dal tipo indicato ''{2}''. 
JMSCC0068.explanation = La conversione tra i due tipi di dati specificati non \u00e8 consentita dalla specifica JMS.
JMSCC0068.useraction = Impostare la propriet\u00e0 denominata utilizzando una delle conversioni consentite.
JMSCC0068.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC0068.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE

JMSCC0069 = La propriet\u00e0 ''{0}'' deve essere impostata utilizzando un valore di tipo ''{1}''. Non \u00e8 possibile eseguire la conversione dal tipo indicato ''{2}'' con il valore ''{3}''. 
JMSCC0069.explanation = Si \u00e8 verificato un errore durante il tentativo di impostare una propriet\u00e0 del messaggio.
JMSCC0069.useraction = Impostare la propriet\u00e0 denominata utilizzando una delle conversioni consentite con un valore appropriato.
JMSCC0069.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC0069.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE, XMSC_INSERT_VALUE

JMSCC0070 = Si \u00e8 verificato un errore interno. Si \u00e8 verificato un problema nell''impostazione della propriet\u00e0 del messaggio JMS ''{0}'', tipo previsto ''{1}'', con un oggetto di tipo ''{2}''.
JMSCC0070.explanation = Si \u00e8 verificato un errore durante il tentativo di impostare una propriet\u00e0 del messaggio.
JMSCC0070.useraction = Salvare tutti i file di output generati e utilizzare il sito dell'assistenza WMQ: http://www.ibm.com/software/integration/wmq/support/, o l'ISA(IBM Support Assistant): http://www.ibm.com/software/support/isa/, per vedere se \u00e8 gi\u00e0 disponibile una soluzione.  In caso di impossibilit\u00e0 di trovare una corrispondenza, contattare il centro assistenza IBM.
JMSCC0070.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC0070.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE

JMSCC0083 = \u00c8 stato fornito un oggetto non corretto di tipo ''{0}''.
JMSCC0083.explanation = \u00c8 stato fornito un oggetto al metodo writeObject() che non era un wrapper primitivo Java(tm).
JMSCC0083.useraction = Correggere l'applicazione per assicurarsi che siano passati come parametri al metodo writeObject() solo oggetti dei tipi permessi.
JMSCC0083.inserts = XMSC_INSERT_OBJECT
JMSCC0083.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0084 = Non \u00e8 stata impostata una propriet\u00e0 di nome ''{0}''.
JMSCC0084.inserts = XMSC_INSERT_PROPERTY

JMSCC0085 = Non \u00e8 stata specificata una destinazione.
JMSCC0085.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0086 = La dimensione batch ''{0}'' non era corretta.
JMSCC0086.inserts = XMSC_INSERT_BATCH_SIZE

JMSCC0087 = Non \u00e8 stato specificato un pool di sessioni server.

JMSCC0088 = Non \u00e8 stato possibile ottenere la sessione dal pool di sessioni specificato.

JMSCC0089 = La sessione ''{0}'' non era valida.
JMSCC0089.inserts = XMSC_INSERT_SESSION

JMSCC0091 = Non \u00e8 stato possibile caricare il factory del provider per il tipo di connessione ''{0}''.
JMSCC0091.inserts = XMSC_CONNECTION_TYPE

JMSCC0092 = Era previsto il tipo di connessione ''{0}'' che invece in realt\u00e0 era ''{1}''.
JMSCC0092.inserts = XMSC_CONNECTION_TYPE_NAME, XMSC_CONNECTION_TYPE
JMSCC0092.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0093 = La destinazione non era valida. Non \u00e8 possibile creare la sottoscrizione durevole su una destinazione temporanea di tipo ''{0}'' e nome ''{1}''.
JMSCC0093.inserts = XMSC_INSERT_TYPE, XMSC_DESTINATION_NAME
JMSCC0093.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0094 = Questo browser delle connessioni \u00e8 chiuso.
JMSCC0094.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0095 = Il nome di destinazione ''{0}'' non \u00e8 valido.
JMSCC0095.explanation = Il nome di destinazione specificato non \u00e8 conforme alla sintassi di destinazione pubblicata.
JMSCC0095.useraction = Correggere il nome di destinazione specificato e riprovare.
JMSCC0095.inserts = XMSC_DESTINATION_NAME
JMSCC0095.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0097 = Modalit\u00e0 di riconoscimento ''{0}'' non corretta. \u00c8 stato chiesto a Connection.createSession() di creare una sessione non transacted (transacted era a false) ma la modalit\u00e0 di riconoscimento non era AUTO_ACKNOWLEDGE, DUPS_OK_ACKNOWLEDGE o CLIENT_ACKNOWLEDGE.
JMSCC0097.inserts = XMSC_ACKNOWLEDGE_MODE

JMSCC0098 = Il messaggio non pu\u00f2 essere nullo.
JMSCC0098.useraction = Specificare un messaggio non nullo.
JMSCC0098.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0099 = La destinazione ''{0}'' non \u00e8 un''istanza di com.ibm.msg.client.jms.JmsDestination.
JMSCC0099.useraction = Specificare un'istanza di com.ibm.msg.client.jms.JmsDestination.
JMSCC0099.inserts = XMSC_DESTINATION_NAME
JMSCC0099.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0100 = Il nome sottoscrizione non pu\u00f2 essere nullo.
JMSCC0100.useraction = Specificare un nome sottoscrizione non nullo.
JMSCC0100.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0101 = L'ID client non pu\u00f2 essere nullo.
JMSCC0101.useraction = Specificare un ID client non nullo.
JMSCC0101.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0102 = Il nome propriet\u00e0 ''{0}'' nel messaggio non \u00e8 un identificativo Java(tm) valido.
JMSCC0102.explanation = Il nome della propriet\u00e0 fornito non \u00e8 conforme al formato consentito descritto nella specifica JMS.
JMSCC0102.useraction = Verificare i caratteri utilizzati nel nome della propriet\u00e0 e modificare secondo necessit\u00e0.
JMSCC0102.inserts = XMSC_INSERT_PROPERTY
JMSCC0102.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0103 = \u00c8 stato fornito un oggetto nullo.
JMSCC0103.explanation = \u00c8 stato fornito al metodo writeObject() un oggetto nullo.
JMSCC0103.useraction = Correggere l'applicazione per assicurarsi che siano passati come parametri al metodo writeObject() solo oggetti non nulli.
JMSCC0103.exception = java.lang.NullPointerException

JMSCC0105 = La conversione dell''elemento ''{0}'' dal tipo ''{1}'' al tipo ''{2}'' non \u00e8 consentita.
JMSCC0105.explanation = La conversione tra i due tipi di dati specificati non \u00e8 consentita dalla specifica JMS.
JMSCC0105.useraction = Richiamare l'elemento denominato utilizzando una delle conversioni consentite.
JMSCC0105.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE
JMSCC0105.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0106 = Acquisizione di una risorsa XA non riuscita. ''{0}''.
JMSCC0106.useraction = Vedere la causa per ulteriori informazioni.
JMSCC0106.inserts = XMSC_INSERT_EXCEPTION
JMSCC0106.exception = java.lang.RuntimeException

JMSCC0107 = Timeout ''{0}'' non corretto.
JMSCC0107.explanation = Il timeout deve essere positivo o zero, espresso in millisecondi.
JMSCC0107.useraction = Non passare un timeout negativo.
JMSCC0107.inserts = XMSC_INSERT_TIMEOUT

# Message changed for APAR IT16300
JMSCC0108 = Le classi IBM MQ per JMS hanno rilevato un messaggio, pronto per la consegna asincrona a un'applicazione. Quando si \u00e8 tentata la consegna, il messaggio non era pi\u00f9 disponibile. Consultare l'argomento "Troubleshooting JMSCC0108 messages" nella sezione IBM MQ V9.0 del Knowledge Center IBM per possibili cause e azioni.
JMSCC0108.explanation = Un thread interno nelle classi IBM MQ per JMS ha rilevato un messaggio e ha richiesto che un altro thread interno ottenga il messaggio e lo consegni a un'applicazione per l'elaborazione. Quando il thread ha tentato di ottenere il messaggio, questo non era pi\u00f9 disponibile.
JMSCC0108.useraction = Consultare l'argomento "Troubleshooting JMSCC0108 messages" nella sezione IBM MQ V9.0 del Knowledge Center IBM per ulteriori informazioni.

JMSCC0109 = Un MDB (Message Driven Bean) ha emesso un''eccezione ''{0}'' di runtime.
JMSCC0109.explanation = Questo potrebbe indicare un problema nel listener di messaggi.
JMSCC0109.useraction = Se l'eccezione di runtime \u00e8 stata generata involontariamente dal listener di messaggi, utilizzare l'eccezione collegata per determinare la causa del problema.
JMSCC0109.inserts = XMSC_INSERT_EXCEPTION
JMSCC0109.exception = java.lang.RuntimeException

JMSCC0110 = \u00c8 stata catturata un''eccezione ''{0}'' durante l''elaborazione di un messaggio per la consegna a un MDB (Message Driven Bean).
JMSCC0110.useraction = Per ulteriori informazioni, esaminare le eccezioni collegate.
JMSCC0110.inserts = XMSC_INSERT_EXCEPTION
JMSCC0110.exception = java.lang.RuntimeException

JMSCC0111 = IBM MQ classes per JMS hanno provato a impostare un ID client preesistente su un Connection o un JMSContext.
JMSCC0111.explanation = Un''applicazione ha provato a impostare la propriet\u00e0 ID client di un Connection o un JMSContext validi sul valore ''{0}'' ma questo valore era gi\u00e0 in uso.\n\
L''ID client era gi\u00e0 stato impostato da {1}.
JMSCC0111.useraction = Assicurarsi che la connessione sia valida e che l'ID client sia univoco.
JMSCC0111.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_STRING
JMSCC0111.exception = com.ibm.msg.client.jms.DetailedInvalidClientIDException

JMSCC0112 = Il ritardo di recapito non \u00e8 supportato da questo provider
JMSCC0112.explanation = Un'applicazione ha tentato di impostare un ritardo di recapito, ma il provider JMS non supporta questa opzione

JMSCC0113 = Il ritardo di recapito deve essere inferiore al periodo di validit\u00e0
JMSCC0113.explanation = Un'applicazione ha tentato di impostare un ritardo di recapito, ma il periodo di validit\u00e0 non era superiore a questo ritardo

JMSCC0114 = Il ritardo di recapito non \u00e8 supportato per le pubblicazioni conservate
JMSCC0114.explanation = Un'applicazione ha tentato di impostare un ritardo di recapito su un messaggio conservato, ma questa opzione non \u00e8 supportata

JMSCC0115 = Impossibile utilizzare il ritardo di recapito con il raggruppamento
JMSCC0115.explanation = Un'applicazione ha tentato di impostare un ritardo di recapito su un messaggio che aveva anch'esso un ID gruppo e/o un numero di sequenza gruppo impostato. Questa operazione non \u00e8 supportata

# Message for FFST - additional fields not required
JMSCC1026 = \u00c8 stata emessa un'eccezione durante l'esecuzione del listener di eccezioni dell'utente.

# Message for FFST - additional fields not required
JMSCC1027 = Esecuzione del listener di eccezioni non riuscita.

JMSCC1069 = L'operazione per una sessione XA transacted non era valida.
JMSCC1069.explanation = La modalit\u00e0 di riconoscimento relativa a una sessione transacted non era valida. Commit(), rollback(), acknowledge() e recover() non sono operazioni valide nelle sessioni transacted.
JMSCC1069.useraction = Non chiamare questi metodi quando si utilizza XA.
JMSCC1069.exception = com.ibm.msg.client.jms.DetailedTransactionInProgressException

JMSCC1083 = Dimensione batch del messaggio non valida (deve essere maggiore di zero).
JMSCC1083.explanation = \u00c8 stato passato a createConnectionConsumer() o createDurableConnectionConsumer() un parametro dimensione batch non corretto.
JMSCC1083.useraction = Impostare una dimensione batch maggiore di zero. In un server delle applicazioni conforme a JEE, ci\u00f2 potrebbe rappresentare un errore del server delle applicazioni. Fare riferimento alla documentazione del server delle applicazioni.

JMSCC1084 = \u00c8 stato fornito un pool di sessioni server nullo.
JMSCC1084.explanation = Il pool di sessioni server specificato su createConnectionConsumer() o createDurableConnectionConsumer() era nullo.
JMSCC1084.useraction = Impostare un ServerSessionPool opportuno. In un server delle applicazioni conforme a JEE, ci\u00f2 potrebbe rappresentare un errore del server delle applicazioni. Fare riferimento alla documentazione del server delle applicazioni.

JMSCC1093 = \u00c8 stato passato un parametro nullo.
JMSCC1093.explanation = Un oggetto richiesto da questo metodo non \u00e8 stato correttamente inizializzato.
JMSCC1093.useraction = Assicurarsi che tutti i parametri passati a questo metodo siano correttamente inizializzati.

JMSCC1094 = QuantityHint non \u00e8 valido.
JMSCC1094.explanation = \u00c8 stato fatto un tentativo di creare un browser di connessioni con una definizione quantit\u00e0 dati non corretta.
JMSCC1094.useraction = Specificare NO_DATA, HEADER_DATA o FULL_DATA.
JMSCC1094.exception = java.lang.IllegalArgumentException

JMSCC1096 = Il riferimento messaggio non \u00e8 valido.
JMSCC1096.explanation = \u00c8 stato passato a questo metodo un riferimento messaggio non correttamente formato. Il riferimento messaggio deve essere un'istanza di JmsMessageReference.
JMSCC1096.useraction = Assicurarsi che siano utilizzati riferimenti messaggio corretti.

JMSCC1112 = Operazione non valida per un oggetto specifico del dominio. L''operazione ''{0}'' non \u00e8 valida per il tipo ''{1}''.
JMSCC1112.explanation = Un'applicazione JMS ha tentato di eseguire un'operazione su un oggetto specifico del dominio, ma l'operazione \u00e8 valida solo per l'altro dominio di messaggistica.
JMSCC1112.useraction = Assicurarsi che gli oggetti JMS e le operazioni utilizzati dall'applicazione siano relativi al dominio di messaggistica richiesto. Se l'applicazione utilizza entrambi i domini di messaggistica, considerare di utilizzare per tutta l'applicazione oggetti indipendenti dal dominio.
JMSCC1112.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_TYPE
JMSCC1112.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC1113 = Operazione non valida per un oggetto specifico del dominio. L''operazione ''{0}'' non \u00e8 valida per il tipo ''{1}'' perch\u00e9 la sessione \u00e8 del tipo ''{2}''.
JMSCC1113.explanation = Un'applicazione JMS ha tentato di eseguire un'operazione su un oggetto specifico del dominio, ma l'operazione \u00e8 valida solo per l'altro dominio di messaggistica.
JMSCC1113.useraction = Assicurarsi che gli oggetti JMS, le operazioni e le factory di connessione utilizzati dall'applicazione siano relativi al dominio di messaggistica richiesto. Se l'applicazione utilizza entrambi i domini di messaggistica, considerare di utilizzare per tutta l'applicazione oggetti indipendenti dal dominio.
JMSCC1113.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_TYPE,XMSC_INSERT_SESSION
JMSCC1113.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC3002 = Non \u00e8 stato possibile eliminare la destinazione coda temporanea ''{0}'' poich\u00e9 \u00e8 ancora in uso.
JMSCC3002.explanation = \u00c8 stato fatto un tentativo di eliminare una destinazione temporanea mentre \u00e8 ancora in uso da un destinatario o browser.
JMSCC3002.useraction = Chiudere tutti i destinatari e i browser dipendenti dalla destinazione prima di eliminarla.
JMSCC3002.inserts = XMSC_DESTINATION_NAME

JMSCC3003 = Uso non corretto della destinazione temporanea ''{0}''.
JMSCC3003.explanation = L'utilizzo delle destinazioni temporanee da parte di destinatari e browser di messaggi \u00e8 limitato a quelli creati mediante la stessa connessione.
JMSCC3003.useraction = Modificare l'applicazione in modo che utilizzi una destinazione temporanea creata dalla stessa connessione e riprovare.
JMSCC3003.inserts = XMSC_DESTINATION_NAME
JMSCC3003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException


JMSCC3019 = La destinazione temporanea \u00e8 gi\u00e0 stata eliminata ''{0}'' .
JMSCC3019.explanation = Quando \u00e8 stato effettuato un tentativo di utilizzo della destinazione temporanea, questa era gi\u00e0 stata eliminata.
JMSCC3019.useraction = Modificare l'applicazione in modo da non chiudere la destinazione temporanea o utilizzare una destinazione differente.
JMSCC3019.inserts = XMSC_DESTINATION_NAME
JMSCC3019.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC3025 = Non \u00e8 stato possibile eliminare la destinazione argomento temporanea ''{0}'' poich\u00e9 \u00e8 ancora in uso.
JMSCC3025.explanation = \u00c8 stato fatto un tentativo di eliminare una destinazione temporanea mentre \u00e8 ancora in uso da un destinatario o browser.
JMSCC3025.useraction = Chiudere tutti i destinatari e i browser dipendenti dalla destinazione prima di eliminarla.
JMSCC3025.inserts = XMSC_DESTINATION_NAME

JMSCC3031 = Un ID client non pu\u00f2 essere impostato dopo aver utilizzato la connessione.
JMSCC3031.explanation = L'ID client di una connessione pu\u00f2 essere impostato solo una volta e solo prima di utilizzare la connessione.
JMSCC3031.useraction = Impostare l'ID client prima di utilizzare la connessione.
JMSCC3031.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC3032 = La reimpostazione dell'ID client non \u00e8 consentita.
JMSCC3032.explanation = L'ID client di una connessione pu\u00f2 essere impostato solo una volta e solo prima di utilizzare la connessione.
JMSCC3032.useraction = Impostare l'ID client prima di utilizzare la connessione.
JMSCC3032.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC3033 = La chiamata close() all'interno del listener di messaggi ha dato origine a un deadlock.
JMSCC3033.explanation = Il metodo close() \u00e8 stato richiamato da un listener di messaggi. Non \u00e8 consentito il ritorno dalla chiamata close() finch\u00e9 il listener di messaggi \u00e8 in esecuzione e quindi si generer\u00e0 un deadlock.
JMSCC3033.useraction = Modificare l'applicazione in modo che non richiami alcun metodo close() all'interno di un listener di messaggi.
JMSCC3033.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

# Log message
JMSCC3034 = L''eccezione \u00e8 ignorata poich\u00e9 non \u00e8 registrato alcun listener di eccezioni: ''{0}''.
JMSCC3034.explanation = \u00c8 stato fatto un tentativo di recapitare un'eccezione al listener di eccezioni della connessione ma non \u00e8 stato registrato un listener.
JMSCC3034.useraction = Per ricevere eccezioni sulla connessione, con essa deve essere registrato un listener di eccezioni.
JMSCC3034.inserts = XMSC_INSERT_EXCEPTION

# Log message
JMSCC3035 = L''eccezione \u00e8 ignorata poich\u00e9 il suo tipo non \u00e8 fra quelli scelti per il listener di eccezioni: ''{0}''.
JMSCC3035.explanation = L'eccezione non \u00e8 fra i tipi scelti da recapitare al listener di eccezioni della connessione e quindi viene ignorata.
JMSCC3035.useraction = Riesaminare l'impostazione di connessione ASYNC_EXCEPTIONS per assicurarsi che il filtraggio delle eccezioni sia impostato come previsto.
JMSCC3035.inserts = XMSC_INSERT_EXCEPTION

# Log message
JMSCC3036 = \u00c8 stata recapitata un''eccezione al listener di eccezioni della connessione: ''{0}''.
JMSCC3036.useraction = Per ulteriori informazioni, riesaminare i dettagli dell'eccezione.
JMSCC3036.inserts = XMSC_INSERT_EXCEPTION

JMSCC3039 = Il nome della sottoscrizione era nullo o una stringa vuota.
JMSCC3039.explanation = I destinatari di connessioni durevoli devono disporre di un nome sottoscrizione non nullo e non corrispondente a una stringa vuota.
JMSCC3039.useraction = Passare un nome sottoscrizione non nullo e che non sia una stringa vuota.

JMSCC3040 = Il tentativo di eliminare Connection Metadata \u00e8 stato ignorato. 
JMSCC3040.explanation = Connection Metadata \u00e8 di sola lettura, le propriet\u00e0 non possono essere modificate.
JMSCC3040.useraction = Modificare l'applicazione per non tentare di modificare Connection Metadata.

JMSCC3041 = Il tentativo di impostare propriet\u00e0 multiple contemporaneamente non \u00e8 riuscito. Le propriet\u00e0 sono ''{0}''.
JMSCC3041.explanation = Una o pi\u00f9 propriet\u00e0 \u00e8 considerata non valida quindi nessuna delle modifiche \u00e8 stata effettuata.
JMSCC3041.useraction = Verificare che la combinazione delle propriet\u00e0 abbia valori validi. 
JMSCC3041.inserts = XMSC_INSERT_PROPERTY

# XA unavailable. An attempt was made to perform and action that requires XA when XA is not supported.
JMSCC4001 = Transazioni distribuite non disponibili.
JMSCC4001.explanation = \u00c8 stato fatto un tentativo di utilizzare transazioni distribuite in un ambiente in cui non erano disponibili.


JMSCC5001 = Impossibile ottenere il corpo perch\u00e9 il messaggio \u00e8 StreamMessage
JMSCC5001.explanation = Non \u00e8 stato possibile ottenere il corpo perch\u00e9 il messaggio \u00e8 un StreamMessage e ci\u00f2 non \u00e8 consentito dalla specifica JMS
JMSCC5001.useraction = Il tipo di applicazione o di messaggio inviato dovr\u00e0 essere modificato
JMSCC5001.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC5002 = Il messaggio di tipo {0} non pu\u00f2 avere il corpo assegnato a {1}
JMSCC5002.explanation = La specifica JMS non consente un'assegnazione di questo tipo
JMSCC5002.useraction = Il tipo di applicazione o di messaggio inviato dovr\u00e0 essere modificato
JMSCC5002.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC5002.inserts = XMSC_INSERT_MESSAGE_TYPE, XMSC_INSERT_BODY_TYPE

JMSCC5003 = Si \u00e8 verificata un''eccezione durante la deserializzazione di un messaggio, eccezione: ''{0}''.
JMSCC5003.explanation = Non \u00e8 stato possibile deserializzare l'oggetto a causa dell'eccezione mostrata.
JMSCC5003.useraction = Per dettagli sull'errore, esaminare l'eccezione collegata.
JMSCC5003.inserts = XMSC_INSERT_EXCEPTION
JMSCC5003.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC5004 = Messaggio senza corpo
JMSCC5004.explanation = Il messaggio non ha alcun corpo, pertanto non pu\u00f2 essere convertito nel tipo specificato
JMSCC5004.useraction = Il tipo di applicazione o di messaggio inviato dovr\u00e0 essere modificato
JMSCC5004.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC5005 = Non \u00e8 consentito inviare questo messaggio perch\u00e9 il testo del messaggio \u00e8 di sola lettura ed \u00e8 stata effettuata una chiamata JmsProducer.setProperty
JMSCC5005.explanation = Un'applicazione utente ha tentato di impostare un testo del messaggio di sola lettura, tramite una chiamata JmsProducer.setProperty.
JMSCC5005.useraction = Modificare il programma dell'applicazione per rimuovere questo comportamento oppure chiamare prima il metodo clearBody().
JMSCC5005.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSCC5006 = Non \u00e8 consentito inviare questo messaggio perch\u00e9 il buffer di invio asincrono lato client \u00e8 pieno
JMSCC5006.explanation = Un'applicazione utente ha tentato di inviare un messaggio JMS in modo asincrono ed esiste gi\u00e0 un backlog di messaggi asincroni nel client.
JMSCC5006.useraction = Modificare il programma dell'applicazione per chiamare i metodi di invio asincrono con minore frequenza o fare riferimento alla documentazione per le opzioni di configurazione.

JMSCC5007 = L''utilizzo dell''API JMS2.0 ''{0}'' non \u00e8 supportata con questa istanza della connessione
JMSCC5007.explanation = Solo le connessioni con un corretto tipo di connessione possono supportare l'utilizzo dell'API JMS2.0
JMSCC5007.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC5007.inserts =XMSC_INSERT_METHOD

JMSCC5008 = L''utilizzo della funzione JMS2.0 ''{0}'' non \u00e8 supportata con questa istanza della connessione
JMSCC5008.explanation = L'utilizzo della funzionalit\u00e0 JMS2.0 indicata in questo messaggio \u00e8 supportato solo quando si stabilisce una connessione a un gestore code IBM MQ V8 utilizzando la modalit\u00e0 di provider di messaggistica IBM MQ V8.
JMSCC5008.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC5008.inserts =XMSC_INSERT_METHOD

JMSCC5009 = Nessuna risposta dal thread di invio. \u00c8 possibile che il messaggio non sia stato inviato
JMSCC5009.explanation = Il thread di invio asincrono non risponde. Il thread potrebbe essere stato terminato in modo imprevisto.

JMSCC5010 = Sovrascrittura delle propriet\u00e0 ConnectionFactory da PropertyStore:\n\
{0}
JMSCC5010.inserts = XMSC_INSERT_PROPERTY_OVERRIDE_LIST

JMSCC5011 = Sovrascrittura della propriet\u00e0 {0}:\n\
\tValore originale = {1}\n\
\tNuovo valore      = {2}
JMSCC5011.inserts = XMSC_OVERRIDDEN_PROPERTY, XMSC_ORIGINAL__PROPERTY_VALUE, XMSC_NEW_PROPERTY_VALUE

#CICS related messages. JMSCC6 used to prevent issues when back porting.
#The first two exceptions have the same text but different exception types
JMSCC6001 = Il metodo ''{0}'' non \u00e8 supportato durante l''esecuzione in un ambiente CICS.
JMSCC6001.explanation = Non \u00e8 possibile utilizzare il metodo specificato con una connessione in modalit\u00e0 bind a MQ in un ambiente CICS.
JMSCC6001.useraction = Modificare l'applicazione in modo che non richiami il metodo specificato.
JMSCC6001.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6001.inserts = XMSC_INSERT_METHOD
 
JMSCC6002 = Il metodo ''{0}'' non \u00e8 supportato durante l''esecuzione in un ambiente CICS.
JMSCC6002.explanation = Non \u00e8 possibile utilizzare il metodo specificato con una connessione in modalit\u00e0 bind a MQ in un ambiente CICS.
JMSCC6002.useraction = Modificare l'applicazione in modo che non richiami il metodo specificato.
JMSCC6002.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC6002.inserts = XMSC_INSERT_METHOD
 
JMSCC6003 = \u00c8 possibile attivare una sola istanza di sessione per connessione alla volta durante l'esecuzione in un ambiente CICS.
JMSCC6003.explanation = \u00c8 possibile attivare una sola istanza di sessione per connessione in modalit\u00e0 bind a MQ alla volta in un ambiente CICS.
JMSCC6003.useraction = Modificare l'applicazione in modo che crei una sessione da una connessione differente o chiuda la sessione esistente che utilizza la connessione corrente.
JMSCC6003.exception = com.ibm.msg.client.jms.DetailedJMSException
 
JMSCC6004 = La creazione di una connessione o di un contesto JMS con un ID utente o password non \u00e8 supportata durante l'esecuzione in un ambiente CICS.
JMSCC6004.explanation = Il gestore code non supporta l'autenticazione o l'autorizzazione con un ID utente e password forniti durante la creazione di una connessione in modalit\u00e0 bind o di un contesto JMS in un ambiente CICS. Viene utilizzato invece l'ID utente associato allo spazio indirizzi o transazione CICS.
JMSCC6004.useraction = Modificare l'applicazione in modo che non specifichi un ID utente o password.
JMSCC6004.exception = com.ibm.msg.client.jms.DetailedJMSException

#The first two exceptions have the same text but different exception types
JMSCC6011 = Il metodo ''{0}'' non \u00e8 supportato durante l''esecuzione in un ambiente IMS.
JMSCC6011.explanation = Non \u00e8 possibile utilizzare il metodo specificato con una connessione in modalit\u00e0 bind a MQ in un ambiente IMS.
JMSCC6011.useraction = Modificare l'applicazione in modo che non richiami il metodo specificato.
JMSCC6011.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6011.inserts = XMSC_INSERT_METHOD
 
JMSCC6012 = Il metodo ''{0}'' non \u00e8 supportato durante l''esecuzione in un ambiente IMS.
JMSCC6012.explanation = Non \u00e8 possibile utilizzare il metodo specificato con una connessione in modalit\u00e0 bind a MQ in un ambiente IMS.
JMSCC6012.useraction = Modificare l'applicazione in modo che non richiami il metodo specificato.
JMSCC6012.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC6012.inserts = XMSC_INSERT_METHOD
 
JMSCC6013 = \u00c8 possibile attivare una sola istanza di sessione per connessione alla volta durante l'esecuzione in un ambiente IMS.
JMSCC6013.explanation = \u00c8 possibile attivare una sola istanza di sessione per connessione in modalit\u00e0 bind a MQ alla volta in un ambiente IMS.
JMSCC6013.useraction = Modificare l'applicazione in modo che crei una sessione da una connessione differente o chiuda la sessione esistente che utilizza la connessione corrente.
JMSCC6013.exception = com.ibm.msg.client.jms.DetailedJMSException
 
JMSCC6014 = La creazione di una connessione o di un contesto JMS con un ID utente o password non \u00e8 supportata durante l'esecuzione in un ambiente IMS.
JMSCC6014.explanation = Il gestore code non supporta l'autenticazione o l'autorizzazione con un ID utente e password forniti durante la creazione di una connessione in modalit\u00e0 bind o di un contesto JMS in un ambiente IMS. Viene utilizzato invece l'ID utente associato allo spazio indirizzi, transazione, nome LTERM o PSBNAME IMS.
JMSCC6014.useraction = Modificare l'applicazione in modo che non specifichi un ID utente o password.
JMSCC6014.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSCC6015 = Il metodo ''{0}'' non \u00e8 supportato durante l''esecuzione in un server delle applicazioni.
JMSCC6015.explanation = Il metodo specificato non deve essere utilizzato in un contenitore web o un EJB EE Java.
JMSCC6015.useraction = Modificare l'applicazione in modo che non richiami il metodo specificato.
JMSCC6015.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6015.inserts = XMSC_INSERT_METHOD

JMSCC6016 = Si \u00e8 verificato un timeout durante l''attesa per il server delle applicazioni di ottenere una sessione server. Il timeout \u00e8 impostato su  ''{0}''
JMSCC6016.explanation = Dopo che il valore di timeout \u00e8 scaduto, l'adattatore di risorse MQ ha interrotto l'attesa per una sessione del server.
JMSCC6016.useraction = Considerare di incrementare questo timeout con la propriet\u00e0 di configurazione JMS 'com.ibm.msg.client.wmq.getServerSessionTimeout'
JMSCC6016.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6016.inserts = XMSC_INSERT_TIMEOUT
 
