# %Z% %W% %I% %E% %U%
#
#   <copyright 
#   notice="oco-source" 
#   pids="5724-H72" 
#   years="2008,2017" 
#   crc="775383328" > 
#   IBM Confidential 
#    
#   OCO Source Materials 
#    
#   5724-H72,5655-R36,5655-L82,5724-L26, 
#    
#   (C) Copyright IBM Corp. 2008, 2017 
#    
#   The source code for the program is not published 
#   or otherwise divested of its trade secrets, 
#   irrespective of what has been deposited with the 
#   U.S. Copyright Office. 
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR

JMSCC0001 = Do\u0161lo k intern\u00ed chyb\u011b. Nebylo mo\u017en\u00e9 vytvo\u0159it instanci po\u017eadovan\u00e9 t\u0159\u00eddy: {0}.
JMSCC0001.useraction = Ulo\u017ete vygenerovan\u00e9 v\u00fdstupn\u00ed soubory a pak pou\u017eijte web podpory produktu MQ (http://www.ibm.com/software/integration/wmq/support/) nebo web aplikace IBM Support \
Assistant (http://www.ibm.com/software/support/isa/) a zkontrolujte, zda nen\u00ed k dispozici \u0159e\u0161en\u00ed probl\u00e9mu. Pokud \u017e\u00e1dn\u00e9 vyhovuj\u00edc\u00ed nenajdete, kontaktujte sv\u00e9 centrum podpory IBM.
JMSCC0001.inserts = XMSC_INSERT_EXCEPTION

JMSCC0002 = T\u0159\u00eddy produktu IBM MQ pro syst\u00e9m JMS provedly pokus o nastaven\u00ed neplatn\u00e9ho ID klienta pro p\u0159ipojen\u00ed.
JMSCC0002.explanation = Aplikace se pokusila nastavit vlastnost ID klienta u platn\u00e9ho p\u0159ipojen\u00ed na hodnotu Null nebo nastavit vlastnost clientId u neplatn\u00e9ho p\u0159ipojen\u00ed.
JMSCC0002.useraction = Vlastnost clientId u p\u0159ipojen\u00ed lze nastavit jen jednou, nelze ji nastavit na hodnotu Null a nastaven\u00ed lze prov\u00e9st pouze tehdy, nebylo-li p\u0159ipojen\u00ed dosud pou\u017eito. Zkontrolujte, zda je p\u0159ipojen\u00ed platn\u00e9 a zda nem\u00e1 ID klienta hodnotu Null.
JMSCC0002.exception = com.ibm.msg.client.jms.DetailedInvalidClientIDException

JMSCC0003 = Ur\u010den\u00e1 hodnota {1} nen\u00ed povolena pro vlastnost {0}.
JMSCC0003.explanation = Pro ur\u010denou vlastnost nen\u00ed povolena dan\u00e1 hodnota.
JMSCC0003.useraction = Zm\u011b\u0148te hodnotu na takovou, kter\u00e1 je pro p\u0159\u00edslu\u0161nou vlastnost podporov\u00e1na.
JMSCC0003.inserts = XMSC_INSERT_NAME, XMSC_INSERT_VALUE
JMSCC0003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0004 = Vol\u00e1n\u00ed metody p\u0159\u00edjmu nevr\u00e1t\u00ed zpr\u00e1vu pro zastaven\u00e9 p\u0159ipojen\u00ed.
JMSCC0004.explanation = Podle specifikace JMS nesm\u00ed metoda receive() vr\u00e1tit zpr\u00e1vu, pokud je p\u0159ipojen\u00ed zastaveno. Vol\u00e1n\u00ed metody receiveNoWait nebo receive s \u010dasov\u00fdm limitem vr\u00e1t\u00ed po vypr\u0161en\u00ed \u010dasov\u00e9ho limitu hodnotu Null. Vol\u00e1n\u00ed metody p\u0159\u00edjmu bez \u010dasov\u00e9ho limitu nevr\u00e1t\u00ed \u017e\u00e1dn\u00e1 data, dokud nebude p\u0159ipojen\u00ed spu\u0161t\u011bno nebo zav\u0159eno nebo dokud nedojde k ukon\u010den\u00ed aplikace.
JMSCC0004.useraction = Spus\u0165te p\u0159ipojen\u00ed vol\u00e1n\u00edm metody javax.jms.Connection.start(). 

# JMSCC0005 is the same as JMSCC0003 except that JMSCC0003 throws a InvalidDestinationException
# whereas JMSCC0005 throws an JMSException.
JMSCC0005 = Ur\u010den\u00e1 hodnota {1} nen\u00ed povolena pro vlastnost {0}.
JMSCC0005.explanation = Pro ur\u010denou vlastnost nen\u00ed povolena dan\u00e1 hodnota.
JMSCC0005.useraction = Zm\u011b\u0148te hodnotu na takovou, kter\u00e1 je pro p\u0159\u00edslu\u0161nou vlastnost podporov\u00e1na.
JMSCC0005.inserts = XMSC_INSERT_NAME, XMSC_INSERT_VALUE

JMSCC0007 = B\u011bhem vol\u00e1n\u00ed metody {1} byla p\u0159ijata v\u00fdjimka: {0}
JMSCC0007.explanation = V dob\u011b, kdy b\u011b\u017eela uveden\u00e1 metoda, vyvolala jin\u00e1 komponenta v\u00fdjimku.
JMSCC0007.useraction = Dal\u0161\u00ed informace naleznete v popisu propojen\u00e9 v\u00fdjimky.
JMSCC0007.inserts = XMSC_INSERT_EXCEPTION, XMSC_INSERT_METHOD

JMSCC0008 = Toto p\u0159ipojen\u00ed je uzav\u0159en\u00e9.
JMSCC0008.explanation = Aplikace vyvolala metodu, kter\u00e1 nesm\u00ed b\u00fdt pou\u017eita po zav\u0159en\u00ed p\u0159ipojen\u00ed.
JMSCC0008.useraction = P\u0159ed vol\u00e1n\u00edm metody zkontrolujte, zda nen\u00ed uzav\u0159eno p\u0159ipojen\u00ed.
JMSCC0008.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0011 = V tomto kontejneru nen\u00ed povolena metoda {0}.
JMSCC0011.explanation = Byla vol\u00e1na metoda, kter\u00e1 nen\u00ed v aktu\u00e1ln\u00edm kontejneru povolena.
JMSCC0011.useraction = Odeberte vol\u00e1n\u00ed uveden\u00e9 metody.
JMSCC0011.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0011.inserts = XMSC_INSERT_METHOD

JMSCC0012 = Metoda ''{0}'' nesm\u00ed b\u00fdt vol\u00e1na z modulu listener {1}.
JMSCC0012.explanation = Byla vol\u00e1na metoda, kter\u00e1 nen\u00ed v aktu\u00e1ln\u00edm kontextu povolena.
JMSCC0012.useraction = Odeberte vol\u00e1n\u00ed uveden\u00e9 metody.
JMSCC0012.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0012.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_NAME

JMSCC0014 = Vol\u00e1n\u00ed metody {0} v relaci bez transakc\u00ed nen\u00ed platn\u00e9.
JMSCC0014.explanation = Aplikace vyvolala metodu, kter\u00e1 nesm\u00ed b\u00fdt vol\u00e1na v relaci bez transakc\u00ed.
JMSCC0014.useraction = Zm\u011b\u0148te aplika\u010dn\u00ed program tak, aby k takov\u00e9mu chov\u00e1n\u00ed nedoch\u00e1zelo.
JMSCC0014.inserts = XMSC_INSERT_METHOD
JMSCC0014.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0020 = Tato relace je uzav\u0159ena.
JMSCC0020.explanation = Aplikace vyvolala metodu, kter\u00e1 nesm\u00ed b\u00fdt pou\u017eita po zav\u0159en\u00ed relace.
JMSCC0020.useraction = P\u0159ed vol\u00e1n\u00edm metody zkontrolujte, zda nen\u00ed relace uzav\u0159ena.
JMSCC0020.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0021 = Vol\u00e1n\u00ed metody {0} v relaci s transakcemi nen\u00ed platn\u00e9.
JMSCC0021.explanation = Aplikace vyvolala metodu, kter\u00e1 nesm\u00ed b\u00fdt vol\u00e1na v relaci s transakcemi.
JMSCC0021.useraction = Zm\u011b\u0148te aplika\u010dn\u00ed program tak, aby k takov\u00e9mu chov\u00e1n\u00ed nedoch\u00e1zelo.
JMSCC0021.inserts = XMSC_INSERT_METHOD
JMSCC0021.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0026 = \u010cinnost producenta zpr\u00e1v je ukon\u010dena.
JMSCC0026.explanation = Aplikace vyvolala metodu, kter\u00e1 nesm\u00ed b\u00fdt pou\u017eita po zav\u0159en\u00ed producenta zpr\u00e1v.
JMSCC0026.useraction = P\u0159ed vol\u00e1n\u00edm metody zkontrolujte, zda nen\u00ed uzav\u0159en producent zpr\u00e1v.
JMSCC0026.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0029 = P\u0159i odes\u00edl\u00e1n\u00ed z tohoto producenta mus\u00ed b\u00fdt stanoveno m\u00edsto ur\u010den\u00ed.
JMSCC0029.explanation = Producent byl vytvo\u0159en s m\u00edstem ur\u010den\u00ed s hodnotou Null a metoda odesl\u00e1n\u00ed rovn\u011b\u017e neur\u010dila m\u00edsto ur\u010den\u00ed.
JMSCC0029.useraction = Zm\u011b\u0148te aplikaci tak, aby pou\u017eit\u00e1 metoda send() stanovila m\u00edsto ur\u010den\u00ed, nebo zadejte m\u00edsto ur\u010den\u00ed p\u0159i vytvo\u0159en\u00ed producenta.
JMSCC0029.exception = java.lang.UnsupportedOperationException

JMSCC0030 = P\u0159i odes\u00edl\u00e1n\u00ed z tohoto producenta nelze stanovit m\u00edsto ur\u010den\u00ed.
JMSCC0030.explanation = Producent byl vytvo\u0159en se zadan\u00fdm m\u00edstem ur\u010den\u00ed. Nov\u00e9 zad\u00e1n\u00ed m\u00edsta ur\u010den\u00ed p\u0159i odes\u00edl\u00e1n\u00ed zpr\u00e1vy je neplatn\u00e9.
JMSCC0030.useraction = Zm\u011b\u0148te aplikaci tak, aby pou\u017eit\u00e1 metoda send nenastavovala m\u00edsto ur\u010den\u00ed, nebo p\u0159i vytvo\u0159en\u00ed producenta zadejte m\u00edsto ur\u010den\u00ed s hodnotou Null.
JMSCC0030.exception = java.lang.UnsupportedOperationException

JMSCC0031 = Ur\u010den\u00ed modulu listener dokon\u010den\u00ed v hodnot\u011b null nen\u00ed platn\u00e9.
JMSCC0031.explanation = Vol\u00e1n\u00ed na metodu odesl\u00e1n\u00ed obsahovalo modul listener dokon\u010den\u00ed, listener byl ale null.
JMSCC0031.useraction = Zm\u011b\u0148te aplikaci tak, aby pou\u017eit\u00e1 metoda odesl\u00e1n\u00ed neur\u010dovala modul listener dokon\u010den\u00ed, nebo p\u0159i vytvo\u0159en\u00ed odeslan\u00e9ho vol\u00e1n\u00ed ur\u010dete modul listener dokon\u010den\u00ed bez hodnoty null.
JMSCC0031.exception = java.lang.IllegalArgumentException

JMSCC0032 = Spot\u0159ebitel t\u00e9to zpr\u00e1vy je uzav\u0159en.
JMSCC0032.explanation = Aplikace vyvolala metodu, kter\u00e1 nesm\u00ed b\u00fdt pou\u017eita po zav\u0159en\u00ed spot\u0159ebitele zpr\u00e1v.
JMSCC0032.useraction = P\u0159ed vol\u00e1n\u00edm metody zkontrolujte, zda nen\u00ed uzav\u0159en spot\u0159ebitel zpr\u00e1v.
JMSCC0032.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0033 = P\u0159i asynchronn\u00edm pou\u017eit\u00ed relace nen\u00ed povoleno vol\u00e1n\u00ed synchronn\u00ed metody: {0}.
JMSCC0033.explanation = Specifikace JMS nedovoluje pou\u017e\u00edt relaci pro synchronn\u00ed metody, pokud je spu\u0161t\u011bno asynchronn\u00ed doru\u010dov\u00e1n\u00ed zpr\u00e1v.
JMSCC0033.useraction = Chcete-li sou\u010dasn\u011b vyu\u017e\u00edvat synchronn\u00ed metody i asynchronn\u00ed doru\u010dov\u00e1n\u00ed, vytvo\u0159te samostatnou relaci.
JMSCC0033.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0033.inserts = XMSC_INSERT_METHOD

JMSCC0034 = Mechanizmus asynchronn\u00edho doru\u010dov\u00e1n\u00ed se nach\u00e1z\u00ed v nekonzistentn\u00edm stavu v r\u00e1mci metody: {0}.
JMSCC0034.explanation = B\u011bhem doru\u010dov\u00e1n\u00ed zpr\u00e1v do objektu typu message-driven bean (MDB) byla zji\u0161t\u011bna neo\u010dek\u00e1van\u00e1 posloupnost ud\u00e1lost\u00ed. P\u0159\u00ed\u010dinou mohou b\u00fdt chyby v programech aplikac\u00ed klienta.
JMSCC0034.useraction = Vyhledejte v souborech protokolu aplika\u010dn\u00edho serveru \u00fadaje o dal\u0161\u00edch probl\u00e9mech p\u0159idru\u017een\u00fdch k p\u0159\u00edslu\u0161n\u00e9mu objektu typu message-driven bean. Ulo\u017ete v\u0161echny vygenerovan\u00e9 v\u00fdstupn\u00ed soubory a prost\u0159ednictv\u00edm webu pro podporu produktu WMQ na adrese http://www.ibm.com/software/integration/wmq/support/ nebo webu produktu ISA (IBM Support Assistant) na adrese http://www.ibm.com/software/support/isa/ zjist\u011bte, zda je ji\u017e \u0159e\u0161en\u00ed k dispozici. Pokud \u017e\u00e1dn\u00e9 vyhovuj\u00edc\u00ed nenajdete, kontaktujte sv\u00e9 centrum podpory IBM.
JMSCC0034.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0034.inserts = XMSC_INSERT_METHOD

JMSCC0037 = Metoda MessageListener.onMessage() vyvolala b\u011bhovou v\u00fdjimku.
JMSCC0037.explanation = Spot\u0159ebitel zpr\u00e1v se zaregistrovan\u00fdm modulem listener pro zpr\u00e1vy obdr\u017eel v\u00fdjimku z metody onMessage().
JMSCC0037.useraction = Metodu onMessage() je t\u0159eba zm\u011bnit tak, aby nevyvol\u00e1vala v\u00fdjimky.

JMSCC0038 = U\u017eivatel nem\u00e1 autorizaci k proveden\u00ed t\u00e9to operace. Podrobnosti naleznete v propojen\u00e9 v\u00fdjimce.
JMSCC0038.explanation = Propojen\u00e1 v\u00fdjimka obsahuje podrobn\u00e9 informace o opr\u00e1vn\u011bn\u00edch, kter\u00e1 jsou vy\u017eadov\u00e1na pro proveden\u00e9 t\u00e9to operace.
JMSCC0038.useraction = Administr\u00e1tor mus\u00ed p\u0159\u00edslu\u0161n\u00e9mu u\u017eivateli poskytnout pot\u0159ebn\u00e1 opr\u00e1vn\u011bn\u00ed.

JMSCC0039 = Pou\u017eit\u00ed typu {0} jako vlastnosti objektu {1} je neplatn\u00e9.
JMSCC0039.explanation = Aplikace se pokusila nastavit vlastnost objektu s pou\u017eit\u00edm typu objektu, kter\u00fd specifikace JMS nep\u0159ipou\u0161t\u00ed.
JMSCC0039.useraction = Pou\u017eijte p\u0159\u00edpustn\u00fd typ objektu. K p\u0159\u00edpustn\u00fdm typ\u016fm objekt\u016f pat\u0159\u00ed primitivn\u00ed t\u0159\u00eddy ob\u00e1lky a \u0159et\u011bzcov\u00e9 objekty.
JMSCC0039.inserts = XMSC_INSERT_TYPE, XMSC_INSERT_PROPERTY
JMSCC0039.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0040 = P\u0159i p\u0159\u00edjmu zpr\u00e1vy se vyskytla v\u00fdjimka: {0}
JMSCC0040.explanation = B\u011bhem p\u0159ij\u00edm\u00e1n\u00ed zpr\u00e1vy do\u0161lo k v\u00fdjimce, kter\u00e1 zp\u016fsobila selh\u00e1n\u00ed operace.
JMSCC0040.useraction = Dal\u0161\u00ed informace z\u00edsk\u00e1te prozkoum\u00e1n\u00edm uveden\u00e9 v\u00fdjimky a objektu propojen\u00e9 v\u00fdjimky.
JMSCC0040.inserts = XMSC_INSERT_EXCEPTION
JMSCC0040.exception = com.ibm.msg.client.jms.internal.JmsQueueBrowserImpl.MessageConversionFailed

JMSCC0041 = P\u0159evod polo\u017eky {0} z typu {1} na typ {2} nen\u00ed povolen.
JMSCC0041.explanation = Specifikace platformy JMS neumo\u017e\u0148uje p\u0159evod mezi ur\u010den\u00fdmi dv\u011bma datov\u00fdmi typy.
JMSCC0041.useraction = Na\u010dt\u011bte p\u0159\u00edslu\u0161nou polo\u017eku s pou\u017eit\u00edm jednoho z povolen\u00fdch p\u0159evod\u016f.
JMSCC0041.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE

JMSCC0042 = Nebylo nastaveno pole zpr\u00e1vy {0}.
JMSCC0042.explanation = Aplikace se pokusila na\u010d\u00edst hodnotu pole, kter\u00e9 nebylo nastaveno.
JMSCC0042.useraction = P\u0159ed na\u010dten\u00edm hodnoty pole tuto hodnotu nastavte.
JMSCC0042.inserts = XMSC_INSERT_FIELD

JMSCC0043 = N\u00e1zev pole nesm\u00ed b\u00fdt tvo\u0159en hodnotou Null ani pr\u00e1zdn\u00fdm \u0159et\u011bzcem.
JMSCC0043.explanation = U\u017eivatelsk\u00e1 aplikace se pokusila nastavit pole s pou\u017eit\u00edm neplatn\u00e9ho n\u00e1zvu, nap\u0159. n\u00e1zvu s hodnotou Null nebo pr\u00e1zdn\u00e9ho \u0159et\u011bzce.
JMSCC0043.useraction = Pou\u017eijte platn\u00fd n\u00e1zev pole.
JMSCC0043.exception = java.lang.IllegalArgumentException

JMSCC0044 = Ve zpr\u00e1v\u011b nen\u00ed povoleno vol\u00e1n\u00ed metody {0}, proto\u017ee t\u011blo zpr\u00e1vy je ur\u010deno jen ke \u010dten\u00ed.
JMSCC0044.explanation = U\u017eivatelsk\u00e1 aplikace se pokusila nastavit t\u011blo zpr\u00e1vy ur\u010den\u00e9 jen ke \u010dten\u00ed.
JMSCC0044.useraction = Zm\u011b\u0148te aplika\u010dn\u00ed program tak, aby k takov\u00e9mu chov\u00e1n\u00ed nedoch\u00e1zelo, nebo nejprve volejte metodu clearBody().
JMSCC0044.inserts = XMSC_INSERT_METHOD
JMSCC0044.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSCC0045 = Ve zpr\u00e1v\u011b nen\u00ed povoleno vol\u00e1n\u00ed metody {0}, proto\u017ee vlastnosti zpr\u00e1vy jsou ur\u010deny jen ke \u010dten\u00ed.
JMSCC0045.explanation = U\u017eivatelsk\u00e1 aplikace se pokusila nastavit vlastnost zpr\u00e1vy ur\u010denou jen ke \u010dten\u00ed.
JMSCC0045.useraction = Zm\u011b\u0148te aplika\u010dn\u00ed program tak, aby k takov\u00e9mu chov\u00e1n\u00ed nedoch\u00e1zelo, nebo nejprve volejte metodu clearProperties().
JMSCC0045.inserts = XMSC_INSERT_METHOD
JMSCC0045.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSCC0046 = Ve zpr\u00e1v\u011b nen\u00ed povoleno vol\u00e1n\u00ed metody {0}, proto\u017ee t\u011blo zpr\u00e1vy je ur\u010deno jen k z\u00e1pisu.
JMSCC0046.explanation = U\u017eivatelsk\u00e1 aplikace se pokusila p\u0159e\u010d\u00edst t\u011blo zpr\u00e1vy ur\u010den\u00e9 jen k z\u00e1pisu.
JMSCC0046.useraction = Zm\u011b\u0148te aplika\u010dn\u00ed program tak, aby k takov\u00e9mu chov\u00e1n\u00ed nedoch\u00e1zelo, nebo nejprve volejte metodu reset().
JMSCC0046.inserts = XMSC_INSERT_METHOD
JMSCC0046.exception = com.ibm.msg.client.jms.DetailedMessageNotReadableException

JMSCC0048 = P\u0159i pokusu o vytvo\u0159en\u00ed zpr\u00e1vy do\u0161lo k chyb\u011b. Dal\u0161\u00ed podrobnosti naleznete v popisu propojen\u00e9 v\u00fdjimky.
JMSCC0048.explanation = Nezda\u0159ilo se vytvo\u0159it zpr\u00e1vu, proto\u017ee do\u0161lo k chyb\u011b.
JMSCC0048.useraction = Prozkoumejte podrobnosti t\u00fdkaj\u00edc\u00ed se chyby prost\u0159ednictv\u00edm propojen\u00e9 v\u00fdjimky.

JMSCC0049 = N\u00e1zev vlastnosti {0} nen\u00ed platn\u00fdm identifik\u00e1torem jazyka Java(tm).
JMSCC0049.explanation = Zadan\u00fd n\u00e1zev vlastnosti neodpov\u00edd\u00e1 povolen\u00e9mu form\u00e1tu popsan\u00e9mu ve specifikaci platformy JMS.
JMSCC0049.useraction = Zkontrolujte znaky pou\u017eit\u00e9 v n\u00e1zvu vlastnosti a podle pot\u0159eby je upravte.
JMSCC0049.inserts = XMSC_INSERT_PROPERTY
JMSCC0049.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0050 = N\u00e1zev vlastnosti {0} je rezervovan\u00fd a nelze jej nastavit.
JMSCC0050.explanation = Zadan\u00fd n\u00e1zev vlastnosti za\u010d\u00edn\u00e1 p\u0159edponou JMS, nepat\u0159\u00ed v\u0161ak k podporovan\u00fdm nastaviteln\u00fdm vlastnostem.
JMSCC0050.useraction = Zkontrolujte n\u00e1zev vlastnosti a odstra\u0148te chyby.
JMSCC0050.inserts = XMSC_INSERT_PROPERTY
JMSCC0050.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0051 = K nastaven\u00ed vlastnosti {0} je t\u0159eba pou\u017e\u00edt typ {1}, nikoli {2}.
JMSCC0051.explanation = Vlastnosti JMS_IBM lze nastavit pouze s pou\u017eit\u00edm specifick\u00e9ho typu prom\u011bnn\u00e9.
JMSCC0051.useraction = Opravte k\u00f3d aplikace tak, aby byl p\u0159i nastaven\u00ed t\u00e9to vlastnosti JMS_IBM pou\u017eit po\u017eadovan\u00fd typ prom\u011bnn\u00e9.
JMSCC0051.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE
JMSCC0051.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0052 = Do\u0161lo k v\u00fdjimce p\u0159i serializaci objektu: {0}
JMSCC0052.explanation = Nezda\u0159ilo se serializovat objekt, proto\u017ee do\u0161lo k v\u00fdjimce.
JMSCC0052.useraction = Prozkoumejte podrobnosti t\u00fdkaj\u00edc\u00ed se chyby prost\u0159ednictv\u00edm propojen\u00e9 v\u00fdjimky.
JMSCC0052.inserts = XMSC_INSERT_EXCEPTION
JMSCC0052.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0053 = P\u0159i deserializaci zpr\u00e1vy se vyskytla v\u00fdjimka: {0}
JMSCC0053.explanation = Uveden\u00e1 v\u00fdjimka zabr\u00e1nila deserializaci zpr\u00e1vy.
JMSCC0053.useraction = Prozkoumejte podrobnosti t\u00fdkaj\u00edc\u00ed se chyby prost\u0159ednictv\u00edm propojen\u00e9 v\u00fdjimky.
JMSCC0053.inserts = XMSC_INSERT_EXCEPTION
JMSCC0053.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0054 = Prohl\u00ed\u017ee\u010d front nem\u00e1 k dispozici \u017e\u00e1dn\u00e9 zpr\u00e1vy.
JMSCC0054.explanation = U\u017eivatelsk\u00e1 aplikace si vy\u017e\u00e1dala zpr\u00e1vu z prohl\u00ed\u017ee\u010de front v dob\u011b, kdy nebyla \u017e\u00e1dn\u00e1 zpr\u00e1va k dispozici.
JMSCC0054.useraction = Upravte aplikaci tak, aby tuto metodu nevolala v dob\u011b, kdy nejsou k dispozici \u017e\u00e1dn\u00e9 zpr\u00e1vy, nebo aby tuto v\u00fdjimku zachyt\u00e1vala.
JMSCC0054.exception = java.util.NoSuchElementException

JMSCC0055 = Tento prohl\u00ed\u017ee\u010d front je zav\u0159en\u00fd.
JMSCC0055.explanation = Aplikace vyvolala metodu, kter\u00e1 nesm\u00ed b\u00fdt pou\u017eita po zav\u0159en\u00ed prohl\u00ed\u017ee\u010de front.
JMSCC0055.useraction = P\u0159ed vol\u00e1n\u00edm metody zkontrolujte, zda nen\u00ed uzav\u0159en prohl\u00ed\u017ee\u010d front.
JMSCC0055.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0059 = Vyrovn\u00e1vac\u00ed pam\u011b\u0165 pro \u010dten\u00ed m\u00e1 hodnotu Null.
JMSCC0059.explanation = Metod\u011b StreamMessage.readBytes() byl p\u0159ed\u00e1n odkaz s hodnotou Null, tak\u017ee nebylo mo\u017en\u00e9 vr\u00e1tit \u017e\u00e1dn\u00e1 data.
JMSCC0059.useraction = Ve vol\u00e1n\u00ed metody readBytes() uve\u010fte odkaz na vyrovn\u00e1vac\u00ed pam\u011b\u0165 vhodn\u00e9 velikosti.
JMSCC0059.exception = java.lang.NullPointerException

JMSCC0060 = Bylo dosa\u017eeno konce proudu zpr\u00e1v.
JMSCC0060.explanation = Bylo dosa\u017eeno konce obsahu zpr\u00e1v. Tento stav je norm\u00e1ln\u00ed, pokud aplikace prov\u00e1d\u011bj\u00edc\u00ed \u010dten\u00ed nem\u00e1 informace o tom, kolik dat m\u00e1 o\u010dek\u00e1vat.
JMSCC0060.useraction = Nen\u00ed vy\u017eadov\u00e1na \u017e\u00e1dn\u00e1 akce.
JMSCC0060.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCC0061 = Bajtov\u00e9 pole StreamMessage bylo ne\u00fapln\u011b p\u0159e\u010dteno.
JMSCC0061.explanation = Prob\u011bhl pokus o na\u010dten\u00ed dal\u0161\u00edho pole z proudu v okam\u017eiku, kdy bylo bajtov\u00e9 pole na\u010dteno jen z \u010d\u00e1sti.
JMSCC0061.useraction = Upravte u\u017eivatelsk\u00fd k\u00f3d tak, aby dokon\u010dil \u010dten\u00ed ka\u017ed\u00e9ho bajtov\u00e9ho pole, ne\u017e se pokus\u00ed na\u010d\u00edst dal\u0161\u00ed pole.
JMSCC0061.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0062 = Hodnotu Null nelze vr\u00e1tit jako znak.
JMSCC0062.explanation = Prob\u011bhl pokus o na\u010dten\u00ed pole StreamMessage obsahuj\u00edc\u00edho hodnotu Null pomoc\u00ed metody readChar().
JMSCC0062.useraction = Vyvarujte se \u010dten\u00ed hodnot Null pomoc\u00ed metody readChar().
JMSCC0062.exception = java.lang.NullPointerException

JMSCC0063 = K\u00f3dov\u00e1n\u00ed \u0159et\u011bzce {0} je neplatn\u00e9.
JMSCC0063.explanation = Zadan\u00e1 hodnota nen\u00ed uvedena ve zn\u00e1m\u00e9m k\u00f3dov\u00e1n\u00ed.
JMSCC0063.useraction = Upravte aplikaci tak, aby uv\u00e1d\u011bla n\u011bkterou hodnotu z definovan\u00e9ho seznamu k\u00f3dov\u00e1n\u00ed.
JMSCC0063.inserts = JMS_IBM_Encoding

JMSCC0064 = P\u0159i z\u00e1pisu do datov\u00e9ho proudu do\u0161lo k intern\u00ed chyb\u011b.
JMSCC0064.explanation = Vyskytl se probl\u00e9m s datov\u00fdmi proudy vyu\u017e\u00edvan\u00fdmi pro p\u0159evod form\u00e1tu hodnot s plovouc\u00ed \u0159\u00e1dovou \u010d\u00e1rkou a hodnot s dvojitou p\u0159esnost\u00ed.
JMSCC0064.useraction = Ulo\u017ete v\u0161echny vygenerovan\u00e9 v\u00fdstupn\u00ed soubory a prost\u0159ednictv\u00edm webu pro podporu produktu WMQ na adrese http://www.ibm.com/software/integration/wmq/support/ nebo webu produktu ISA (IBM Support Assistant) na adrese http://www.ibm.com/software/support/isa/ zjist\u011bte, zda je ji\u017e \u0159e\u0161en\u00ed k dispozici. Pokud \u017e\u00e1dn\u00e9 vyhovuj\u00edc\u00ed nenajdete, kontaktujte sv\u00e9 centrum podpory IBM.

JMSCC0065 = Byl proveden pokus o \u010dten\u00ed za koncem zpr\u00e1vy.
JMSCC0065.explanation = Byl proveden pokus o \u010dten\u00ed za koncem zpr\u00e1vy. Tento stav m\u016f\u017ee b\u00fdt norm\u00e1ln\u00ed, pokud byl k\u00f3d aplikace vytvo\u0159en tak, aby na\u010d\u00edtal data prom\u011bnn\u00e9 d\u00e9lky podle specifikace JMS 1.0.2.
JMSCC0065.useraction = V p\u0159\u00edpad\u011b pot\u0159eby zm\u011b\u0148te k\u00f3d aplikace tak, aby vyu\u017e\u00edval novou metodu getBodyLength().
JMSCC0065.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCC0066 = Nezda\u0159il se p\u0159evod k\u00f3du UTF-8.
JMSCC0066.explanation = Vyskytl se probl\u00e9m s \u010dten\u00edm nebo z\u00e1pisem \u0159et\u011bzce v k\u00f3dov\u00e1n\u00ed UTF-8. Nej\u010dast\u011bji se jedn\u00e1 o pokus zapsat \u0159et\u011bzec del\u0161\u00ed ne\u017e 65535 znak\u016f.
JMSCC0066.useraction = Dal\u0161\u00ed informace naleznete v propojen\u00e9 v\u00fdjimce.
JMSCC0066.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0067 = Do\u0161lo k intern\u00ed chyb\u011b. Vyskytl se probl\u00e9m se z\u00e1pisem do zpr\u00e1vy.
JMSCC0067.explanation = P\u0159i pokusu o z\u00e1pis polo\u017eky do zpr\u00e1vy do\u0161lo k chyb\u011b.
JMSCC0067.useraction = Ulo\u017ete v\u0161echny vygenerovan\u00e9 v\u00fdstupn\u00ed soubory a prost\u0159ednictv\u00edm webu pro podporu produktu WMQ na adrese http://www.ibm.com/software/integration/wmq/support/ nebo webu produktu ISA (IBM Support Assistant) na adrese http://www.ibm.com/software/support/isa/ zjist\u011bte, zda je ji\u017e \u0159e\u0161en\u00ed k dispozici. Pokud \u017e\u00e1dn\u00e9 vyhovuj\u00edc\u00ed nenajdete, kontaktujte sv\u00e9 centrum podpory IBM.
JMSCC0067.exception = com.ibm.msg.client.jms.DetailedResourceAllocationException

JMSCC0068 = Vlastnost ''{0}'' mus\u00ed b\u00fdt nastavena pomoc\u00ed hodnoty typu ''{1}'' nebo typu p\u0159evoditeln\u00e9ho na tento typ podle specifikace JMS. Nelze p\u0159ev\u00e9st z dan\u00e9ho typu ''{2}''. 
JMSCC0068.explanation = Specifikace platformy JMS neumo\u017e\u0148uje p\u0159evod mezi ur\u010den\u00fdmi dv\u011bma datov\u00fdmi typy.
JMSCC0068.useraction = Nastavte pojmenovanou vlastnost pomoc\u00ed jednoho z povolen\u00fdch p\u0159evod\u016f.
JMSCC0068.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC0068.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE

JMSCC0069 = Vlastnost ''{0}'' mus\u00ed b\u00fdt nastavena pomoc\u00ed hodnoty typu ''{1}''. Nelze p\u0159ev\u00e9st z dan\u00e9ho typu ''{2}'' s hodnotou ''{3}''. 
JMSCC0069.explanation = P\u0159i pokusu o nastaven\u00ed vlastnosti zpr\u00e1vy do\u0161lo k chyb\u011b.
JMSCC0069.useraction = Nastavte pojmenovanou vlastnost pomoc\u00ed jednoho z povolen\u00fdch p\u0159evod\u016f pomoc\u00ed p\u0159\u00edslu\u0161n\u00e9 hodnoty.
JMSCC0069.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC0069.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE, XMSC_INSERT_VALUE

JMSCC0070 = Do\u0161lo k intern\u00ed chyb\u011b. Do\u0161lo k probl\u00e9mu p\u0159i nastaven\u00ed vlastnosti zpr\u00e1vy JMS ''{0}'', o\u010dek\u00e1van\u00fd typ ''{1}'', pou\u017eit\u00ed objektu typu ''{2}''.
JMSCC0070.explanation = P\u0159i pokusu o nastaven\u00ed vlastnosti zpr\u00e1vy do\u0161lo k chyb\u011b.
JMSCC0070.useraction = Ulo\u017ete v\u0161echny vygenerovan\u00e9 v\u00fdstupn\u00ed soubory a prost\u0159ednictv\u00edm webu pro podporu produktu WMQ na adrese http://www.ibm.com/software/integration/wmq/support/ nebo webu produktu ISA (IBM Support Assistant) na adrese http://www.ibm.com/software/support/isa/ zjist\u011bte, zda je ji\u017e \u0159e\u0161en\u00ed k dispozici. Pokud \u017e\u00e1dn\u00e9 vyhovuj\u00edc\u00ed nenajdete, kontaktujte sv\u00e9 centrum podpory IBM.
JMSCC0070.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC0070.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE

JMSCC0083 = Byl zad\u00e1n nespr\u00e1vn\u00fd objekt typu {0}.
JMSCC0083.explanation = Metod\u011b writeObject() byl p\u0159ed\u00e1n objekt, kter\u00fd nen\u00ed primitivn\u00edho typu ob\u00e1lky Java(tm).
JMSCC0083.useraction = Opravte aplikaci tak, aby byly metod\u011b writeObject() p\u0159ed\u00e1v\u00e1ny jako parametry pouze objekty povolen\u00fdch typ\u016f.
JMSCC0083.inserts = XMSC_INSERT_OBJECT
JMSCC0083.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0084 = Nebyla nastavena vlastnost s n\u00e1zvem {0}.
JMSCC0084.inserts = XMSC_INSERT_PROPERTY

JMSCC0085 = Nebylo zad\u00e1no m\u00edsto ur\u010den\u00ed.
JMSCC0085.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0086 = Nespr\u00e1vn\u00e1 velikost d\u00e1vky {0}
JMSCC0086.inserts = XMSC_INSERT_BATCH_SIZE

JMSCC0087 = Nebyl zad\u00e1n fond relac\u00ed serveru.

JMSCC0088 = Nezda\u0159ilo se z\u00edskat relaci ze zadan\u00e9ho fondu relac\u00ed serveru.

JMSCC0089 = Relace {0} je neplatn\u00e1.
JMSCC0089.inserts = XMSC_INSERT_SESSION

JMSCC0091 = Nezda\u0159ilo se zav\u00e9st tov\u00e1rnu poskytovatele pro typ p\u0159ipojen\u00ed {0}.
JMSCC0091.inserts = XMSC_CONNECTION_TYPE

JMSCC0092 = Nam\u00edsto o\u010dek\u00e1van\u00e9ho typu p\u0159ipojen\u00ed {0} byl zji\u0161t\u011bn typ {1}.
JMSCC0092.inserts = XMSC_CONNECTION_TYPE_NAME, XMSC_CONNECTION_TYPE
JMSCC0092.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0093 = M\u00edsto ur\u010den\u00ed je neplatn\u00e9. Pro do\u010dasn\u00e9 m\u00edsto ur\u010den\u00ed typu {0} s n\u00e1zvem {1} nelze vytvo\u0159it trval\u00fd odb\u011br.
JMSCC0093.inserts = XMSC_INSERT_TYPE, XMSC_DESTINATION_NAME
JMSCC0093.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0094 = Tento prohl\u00ed\u017ee\u010d p\u0159ipojen\u00ed je uzav\u0159en.
JMSCC0094.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0095 = N\u00e1zev m\u00edsta ur\u010den\u00ed {0} nen\u00ed platn\u00fd.
JMSCC0095.explanation = Zadan\u00fd n\u00e1zev m\u00edsta ur\u010den\u00ed neodpov\u00edd\u00e1 syntaxi publikovan\u00e9ho m\u00edsta ur\u010den\u00ed.
JMSCC0095.useraction = Opravte zadan\u00fd n\u00e1zev m\u00edsta ur\u010den\u00ed a prove\u010fte operaci znovu.
JMSCC0095.inserts = XMSC_DESTINATION_NAME
JMSCC0095.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0097 = Chybn\u00fd re\u017eim potvrzov\u00e1n\u00ed {0}. Metod\u011b connection.createSession() byl p\u0159ed\u00e1n po\u017eadavek na vytvo\u0159en\u00ed relace bez transakc\u00ed (parametr transacted m\u011bl hodnotu false), byl v\u0161ak nastaven jin\u00fd re\u017eim potvrzov\u00e1n\u00ed ne\u017e AUTO_ACKNOWLEDGE, DUPS_OK_ACKNOWLEDGE nebo CLIENT_ACKNOWLEDGE.
JMSCC0097.inserts = XMSC_ACKNOWLEDGE_MODE

JMSCC0098 = Zpr\u00e1va nem\u016f\u017ee m\u00edt hodnotu null.
JMSCC0098.useraction = Zadejte zpr\u00e1vu s hodnotou jinou ne\u017e null.
JMSCC0098.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0099 = M\u00edsto ur\u010den\u00ed {0} nen\u00ed instanc\u00ed t\u0159\u00eddy com.ibm.msg.client.jms.JmsDestination.
JMSCC0099.useraction = Zadan\u00e9 m\u00edsto ur\u010den\u00ed nahra\u010fte instanc\u00ed t\u0159\u00eddy com.ibm.msg.client.jms.JmsDestination.
JMSCC0099.inserts = XMSC_DESTINATION_NAME
JMSCC0099.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0100 = N\u00e1zev odb\u011bru nesm\u00ed m\u00edt hodnotu Null.
JMSCC0100.useraction = Zadejte n\u00e1zev odb\u011bru, kter\u00fd nebude m\u00edt hodnotu Null.
JMSCC0100.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0101 = ID klienta nesm\u00ed m\u00edt hodnotu Null.
JMSCC0101.useraction = Zadejte ID klienta, kter\u00e9 nebude m\u00edt hodnotu Null.
JMSCC0101.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0102 = N\u00e1zev vlastnosti {0} ve zpr\u00e1v\u011b nen\u00ed platn\u00fdm identifik\u00e1torem jazyka Java(tm).
JMSCC0102.explanation = Zadan\u00fd n\u00e1zev vlastnosti neodpov\u00edd\u00e1 povolen\u00e9mu form\u00e1tu popsan\u00e9mu ve specifikaci platformy JMS.
JMSCC0102.useraction = Zkontrolujte znaky pou\u017eit\u00e9 v n\u00e1zvu vlastnosti a podle pot\u0159eby je upravte.
JMSCC0102.inserts = XMSC_INSERT_PROPERTY
JMSCC0102.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0103 = Byl zad\u00e1n objekt s hodnotou Null.
JMSCC0103.explanation = Metod\u011b writeObject() byl p\u0159ed\u00e1n objekt s hodnotou Null.
JMSCC0103.useraction = Opravte aplikaci tak, aby byly metod\u011b writeObject() p\u0159ed\u00e1v\u00e1ny jako parametry pouze objekty, kter\u00e9 nemaj\u00ed hodnotu Null.
JMSCC0103.exception = java.lang.NullPointerException

JMSCC0105 = P\u0159evod polo\u017eky {0} z typu {1} na typ {2} nen\u00ed povolen.
JMSCC0105.explanation = Specifikace syst\u00e9mu JMS neumo\u017e\u0148uje p\u0159evod mezi ur\u010den\u00fdmi dv\u011bma datov\u00fdmi typy.
JMSCC0105.useraction = Na\u010dt\u011bte p\u0159\u00edslu\u0161nou polo\u017eku s pou\u017eit\u00edm jednoho z povolen\u00fdch p\u0159evod\u016f.
JMSCC0105.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE
JMSCC0105.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0106 = Nezda\u0159ilo se z\u00edskat prost\u0159edek XA. {0}.
JMSCC0106.useraction = Dal\u0161\u00ed informace naleznete v popisu p\u0159\u00ed\u010diny.
JMSCC0106.inserts = XMSC_INSERT_EXCEPTION
JMSCC0106.exception = java.lang.RuntimeException

JMSCC0107 = Chybn\u00fd \u010dasov\u00fd limit {0}
JMSCC0107.explanation = Hodnota \u010dasov\u00e9ho limitu mus\u00ed b\u00fdt kladn\u00e1 nebo nulov\u00e1 a ud\u00e1vat po\u010det milisekund.
JMSCC0107.useraction = Nezad\u00e1vejte z\u00e1porn\u00e9 hodnoty \u010dasov\u00e9ho limitu.
JMSCC0107.inserts = XMSC_INSERT_TIMEOUT

# Message changed for APAR IT16300
JMSCC0108 = T\u0159\u00eddy IBM MQ pro JMS detekovaly zpr\u00e1vu, p\u0159ipraveno pro asynchronn\u00ed doru\u010den\u00ed do aplikace. Kdy\u017e byl proveden pokus o doru\u010den\u00ed, nebyla zpr\u00e1va ji\u017e k dispozici. Mo\u017en\u00e9 p\u0159\u00ed\u010diny a akce viz t\u00e9ma "Troubleshooting JMSCC0108 messages" v sekci produktu IBM MQ V9.0, Centrum znalost\u00ed IBM.
JMSCC0108.explanation = Intern\u00ed podproces v r\u00e1mci t\u0159\u00edd IBM MQ pro JMS zjistil zpr\u00e1vu a po\u017eadoval, aby jin\u00fd intern\u00ed podproces z\u00edskal zpr\u00e1vu a doru\u010dil ji do aplikace ke zpracov\u00e1n\u00ed. Kdy\u017e se dan\u00fd podproces pokusil z\u00edskat zpr\u00e1vu, nebyla ji\u017e k dispozici.
JMSCC0108.useraction = Dal\u0161\u00ed informace viz t\u00e9ma "Troubleshooting JMSCC0108 messages" v sekci produktu IBM MQ V9.0, Centrum znalost\u00ed IBM.

JMSCC0109 = Objekt typu message-driven bean vyvolal b\u011bhovou v\u00fdjimku {0}.
JMSCC0109.explanation = To m\u016f\u017ee b\u00fdt p\u0159\u00edznakem probl\u00e9mu v modulu listener zpr\u00e1v.
JMSCC0109.useraction = Pokud byla b\u011bhov\u00e1 v\u00fdjimka generov\u00e1na modulem listener zpr\u00e1v neo\u010dek\u00e1van\u011b, pou\u017eijte propojenou v\u00fdjimku k ur\u010den\u00ed p\u0159\u00ed\u010diny probl\u00e9mu.
JMSCC0109.inserts = XMSC_INSERT_EXCEPTION
JMSCC0109.exception = java.lang.RuntimeException

JMSCC0110 = P\u0159i p\u0159\u00edprav\u011b zpr\u00e1vy k doru\u010den\u00ed do objektu typu message-driven bean byla zachycena v\u00fdjimka {0}.
JMSCC0110.useraction = Dal\u0161\u00ed informace m\u016f\u017eete z\u00edskat prozkoum\u00e1n\u00edm propojen\u00e9 v\u00fdjimky.
JMSCC0110.inserts = XMSC_INSERT_EXCEPTION
JMSCC0110.exception = java.lang.RuntimeException

JMSCC0111 = T\u0159\u00eddy IBM MQ pro JMS se pokusily nastavit d\u0159\u00edve existuj\u00edc\u00ed ID klienta pro p\u0159ipojen\u00ed nebo kontext JMSContext.
JMSCC0111.explanation = Aplikace se pokusila nastavit vlastnost ID klienta u platn\u00e9ho p\u0159ipojen\u00ed nebo kontextu JMSContext na hodnotu ''{0}'', ale tato hodnota ji\u017e byla pou\u017eita.\n\
ID klienta ji\u017e bylo nastaveno {1}.
JMSCC0111.useraction = Zkontrolujte, zda je p\u0159ipojen\u00ed platn\u00e9 a ID klienta jedine\u010dn\u00e9.
JMSCC0111.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_STRING
JMSCC0111.exception = com.ibm.msg.client.jms.DetailedInvalidClientIDException

JMSCC0112 = Prodleva doru\u010den\u00ed nen\u00ed t\u00edmto poskytovatelem podporov\u00e1na
JMSCC0112.explanation = Aplikace se pokusila nastavit prodlevu doru\u010den\u00ed, ale poskytovatel JMS to nepodporuje

JMSCC0113 = Prodleva doru\u010den\u00ed mus\u00ed b\u00fdt men\u0161\u00ed ne\u017e doba \u017eivotnosti
JMSCC0113.explanation = Aplikace se pokusila nastavit prodlevu doru\u010den\u00ed, ale doba \u017eivotnosti nebyla v\u011bt\u0161\u00ed ne\u017e tato prodleva

JMSCC0114 = Prodleva doru\u010den\u00ed nen\u00ed pro zachovan\u00e1 publikov\u00e1n\u00ed podporov\u00e1na
JMSCC0114.explanation = Aplikace se pokusila nastavit prodlevu doru\u010den\u00ed na zachovanou zpr\u00e1vu, ale to nen\u00ed podporov\u00e1no

JMSCC0115 = Prodlevu doru\u010den\u00ed nelze pou\u017e\u00edvat se seskupen\u00edm
JMSCC0115.explanation = Aplikace se pokusila nastavit prodlevu doru\u010den\u00ed pro zpr\u00e1vu, kter\u00e1 m\u00e1 z\u00e1rove\u0148 nastaveno ID skupiny anebo po\u0159adov\u00e9 \u010d\u00edslo skupiny, co\u017e nen\u00ed podporov\u00e1no

# Message for FFST - additional fields not required
JMSCC1026 = Byla zachycena v\u00fdjimka za b\u011bhu u\u017eivatelsk\u00e9ho modulu listener pro v\u00fdjimky.

# Message for FFST - additional fields not required
JMSCC1027 = Nezda\u0159ilo se spustit u\u017eivatelsk\u00fd modul listener pro v\u00fdjimky.

JMSCC1069 = Operace v relaci s transakcemi XA byla neplatn\u00e1.
JMSCC1069.explanation = Neplatn\u00fd re\u017eim potvrzov\u00e1n\u00ed u relace s transakcemi. Operace commit(), rollback(), acknowledge() a recover() nejsou v relac\u00edch s transakcemi platn\u00e9.
JMSCC1069.useraction = P\u0159i pou\u017eit\u00ed relac\u00ed XA nevolejte uveden\u00e9 metody.
JMSCC1069.exception = com.ibm.msg.client.jms.DetailedTransactionInProgressException

JMSCC1083 = Nespr\u00e1vn\u00e1 velikost d\u00e1vky zpr\u00e1v (mus\u00ed b\u00fdt v\u011bt\u0161\u00ed ne\u017e nula).
JMSCC1083.explanation = Metod\u011b createConnectionConsumer() nebo createDurableConnectionConsumer() byl p\u0159ed\u00e1n nespr\u00e1vn\u00fd parametr velikosti d\u00e1vky.
JMSCC1083.useraction = Nastavte velikost d\u00e1vky v\u011bt\u0161\u00ed ne\u017e 0. Na aplika\u010dn\u00edm serveru odpov\u00eddaj\u00edc\u00edm specifikaci prost\u0159ed\u00ed J2EE m\u016f\u017ee j\u00edt o reprezentaci chyby aplika\u010dn\u00edho serveru. Informace naleznete v dokumentaci k aplika\u010dn\u00edmu serveru.

JMSCC1084 = Byl zad\u00e1n fond relac\u00ed serveru s hodnotou Null.
JMSCC1084.explanation = Fond relac\u00ed serveru p\u0159edan\u00fd metod\u011b createConnectionConsumer() nebo createDurableConnectionConsumer() m\u011bl hodnotu Null.
JMSCC1084.useraction = Nastavte vhodn\u00fd fond relac\u00ed serveru. Na aplika\u010dn\u00edm serveru odpov\u00eddaj\u00edc\u00edm specifikaci prost\u0159ed\u00ed J2EE m\u016f\u017ee j\u00edt o reprezentaci chyby aplika\u010dn\u00edho serveru. Informace naleznete v dokumentaci k aplika\u010dn\u00edmu serveru.

JMSCC1093 = Byl zad\u00e1n parametr s hodnotou Null.
JMSCC1093.explanation = Objekt vy\u017eadovan\u00fd touto metodou nebyl spr\u00e1vn\u011b inicializov\u00e1n.
JMSCC1093.useraction = Zajist\u011bte \u0159\u00e1dnou inicializaci v\u0161ech parametr\u016f p\u0159ed\u00e1van\u00fdch t\u00e9to metod\u011b.

JMSCC1094 = Hodnota QuantityHint je neplatn\u00e1.
JMSCC1094.explanation = Prob\u011bhl pokus o vytvo\u0159en\u00ed prohl\u00ed\u017ee\u010de p\u0159ipojen\u00ed s nespr\u00e1vn\u00fdm pokynem pro mno\u017estv\u00ed dat.
JMSCC1094.useraction = Zadejte hodnotu NO_DATA, HEADER_DATA nebo FULL_DATA.
JMSCC1094.exception = java.lang.IllegalArgumentException

JMSCC1096 = Neplatn\u00fd odkaz na zpr\u00e1vu
JMSCC1096.explanation = T\u00e9to metod\u011b byl p\u0159ed\u00e1n nespr\u00e1vn\u011b utvo\u0159en\u00fd odkaz na zpr\u00e1vu. Odkaz na zpr\u00e1vu mus\u00ed b\u00fdt instanc\u00ed t\u0159\u00eddy JmsMessageReference.
JMSCC1096.useraction = Zajist\u011bte pou\u017eit\u00ed spr\u00e1vn\u00fdch odkaz\u016f na zpr\u00e1vy.

JMSCC1112 = Operace pro objekt specifick\u00fd pro konkr\u00e9tn\u00ed dom\u00e9nu byla neplatn\u00e1. Operace {0} je pro typ {1} neplatn\u00e1.
JMSCC1112.explanation = Aplikace syst\u00e9mu JMS se pokusila o proveden\u00ed operace s objektem specifick\u00fdm pro konkr\u00e9tn\u00ed dom\u00e9nu, operace je v\u0161ak platn\u00e1 pouze pro zb\u00fdvaj\u00edc\u00ed dom\u00e9nu syst\u00e9mu zpr\u00e1v.
JMSCC1112.useraction = Ov\u011b\u0159te, \u017ee jsou objekty syst\u00e9mu JMS a operace pou\u017e\u00edvan\u00e9 aplikac\u00ed relevantn\u00ed pro po\u017eadovanou dom\u00e9nu syst\u00e9mu zpr\u00e1v. Pokud aplikace pou\u017e\u00edv\u00e1 ob\u011b dom\u00e9ny syst\u00e9mu zpr\u00e1v, uva\u017eujte o pou\u017eit\u00ed objekt\u016f nez\u00e1visl\u00fdch na dom\u00e9n\u011b v cel\u00e9 aplikaci.
JMSCC1112.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_TYPE
JMSCC1112.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC1113 = Operace pro objekt specifick\u00fd pro konkr\u00e9tn\u00ed dom\u00e9nu byla neplatn\u00e1. Operace ''{0}'' nen\u00ed pro typ ''{1}'' platn\u00e1 jako relace typu ''{2}''.
JMSCC1113.explanation = Aplikace syst\u00e9mu JMS se pokusila o proveden\u00ed operace s objektem specifick\u00fdm pro konkr\u00e9tn\u00ed dom\u00e9nu, operace je v\u0161ak platn\u00e1 pouze pro zb\u00fdvaj\u00edc\u00ed dom\u00e9nu syst\u00e9mu zpr\u00e1v.
JMSCC1113.useraction = Ov\u011b\u0159te, \u017ee jsou objekty syst\u00e9mu JMS, operace a tov\u00e1rny na p\u0159ipojen\u00ed pou\u017e\u00edvan\u00e9 aplikac\u00ed relevantn\u00ed pro po\u017eadovanou dom\u00e9nu syst\u00e9mu zpr\u00e1v. Pokud aplikace pou\u017e\u00edv\u00e1 ob\u011b dom\u00e9ny syst\u00e9mu zpr\u00e1v, uva\u017eujte o pou\u017eit\u00ed objekt\u016f nez\u00e1visl\u00fdch na dom\u00e9n\u011b v cel\u00e9 aplikaci.
JMSCC1113.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_TYPE,XMSC_INSERT_SESSION
JMSCC1113.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC3002 = Do\u010dasn\u00fd c\u00edl fronty {0} nelze odstranit, proto\u017ee je st\u00e1le pou\u017e\u00edv\u00e1no.
JMSCC3002.explanation = Do\u0161lo k pokusu o odstran\u011bn\u00ed do\u010dasn\u00e9ho m\u00edsta ur\u010den\u00ed, kter\u00e9 je st\u00e1le pou\u017e\u00edv\u00e1no spot\u0159ebitelem nebo prohl\u00ed\u017ee\u010dem.
JMSCC3002.useraction = P\u0159ed odstran\u011bn\u00edm m\u00edsta ur\u010den\u00ed zav\u0159ete v\u0161echny spot\u0159ebitele a prohl\u00ed\u017ee\u010de na n\u011bm z\u00e1visl\u00e9.
JMSCC3002.inserts = XMSC_DESTINATION_NAME

JMSCC3003 = Nespr\u00e1vn\u00e9 pou\u017eit\u00ed do\u010dasn\u00e9ho m\u00edsta ur\u010den\u00ed {0}.
JMSCC3003.explanation = Pou\u017eit\u00ed do\u010dasn\u00fdch m\u00edst ur\u010den\u00ed ve spot\u0159ebitel\u00edch a prohl\u00ed\u017ee\u010d\u00edch zpr\u00e1v je omezeno na m\u00edsta vytvo\u0159en\u00e1 v r\u00e1mci t\u00e9ho\u017e p\u0159ipojen\u00ed.
JMSCC3003.useraction = Upravte aplikaci tak, aby pou\u017e\u00edvala do\u010dasn\u00e1 m\u00edsta ur\u010den\u00ed vytvo\u0159en\u00e1 v r\u00e1mci jednoho p\u0159ipojen\u00ed, a zopakujte akci.
JMSCC3003.inserts = XMSC_DESTINATION_NAME
JMSCC3003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException


JMSCC3019 = Do\u010dasn\u00e9 m\u00edsto ur\u010den\u00ed {0} ji\u017e bylo odstran\u011bno.
JMSCC3019.explanation = Do\u010dasn\u00e9 m\u00edsto ur\u010den\u00ed ji\u017e bylo v dob\u011b pokusu o pou\u017eit\u00ed odstran\u011bno.
JMSCC3019.useraction = Upravte aplikaci, aby do\u010dasn\u00e9 m\u00edsto ur\u010den\u00ed nezav\u00edrala nebo aby pou\u017e\u00edvala jin\u00e9 m\u00edsto ur\u010den\u00ed.
JMSCC3019.inserts = XMSC_DESTINATION_NAME
JMSCC3019.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC3025 = Do\u010dasn\u00e9 m\u00edsto ur\u010den\u00ed t\u00e9matu {0} nelze odstranit, proto\u017ee je st\u00e1le pou\u017e\u00edv\u00e1no.
JMSCC3025.explanation = Do\u0161lo k pokusu o odstran\u011bn\u00ed do\u010dasn\u00e9ho m\u00edsta ur\u010den\u00ed, kter\u00e9 je st\u00e1le pou\u017e\u00edv\u00e1no spot\u0159ebitelem nebo prohl\u00ed\u017ee\u010dem.
JMSCC3025.useraction = P\u0159ed odstran\u011bn\u00edm m\u00edsta ur\u010den\u00ed zav\u0159ete v\u0161echny spot\u0159ebitele a prohl\u00ed\u017ee\u010de na n\u011bm z\u00e1visl\u00e9.
JMSCC3025.inserts = XMSC_DESTINATION_NAME

JMSCC3031 = ID klienta nelze nastavit, bylo-li p\u0159ipojen\u00ed ji\u017e pou\u017e\u00edv\u00e1no.
JMSCC3031.explanation = ID klienta pro p\u0159ipojen\u00ed lze nastavit pouze jednou, a to p\u0159ed pou\u017eit\u00edm p\u0159ipojen\u00ed.
JMSCC3031.useraction = Nastavte ID klienta p\u0159ed pou\u017eit\u00edm p\u0159ipojen\u00ed.
JMSCC3031.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC3032 = Resetov\u00e1n\u00ed ID klienta nen\u00ed povoleno.
JMSCC3032.explanation = ID klienta pro p\u0159ipojen\u00ed lze nastavit pouze jednou, a to p\u0159ed pou\u017eit\u00edm p\u0159ipojen\u00ed.
JMSCC3032.useraction = Nastavte ID klienta p\u0159ed pou\u017eit\u00edm p\u0159ipojen\u00ed.
JMSCC3032.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC3033 = Vol\u00e1n\u00ed metody close() v modulu listener pro zpr\u00e1vy by vedlo k zablokov\u00e1n\u00ed.
JMSCC3033.explanation = Z modulu listener pro zpr\u00e1vy byla vol\u00e1na metoda close(). Vol\u00e1n\u00ed metody close() nesm\u00ed prov\u00e9st n\u00e1vrat, dokud neskon\u010d\u00ed modul listener pro zpr\u00e1vy, tak\u017ee by do\u0161lo k zablokov\u00e1n\u00ed.
JMSCC3033.useraction = Zm\u011b\u0148te aplikaci tak, aby modul listener pro zpr\u00e1vy nevolal \u017e\u00e1dn\u00e9 metody close().
JMSCC3033.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

# Log message
JMSCC3034 = V\u00fdjimka je ignorov\u00e1na, proto\u017ee nen\u00ed zaregistrov\u00e1n \u017e\u00e1dn\u00fd modul listener pro v\u00fdjimky: {0}
JMSCC3034.explanation = Prob\u011bhl pokus o doru\u010den\u00ed v\u00fdjimky do modulu listener pro v\u00fdjimky p\u0159ipojen\u00ed, takov\u00fd modul listener v\u0161ak nebyl zaregistrov\u00e1n.
JMSCC3034.useraction = Aby bylo mo\u017en\u00e9 doru\u010dovat v\u00fdjimky p\u0159ipojen\u00ed, mus\u00ed b\u00fdt zaregistrov\u00e1n modul listener pro v\u00fdjimky.
JMSCC3034.inserts = XMSC_INSERT_EXCEPTION

# Log message
JMSCC3035 = V\u00fdjimka je ignorov\u00e1na, proto\u017ee jej\u00ed typ nepat\u0159\u00ed k typ\u016fm vybran\u00fdm pro modul listener pro v\u00fdjimky: {0}
JMSCC3035.explanation = Typ v\u00fdjimky nepat\u0159\u00ed k typ\u016fm vybran\u00fdm pro doru\u010dov\u00e1n\u00ed do modulu listener pro v\u00fdjimky p\u0159ipojen\u00ed. V\u00fdjimka byla proto ignorov\u00e1na.
JMSCC3035.useraction = Zkontrolujte nastaven\u00ed p\u0159ipojen\u00ed ASYNC_EXCEPTIONS a ujist\u011bte se, \u017ee je spr\u00e1vn\u011b nastaveno filtrov\u00e1n\u00ed v\u00fdjimek.
JMSCC3035.inserts = XMSC_INSERT_EXCEPTION

# Log message
JMSCC3036 = Modulu listener pro v\u00fdjimky p\u0159ipojen\u00ed byla doru\u010dena v\u00fdjimka: {0}.
JMSCC3036.useraction = Dal\u0161\u00ed informace naleznete v podrobn\u00fdch \u00fadaj\u00edch o v\u00fdjimce.
JMSCC3036.inserts = XMSC_INSERT_EXCEPTION

JMSCC3039 = N\u00e1zev odb\u011bru m\u011bl hodnotu Null nebo obsahoval pr\u00e1zdn\u00fd \u0159et\u011bzec.
JMSCC3039.explanation = U trval\u00fdch spot\u0159ebitel\u016f p\u0159ipojen\u00ed mus\u00ed b\u00fdt nastaven n\u00e1zev odb\u011bru, kter\u00fd nem\u00e1 hodnotu Null a neobsahuje pouze pr\u00e1zdn\u00fd \u0159et\u011bzec.
JMSCC3039.useraction = Zadejte n\u00e1zev odb\u011bru, kter\u00fd nem\u00e1 hodnotu Null a neobsahuje pouze pr\u00e1zdn\u00fd \u0159et\u011bzec.

JMSCC3040 = Pokus o zm\u011bnu metadat p\u0159ipojen\u00ed byl ignorov\u00e1n. 
JMSCC3040.explanation = Metadata p\u0159ipojen\u00ed jsou p\u0159\u00edstupn\u00e1 pouze pro \u010dten\u00ed, vlastnosti nelze upravit.
JMSCC3040.useraction = Upravte aplikaci tak, aby se nepokou\u0161ela o zm\u011bnu metadat p\u0159ipojen\u00ed.

JMSCC3041 = Pokus o nastaven\u00ed v\u00edce vlastnost\u00ed najednou se nezda\u0159il. Vlastnosti jsou ''{0}''.
JMSCC3041.explanation = U nejm\u00e9n\u011b jedn\u00e9 vlastnosti se nezda\u0159ilo ov\u011b\u0159en\u00ed platnosti, nebyla provedena \u017e\u00e1dn\u00e1 zm\u011bna.
JMSCC3041.useraction = Zkontrolujte, zda m\u00e1 pou\u017eit\u00e1 kombinace vlastnost\u00ed platn\u00e9 hodnoty. 
JMSCC3041.inserts = XMSC_INSERT_PROPERTY

# XA unavailable. An attempt was made to perform and action that requires XA when XA is not supported.
JMSCC4001 = Distribuovan\u00e9 transakce nejsou k dispozici.
JMSCC4001.explanation = Prob\u011bhl pokus o pou\u017eit\u00ed distribuovan\u00fdch transakc\u00ed v prost\u0159ed\u00ed, kde nejsou k dispozici.


JMSCC5001 = Nelze z\u00edskat t\u011blo, proto\u017ee zpr\u00e1va je StreamMessage
JMSCC5001.explanation = Nebylo mo\u017en\u00e9 z\u00edskat t\u011blo, proto\u017ee zpr\u00e1va je StreamMessage, co\u017e nen\u00ed povoleno specifikac\u00ed JMS
JMSCC5001.useraction = Bude nutn\u00e9 zm\u011bnit aplikaci nebo odes\u00edlan\u00fd typ zpr\u00e1vy
JMSCC5001.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC5002 = T\u011blo zpr\u00e1vy typu {0} nelze p\u0159i\u0159adit k {1}
JMSCC5002.explanation = Specifikace nepovoluje p\u0159i\u0159azen\u00ed tohoto typu
JMSCC5002.useraction = Bude nutn\u00e9 zm\u011bnit aplikaci nebo odes\u00edlan\u00fd typ zpr\u00e1vy
JMSCC5002.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC5002.inserts = XMSC_INSERT_MESSAGE_TYPE, XMSC_INSERT_BODY_TYPE

JMSCC5003 = P\u0159i deserializaci zpr\u00e1vy se vyskytla v\u00fdjimka: {0}
JMSCC5003.explanation = Uveden\u00e1 v\u00fdjimka zabr\u00e1nila deserializaci zpr\u00e1vy.
JMSCC5003.useraction = Prozkoumejte podrobnosti t\u00fdkaj\u00edc\u00ed se chyby prost\u0159ednictv\u00edm propojen\u00e9 v\u00fdjimky.
JMSCC5003.inserts = XMSC_INSERT_EXCEPTION
JMSCC5003.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC5004 = Zpr\u00e1va nem\u00e1 t\u011blo
JMSCC5004.explanation = Zpr\u00e1va nem\u00e1 t\u011blo, tak\u017ee nem\u016f\u017ee b\u00fdt p\u0159evedena na ur\u010den\u00fd typ
JMSCC5004.useraction = Bude nutn\u00e9 zm\u011bnit aplikaci nebo odes\u00edlan\u00fd typ zpr\u00e1vy
JMSCC5004.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC5005 = Nen\u00ed povoleno odeslat tuto zpr\u00e1vu, proto\u017ee t\u011blo zpr\u00e1vy je jen pro \u010dten\u00ed a bylo vytvo\u0159eno vol\u00e1n\u00ed JmsProducer.setProperty
JMSCC5005.explanation = U\u017eivatelsk\u00e1 aplikace se pokusila nastavit t\u011blo zpr\u00e1vy jen pro \u010dten\u00ed p\u0159es vol\u00e1n\u00ed JmsProducer.setProperty.
JMSCC5005.useraction = Zm\u011b\u0148te aplika\u010dn\u00ed program tak, aby k takov\u00e9mu chov\u00e1n\u00ed nedoch\u00e1zelo, nebo nejprve volejte metodu clearBody().
JMSCC5005.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSCC5006 = Nen\u00ed povoleno odeslat tuto zpr\u00e1vu, proto\u017ee vyrovn\u00e1vac\u00ed pam\u011b\u0165 pro asynchronn\u00ed odes\u00edl\u00e1n\u00ed na stran\u011b klienta je pln\u00e1.
JMSCC5006.explanation = U\u017eivatelsk\u00e1 aplikace se pokusila asynchronn\u011b odeslat zpr\u00e1vu JMS, ale na klientu jsou ji\u017e nevy\u0159\u00edzen\u00e9 asynchronn\u00ed zpr\u00e1vy.
JMSCC5006.useraction = Zm\u011b\u0148te aplika\u010dn\u00ed program tak, aby volal metody asynchronn\u00edho odes\u00edl\u00e1n\u00ed m\u00e9n\u011b \u010dasto, nebo si v dokumentaci prostudujte volby konfigurace.

JMSCC5007 = Pou\u017eit\u00ed rozhran\u00ed API JMS2.0 ''{0}'' nen\u00ed s touto instanc\u00ed tohoto p\u0159ipojen\u00ed podporov\u00e1no
JMSCC5007.explanation = Pou\u017eit\u00ed rozhran\u00ed API JMS2.0 mohou podporovat pouze p\u0159ipojen\u00ed spr\u00e1vn\u00e9ho typu
JMSCC5007.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC5007.inserts =XMSC_INSERT_METHOD

JMSCC5008 = Pou\u017eit\u00ed funkce JMS2.0 ''{0}'' nen\u00ed s touto instanc\u00ed tohoto p\u0159ipojen\u00ed podporov\u00e1no
JMSCC5008.explanation = Pou\u017eit\u00ed funk\u010dnosti JMS2.0 uveden\u00e9 ve zpr\u00e1v\u011b je podporov\u00e1no, pouze p\u0159i p\u0159ipojen\u00ed ke spr\u00e1vci front IBM MQ V8 s pomoc\u00ed re\u017eimu poskytovatele syst\u00e9mu zpr\u00e1v IBM MQ V8.
JMSCC5008.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC5008.inserts =XMSC_INSERT_METHOD

JMSCC5009 = Podproces odes\u00edl\u00e1n\u00ed nevr\u00e1til \u017e\u00e1dnou odezvu. Zpr\u00e1va mo\u017en\u00e1 nebyla odesl\u00e1na.
JMSCC5009.explanation = Podproces asynchronn\u00ed odes\u00edl\u00e1n\u00ed neodpov\u00edd\u00e1. Mo\u017en\u00e1 byl podproces neo\u010dek\u00e1van\u011b ukon\u010den.

JMSCC5010 = Potla\u010den\u00ed vlastnosti ConnectionFactory z objektu PropertyStore:\n\
{0}
JMSCC5010.inserts = XMSC_INSERT_PROPERTY_OVERRIDE_LIST

JMSCC5011 = Potla\u010den\u00ed vlastnosti {0}:\n\
\tP\u016fvodn\u00ed hodnota = {1}\n\
\tNov\u00e1 hodnota      = {2}
JMSCC5011.inserts = XMSC_OVERRIDDEN_PROPERTY, XMSC_ORIGINAL__PROPERTY_VALUE, XMSC_NEW_PROPERTY_VALUE

#CICS related messages. JMSCC6 used to prevent issues when back porting.
#The first two exceptions have the same text but different exception types
JMSCC6001 = Metoda ''{0}'' p\u0159i spu\u0161t\u011bn\u00ed nen\u00ed v prost\u0159ed\u00ed CICS podporov\u00e1na.
JMSCC6001.explanation = Ur\u010denou metodu nelze pou\u017e\u00edt s re\u017eimem v\u00e1z\u00e1n\u00ed do produktu MQ v prost\u0159ed\u00ed CICS.
JMSCC6001.useraction = Upravte aplikaci tak, aby nevolala ur\u010denou metodu.
JMSCC6001.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6001.inserts = XMSC_INSERT_METHOD
 
JMSCC6002 = Metoda ''{0}'' p\u0159i spu\u0161t\u011bn\u00ed nen\u00ed v prost\u0159ed\u00ed CICS podporov\u00e1na.
JMSCC6002.explanation = Ur\u010denou metodu nelze pou\u017e\u00edt s re\u017eimem v\u00e1z\u00e1n\u00ed do produktu MQ v prost\u0159ed\u00ed CICS.
JMSCC6002.useraction = Upravte aplikaci tak, aby nevolala ur\u010denou metodu.
JMSCC6002.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC6002.inserts = XMSC_INSERT_METHOD
 
JMSCC6003 = P\u0159i spu\u0161t\u011bn\u00ed v prost\u0159ed\u00ed CICS m\u016f\u017ee m\u00edt p\u0159ipojen\u00ed sou\u010dasn\u011b aktivn\u00ed pouze jednu instanci relace.
JMSCC6003.explanation = Sou\u010dasn\u011b je mo\u017en\u00e9 m\u00edt v prost\u0159ed\u00ed CICS aktivn\u00ed pouze jednu instanci relace na p\u0159ipojen\u00ed v re\u017eimu v\u00e1z\u00e1n\u00ed k produktu MQ.
JMSCC6003.useraction = Upravte aplikaci tak, aby bu\u010f vytv\u00e1\u0159ela relaci z jin\u00e9ho p\u0159ipojen\u00ed, nebo zav\u0159ela relaci s aktu\u00e1ln\u00edm p\u0159ipojen\u00edm.
JMSCC6003.exception = com.ibm.msg.client.jms.DetailedJMSException
 
JMSCC6004 = P\u0159i spu\u0161t\u011bn\u00ed v prost\u0159ed\u00ed CICS nen\u00ed vytvo\u0159en\u00ed p\u0159ipojen\u00ed nebo kontextu JMS s ID u\u017eivatele nebo heslem podporov\u00e1no.
JMSCC6004.explanation = Spr\u00e1vce front v prost\u0159ed\u00ed CICS nepodporuje ov\u011b\u0159en\u00ed nebo autorizaci s ID u\u017eivatele a heslem p\u0159i vytv\u00e1\u0159en\u00ed p\u0159ipojen\u00ed v re\u017eimu v\u00e1z\u00e1n\u00ed nebo kontextu JMS. M\u00edsto toho se pou\u017eije ID u\u017eivatele p\u0159idru\u017een\u00e9ho k adresn\u00edmu prostoru CICS nebo transakci.
JMSCC6004.useraction = Upravte aplikaci tak, aby neur\u010dovala ID u\u017eivatele nebo heslo.
JMSCC6004.exception = com.ibm.msg.client.jms.DetailedJMSException

#The first two exceptions have the same text but different exception types
JMSCC6011 = P\u0159i spu\u0161t\u011bn\u00ed v prost\u0159ed\u00ed IMS nen\u00ed metoda ''{0}'' podporov\u00e1na.
JMSCC6011.explanation = Uvedenou metodu nelze v prost\u0159ed\u00ed IMS pou\u017e\u00edt s p\u0159ipojen\u00edm k MQ v re\u017eimu v\u00e1z\u00e1n\u00ed.
JMSCC6011.useraction = Upravte aplikaci tak, aby nevolala ur\u010denou metodu.
JMSCC6011.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6011.inserts = XMSC_INSERT_METHOD
 
JMSCC6012 = P\u0159i spu\u0161t\u011bn\u00ed v prost\u0159ed\u00ed IMS nen\u00ed metoda ''{0}'' podporov\u00e1na.
JMSCC6012.explanation = Uvedenou metodu nelze v prost\u0159ed\u00ed IMS pou\u017e\u00edt s p\u0159ipojen\u00edm k MQ v re\u017eimu v\u00e1z\u00e1n\u00ed.
JMSCC6012.useraction = Upravte aplikaci tak, aby nevolala ur\u010denou metodu.
JMSCC6012.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC6012.inserts = XMSC_INSERT_METHOD
 
JMSCC6013 = P\u0159i spu\u0161t\u011bn\u00ed v prost\u0159ed\u00ed IMS m\u016f\u017ee m\u00edt p\u0159ipojen\u00ed v kter\u00fdkoli okam\u017eik aktivn\u00ed pouze jednu instanci relace.
JMSCC6013.explanation = V prost\u0159ed\u00ed IMS m\u016f\u017ee b\u00fdt v jednom okam\u017eiku pro ka\u017ed\u00e9 p\u0159ipojen\u00ed k MQ v re\u017eimu v\u00e1z\u00e1n\u00ed aktivn\u00ed pouze jedna relace.
JMSCC6013.useraction = Upravte aplikaci tak, aby bu\u010f vytv\u00e1\u0159ela relaci z jin\u00e9ho p\u0159ipojen\u00ed, nebo zav\u0159ela relaci s aktu\u00e1ln\u00edm p\u0159ipojen\u00edm.
JMSCC6013.exception = com.ibm.msg.client.jms.DetailedJMSException
 
JMSCC6014 = P\u0159i spu\u0161t\u011bn\u00ed v prost\u0159ed\u00ed IMS nen\u00ed podporov\u00e1no vytvo\u0159en\u00ed p\u0159ipojen\u00ed nebo kontextu JMS s ID u\u017eivatele nebo heslem.
JMSCC6014.explanation = Spr\u00e1vce front v prost\u0159ed\u00ed IMS p\u0159i vytv\u00e1\u0159en\u00ed p\u0159ipojen\u00ed v re\u017eimu v\u00e1z\u00e1n\u00ed nebo kontextu JMS nepodporuje ov\u011b\u0159en\u00ed nebo autorizaci s ID u\u017eivatele a heslem. M\u00edsto toho se \
pou\u017eije ID u\u017eivatele p\u0159idru\u017een\u00e9 k adresn\u00edmu prostoru IMS, transakci, n\u00e1zvu LTERM nebo PSBNAME.
JMSCC6014.useraction = Upravte aplikaci tak, aby neur\u010dovala ID u\u017eivatele nebo heslo.
JMSCC6014.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSCC6015 = Metoda ''{0}'' nen\u00ed p\u0159i spu\u0161t\u011bn\u00ed v aplika\u010dn\u00edm server podporov\u00e1na
JMSCC6015.explanation = Ur\u010den\u00e1 metoda nesm\u00ed b\u00fdt pou\u017eita v Java EE EJB nebo ve webov\u00e9m kontejneru.
JMSCC6015.useraction = Upravte aplikaci tak, aby nevolala ur\u010denou metodu.
JMSCC6015.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6015.inserts = XMSC_INSERT_METHOD

JMSCC6016 = Aplika\u010dn\u00ed server m\u00e1 \u010dasov\u00fd limit \u010dek\u00e1n\u00ed na z\u00edsk\u00e1n\u00ed relace serveru. \u010casov\u00fd limit je nastaven na ''{0}''
JMSCC6016.explanation = Po vypr\u0161en\u00ed \u010dasov\u00e9ho limitu mus\u00ed adapt\u00e9r prost\u0159edku MQ p\u0159eru\u0161it \u010dek\u00e1n\u00ed na relaci serveru.
JMSCC6016.useraction = Zva\u017ete zv\u00fd\u0161en\u00ed tohoto \u010dasov\u00e9ho limitu v konfigura\u010dn\u00ed vlastnosti JMS 'com.ibm.msg.client.wmq.getServerSessionTimeout'
JMSCC6016.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6016.inserts = XMSC_INSERT_TIMEOUT
 
