# %Z% %W% %I% %E% %U%
#
#   <copyright 
#   notice="oco-source" 
#   pids="5724-H72" 
#   years="2008,2017" 
#   crc="775383328" > 
#   IBM Confidential 
#    
#   OCO Source Materials 
#    
#   5724-H72,5655-R36,5655-L82,5724-L26, 
#    
#   (C) Copyright IBM Corp. 2008, 2017 
#    
#   The source code for the program is not published 
#   or otherwise divested of its trade secrets, 
#   irrespective of what has been deposited with the 
#   U.S. Copyright Office. 
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR

JMSCC0001 = Wyst\u0105pi\u0142 b\u0142\u0105d wewn\u0119trzny. Nie mo\u017cna utworzy\u0107 instancji wymaganej klasy: {0}.
JMSCC0001.useraction = Zapisz wszystkie wygenerowane \
pliki wyj\u015bciowe i przy u\u017cyciu serwisu wsparcia produktu MQ znajduj\u0105cego si\u0119 pod \
adresem http://www.ibm.com/software/integration/wmq/support/ lub przy u\u017cyciu \
produktu IBM Support Assistant (ISA) znajduj\u0105cego si\u0119 pod adresem \
http://www.ibm.com/software/support/isa/ sprawd\u017a, czy rozwi\u0105zanie jest ju\u017c \
dost\u0119pne.  Je\u015bli znalezienie zgodnego przypadku nie jest mo\u017cliwe, skontaktuj si\u0119 z dzia\u0142em wsparcia IBM.
JMSCC0001.inserts = XMSC_INSERT_EXCEPTION

JMSCC0002 = Produkt IBM MQ classes for JMS podj\u0105\u0142 pr\u00f3b\u0119 \
ustawienia niepoprawnego identyfikatora klienta dla po\u0142\u0105czenia.
JMSCC0002.explanation = Aplikacja podj\u0119\u0142a pr\u00f3b\u0119 ustawienia w\u0142a\u015bciwo\u015bci identyfikatora klienta poprawnego po\u0142\u0105czenia na warto\u015b\u0107 NULL lub podj\u0119\u0142a pr\u00f3b\u0119 ustawienia w\u0142a\u015bciwo\u015bci identyfikatora klienta niepoprawnego po\u0142\u0105czenia.
JMSCC0002.useraction = W\u0142a\u015bciwo\u015b\u0107 clientId dla po\u0142\u0105czenia mo\u017ce zosta\u0107 ustawiona tylko raz, tylko na warto\u015b\u0107 inn\u0105 ni\u017c NULL i tylko przed u\u017cyciem po\u0142\u0105czenia. Nale\u017cy upewni\u0107 si\u0119, \u017ce po\u0142\u0105czenie jest poprawne i \u017ce identyfikator klienta nie ma warto\u015bci NULL.
JMSCC0002.exception = com.ibm.msg.client.jms.DetailedInvalidClientIDException

JMSCC0003 = Podana warto\u015b\u0107 {1} nie jest dozwolona w przypadku w\u0142a\u015bciwo\u015bci {0}.
JMSCC0003.explanation = Podana warto\u015b\u0107 nie jest dozwolona w odniesieniu do okre\u015blonej w\u0142a\u015bciwo\u015bci.
JMSCC0003.useraction = Zmie\u0144 warto\u015b\u0107 na tak\u0105, kt\u00f3ra jest obs\u0142ugiwana w przypadku tej w\u0142a\u015bciwo\u015bci.
JMSCC0003.inserts = XMSC_INSERT_NAME, XMSC_INSERT_VALUE
JMSCC0003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0004 = Wywo\u0142anie metody receive nie zwr\u00f3ci komunikatu dla zatrzymanego po\u0142\u0105czenia.
JMSCC0004.explanation = Wed\u0142ug specyfikacji JMS wywo\u0142anie metody receive() nie mo\u017ce zwr\u00f3ci\u0107 komunikatu, je\u015bli po\u0142\u0105czenie jest zatrzymane. Wywo\u0142anie metody receiveNoWait lub receive z limitem czasu spowoduje zwr\u00f3cenie warto\u015bci NULL po up\u0142yni\u0119ciu limitu czasu. Wywo\u0142anie metody receive bez limitu czasu nie spowoduje zwr\u00f3cenia warto\u015bci do momentu uruchomienia lub zamkni\u0119cia po\u0142\u0105czenia albo do momentu zako\u0144czenia dzia\u0142ania aplikacji.
JMSCC0004.useraction = Uruchom po\u0142\u0105czenie, wywo\u0142uj\u0105c metod\u0119 javax.jms.Connection.start(). 

# JMSCC0005 is the same as JMSCC0003 except that JMSCC0003 throws a InvalidDestinationException
# whereas JMSCC0005 throws an JMSException.
JMSCC0005 = Podana warto\u015b\u0107 {1} nie jest dozwolona w przypadku w\u0142a\u015bciwo\u015bci {0}.
JMSCC0005.explanation = Podana warto\u015b\u0107 nie jest dozwolona w odniesieniu do okre\u015blonej w\u0142a\u015bciwo\u015bci.
JMSCC0005.useraction = Zmie\u0144 warto\u015b\u0107 na tak\u0105, kt\u00f3ra jest obs\u0142ugiwana w przypadku tej w\u0142a\u015bciwo\u015bci.
JMSCC0005.inserts = XMSC_INSERT_NAME, XMSC_INSERT_VALUE

JMSCC0007 = Wyst\u0105pi\u0142 wyj\u0105tek podczas wywo\u0142ywania metody {1}: {0}.
JMSCC0007.explanation = Podczas dzia\u0142ania okre\u015blonej metody inny komponent zg\u0142osi\u0142 wyj\u0105tek.
JMSCC0007.useraction = Wi\u0119cej informacji na ten temat zawiera do\u0142\u0105czony wyj\u0105tek.
JMSCC0007.inserts = XMSC_INSERT_EXCEPTION, XMSC_INSERT_METHOD

JMSCC0008 = To po\u0142\u0105czenie jest zamkni\u0119te.
JMSCC0008.explanation = Aplikacja wywo\u0142a\u0142a metod\u0119, kt\u00f3rej nie mo\u017cna u\u017cywa\u0107 po zamkni\u0119ciu po\u0142\u0105czenia.
JMSCC0008.useraction = Przed wywo\u0142aniem metody sprawd\u017a, czy po\u0142\u0105czenie nie jest zamkni\u0119te.
JMSCC0008.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0011 = Metoda {0} nie jest dozwolona w tym kontenerze.
JMSCC0011.explanation = Wywo\u0142ano metod\u0119, kt\u00f3ra nie jest dozwolona w bie\u017c\u0105cym kontenerze.
JMSCC0011.useraction = Usu\u0144 wywo\u0142anie metody.
JMSCC0011.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0011.inserts = XMSC_INSERT_METHOD

JMSCC0012 = Nie mo\u017cna wywo\u0142ywa\u0107 metody {0} z poziomu procesu nas\u0142uchuj\u0105cego {1}.
JMSCC0012.explanation = Wywo\u0142ano metod\u0119, kt\u00f3ra nie jest dozwolona w bie\u017c\u0105cym kontek\u015bcie.
JMSCC0012.useraction = Usu\u0144 wywo\u0142anie metody.
JMSCC0012.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0012.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_NAME

JMSCC0014 = Nie mo\u017cna wywo\u0142a\u0107 metody {0} w przypadku sesji bez transakcji.
JMSCC0014.explanation = Aplikacja wywo\u0142a\u0142a metod\u0119, kt\u00f3rej nie mo\u017cna wywo\u0142ywa\u0107 w przypadku sesji bez transakcji.
JMSCC0014.useraction = Zmodyfikuj aplikacj\u0119, aby wyeliminowa\u0107 to zachowanie.
JMSCC0014.inserts = XMSC_INSERT_METHOD
JMSCC0014.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0020 = Ta sesja jest zamkni\u0119ta.
JMSCC0020.explanation = Aplikacja wywo\u0142a\u0142a metod\u0119, z kt\u00f3rej nie mo\u017cna korzysta\u0107 po zamkni\u0119ciu sesji.
JMSCC0020.useraction = Przed wywo\u0142aniem metody sprawd\u017a, czy sesja nie jest zamkni\u0119ta.
JMSCC0020.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0021 = Nie mo\u017cna wywo\u0142a\u0107 metody {0} w przypadku sesji z transakcj\u0105.
JMSCC0021.explanation = Aplikacja wywo\u0142a\u0142a metod\u0119, kt\u00f3rej nie mo\u017cna wywo\u0142ywa\u0107 w przypadku sesji z transakcj\u0105.
JMSCC0021.useraction = Zmodyfikuj aplikacj\u0119, aby wyeliminowa\u0107 to zachowanie.
JMSCC0021.inserts = XMSC_INSERT_METHOD
JMSCC0021.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0026 = Producent komunikat\u00f3w jest zamkni\u0119ty.
JMSCC0026.explanation = Aplikacja wywo\u0142a\u0142a metod\u0119, z kt\u00f3rej nie mo\u017cna korzysta\u0107 po zamkni\u0119ciu producenta komunikat\u00f3w.
JMSCC0026.useraction = Przed wywo\u0142aniem metody sprawd\u017a, czy producent komunikat\u00f3w nie jest zamkni\u0119ty.
JMSCC0026.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0029 = W przypadku wysy\u0142ania komunikat\u00f3w z tego producenta nale\u017cy okre\u015bli\u0107 miejsce docelowe.
JMSCC0029.explanation = Utworzono producenta z miejscem docelowym o warto\u015bci NULL i nie okre\u015blono miejsca docelowego w metodzie send.
JMSCC0029.useraction = Zmodyfikuj aplikacj\u0119 w taki spos\u00f3b, aby by\u0142a w niej u\u017cywana metoda send(), kt\u00f3ra okre\u015bla miejsce docelowe, albo okre\u015bl miejsce docelowe podczas tworzenia producenta.
JMSCC0029.exception = java.lang.UnsupportedOperationException

JMSCC0030 = W przypadku wysy\u0142ania komunikat\u00f3w z tego producenta nie mo\u017cna okre\u015bli\u0107 miejsca docelowego.
JMSCC0030.explanation = Producent zosta\u0142 utworzony z u\u017cyciem okre\u015blonego miejsca docelowego. Nie jest mo\u017cliwe ponowne okre\u015blenie miejsca docelowego podczas wysy\u0142ania komunikatu.
JMSCC0030.useraction = Zmodyfikuj aplikacj\u0119 w taki spos\u00f3b, aby by\u0142a w niej u\u017cywana metoda send, kt\u00f3ra nie okre\u015bla miejsca docelowego, albo okre\u015bl miejsce docelowe o warto\u015bci NULL podczas tworzenia producenta.
JMSCC0030.exception = java.lang.UnsupportedOperationException

JMSCC0031 = Okre\u015blanie procesu nas\u0142uchuj\u0105cego zako\u0144czenia o warto\u015bci Null nie jest poprawne.
JMSCC0031.explanation = Wywo\u0142anie metody send zawiera\u0142o proces nas\u0142uchuj\u0105cy zako\u0144czenia, ale ten proces mia\u0142 warto\u015b\u0107 Null.
JMSCC0031.useraction = Zmodyfikuj aplikacj\u0119 w taki spos\u00f3b, aby by\u0142a w niej u\u017cywana metoda send, kt\u00f3ra nie okre\u015bla procesu nas\u0142uchuj\u0105cego zako\u0144czenia, albo okre\u015bl proces nas\u0142uchuj\u0105cy zako\u0144czenia o warto\u015bci innej ni\u017c Null podczas tworzenia wywo\u0142ania metody send.
JMSCC0031.exception = java.lang.IllegalArgumentException

JMSCC0032 = Ten konsument komunikat\u00f3w jest zamkni\u0119ty.
JMSCC0032.explanation = Aplikacja wywo\u0142a\u0142a metod\u0119, z kt\u00f3rej nie mo\u017cna korzysta\u0107 po zamkni\u0119ciu konsumenta komunikat\u00f3w.
JMSCC0032.useraction = Przed wywo\u0142aniem metody sprawd\u017a, czy konsument komunikat\u00f3w nie jest zamkni\u0119ty.
JMSCC0032.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0033 = Wywo\u0142anie metody synchronicznej nie jest dozwolone, gdy sesja jest u\u017cywana w trybie asynchronicznym: {0}.
JMSCC0033.explanation = Specyfikacja JMS nie zezwala na u\u017cycie sesji dla metod synchronicznych w przypadku dostarczania komunikat\u00f3w w trybie asynchronicznym.
JMSCC0033.useraction = Utw\u00f3rz oddzieln\u0105 sesj\u0119, je\u015bli metody synchroniczne i tryb asynchronicznego dostarczania komunikat\u00f3w maj\u0105 by\u0107 u\u017cywane r\u00f3wnocze\u015bnie.
JMSCC0033.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0033.inserts = XMSC_INSERT_METHOD

JMSCC0034 = Mechanizm asynchronicznego dostarczania jest w stanie niesp\u00f3jno\u015bci w metodzie: ''{0}''.
JMSCC0034.explanation = Wykryto nieoczekiwan\u0105 sekwencj\u0119 zdarze\u0144 podczas dostarczania komunikat\u00f3w do komponentu bean sterowanego komunikatami (MDB). Mo\u017ce to by\u0107 spowodowane b\u0142\u0119dami aplikacji programistycznej klienta.
JMSCC0034.useraction = Sprawd\u017a, czy w plikach dziennika serwera aplikacji znajduj\u0105 si\u0119 informacje o innych problemach zwi\u0105zanych z komponentem bean sterowanym komunikatami. Zapisz wszystkie wygenerowane pliki wyj\u015bciowe i skorzystaj z serwisu dzia\u0142u wsparcia dla produktu WMQ (http://www.ibm.com/software/integration/wmq/support/) lub programu IBM Support Assistant (ISA) (http://www.ibm.com/software/support/isa/) w celu sprawdzenia, czy rozwi\u0105zanie jest ju\u017c dost\u0119pne.  Je\u015bli znalezienie zgodnego przypadku nie jest mo\u017cliwe, skontaktuj si\u0119 z dzia\u0142em wsparcia IBM.
JMSCC0034.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0034.inserts = XMSC_INSERT_METHOD

JMSCC0037 = Metoda MessageListener.onMessage() zg\u0142osi\u0142a wyj\u0105tek w czasie wykonywania.
JMSCC0037.explanation = Konsument komunikat\u00f3w z zarejestrowanym obiektem nas\u0142uchiwania komunikat\u00f3w odebra\u0142 wyj\u0105tek z metody onMessage().
JMSCC0037.useraction = Nale\u017cy zmieni\u0107 metod\u0119 onMessage(), aby wyeliminowa\u0107 przyczyn\u0119 zg\u0142aszania wyj\u0105tk\u00f3w.

JMSCC0038 = U\u017cytkownik nie ma uprawnie\u0144 do przeprowadzenia tej operacji. Szczeg\u00f3\u0142owe informacje na ten temat zawiera do\u0142\u0105czony wyj\u0105tek.
JMSCC0038.explanation = Do\u0142\u0105czony wyj\u0105tek zawiera szczeg\u00f3\u0142owe informacje dotycz\u0105ce uprawnie\u0144, kt\u00f3re s\u0105 wymagane do przeprowadzenia tej operacji.
JMSCC0038.useraction = Administrator musi nada\u0107 wymagane uprawnienia odpowiedniemu u\u017cytkownikowi.

JMSCC0039 = Typ {0} nie jest poprawny jako w\u0142a\u015bciwo\u015b\u0107 obiektu {1}.
JMSCC0039.explanation = Aplikacja pr\u00f3bowa\u0142a ustawi\u0107 w\u0142a\u015bciwo\u015b\u0107 obiektu przy u\u017cyciu typu obiektu, kt\u00f3ry nie jest dozwolony przez specyfikacj\u0119 JMS.
JMSCC0039.useraction = U\u017cyj dozwolonego typu obiektu. Podstawowe klasy opakowuj\u0105ce lub obiekty typu String to dozwolone typy obiekt\u00f3w.
JMSCC0039.inserts = XMSC_INSERT_TYPE, XMSC_INSERT_PROPERTY
JMSCC0039.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0040 = Podczas odbierania komunikatu wyst\u0105pi\u0142 wyj\u0105tek: {0}.
JMSCC0040.explanation = Podczas odbierania komunikatu zosta\u0142 zg\u0142oszony wyj\u0105tek, kt\u00f3ry spowodowa\u0142, \u017ce operacja nie powiod\u0142a si\u0119.
JMSCC0040.useraction = Sprawd\u017a okre\u015blony wyj\u0105tek. Wi\u0119cej informacji zawiera do\u0142\u0105czony obiekt wyj\u0105tku.
JMSCC0040.inserts = XMSC_INSERT_EXCEPTION
JMSCC0040.exception = com.ibm.msg.client.jms.internal.JmsQueueBrowserImpl.MessageConversionFailed

JMSCC0041 = Konwersja elementu {0} z typu {1} na typ {2} nie jest dozwolona.
JMSCC0041.explanation = Konwersja mi\u0119dzy dwoma podanymi typami danych nie jest dozwolona przez specyfikacj\u0119 JMS.
JMSCC0041.useraction = Pobierz wskazany element przy u\u017cyciu jednej z dozwolonych konwersji.
JMSCC0041.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE

JMSCC0042 = Nie ustawiono warto\u015bci pola komunikatu {0}.
JMSCC0042.explanation = Aplikacja pr\u00f3bowa\u0142a pobra\u0107 warto\u015b\u0107 pola, kt\u00f3ra nie zosta\u0142a ustawiona.
JMSCC0042.useraction = Ustaw warto\u015b\u0107 pola przed pr\u00f3b\u0105 jej pobrania.
JMSCC0042.inserts = XMSC_INSERT_FIELD

JMSCC0043 = Nazwa pola nie mo\u017ce mie\u0107 warto\u015bci NULL ani by\u0107 pusta.
JMSCC0043.explanation = Aplikacja u\u017cytkownika pr\u00f3bowa\u0142a ustawi\u0107 pole przy u\u017cyciu nazwy, kt\u00f3ra nie jest poprawna (np. warto\u015bci NULL lub pustego \u0142a\u0144cucha).
JMSCC0043.useraction = U\u017cyj poprawnej nazwy pola.
JMSCC0043.exception = java.lang.IllegalArgumentException

JMSCC0044 = Wywo\u0142anie metody {0} w odniesieniu do komunikatu nie jest dozwolone, poniewa\u017c tre\u015b\u0107 komunikatu jest tylko do odczytu.
JMSCC0044.explanation = Aplikacja u\u017cytkownika pr\u00f3bowa\u0142a ustawi\u0107 tre\u015b\u0107 komunikatu, kt\u00f3ra jest tylko do odczytu.
JMSCC0044.useraction = Zmodyfikuj aplikacj\u0119, aby wyeliminowa\u0107 to zachowanie, albo wywo\u0142aj najpierw metod\u0119 clearBody().
JMSCC0044.inserts = XMSC_INSERT_METHOD
JMSCC0044.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSCC0045 = Wywo\u0142anie metody {0} w odniesieniu do komunikatu nie jest dozwolone, poniewa\u017c w\u0142a\u015bciwo\u015bci komunikatu s\u0105 tylko do odczytu.
JMSCC0045.explanation = Aplikacja u\u017cytkownika pr\u00f3bowa\u0142a ustawi\u0107 w\u0142a\u015bciwo\u015b\u0107 komunikatu, kt\u00f3ra jest tylko do odczytu.
JMSCC0045.useraction = Zmodyfikuj aplikacj\u0119, aby wyeliminowa\u0107 to zachowanie, albo wywo\u0142aj najpierw metod\u0119 clearProperties().
JMSCC0045.inserts = XMSC_INSERT_METHOD
JMSCC0045.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSCC0046 = Wywo\u0142anie metody {0} w odniesieniu do komunikatu nie jest dozwolone, poniewa\u017c tre\u015b\u0107 komunikatu jest tylko do zapisu.
JMSCC0046.explanation = Aplikacja u\u017cytkownika pr\u00f3bowa\u0142a odczyta\u0107 tre\u015b\u0107 komunikatu, kt\u00f3ry jest tylko do zapisu.
JMSCC0046.useraction = Zmodyfikuj aplikacj\u0119, aby wyeliminowa\u0107 to zachowanie, albo wywo\u0142aj najpierw metod\u0119 reset().
JMSCC0046.inserts = XMSC_INSERT_METHOD
JMSCC0046.exception = com.ibm.msg.client.jms.DetailedMessageNotReadableException

JMSCC0048 = Wyst\u0105pi\u0142 b\u0142\u0105d podczas pr\u00f3by utworzenia komunikatu. Wi\u0119cej szczeg\u00f3\u0142owych informacji na ten temat zawiera do\u0142\u0105czony wyj\u0105tek.
JMSCC0048.explanation = Nie mo\u017cna utworzy\u0107 komunikatu z powodu b\u0142\u0119du.
JMSCC0048.useraction = Szczeg\u00f3\u0142owe informacje na temat tego b\u0142\u0119du zawiera do\u0142\u0105czony wyj\u0105tek.

JMSCC0049 = Nazwa w\u0142a\u015bciwo\u015bci {0} nie jest poprawnym identyfikatorem j\u0119zyka Java(tm).
JMSCC0049.explanation = Podana nazwa w\u0142a\u015bciwo\u015bci nie jest zgodna z dozwolonym formatem opisanym w specyfikacji JMS.
JMSCC0049.useraction = Sprawd\u017a znaki u\u017cyte w nazwie w\u0142a\u015bciwo\u015bci i wprowad\u017a wymagane modyfikacje.
JMSCC0049.inserts = XMSC_INSERT_PROPERTY
JMSCC0049.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0050 = Nazwa w\u0142a\u015bciwo\u015bci {0} jest zastrze\u017cona i nie mo\u017cna jej ustawi\u0107.
JMSCC0050.explanation = Podana nazwa w\u0142a\u015bciwo\u015bci zaczyna si\u0119 od przedrostka JMS, ale nie jest ona jedn\u0105 z obs\u0142ugiwanych i mo\u017cliwych do ustawiania w\u0142a\u015bciwo\u015bci.
JMSCC0050.useraction = Sprawd\u017a nazw\u0119 w\u0142a\u015bciwo\u015bci i popraw b\u0142\u0119dy.
JMSCC0050.inserts = XMSC_INSERT_PROPERTY
JMSCC0050.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0051 = W\u0142a\u015bciwo\u015b\u0107 {0} nale\u017cy ustawi\u0107 przy u\u017cyciu typu {1}, a nie typu {2}.
JMSCC0051.explanation = W\u0142a\u015bciwo\u015bci JMS_IBM mo\u017cna ustawia\u0107 tylko przy u\u017cyciu okre\u015blonego typu zmiennej.
JMSCC0051.useraction = Popraw kod aplikacji, aby podczas ustawiania w\u0142a\u015bciwo\u015bci JMS_IBM u\u017cywany by\u0142 wymagany typ zmiennej.
JMSCC0051.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE
JMSCC0051.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0052 = Wyst\u0105pi\u0142 wyj\u0105tek podczas przekszta\u0142cania obiektu do postaci szeregowej: {0}.
JMSCC0052.explanation = Nie mo\u017cna przekszta\u0142ci\u0107 obiektu do postaci szeregowej z powodu wyj\u0105tku.
JMSCC0052.useraction = Szczeg\u00f3\u0142owe informacje na temat tego b\u0142\u0119du zawiera do\u0142\u0105czony wyj\u0105tek.
JMSCC0052.inserts = XMSC_INSERT_EXCEPTION
JMSCC0052.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0053 = Wyst\u0105pi\u0142 wyj\u0105tek podczas przekszta\u0142cania komunikatu z postaci szeregowej: {0}.
JMSCC0053.explanation = Nie mo\u017cna przekszta\u0142ci\u0107 obiektu z postaci szeregowej z powodu podanego wyj\u0105tku.
JMSCC0053.useraction = Szczeg\u00f3\u0142owe informacje na temat tego b\u0142\u0119du zawiera do\u0142\u0105czony wyj\u0105tek.
JMSCC0053.inserts = XMSC_INSERT_EXCEPTION
JMSCC0053.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0054 = W przegl\u0105darce kolejek nie ma dost\u0119pnych komunikat\u00f3w.
JMSCC0054.explanation = Aplikacja u\u017cytkownika za\u017c\u0105da\u0142a przes\u0142ania komunikatu z przegl\u0105darki kolejek, ale nie ma dost\u0119pnych komunikat\u00f3w.
JMSCC0054.useraction = Sprawd\u017a, czy aplikacja wywo\u0142uje t\u0119 metod\u0119 tylko wtedy, gdy s\u0105 dost\u0119pne komunikaty, oraz czy obs\u0142uguje ten wyj\u0105tek.
JMSCC0054.exception = java.util.NoSuchElementException

JMSCC0055 = Przegl\u0105darka kolejek jest zamkni\u0119ta.
JMSCC0055.explanation = Aplikacja wywo\u0142a\u0142a metod\u0119, z kt\u00f3rej nie mo\u017cna korzysta\u0107 po zamkni\u0119ciu przegl\u0105darki kolejek.
JMSCC0055.useraction = Przed wywo\u0142aniem metody sprawd\u017a, \u017ce przegl\u0105darka kolejek nie jest zamkni\u0119ta.
JMSCC0055.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0059 = Bufor odczytu ma warto\u015b\u0107 NULL.
JMSCC0059.explanation = Do metody StreamMessage.readBytes() przekazano odwo\u0142anie o warto\u015bci NULL, dlatego nie mog\u0142y zosta\u0107 zwr\u00f3cone \u017cadne dane.
JMSCC0059.useraction = Do metody readBytes() przeka\u017c bufor o odpowiedniej wielko\u015bci.
JMSCC0059.exception = java.lang.NullPointerException

JMSCC0060 = Osi\u0105gni\u0119to koniec strumienia komunikatu.
JMSCC0060.explanation = Osi\u0105gni\u0119to koniec tre\u015bci komunikatu. Jest to normalne, je\u015bli aplikacja odczytuj\u0105ca nie wie, jakiej ilo\u015bci danych mo\u017cna oczekiwa\u0107.
JMSCC0060.useraction = Nie jest wymagana \u017cadna czynno\u015b\u0107.
JMSCC0060.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCC0061 = Tablica bajt\u00f3w obiektu StreamMessage nie zosta\u0142a odczytana w ca\u0142o\u015bci.
JMSCC0061.explanation = Podj\u0119to pr\u00f3b\u0119 odczytu nast\u0119pnego pola ze strumienia, podczas gdy tablica bajt\u00f3w zosta\u0142a odczytana tylko cz\u0119\u015bciowo.
JMSCC0061.useraction = Sprawd\u017a, czy kod u\u017cytkownika ko\u0144czy odczyt tablicy bajt\u00f3w przed podj\u0119ciem pr\u00f3by odczytu nast\u0119pnego pola.
JMSCC0061.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0062 = Nie jest mo\u017cliwe zwr\u00f3cenie warto\u015bci NULL jako znaku.
JMSCC0062.explanation = Podj\u0119to pr\u00f3b\u0119 odczytu pola StreamMessage zawieraj\u0105cego warto\u015b\u0107 NULL przy u\u017cyciu metody readChar().
JMSCC0062.useraction = Nale\u017cy unika\u0107 odczytywania warto\u015bci NULL przy u\u017cyciu metody readChar().
JMSCC0062.exception = java.lang.NullPointerException

JMSCC0063 = Niepoprawne kodowanie w przypadku \u0142a\u0144cucha {0}.
JMSCC0063.explanation = Kodowanie podanej warto\u015bci jest nieznane.
JMSCC0063.useraction = Sprawd\u017a, czy aplikacja udost\u0119pnia warto\u015b\u0107 ze zdefiniowanej listy kodowa\u0144.
JMSCC0063.inserts = JMS_IBM_Encoding

JMSCC0064 = Wyst\u0105pi\u0142 b\u0142\u0105d wewn\u0119trzny podczas zapisu do strumienia danych.
JMSCC0064.explanation = Wyst\u0105pi\u0142 problem zwi\u0105zany ze strumieniami danych u\u017cywanymi do konwersji formatu warto\u015bci typu float i double.
JMSCC0064.useraction = Zapisz wszystkie wygenerowane pliki wyj\u015bciowe i skorzystaj z serwisu dzia\u0142u wsparcia dla produktu WMQ (http://www.ibm.com/software/integration/wmq/support/) lub programu IBM Support Assistant (ISA) (http://www.ibm.com/software/support/isa/) w celu sprawdzenia, czy rozwi\u0105zanie jest ju\u017c dost\u0119pne.  Je\u015bli znalezienie zgodnego przypadku nie jest mo\u017cliwe, skontaktuj si\u0119 z dzia\u0142em wsparcia IBM.

JMSCC0065 = Podj\u0119to pr\u00f3b\u0119 odczytu za ko\u0144cem komunikatu.
JMSCC0065.explanation = Podj\u0119to pr\u00f3b\u0119 odczytu za ko\u0144cem komunikatu. Mo\u017ce to by\u0107 normalna sytuacja, je\u015bli aplikacja zosta\u0142a utworzona w taki spos\u00f3b, \u017ce jest mo\u017cliwy odczyt danych o zmiennej d\u0142ugo\u015bci przy u\u017cyciu specyfikacji JMS 1.0.2.
JMSCC0065.useraction = W razie potrzeby zmodyfikuj aplikacj\u0119 w taki spos\u00f3b, aby korzysta\u0142a z nowej metody getBodyLength().
JMSCC0065.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCC0066 = Nie powiod\u0142a si\u0119 pr\u00f3ba konwersji \u0142a\u0144cucha UTF-8.
JMSCC0066.explanation = Wyst\u0105pi\u0142 problem podczas odczytu lub zapisu \u0142a\u0144cucha UTF-8. Najcz\u0119stsz\u0105 przyczyn\u0105 tego problemu jest pr\u00f3ba zapisu \u0142a\u0144cucha d\u0142u\u017cszego ni\u017c 65535 znak\u00f3w.
JMSCC0066.useraction = Wi\u0119cej informacji na ten temat zawiera do\u0142\u0105czony wyj\u0105tek.
JMSCC0066.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0067 = Wyst\u0105pi\u0142 b\u0142\u0105d wewn\u0119trzny. Problem dotyczy zapisu w komunikacie.
JMSCC0067.explanation = Wyst\u0105pi\u0142 b\u0142\u0105d podczas pr\u00f3by zapisu elementu w komunikacie.
JMSCC0067.useraction = Zapisz wszystkie wygenerowane pliki wyj\u015bciowe i skorzystaj z serwisu dzia\u0142u wsparcia dla produktu WMQ (http://www.ibm.com/software/integration/wmq/support/) lub programu IBM Support Assistant (ISA) (http://www.ibm.com/software/support/isa/) w celu sprawdzenia, czy rozwi\u0105zanie jest ju\u017c dost\u0119pne.  Je\u015bli znalezienie zgodnego przypadku nie jest mo\u017cliwe, skontaktuj si\u0119 z dzia\u0142em wsparcia IBM.
JMSCC0067.exception = com.ibm.msg.client.jms.DetailedResourceAllocationException

JMSCC0068 = Dla w\u0142a\u015bciwo\u015bci {0} musi by\u0107 ustawiona \
warto\u015b\u0107 typu {1} lub typu, kt\u00f3ry mo\u017cna przekszta\u0142ci\u0107 w ten typ, zgodnie ze \
specyfikacj\u0105 JMS. Nie mo\u017cna przekszta\u0142ci\u0107 z danego typu {2}. 
JMSCC0068.explanation = Konwersja mi\u0119dzy dwoma podanymi typami danych nie jest dozwolona przez specyfikacj\u0119 JMS.
JMSCC0068.useraction = Ustaw nazwan\u0105 w\u0142a\u015bciwo\u015b\u0107 przy u\u017cyciu \
jednej z dozwolonych konwersji.
JMSCC0068.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC0068.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE

JMSCC0069 = Dla w\u0142a\u015bciwo\u015bci {0} musi by\u0107 ustawiona \
warto\u015b\u0107 typu {1}. Nie mo\u017cna przekszta\u0142ci\u0107 z danego typu {2} warto\u015bci {3}. 
JMSCC0069.explanation = Napotkano b\u0142\u0105d podczas pr\u00f3by \
ustawienia w\u0142a\u015bciwo\u015bci komunikatu.
JMSCC0069.useraction = Ustaw odpowiedni\u0105 warto\u015b\u0107 nazwanej \
w\u0142a\u015bciwo\u015bci przy u\u017cyciu jednej z dozwolonych konwersji.
JMSCC0069.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC0069.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE, XMSC_INSERT_VALUE

JMSCC0070 = Wyst\u0105pi\u0142 b\u0142\u0105d wewn\u0119trzny. Wyst\u0105pi\u0142 problem \
podczas ustawiania w\u0142a\u015bciwo\u015bci komunikatu JMS {0} o oczekiwanym typie {1} przy \
u\u017cyciu obiektu typu {2}.
JMSCC0070.explanation = Napotkano b\u0142\u0105d podczas pr\u00f3by \
ustawienia w\u0142a\u015bciwo\u015bci komunikatu.
JMSCC0070.useraction = Zapisz wszystkie wygenerowane pliki wyj\u015bciowe i skorzystaj z serwisu dzia\u0142u wsparcia dla produktu WMQ (http://www.ibm.com/software/integration/wmq/support/) lub programu IBM Support Assistant (ISA) (http://www.ibm.com/software/support/isa/) w celu sprawdzenia, czy rozwi\u0105zanie jest ju\u017c dost\u0119pne.  Je\u015bli znalezienie zgodnego przypadku nie jest mo\u017cliwe, skontaktuj si\u0119 z dzia\u0142em wsparcia IBM.
JMSCC0070.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC0070.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE

JMSCC0083 = Przekazano niepoprawny obiekt typu {0}.
JMSCC0083.explanation = Do metody writeObject() przekazano obiekt, kt\u00f3rego typ nie jest podstawowym typem opakowania Java(tm).
JMSCC0083.useraction = Popraw aplikacj\u0119 w taki spos\u00f3b, aby tylko obiekty dozwolonych typ\u00f3w by\u0142y przekazywane jako parametry do metody writeObject().
JMSCC0083.inserts = XMSC_INSERT_OBJECT
JMSCC0083.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0084 = Nie ustawiono w\u0142a\u015bciwo\u015bci nazwy {0}.
JMSCC0084.inserts = XMSC_INSERT_PROPERTY

JMSCC0085 = Nie okre\u015blono miejsca docelowego.
JMSCC0085.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0086 = Wielko\u015b\u0107 partii {0} by\u0142a niepoprawna.
JMSCC0086.inserts = XMSC_INSERT_BATCH_SIZE

JMSCC0087 = Nie okre\u015blono puli sesji serwera.

JMSCC0088 = Nie mo\u017cna uzyska\u0107 sesji z okre\u015blonej puli sesji serwera.

JMSCC0089 = Sesja {0} by\u0142a niepoprawna.
JMSCC0089.inserts = XMSC_INSERT_SESSION

JMSCC0091 = Nie mo\u017cna za\u0142adowa\u0107 fabryki dostawc\u00f3w w przypadku typu po\u0142\u0105czenia {0}.
JMSCC0091.inserts = XMSC_CONNECTION_TYPE

JMSCC0092 = Oczekiwano typu po\u0142\u0105czenia {0}, podczas gdy u\u017cyto typu po\u0142\u0105czenia {1}.
JMSCC0092.inserts = XMSC_CONNECTION_TYPE_NAME, XMSC_CONNECTION_TYPE
JMSCC0092.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0093 = Miejsce docelowe by\u0142o niepoprawne. Nie mo\u017cna utworzy\u0107 trwa\u0142ej subskrypcji tymczasowego miejsca docelowego o typie {0} i nazwie {1}.
JMSCC0093.inserts = XMSC_INSERT_TYPE, XMSC_DESTINATION_NAME
JMSCC0093.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0094 = Ta przegl\u0105darka po\u0142\u0105cze\u0144 jest zamkni\u0119ta.
JMSCC0094.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0095 = Nazwa miejsca docelowego {0} jest niepoprawna.
JMSCC0095.explanation = Podana nazwa miejsca docelowego nie jest zgodna z opublikowanymi regu\u0142ami sk\u0142adni nazwy miejsca docelowego.
JMSCC0095.useraction = Popraw podan\u0105 nazw\u0119 miejsca docelowego i spr\u00f3buj ponownie.
JMSCC0095.inserts = XMSC_DESTINATION_NAME
JMSCC0095.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0097 = B\u0142\u0119dny tryb potwierdzenia {0}. Metoda Connection.createSession() otrzyma\u0142a \u017c\u0105danie utworzenia sesji bez transakcji (w\u0142a\u015bciwo\u015b\u0107 transacted mia\u0142a warto\u015b\u0107 false), ale tryb potwierdzenia nie by\u0142 jednym z nast\u0119puj\u0105cych element\u00f3w: AUTO_ACKNOWLEDGE, DUPS_OK_ACKNOWLEDGE i CLIENT_ACKNOWLEDGE.
JMSCC0097.inserts = XMSC_ACKNOWLEDGE_MODE

JMSCC0098 = Komunikat nie mo\u017ce mie\u0107 warto\u015bci NULL.
JMSCC0098.useraction = Podaj komunikat o warto\u015bci innej ni\u017c NULL.
JMSCC0098.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0099 = Miejsce docelowe {0} nie jest instancj\u0105 obiektu com.ibm.msg.client.jms.JmsDestination.
JMSCC0099.useraction = Zamiast niego podaj instancj\u0119 obiektu com.ibm.msg.client.jms.JmsDestination.
JMSCC0099.inserts = XMSC_DESTINATION_NAME
JMSCC0099.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0100 = Nazwa subskrypcji nie mo\u017ce mie\u0107 warto\u015bci NULL.
JMSCC0100.useraction = Podaj nazw\u0119 subskrypcji o warto\u015bci innej ni\u017c NULL.
JMSCC0100.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0101 = Identyfikator klienta nie mo\u017ce mie\u0107 warto\u015bci NULL.
JMSCC0101.useraction = Podaj identyfikator klienta o warto\u015bci innej ni\u017c NULL.
JMSCC0101.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0102 = Nazwa w\u0142a\u015bciwo\u015bci {0} w komunikacie nie jest poprawnym identyfikatorem j\u0119zyka Java(tm).
JMSCC0102.explanation = Podana nazwa w\u0142a\u015bciwo\u015bci nie jest zgodna z dozwolonym formatem opisanym w specyfikacji JMS.
JMSCC0102.useraction = Sprawd\u017a znaki u\u017cyte w nazwie w\u0142a\u015bciwo\u015bci i wprowad\u017a wymagane modyfikacje.
JMSCC0102.inserts = XMSC_INSERT_PROPERTY
JMSCC0102.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0103 = Przekazano obiekt o warto\u015bci NULL.
JMSCC0103.explanation = Do metody writeObject() przekazano obiekt o warto\u015bci NULL.
JMSCC0103.useraction = Popraw aplikacj\u0119 w taki spos\u00f3b, aby tylko obiekty o warto\u015bci innej ni\u017c NULL by\u0142y przekazywane jako parametry do metody writeObject().
JMSCC0103.exception = java.lang.NullPointerException

JMSCC0105 = Konwersja elementu {0} z typu {1} na typ {2} nie jest dozwolona.
JMSCC0105.explanation = Konwersja mi\u0119dzy dwoma podanymi typami danych nie jest dozwolona przez specyfikacj\u0119 JMS.
JMSCC0105.useraction = Pobierz wskazany element przy u\u017cyciu jednej z dozwolonych konwersji.
JMSCC0105.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE
JMSCC0105.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0106 = Nie powiod\u0142o si\u0119 pobieranie zasobu XA. {0}.
JMSCC0106.useraction = Wi\u0119cej informacji na ten temat zawiera opis przyczyny.
JMSCC0106.inserts = XMSC_INSERT_EXCEPTION
JMSCC0106.exception = java.lang.RuntimeException

JMSCC0107 = B\u0142\u0119dny limit czasu {0}.
JMSCC0107.explanation = Limit czasu (wyra\u017cony w milisekundach) musi by\u0107 liczb\u0105 dodatni\u0105 lub wynosi\u0107 zero.
JMSCC0107.useraction = Nie nale\u017cy przekazywa\u0107 ujemnego limitu czasu.
JMSCC0107.inserts = XMSC_INSERT_TIMEOUT

# Message changed for APAR IT16300
JMSCC0108 = Produkt IBM MQ classes for JMS wykry\u0142 komunikat gotowy do asynchronicznego dostarczenia do aplikacji. W chwili podj\u0119cia pr\u00f3by jego dostarczenia komunikat nie by\u0142 ju\u017c dost\u0119pny. Mo\u017cliwe przyczyny i dzia\u0142ania mo\u017cna znale\u017a\u0107 w temacie "Rozwi\u0105zywanie problem\u00f3w z komunikatami JMSCC0108" w sekcji IBM MQ 9.0 Centrum Wiedzy IBM.
JMSCC0108.explanation = W\u0105tek wewn\u0119trzny produktu IBM MQ classes for JMS wykry\u0142 komunikat i za\u017c\u0105da\u0142, aby inny w\u0105tek wewn\u0119trzny dostarczy\u0142 ten komunikat do aplikacji w celu przetworzenia. Gdy ten w\u0105tek podj\u0105\u0142 pr\u00f3b\u0119 przej\u0119cia tego komunikatu, nie by\u0142 on ju\u017c dost\u0119pny.
JMSCC0108.useraction = Wi\u0119cej informacji mo\u017cna znale\u017a\u0107 w temacie "Rozwi\u0105zywanie problem\u00f3w z komunikatami JMSCC0108" w sekcji IBM MQ 9.0 Centrum Wiedzy IBM.

JMSCC0109 = Komponent bean sterowany komunikatami zg\u0142osi\u0142 wyj\u0105tek w czasie wykonywania {0}.
JMSCC0109.explanation = Mo\u017ce to wskazywa\u0107 problem w obiekcie nas\u0142uchiwania komunikat\u00f3w.
JMSCC0109.useraction = Je\u015bli ten wyj\u0105tek wykonawczy zosta\u0142 zg\u0142oszony nierozmy\u015blnie przez obiekt nas\u0142uchiwania komunikat\u00f3w, u\u017cyj do\u0142\u0105czonego wyj\u0105tku w celu ustalenia przyczyny problemu.
JMSCC0109.inserts = XMSC_INSERT_EXCEPTION
JMSCC0109.exception = java.lang.RuntimeException

JMSCC0110 = Podczas przetwarzania komunikatu w celu dostarczenia go do komponentu bean sterowanego komunikatami wychwycono wyj\u0105tek {0}.
JMSCC0110.useraction = Wi\u0119cej informacji na ten temat zawiera do\u0142\u0105czony wyj\u0105tek.
JMSCC0110.inserts = XMSC_INSERT_EXCEPTION
JMSCC0110.exception = java.lang.RuntimeException

JMSCC0111 = Produkt IBM MQ classes for JMS podj\u0105\u0142 pr\u00f3b\u0119 \
ustawienia istniej\u0105cego identyfikatora klienta we w\u0142a\u015bciwo\u015bci Connection lub \
JMSContext.
JMSCC0111.explanation = Aplikacja podj\u0119\u0142a pr\u00f3b\u0119 ustawienia w\u0142a\u015bciwo\u015bci identyfikatora klienta w poprawnej w\u0142a\u015bciwo\u015bci Connection or JMSContext na warto\u015b\u0107 {0}, ale ta warto\u015b\u0107 by\u0142a ju\u017c u\u017cywana.\n\
W\u0142a\u015bciwo\u015b\u0107 clientId zosta\u0142a ju\u017c ustawiona przez {1}.
JMSCC0111.useraction = Upewnij si\u0119, \u017ce po\u0142\u0105czenie jest \
poprawne i \u017ce identyfikator klienta jest unikalny.
JMSCC0111.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_STRING
JMSCC0111.exception = com.ibm.msg.client.jms.DetailedInvalidClientIDException

JMSCC0112 = Op\u00f3\u017anienie dostawy nie jest obs\u0142ugiwane przez tego dostawc\u0119
JMSCC0112.explanation = Aplikacja podj\u0119\u0142a pr\u00f3b\u0119 ustawienia \
op\u00f3\u017anienia dostawy, ale dostawca us\u0142ugi JMS nie obs\u0142uguje tego dzia\u0142ania

JMSCC0113 = Op\u00f3\u017anienie dostawy musi mie\u0107 warto\u015b\u0107 ni\u017csz\u0105 ni\u017c czas \u017cycia
JMSCC0113.explanation = Aplikacja podj\u0119\u0142a pr\u00f3b\u0119 ustawienia op\u00f3\u017anienia dostawy, ale czas \u017cycia nie by\u0142 d\u0142u\u017cszy ni\u017c op\u00f3\u017anienie

JMSCC0114 = Op\u00f3\u017anienie dostawy nie jest obs\u0142ugiwane dla zachowanych publikacji
JMSCC0114.explanation = Aplikacja podj\u0119\u0142a pr\u00f3b\u0119 ustawienia op\u00f3\u017anienia dostawy w zachowanym komunikacie, \
ale to dzia\u0142anie nie jest obs\u0142ugiwane

JMSCC0115 = Nie mo\u017cna u\u017cywa\u0107 op\u00f3\u017anienia dostawy razem z grupowaniem
JMSCC0115.explanation = Aplikacja podj\u0119\u0142a pr\u00f3b\u0119 ustawienia \
op\u00f3\u017anienia dostawy dla komunikatu, kt\u00f3ry mia\u0142 r\u00f3wnie\u017c ustawiony identyfikator \
grupy i/lub numer kolejny grupy, ale to dzia\u0142anie nie jest obs\u0142ugiwane

# Message for FFST - additional fields not required
JMSCC1026 = Zg\u0142oszono wyj\u0105tek podczas dzia\u0142ania obiektu nas\u0142uchiwania wyj\u0105tk\u00f3w u\u017cytkownika.

# Message for FFST - additional fields not required
JMSCC1027 = Uruchomienie obiektu nas\u0142uchiwania wyj\u0105tk\u00f3w nie powiod\u0142o si\u0119.

JMSCC1069 = Operacja dla sesji z transakcj\u0105 XA by\u0142a niepoprawna.
JMSCC1069.explanation = Tryb potwierdzenia dla sesji z transakcj\u0105 XA by\u0142 niepoprawny. Operacje commit(), rollback(), acknowledge() i recover() nie s\u0105 poprawnymi operacjami dla sesji z transakcj\u0105.
JMSCC1069.useraction = Podczas u\u017cywania interfejsu XA nie nale\u017cy wywo\u0142ywa\u0107 tych metod.
JMSCC1069.exception = com.ibm.msg.client.jms.DetailedTransactionInProgressException

JMSCC1083 = Niepoprawna wielko\u015b\u0107 partii komunikat\u00f3w (musi by\u0107 wi\u0119ksza od zera).
JMSCC1083.explanation = Do metody createConnectionConsumer() lub createDurableConnectionConsumer() zosta\u0142 przekazany niepoprawny parametr wielko\u015bci partii.
JMSCC1083.useraction = Ustaw wielko\u015b\u0107 partii w taki spos\u00f3b, aby by\u0142a wi\u0119ksza od zera. Na serwerze aplikacji zgodnym z platform\u0105 JEE mo\u017ce to oznacza\u0107 b\u0142\u0105d serwera aplikacji. Informacje na ten temat mo\u017cna znale\u017a\u0107 w dokumentacji serwera aplikacji.

JMSCC1084 = Przekazano pul\u0119 sesji serwera o warto\u015bci NULL.
JMSCC1084.explanation = Pula sesji serwera okre\u015blona w metodzie createConnectionConsumer() lub createDurableConnectionConsumer() mia\u0142a warto\u015b\u0107 NULL.
JMSCC1084.useraction = Ustaw odpowiedni\u0105 warto\u015b\u0107 w\u0142a\u015bciwo\u015bci ServerSessionPool. Na serwerze aplikacji zgodnym z platform\u0105 JEE mo\u017ce to oznacza\u0107 b\u0142\u0105d serwera aplikacji. Informacje na ten temat mo\u017cna znale\u017a\u0107 w dokumentacji serwera aplikacji.

JMSCC1093 = Przekazano parametr o warto\u015bci NULL.
JMSCC1093.explanation = Obiekt wymagany przez t\u0119 metod\u0119 nie zosta\u0142 poprawnie zainicjowany.
JMSCC1093.useraction = Sprawd\u017a, czy wszystkie parametry przekazane do tej metody zosta\u0142y poprawnie zainicjowane.

JMSCC1094 = Wskaz\u00f3wka QuantityHint jest niepoprawna.
JMSCC1094.explanation = Podj\u0119to pr\u00f3b\u0119 utworzenia przegl\u0105darki po\u0142\u0105cze\u0144 z niepoprawn\u0105 wskaz\u00f3wk\u0105 dotycz\u0105c\u0105 ilo\u015bci danych.
JMSCC1094.useraction = Podaj warto\u015b\u0107 NO_DATA, HEADER_DATA lub FULL_DATA.
JMSCC1094.exception = java.lang.IllegalArgumentException

JMSCC1096 = Odwo\u0142anie komunikatu nie jest poprawne.
JMSCC1096.explanation = Do tej metody przekazano niepoprawnie zbudowane odwo\u0142anie komunikatu. Odwo\u0142anie komunikatu musi by\u0107 instancj\u0105 obiektu JmsMessageReference.
JMSCC1096.useraction = Upewnij si\u0119, \u017ce s\u0105 u\u017cywane poprawne odwo\u0142ania komunikat\u00f3w.

JMSCC1112 = Operacja wykonywana na obiekcie specyficznym dla domeny jest niepoprawna. Operacja {0} nie jest poprawna w przypadku typu {1}.
JMSCC1112.explanation = Aplikacja JMS podj\u0119\u0142a pr\u00f3b\u0119 wykonania operacji na obiekcie specyficznym dla domeny, ale operacja jest poprawna tylko w przypadku innych domen przesy\u0142ania komunikat\u00f3w.
JMSCC1112.useraction = Upewnij si\u0119, \u017ce obiekty i operacje JMS u\u017cywane przez aplikacj\u0119 s\u0105 odpowiednie dla wymaganej domeny przesy\u0142ania komunikat\u00f3w. Je\u015bli aplikacja u\u017cywa obu domen przesy\u0142ania komunikat\u00f3w, warto rozwa\u017cy\u0107 u\u017cycie w aplikacji obiekt\u00f3w niezale\u017cnych od domeny.
JMSCC1112.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_TYPE
JMSCC1112.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC1113 = Operacja wykonywana na obiekcie specyficznym dla domeny jest niepoprawna. Operacja {0} nie jest poprawna w przypadku typu {1}, poniewa\u017c sesja ma typ {2}.
JMSCC1113.explanation = Aplikacja JMS podj\u0119\u0142a pr\u00f3b\u0119 wykonania operacji na obiekcie specyficznym dla domeny, ale operacja jest poprawna tylko w przypadku innych domen przesy\u0142ania komunikat\u00f3w.
JMSCC1113.useraction = Upewnij si\u0119, \u017ce fabryki po\u0142\u0105cze\u0144, \
operacje i obiekty JMS u\u017cywane przez aplikacj\u0119 s\u0105 odpowiednie dla wymaganej \
domeny przesy\u0142ania komunikat\u00f3w. Je\u015bli aplikacja u\u017cywa obu domen przesy\u0142ania komunikat\u00f3w, warto rozwa\u017cy\u0107 u\u017cycie w aplikacji obiekt\u00f3w niezale\u017cnych od domeny.
JMSCC1113.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_TYPE,XMSC_INSERT_SESSION
JMSCC1113.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC3002 = Nie mo\u017cna usun\u0105\u0107 tymczasowego miejsca docelowego kolejki {0}, poniewa\u017c jest ono wci\u0105\u017c w u\u017cyciu.
JMSCC3002.explanation = Podj\u0119to pr\u00f3b\u0119 usuni\u0119cia tymczasowego miejsca docelowego wci\u0105\u017c u\u017cywanego przez konsumenta lub przegl\u0105dark\u0119.
JMSCC3002.useraction = Przed usuni\u0119ciem miejsca docelowego zamknij wszystkie zale\u017cne od niego konsumenty i przegl\u0105darki.
JMSCC3002.inserts = XMSC_DESTINATION_NAME

JMSCC3003 = Niepoprawne u\u017cycie tymczasowego miejsca docelowego {0}.
JMSCC3003.explanation = U\u017cycie tymczasowych miejsc docelowych przez konsumenty komunikat\u00f3w i przegl\u0105darki jest ograniczone do tych, kt\u00f3re utworzono przy u\u017cyciu tego samego po\u0142\u0105czenia.
JMSCC3003.useraction = Zmodyfikuj aplikacj\u0119 w taki spos\u00f3b, aby u\u017cywa\u0142a tymczasowego miejsca docelowego utworzonego przez to samo po\u0142\u0105czenie i spr\u00f3buj ponownie.
JMSCC3003.inserts = XMSC_DESTINATION_NAME
JMSCC3003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException


JMSCC3019 = Tymczasowe miejsce docelowe zosta\u0142o ju\u017c usuni\u0119te ({0}) .
JMSCC3019.explanation = Tymczasowe miejsce docelowe by\u0142o ju\u017c usuni\u0119te, gdy podj\u0119to pr\u00f3b\u0119 jego u\u017cycia.
JMSCC3019.useraction = Zmodyfikuj aplikacj\u0119 w taki spos\u00f3b, aby unikn\u0105\u0107 zamkni\u0119cia tymczasowego miejsca docelowego, lub u\u017cyj innego miejsca docelowego.
JMSCC3019.inserts = XMSC_DESTINATION_NAME
JMSCC3019.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC3025 = Nie mo\u017cna usun\u0105\u0107 tymczasowego miejsca docelowego tematu {0}, poniewa\u017c jest ono wci\u0105\u017c w u\u017cyciu.
JMSCC3025.explanation = Podj\u0119to pr\u00f3b\u0119 usuni\u0119cia tymczasowego miejsca docelowego wci\u0105\u017c u\u017cywanego przez konsumenta lub przegl\u0105dark\u0119.
JMSCC3025.useraction = Przed usuni\u0119ciem miejsca docelowego zamknij wszystkie zale\u017cne od niego konsumenty i przegl\u0105darki.
JMSCC3025.inserts = XMSC_DESTINATION_NAME

JMSCC3031 = Po u\u017cyciu po\u0142\u0105czenia nie mo\u017cna ustawi\u0107 identyfikatora klienta.
JMSCC3031.explanation = Identyfikator klienta po\u0142\u0105czenia mo\u017cna ustawi\u0107 tylko raz i tylko przed u\u017cyciem po\u0142\u0105czenia.
JMSCC3031.useraction = Ustaw identyfikator klienta przed u\u017cyciem po\u0142\u0105czenia.
JMSCC3031.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC3032 = Resetowanie identyfikatora klienta nie jest dozwolone.
JMSCC3032.explanation = Identyfikator klienta po\u0142\u0105czenia mo\u017cna ustawi\u0107 tylko raz i tylko przed u\u017cyciem po\u0142\u0105czenia.
JMSCC3032.useraction = Ustaw identyfikator klienta przed u\u017cyciem po\u0142\u0105czenia.
JMSCC3032.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC3033 = Wywo\u0142anie metody close() w obiekcie nas\u0142uchiwania komunikat\u00f3w mog\u0142oby doprowadzi\u0107 do zakleszczenia.
JMSCC3033.explanation = Metoda close() zosta\u0142a wywo\u0142ana z obiektu nas\u0142uchiwania komunikat\u00f3w. Nie jest dozwolone, aby metoda close() zwraca\u0142a warto\u015b\u0107 podczas dzia\u0142ania obiektu nas\u0142uchiwania komunikat\u00f3w, i dlatego nast\u0105pi zakleszczenie.
JMSCC3033.useraction = Zmie\u0144 aplikacj\u0119 w taki spos\u00f3b, aby nie wywo\u0142ywa\u0142a metod close() z obiektu nas\u0142uchiwania komunikat\u00f3w.
JMSCC3033.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

# Log message
JMSCC3034 = Wyj\u0105tek jest ignorowany, poniewa\u017c nie jest zarejestrowany \u017caden obiekt nas\u0142uchiwania wyj\u0105tk\u00f3w: {0}.
JMSCC3034.explanation = Zosta\u0142a podj\u0119ta pr\u00f3ba dostarczenia wyj\u0105tku do obiektu nas\u0142uchiwania wyj\u0105tk\u00f3w po\u0142\u0105czenia, ale obiekt nas\u0142uchiwania nie jest zarejestrowany.
JMSCC3034.useraction = Obiekt nas\u0142uchiwania wyj\u0105tk\u00f3w musi by\u0107 zarejestrowany z po\u0142\u0105czeniem, aby mo\u017cliwe by\u0142o odbieranie przez niego wyj\u0105tk\u00f3w tego po\u0142\u0105czenia.
JMSCC3034.inserts = XMSC_INSERT_EXCEPTION

# Log message
JMSCC3035 = Wyj\u0105tek jest ignorowany, poniewa\u017c jego typ nie jest jednym z typ\u00f3w wybranych dla obiektu nas\u0142uchiwania wyj\u0105tk\u00f3w: {0}.
JMSCC3035.explanation = Wyj\u0105tek nie jest jednym z typ\u00f3w wybranych na potrzeby dostarczania do obiektu nas\u0142uchiwania wyj\u0105tk\u00f3w po\u0142\u0105czenia i dlatego zosta\u0142 zignorowany.
JMSCC3035.useraction = Sprawd\u017a ustawienie po\u0142\u0105czenia ASYNC_EXCEPTIONS, aby upewni\u0107 si\u0119, czy filtrowanie wyj\u0105tk\u00f3w jest ustawione we w\u0142a\u015bciwy spos\u00f3b.
JMSCC3035.inserts = XMSC_INSERT_EXCEPTION

# Log message
JMSCC3036 = Wyj\u0105tek zosta\u0142 dostarczony do obiektu nas\u0142uchiwania wyj\u0105tk\u00f3w: {0}.
JMSCC3036.useraction = Wi\u0119cej informacji zawieraj\u0105 szczeg\u00f3\u0142y wyj\u0105tku.
JMSCC3036.inserts = XMSC_INSERT_EXCEPTION

JMSCC3039 = Nazwa subskrypcji ma warto\u015b\u0107 NULL lub jest pustym \u0142a\u0144cuchem.
JMSCC3039.explanation = Nazwa subskrypcji trwa\u0142ego wyj\u0105tku po\u0142\u0105czenia nie mo\u017ce mie\u0107 warto\u015bci NULL ani by\u0107 pustym \u0142a\u0144cuchem.
JMSCC3039.useraction = Przeka\u017c nazw\u0119 subskrypcji o warto\u015bci innej ni\u017c NULL i nie b\u0119d\u0105cej pustym \u0142a\u0144cuchem.

JMSCC3040 = Pr\u00f3ba zmodyfikowania metadanych po\u0142\u0105czenia zosta\u0142a zignorowana. 
JMSCC3040.explanation = Metadane po\u0142\u0105czenia s\u0105 tylko do odczytu i dlatego nie mo\u017cna zmodyfikowa\u0107 w\u0142a\u015bciwo\u015bci.
JMSCC3040.useraction = Nie podejmuj pr\u00f3by zmodyfikowania metadanych po\u0142\u0105czenia.

JMSCC3041 = Nie powiod\u0142a si\u0119 pr\u00f3ba r\u00f3wnoczesnego ustawienia wielu w\u0142a\u015bciwo\u015bci. W\u0142a\u015bciwo\u015bci: {0}.
JMSCC3041.explanation = W przypadku jednej lub wielu w\u0142a\u015bciwo\u015bci nie powiod\u0142a si\u0119 operacja sprawdzania poprawno\u015bci i dlatego nie wprowadzono \u017cadnych zmian.
JMSCC3041.useraction = Sprawd\u017a, czy w\u0142a\u015bciwo\u015bci maj\u0105 poprawne warto\u015bci. 
JMSCC3041.inserts = XMSC_INSERT_PROPERTY

# XA unavailable. An attempt was made to perform and action that requires XA when XA is not supported.
JMSCC4001 = Rozproszone transakcje s\u0105 niedost\u0119pne.
JMSCC4001.explanation = Podj\u0119to pr\u00f3b\u0119 u\u017cycia rozproszonych transakcji w \u015brodowisku, w kt\u00f3rym s\u0105 one niedost\u0119pne.


JMSCC5001 = Nie mo\u017cna pobra\u0107 tre\u015bci, poniewa\u017c komunikat jest typu StreamMessage
JMSCC5001.explanation = Nie mo\u017cna pobra\u0107 tre\u015bci, poniewa\u017c komunikat jest typu StreamMessage, \
co jest niedozwolone przez specyfikacj\u0119 JMS
JMSCC5001.useraction = Konieczna b\u0119dzie zmiana wys\u0142anego typu komunikatu lub aplikacji
JMSCC5001.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC5002 = Komunikat typu {0} nie mo\u017ce mie\u0107 tre\u015bci przypisanej do elementu {1}
JMSCC5002.explanation = Specyfikacja JMS nie zezwala na przypisanie tego typu
JMSCC5002.useraction = Konieczna b\u0119dzie zmiana wys\u0142anego typu komunikatu lub aplikacji
JMSCC5002.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC5002.inserts = XMSC_INSERT_MESSAGE_TYPE, XMSC_INSERT_BODY_TYPE

JMSCC5003 = Wyst\u0105pi\u0142 wyj\u0105tek podczas przekszta\u0142cania komunikatu z postaci szeregowej: {0}.
JMSCC5003.explanation = Nie mo\u017cna przekszta\u0142ci\u0107 obiektu z postaci szeregowej z powodu podanego wyj\u0105tku.
JMSCC5003.useraction = Szczeg\u00f3\u0142owe informacje na temat tego b\u0142\u0119du zawiera do\u0142\u0105czony wyj\u0105tek.
JMSCC5003.inserts = XMSC_INSERT_EXCEPTION
JMSCC5003.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC5004 = Komunikat nie zawiera tre\u015bci
JMSCC5004.explanation = Komunikat nie zawiera tre\u015bci, dlatego nie mo\u017cna go przekszta\u0142ci\u0107 w okre\u015blony typ
JMSCC5004.useraction = Konieczna b\u0119dzie zmiana wys\u0142anego typu komunikatu lub aplikacji
JMSCC5004.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC5005 = Wys\u0142anie tego komunikatu nie jest dozwolone, poniewa\u017c tre\u015b\u0107 komunikatu jest tylko do odczytu, a wys\u0142ano wywo\u0142anie JmsProducer.setProperty.
JMSCC5005.explanation = Aplikacja u\u017cytkownika pr\u00f3bowa\u0142a ustawi\u0107 tre\u015b\u0107 komunikatu tylko do odczytu za pomoc\u0105 wywo\u0142ania JmsProducer.setProperty.
JMSCC5005.useraction = Zmodyfikuj aplikacj\u0119, aby wyeliminowa\u0107 to zachowanie, albo wywo\u0142aj najpierw metod\u0119 clearBody().
JMSCC5005.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSCC5006 = Wys\u0142anie tego komunikatu nie jest dozwolone, poniewa\u017c bufor wysy\u0142ania asynchronicznego po stronie klienta jest pe\u0142ny
JMSCC5006.explanation = Aplikacja u\u017cytkownika podj\u0119\u0142a pr\u00f3b\u0119 \
asynchronicznego wys\u0142ania komunikatu JMS, a na kliencie ju\u017c istnieje dziennik komunikat\u00f3w asynchronicznych.
JMSCC5006.useraction = Zmie\u0144 aplikacj\u0119, aby rzadziej \
wywo\u0142ywa\u0142a metody wysy\u0142ania asynchronicznego, lub sprawd\u017a w dokumentacji opcje konfiguracyjne.

JMSCC5007 = U\u017cycie interfejsu API JMS2.0 {0} nie jest obs\u0142ugiwane w tej instancji tego po\u0142\u0105czenia
JMSCC5007.explanation = Tylko po\u0142\u0105czenia poprawnego typu mog\u0105 obs\u0142ugiwa\u0107 u\u017cycie interfejsu API JMS2.0
JMSCC5007.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC5007.inserts =XMSC_INSERT_METHOD

JMSCC5008 = U\u017cycie funkcji JMS2.0 {0} nie jest obs\u0142ugiwane w tej instancji tego po\u0142\u0105czenia
JMSCC5008.explanation = U\u017cycie funkcji JMS2.0 \
wymienionej w komunikacie jest obs\u0142ugiwane tylko podczas nawi\u0105zywania \
po\u0142\u0105czenia z mened\u017cerem kolejek produktu IBM MQ 8 przy u\u017cyciu trybu \
dostawcy przesy\u0142ania komunikat\u00f3w w wersji 8 produktu IBM MQ.
JMSCC5008.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC5008.inserts =XMSC_INSERT_METHOD

JMSCC5009 = Brak odpowiedzi od w\u0105tku wysy\u0142ania. Prawdopodobnie komunikat nie zosta\u0142 wys\u0142any
JMSCC5009.explanation = W\u0105tek wysy\u0142ania asynchronicznego nie odpowiada. W\u0105tek m\u00f3g\u0142 zosta\u0107 nieoczekiwanie zako\u0144czony.

JMSCC5010 = Nadpisywanie w\u0142a\u015bciwo\u015bci ConnectionFactory ze sk\u0142adnicy PropertyStore:\n\
{0}
JMSCC5010.inserts = XMSC_INSERT_PROPERTY_OVERRIDE_LIST

JMSCC5011 = Nadpisywanie w\u0142a\u015bciwo\u015bci {0}:\n\
\tPierwotna warto\u015b\u0107 = {1}\n\
\tNowa warto\u015b\u0107      = {2}
JMSCC5011.inserts = XMSC_OVERRIDDEN_PROPERTY, XMSC_ORIGINAL__PROPERTY_VALUE, XMSC_NEW_PROPERTY_VALUE

#CICS related messages. JMSCC6 used to prevent issues when back porting.
#The first two exceptions have the same text but different exception types
JMSCC6001 = Metoda {0} nie jest obs\u0142ugiwana w przypadku \
dzia\u0142ania w \u015brodowisku CICS.
JMSCC6001.explanation = Podanej metody nie mo\u017cna u\u017cywa\u0107 \
w \u015brodowisku CICS w przypadku po\u0142\u0105czenia z produktem MQ w trybie powi\u0105za\u0144.
JMSCC6001.useraction = Zmodyfikuj aplikacj\u0119 w taki spos\u00f3b, aby \
nie wywo\u0142ywa\u0142a podanej metody.
JMSCC6001.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6001.inserts = XMSC_INSERT_METHOD
 
JMSCC6002 = Metoda {0} nie jest obs\u0142ugiwana w przypadku \
dzia\u0142ania w \u015brodowisku CICS.
JMSCC6002.explanation = Podanej metody nie mo\u017cna u\u017cywa\u0107 \
w \u015brodowisku CICS w przypadku po\u0142\u0105czenia z produktem MQ w trybie powi\u0105za\u0144.
JMSCC6002.useraction = Zmodyfikuj aplikacj\u0119 w taki spos\u00f3b, aby \
nie wywo\u0142ywa\u0142a podanej metody.
JMSCC6002.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC6002.inserts = XMSC_INSERT_METHOD
 
JMSCC6003 = Podczas dzia\u0142ania w \u015brodowisku CICS w danym \
momencie mo\u017ce by\u0107 aktywna tylko jedna instancja sesji na po\u0142\u0105czenie.
JMSCC6003.explanation = Podczas dzia\u0142ania w \u015brodowisku CICS w danym \
momencie mo\u017ce by\u0107 aktywna tylko jedna instancja sesji na po\u0142\u0105czenie z produktem \
MQ w trybie powi\u0105za\u0144.
JMSCC6003.useraction = Zmodyfikuj aplikacj\u0119 w taki spos\u00f3b, aby \
tworzy\u0142a sesj\u0119 przy u\u017cyciu innego po\u0142\u0105czenia lub zamyka\u0142a istniej\u0105c\u0105 sesj\u0119 \
korzystaj\u0105c\u0105 z bie\u017c\u0105cego po\u0142\u0105czenia.
JMSCC6003.exception = com.ibm.msg.client.jms.DetailedJMSException
 
JMSCC6004 = Podczas dzia\u0142ania w \u015brodowisku CICS nie \
jest obs\u0142ugiwane tworzenie po\u0142\u0105czenia ani kontekstu JMS z u\u017cyciem \
identyfikatora u\u017cytkownika lub has\u0142a.
JMSCC6004.explanation = Mened\u017cer kolejek nie obs\u0142uguje \
uwierzytelniania ani autoryzacji przy u\u017cyciu identyfikatora u\u017cytkownika i has\u0142a \
podanego podczas tworzenia po\u0142\u0105czenia w trybie powi\u0105za\u0144 lub kontekstu JMS w \
\u015brodowisku CICS. Zamiast tego u\u017cywany jest identyfikator u\u017cytkownika \
powi\u0105zany z przestrzeni\u0105 adresow\u0105 lub transakcj\u0105 CICS.
JMSCC6004.useraction = Zmodyfikuj aplikacj\u0119 w taki spos\u00f3b, aby \
nie podawa\u0142a identyfikatora u\u017cytkownika ani has\u0142a.
JMSCC6004.exception = com.ibm.msg.client.jms.DetailedJMSException

#The first two exceptions have the same text but different exception types
JMSCC6011 = Metoda {0} nie jest obs\u0142ugiwana w przypadku dzia\u0142ania w \u015brodowisku IMS.
JMSCC6011.explanation = Podanej metody nie mo\u017cna u\u017cywa\u0107 w \u015brodowisku IMS w przypadku po\u0142\u0105czenia z produktem MQ w trybie powi\u0105za\u0144.
JMSCC6011.useraction = Zmodyfikuj aplikacj\u0119 w taki spos\u00f3b, aby \
nie wywo\u0142ywa\u0142a podanej metody.
JMSCC6011.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6011.inserts = XMSC_INSERT_METHOD
 
JMSCC6012 = Metoda {0} nie jest obs\u0142ugiwana w przypadku dzia\u0142ania w \u015brodowisku IMS.
JMSCC6012.explanation = Podanej metody nie mo\u017cna u\u017cywa\u0107 w \u015brodowisku IMS w przypadku po\u0142\u0105czenia z produktem MQ w trybie powi\u0105za\u0144.
JMSCC6012.useraction = Zmodyfikuj aplikacj\u0119 w taki spos\u00f3b, aby \
nie wywo\u0142ywa\u0142a podanej metody.
JMSCC6012.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC6012.inserts = XMSC_INSERT_METHOD
 
JMSCC6013 = Podczas dzia\u0142ania w \u015brodowisku IMS w danym momencie mo\u017ce by\u0107 aktywna tylko jedna instancja sesji na po\u0142\u0105czenie.
JMSCC6013.explanation = Podczas dzia\u0142ania w \u015brodowisku IMS w danym momencie mo\u017ce by\u0107 aktywna tylko jedna instancja sesji na po\u0142\u0105czenie z produktem MQ w trybie powi\u0105za\u0144.
JMSCC6013.useraction = Zmodyfikuj aplikacj\u0119 w taki spos\u00f3b, aby \
tworzy\u0142a sesj\u0119 przy u\u017cyciu innego po\u0142\u0105czenia lub zamyka\u0142a istniej\u0105c\u0105 sesj\u0119 \
korzystaj\u0105c\u0105 z bie\u017c\u0105cego po\u0142\u0105czenia.
JMSCC6013.exception = com.ibm.msg.client.jms.DetailedJMSException
 
JMSCC6014 = Podczas dzia\u0142ania w \u015brodowisku IMS nie jest obs\u0142ugiwane tworzenie po\u0142\u0105czenia ani kontekstu JMS z u\u017cyciem identyfikatora u\u017cytkownika lub has\u0142a.
JMSCC6014.explanation = Mened\u017cer kolejek nie obs\u0142uguje uwierzytelniania ani autoryzacji przy u\u017cyciu identyfikatora u\u017cytkownika i has\u0142a podanego podczas tworzenia po\u0142\u0105czenia w trybie powi\u0105za\u0144 lub kontekstu JMS w \u015brodowisku IMS. Zamiast tego u\u017cywany jest identyfikator u\u017cytkownika powi\u0105zany z przestrzeni\u0105 adresow\u0105, transakcj\u0105, nazw\u0105 LTERM lub PSBNAME \u015brodowiska IMS.
JMSCC6014.useraction = Zmodyfikuj aplikacj\u0119 w taki spos\u00f3b, aby \
nie podawa\u0142a identyfikatora u\u017cytkownika ani has\u0142a.
JMSCC6014.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSCC6015 = Metoda {0} nie jest obs\u0142ugiwana w przypadku dzia\u0142ania na serwerze aplikacji
JMSCC6015.explanation = Nie mo\u017cna u\u017cywa\u0107 podanej metody w komponencie EJB Java EE ani w kontenerze WWW.
JMSCC6015.useraction = Zmodyfikuj aplikacj\u0119 w taki spos\u00f3b, aby \
nie wywo\u0142ywa\u0142a podanej metody.
JMSCC6015.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6015.inserts = XMSC_INSERT_METHOD

JMSCC6016 = Przekroczono limit czasu oczekiwania na serwer aplikacji podczas pr\u00f3by uzyskania sesji serwera. Limit czasu jest ustawiony na warto\u015b\u0107 {0}.
JMSCC6016.explanation = Po przekroczeniu limitu czasu adapter zasob\u00f3w MQ musi przerwa\u0107 oczekiwanie na sesj\u0119 serwera.
JMSCC6016.useraction = Rozwa\u017c zwi\u0119kszenie limitu czasu przy u\u017cyciu w\u0142a\u015bciwo\u015bci konfiguracyjnej JMS com.ibm.msg.client.wmq.getServerSessionTimeout.
JMSCC6016.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6016.inserts = XMSC_INSERT_TIMEOUT
 
