#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE
# %Z% %W% %I% %E% %U%

# Note to translators: the comments for the JMSMQxxxx.documentation properties in
# this file do NOT need to be translated, they are used at build time to create
# untranslated Javadoc documentation. 

#MQJMSIVT messages
JMSMQ0000 = O m\u00e9todo ''{0}'' foi chamado em um momento ilegal ou impr\u00f3prio, ou o provedor n\u00e3o est\u00e1 em um estado apropriado para a opera\u00e7\u00e3o solicitada. 
JMSMQ0000.explanation = A raz\u00e3o normal para essa exce\u00e7\u00e3o \u00e9 se os armazenamentos do certificado SSL n\u00e3o tiverem sido definidos. \
''{0}'' identifica o m\u00e9todo que causou o problema.
JMSMQ0000.inserts = XMSC_INSERT_NAME

JMSMQ1046 = O conjunto de caracteres ''{0}'' n\u00e3o \u00e9 suportado.
JMSMQ1046.documentation = O conjunto de caracteres {0} n\u00e3o \u00e9 suportado. \
<br> <b>Explica\u00e7\u00e3o:</b> Foi feita uma tentativa de enviar ou receber uma mensagem de mapeamento, mensagem de fluxo ou mensagem de texto, cujo corpo est\u00e1 codificado utilizando um conjunto de caracteres n\u00e3o suportado pela JVM. \
No caso de mensagem de texto, esta exce\u00e7\u00e3o pode ser emitida quando o corpo da mensagem \u00e9 consultado primeiro, em vez de no tempo de recebimento. \
<br> <b>Resposta do Usu\u00e1rio:</b> Codifique uma mensagem utilizando apenas um conjunto de caracteres conhecido, dispon\u00edvel no aplicativo de recep\u00e7\u00e3o.

JMSMQ1002 = Servi\u00e7o de mensagens do IBM MQ classes for Java(tm) 
JMSMQ3043 = N\u00edvel Inv\u00e1lido para a repeti\u00e7\u00e3o da Limpeza.
JMSMQ3043.documentation = O n\u00edvel para a Limpeza repetida n\u00e3o \u00e9 v\u00e1lido. \
<br> <b>Resposta do Usu\u00e1rio: </b> Configure a propriedade cleanupLevel para um valor apropriado. 

JMSMQ5032 = Fechando Conex\u00e3o
JMSMQ5010 = Criando uma Conex\u00e3o
JMSMQ5034 = Capturar exce\u00e7\u00e3o
JMSMQ5021 = Falha ao obter a mensagem retornada novamente
JMSMQ5002 = Ignorando o sinalizador -icf; nenhum valor fornecido
JMSMQ5003 = Ignorando o sinalizador desconhecido ''{0}''
JMSMQ5001 = Ignorando o sinalizador -url; nenhum valor fornecido
JMSMQ5006 = Imposs\u00edvel criar InitialContext! Verifique as defini\u00e7\u00f5es de JNDI
JMSMQ5035 = IVT conclu\u00eddo
JMSMQ5000 = Teste de Verifica\u00e7\u00e3o de Instala\u00e7\u00e3o
JMSMQ5033 = IVT conclu\u00eddo com \u00eaxito
JMSMQ5017 = Criando um TextMessage
JMSMQ5024 = Erro! A cadeia de resposta \u00e9 diferente da cadeia original
JMSMQ5023 = A cadeia de resposta \u00e9 igual \u00e0 cadeia original
JMSMQ5020 = Falha ao tentar ler a mensagem retornada novamente aparentemente porque ela n\u00e3o estava l\u00e1
JMSMQ5019 = Lendo a mensagem retornada novamente
JMSMQ5022 = Mensagem obtida
JMSMQ5027 = A mensagem de resposta n\u00e3o \u00e9 um TextMessage
JMSMQ5025 = Cadeia original
JMSMQ5026 = Cadeia de resposta
JMSMQ5018 = Enviando a mensagem para ''{0}''
JMSMQ5028 = Recuperado o tipo de mensagem incorreto
JMSMQ5037 = O jar ou classe ''{0}'' n\u00e3o p\u00f4de ser localizado. Isso ocorreu porque pode estar ausente no caminho de classe.
JMSMQ5038 = A classe ''{0}'' n\u00e3o p\u00f4de ser localizada. Isso ocorreu porque o provedor jndi pode estar ausente no caminho de classe.
JMSMQ5036 = Ignorando op\u00e7\u00e3o ''{0}'', nenhum valor fornecido
JMSMQ5064 = O par\u00e2metro -port deve ser num\u00e9rico
JMSMQ5058 = Exce\u00e7\u00e3o ligada
JMSMQ5007 = Criando um QueueConnectionFactory
JMSMQ5009 = Imposs\u00edvel recuperar o objeto QCF de JNDI
JMSMQ5008 = Recuperando um QueueConnectionFactory de JNDI
JMSMQ5012 = Criando uma Fila
JMSMQ5014 = Imposs\u00edvel recuperar o objeto Q de JNDI
JMSMQ5013 = Recuperando uma Fila de JNDI
JMSMQ5029 = Fechando QueueReceiver
JMSMQ5016 = Criando um QueueReceiver
JMSMQ5030 = Fechando QueueSender
JMSMQ5015 = Criando um QueueSender
JMSMQ5031 = Fechando Sess\u00e3o
JMSMQ5011 = Criando uma Sess\u00e3o
JMSMQ5004 = \u00c9 necess\u00e1rio especificar o par\u00e2metro -url providerURL
JMSMQ5065 = Uso:
JMSMQ5066 = IVTRun -url providerURL [-icf initialContextFactory] [-t]
JMSMQ5067 = IVTRun -nojndi [-m qmgr] [-t] [-v providerversion]
JMSMQ5068 = IVTRun -nojndi -client -m qmgr -host hostname [-port port] [-channel channel] [-ccsid ccsid] [-t] [-v providerversion]
JMSMQ5005 = Utilizando objetos administrados, verifique se est\u00e3o dispon\u00edveis
JMSMQ5100 = Mensagem
JMSMQ5101 = Par\u00e2metro class
JMSMQ5102 = Pilha
JMSMQ5103 = Causado por [{0}] --> Mensagem
JMSMQ5104 = C\u00f3digo de Erro
JMSMQ5105 = Explica\u00e7\u00e3o
JMSMQ5106 = A\u00e7\u00e3o do Usu\u00e1rio
JMSMQ5107 = C\u00f3digo de Conclus\u00e3o
JMSMQ5108 = C\u00f3digo de Raz\u00e3o
JMSMQ5109 = Mensagem de Log
JMSMQ5110 = Explica\u00e7\u00e3o do Log
JMSMQ5111 = Severidade do Log
JMSMQ5112 = Sum\u00e1rio do Log
JMSMQ5113 = Resposta do Usu\u00e1rio
JMSMQ5114 = Executando {0} de {1}
JMSMQ5115 = Falha ao definir propriedades no connection factory da fila


#MQJMSPSIVT messages
JMSMQ5039 = Teste de Verifica\u00e7\u00e3o de Instala\u00e7\u00e3o do Publish/Subscribe
JMSMQ5040 = Recuperando um TopicConnectionFactory de JNDI
JMSMQ5041 = Imposs\u00edvel recuperar o objeto TopicConnectionFactory de JNDI
JMSMQ5042 = Recuperando um T\u00f3pico de JNDI
JMSMQ5043 = Imposs\u00edvel recuperar o objeto Topic de JNDI
JMSMQ5044 = Criando um TopicConnectionFactory
JMSMQ5045 = Imposs\u00edvel criar TopicConnectionFactory
JMSMQ5046 = Criando um T\u00f3pico
JMSMQ5047 = Imposs\u00edvel criar um T\u00f3pico utilizando m\u00e9todos n\u00e3o-JNDI
JMSMQ5048 = Criando um TopicPublisher
JMSMQ5049 = Criando um TopicSubscriber
JMSMQ5050 = Incluindo Texto
JMSMQ5051 = Publicando a mensagem em ''{0}''
JMSMQ5052 = Aguardando uma mensagem chegar [m\u00e1x. 5 seg.]...
JMSMQ5053 = *** Nenhuma resposta do servidor intermedi\u00e1rio. Verifique se o servidor intermedi\u00e1rio est\u00e1 em execu\u00e7\u00e3o. Se estiver \
usando o intermedi\u00e1rio do IBM MQ, verifique se sua brokerVersion est\u00e1 configurada para V1 ***
JMSMQ5053.documentation = Sem resposta do intermedi\u00e1rio. \
<br> <b>Explica\u00e7\u00e3o:</b> As causas poss\u00edveis s\u00e3o: <sl> <li>O intermedi\u00e1rio n\u00e3o est\u00e1 em execu\u00e7\u00e3o. \
<li>Se estiver usando o BrokerVersion=V2 em seu TopicConnectionFactory com o intermedi\u00e1rio Publicar/Assinar do IBM MQ, que n\u00e3o suporta isso. \
<li>O Intermedi\u00e1rio rejeitou a publica\u00e7\u00e3o ou assinatura e a colocou na SYSTEM.DEAD.LETTER.QUEUE </sl> <br> <b>Resposta do Usu\u00e1rio:</b> Certifique-se de que o intermedi\u00e1rio esteja em execu\u00e7\u00e3o. \
Verifique se h\u00e1 mensagens de erro do intermedi\u00e1rio no log de evento do sistema. \
Verifique se o intermedi\u00e1rio suporta a BrokerVersion que est\u00e1 sendo utilizado. \
Verifique se h\u00e1 mensagens rejeitadas em SYSTEM.DEAD.LETTER.QUEUE.

JMSMQ5054 = O intermedi\u00e1rio parece estar em execu\u00e7\u00e3o, mas a mensagem n\u00e3o chegou.
JMSMQ5054.documentation = O intermedi\u00e1rio parece estar em execu\u00e7\u00e3o, mas a mensagem n\u00e3o chegou. \
<br> <b>Explica\u00e7\u00e3o:</b> Gerado pelo teste de verifica\u00e7\u00e3o da instala\u00e7\u00e3o quando o assinante falha ao receber a mensagem publicada. \
<br> <b>Resposta do Usu\u00e1rio:</b> Verifique se o intermedi\u00e1rio foi configurado corretamente. \
Verifique se h\u00e1 mensagens de erro do intermedi\u00e1rio nos logs de evento do sistema. \
Verifique se h\u00e1 mensagens rejeitadas pelo intermedi\u00e1rio em SYSTEM.DEAD.LETTER.QUEUE.

JMSMQ5055 = Falha no PSIVT!
JMSMQ5056 = Fechando o TopicSubscriber
JMSMQ5057 = Fechando o TopicPublisher
JMSMQ5059 = PSIVT conclu\u00eddo
JMSMQ5060 = N\u00e3o \u00e9 poss\u00edvel conectar-se ao gerenciador de filas.
JMSMQ5060.documentation = N\u00e3o \u00e9 poss\u00edvel conectar-se ao gerenciador de filas. \
<br> <b>Explica\u00e7\u00e3o:</b> Gerado pelo teste de verifica\u00e7\u00e3o da instala\u00e7\u00e3o. \
<br> <b>Resposta do Usu\u00e1rio:</b> Verifique se o gerenciador de filas est\u00e1 em execu\u00e7\u00e3o e se o nome foi especificado corretamente nos par\u00e2metros de IVTTest.

JMSMQ5061 = Imposs\u00edvel acessar a fila de controle do intermedi\u00e1rio no gerenciador de filas.
JMSMQ5061.documentation = Imposs\u00edvel acessar a fila de controle do intermedi\u00e1rio no gerenciador de filas. \
<br> <b>Resposta do Usu\u00e1rio:</b> Verifique se a fila de controle existe. \
O nome padr\u00e3o \u00e9 SYSTEM.BROKER.CONTROL.QUEUE.

JMSMQ5062 = Verifique se o servidor intermedi\u00e1rio est\u00e1 instalado nesse gerenciador de filas
JMSMQ5063 = Exce\u00e7\u00e3o no 'brokerIsRunning'
JMSMQ5069 = Uso:
JMSMQ5070 = PSIVTRun -url providerURL [-icf initialContextFactory] [-t]
JMSMQ5071 = PSIVTRun -nojndi [-m qmgr] [-bqm broker] [-t] [-v providerversion]
JMSMQ5072 = PSIVTRun -nojndi -client -m qmgr -host hostname [-port port] [-channel channel] [-bqm broker] [-ccsid ccsid] [-t] [-v providerversion]
JMSMQ5073 = Criando uma Sess\u00e3o S\u00edncrona
JMSMQ5074 = Criando uma Sess\u00e3o Ass\u00edncrona
JMSMQ5075 = Iniciando a conex\u00e3o
JMSMQ5076 = Listener de mensagem disparado
JMSMQ5077 = Listener de mensagem configurado
JMSMQ5078 = Host, porta ou canal n\u00e3o pode ser definido sem a conex\u00e3o do cliente
JMSMQ5079 = Utilit\u00e1rio de Limpeza Publish/Subscribe
JMSMQ5080 = Uso:
JMSMQ5081 = Cleanup [-m qmgr] [-r interval] [SAFE | STRONG | FORCE | NONDUR] [-t]
JMSMQ5082 = Cleanup -client [-m qmgr] -host hostname [-port port] [-channel channel]
JMSMQ5083 =         -r interval [SAFE | STRONG | FORCE | NONDUR] [-t]
JMSMQ5084 = Limpeza conclu\u00edda
JMSMQ5085 = Exce\u00e7\u00e3o durante a limpeza:
JMSMQ5086 = Exce\u00e7\u00e3o ligada:
JMSMQ5090 = \u00c9 necess\u00e1rio especificar um SAFE, STRONG, FORCE ou NONDUR
JMSMQ5091 = \u00c9 necess\u00e1rio especificar o nome do host ao utilizar a conex\u00e3o do cliente
JMSMQ5092 = Valor n\u00e3o num\u00e9rico seguindo ''{0}''
JMSMQ5093 = Par\u00e2metro n\u00e3o reconhec\u00edvel ''{0}''
JMSMQ5094 = Argumento esperado seguindo ''{0}''
JMSMQ5095 = IVT com falha, para obter informa\u00e7\u00f5es adicionais verifique a mensagem de erro anterior.

#MQJMS messages
JMSMQ0003 = O destino n\u00e3o \u00e9 compreendido ou n\u00e3o \u00e9 mais v\u00e1lido.
JMSMQ0003.explanation = A fila ou t\u00f3pico pode ter se tornado n\u00e3o dispon\u00edvel, o aplicativo pode estar utilizando uma conex\u00e3o incorreta para a fila ou t\u00f3pico ou o destino fornecido n\u00e3o \u00e9 do tipo correto para este m\u00e9todo.
JMSMQ0003.useraction = Verifique se o IBM MQ ainda est\u00e1 em execu\u00e7\u00e3o e se o gerenciador de filas est\u00e1 dispon\u00edvel. Verifique se a conex\u00e3o correta est\u00e1 sendo utilizada para a fila ou t\u00f3pico.
JMSMQ0003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException
JMSMQ0003.documentation = ProviderDestination n\u00e3o foi compreendido ou n\u00e3o \u00e9 mais v\u00e1lido. \
<br> <b>Explica\u00e7\u00e3o:</b> A fila ou o t\u00f3pico pode ter se tornado indispon\u00edvel, o aplicativo pode estar utilizando uma conex\u00e3o incorreta para a fila ou o t\u00f3pico, ou o destino fornecido n\u00e3o \u00e9 o tipo correto para este m\u00e9todo. \
<br> <b>Resposta do usu\u00e1rio:</b> verifique se o IBM MQ ainda est\u00e1 em execu\u00e7\u00e3o e se o gerenciador de filas est\u00e1 dispon\u00edvel. \
Verifique se a conex\u00e3o correta est\u00e1 sendo utilizada para a fila ou t\u00f3pico.

JMSMQ1006 = Valor incorreto para ''{0}'': ''{1}''.
JMSMQ1006.explanation = O valor fornecido para a propriedade est\u00e1 fora do intervalo de valores v\u00e1lidos.
JMSMQ1006.useraction = Verifique o valor fornecido
JMSMQ1006.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_VALUE
JMSMQ1006.documentation = O valor para {0}:{1} n\u00e3o \u00e9 v\u00e1lido. \
<br> <b>Explica\u00e7\u00e3o: </b> O valor {1} para a propriedade {0} n\u00e3o est\u00e1 correto. \
<br> <b>Resposta do Usu\u00e1rio: </b> Verifique o valor fornecido. 

JMSMQ0012 = A vers\u00e3o n\u00e3o pode ser alterada, visto que o connection factory ou o destino foi criado.
JMSMQ0012.useraction = Especifique a vers\u00e3o correta ao criar o connection factory ou o destino.
JMSMQ0012.documentation = A vers\u00e3o n\u00e3o pode ser alterada, pois o Connection Factory foi criado.

JMSMQ1096 = Refer\u00eancia da mensagem incorreta.
JMSMQ1096.explanation = Uma MessageReference incorretamente formada foi transmitida a este m\u00e9todo. A refer\u00eancia da mensagem deve ser uma inst\u00e2ncia de MQMessageReference.
JMSMQ1096.useraction = Assegure-se de utilizar as MessageReferences corretas.
JMSMQ1096.documentation = Refer\u00eancia da mensagem inv\u00e1lida.

JMSMQ1112 = A opera\u00e7\u00e3o para um objeto espec\u00edfico do dom\u00ednio n\u00e3o era v\u00e1lida. A opera\u00e7\u00e3o ''{0}'' n\u00e3o \u00e9 v\u00e1lida para o tipo ''{1}''.
JMSMQ1112.explanation = Um aplicativo JMS tentou desempenhar uma opera\u00e7\u00e3o em um objeto espec\u00edfico do dom\u00ednio, mas a opera\u00e7\u00e3o \u00e9 v\u00e1lida apenas para outro dom\u00ednio do sistema de mensagens.
JMSMQ1112.useraction = Certifique-se de que os objetos ou opera\u00e7\u00f5es do JMS utilizados pelo aplicativo s\u00e3o relevantes ao dom\u00ednio do sistema de mensagens necess\u00e1rio. Se seu aplicativo utiliza ambos os dom\u00ednios do sistema de mensagens, considere o uso de objetos independentes de dom\u00ednio no aplicativo.
JMSMQ1112.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_TYPE
JMSMQ1112.documentation = A opera\u00e7\u00e3o para um objeto espec\u00edfico do dom\u00ednio n\u00e3o era v\u00e1lida. \
<br> <b>Explica\u00e7\u00e3o:</b> Um aplicativo JMS tentou desempenhar uma opera\u00e7\u00e3o em um objeto espec\u00edfico do dom\u00ednio, mas a opera\u00e7\u00e3o \u00e9 v\u00e1lida apenas para outro dom\u00ednio do sistema de mensagens. \
<br> <b>Resposta do Usu\u00e1rio:</b> Certifique-se de que os objetos do JMS utilizados pelo aplicativo sejam relevantes ao dom\u00ednio do sistema de mensagens necess\u00e1rio. \
Se seu aplicativo utiliza ambos os dom\u00ednios do sistema de mensagens, considere o uso de objetos independentes de dom\u00ednio no aplicativo.

JMSMQ1113 = O destino n\u00e3o possui um nome configurado.
JMSMQ1113.explanation = Foi feita uma tentativa de utilizar um MQQueue ou MQTopic que foi criado com o construtor padr\u00e3o. Um nome deveria ter sido configurado antes da fila ser utilizada.
JMSMQ1113.useraction = Ap\u00f3s a cria\u00e7\u00e3o, configure um nome em MQQueue ou MQTopic.
JMSMQ1113.documentation = O destino n\u00e3o possui um nome configurado. \
<br> <b>Explica\u00e7\u00e3o:</b> Foi feita uma tentativa de utilizar um MQQueue ou MQTopic que foi criado com o construtor padr\u00e3o; um nome deveria ter sido configurado antes que a fila fosse utilizada. \
<br> <b>Resposta do Usu\u00e1rio:</b> Ap\u00f3s a cria\u00e7\u00e3o, configure um nome em MQQueue ou MQTopic.

JMSMQ1114 = O m\u00e9todo ''{0}'' \u00e9 um m\u00e9todo interno e n\u00e3o deve ser chamado.
JMSMQ1114.explanation = Foi feita uma tentativa de utilizar um m\u00e9todo que \u00e9 apenas para uso interno. Este m\u00e9todo n\u00e3o \u00e9 parte da API publicada e n\u00e3o deve ser utilizado.
JMSMQ1114.useraction = Remova o uso deste m\u00e9todo do aplicativo. Entre em contato com o Servi\u00e7o IBM para obter informa\u00e7\u00f5es adicionais.
JMSMQ1114.inserts = XMSC_INSERT_METHOD
JMSMQ1114.documentation = O m\u00e9todo especificado \u00e9 um m\u00e9todo interno e n\u00e3o deve ser chamado. \
<br> <b>Explica\u00e7\u00e3o:</b> Foi feita uma tentativa de utilizar um m\u00e9todo que \u00e9 apenas para uso interno. \
Este m\u00e9todo n\u00e3o \u00e9 parte da API publicada e n\u00e3o deve ser utilizado. \
<br> <b>Resposta do Usu\u00e1rio:</b> Remova o uso deste m\u00e9todo do aplicativo. \
Entre em contato com o Servi\u00e7o IBM para mais informa\u00e7\u00f5es.

JMSMQ1115 = Nenhum componente foi encontrado.
JMSMQ1115.explanation = Nenhum componente foi encontrado pelo Component Manager.
JMSMQ1115.useraction = Verifique se a configura\u00e7\u00e3o de instala\u00e7\u00e3o e do caminho de classe est\u00e1 correta.
JMSMQ1115.documentation = Nenhum componente foi encontrado. \
<br> <b>Explica\u00e7\u00e3o:</b> Nenhum componente foi encontrado pelo Component Manager. \
<br> <b>Resposta do Usu\u00e1rio:</b> Verifique se a configura\u00e7\u00e3o de instala\u00e7\u00e3o e do caminho de classe est\u00e1 correta.

JMSMQ1120 = A fun\u00e7\u00e3o de Limpeza n\u00e3o \u00e9 suportada na vers\u00e3o do provedor solicitado ''{0}''.
JMSMQ1120.explanation = As opera\u00e7\u00f5es executadas pela limpeza n\u00e3o s\u00e3o necess\u00e1rias para a vers\u00e3o do provedor solicitado.
JMSMQ1120.useraction = Certifique-se de que a vers\u00e3o do provedor solicitado esteja correta.
JMSMQ1120.inserts = XMSC_WMQ_PROVIDER_VERSION
JMSMQ1120.documentation = A fun\u00e7\u00e3o de Limpeza n\u00e3o \u00e9 suportada na vers\u00e3o do provedor solicitado. \
<br> <b>Explica\u00e7\u00e3o:</b> As opera\u00e7\u00f5es executadas pela limpeza n\u00e3o s\u00e3o necess\u00e1rias para a vers\u00e3o do provedor solicitado <br> <b>Resposta do Usu\u00e1rio:</b> Certifique-se de que a vers\u00e3o do provedor fornecido esteja correta.

JMSMQ1121 = Um objeto ConnectionMetaData foi criado usando o construtor em vez de ser obtido de uma conex\u00e3o.
JMSMQ1121.explanation = Os objetos ConnectionMetaData devem ser obtidos a partir da conex\u00e3o que n\u00e3o foi diretamente criada. \
As informa\u00e7\u00f5es de vers\u00e3o ent\u00e3o retornadas podem estar inexatas.
JMSMQ1121.useraction = Obtenha o ConnectionMetaData a partir de uma conex\u00e3o ou utilize a API da vers\u00e3o para obter as informa\u00e7\u00f5es da vers\u00e3o est\u00e1tica.

JMSMQ1122 = Foi feita uma tentativa de configurar ou consultar uma propriedade que foi descontinuada e n\u00e3o \u00e9 mais suportada
JMSMQ1122.explanation = A propriedade n\u00e3o \u00e9 mais usada pelo cliente JMS, portanto, os m\u00e9todos para configur\u00e1-la ou consult\u00e1-la n\u00e3o devem mais ser chamados.

JMSMQ1123 = Sup\u00f5e-se que a instala\u00e7\u00e3o do cliente como biblioteca JNI n\u00e3o esteja localizada 

