#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE
# %Z% %W% %I% %E% %U%

# Note to translators: the comments for the JMSMQxxxx.documentation properties in
# this file do NOT need to be translated, they are used at build time to create
# untranslated Javadoc documentation. 

#MQJMSIVT messages
JMSMQ0000 = Metoda {0} zosta\u0142a wywo\u0142ana w niedozwolonym lub nieodpowiednim czasie lub stan dostawcy nie jest odpowiedni na potrzeby wykonania \u017c\u0105danej operacji. 
JMSMQ0000.explanation = Normaln\u0105 przyczyn\u0105 tego wyj\u0105tku jest to, \u017ce nie zdefiniowano baz certyfikat\u00f3w SSL. \
''{0}'' oznacza metod\u0119, kt\u00f3ra spowodowa\u0142a problem.
JMSMQ0000.inserts = XMSC_INSERT_NAME

JMSMQ1046 = Zestaw znak\u00f3w {0} nie jest obs\u0142ugiwany.
JMSMQ1046.documentation = Zestaw znak\u00f3w {0} nie jest obs\u0142ugiwany. \
<br> <b>Wyja\u015bnienie:</b> Podj\u0119to pr\u00f3b\u0119 wys\u0142ania lub odebrania komunikatu odwzorowania, komunikatu strumienia lub komunikatu tekstowego, kt\u00f3rego tre\u015b\u0107 zosta\u0142a zakodowana za pomoc\u0105 zestawu znak\u00f3w nieobs\u0142ugiwanego przez maszyn\u0119 JVM. \
W przypadku komunikat\u00f3w tekstowych ten wyj\u0105tek mo\u017ce zosta\u0107 zg\u0142oszony, je\u015bli tre\u015b\u0107 wiadomo\u015bci komunikatu jest odpytywana w pierwszej kolejno\u015bci, a nie podczas odbierania. \
<br> <b>Odpowied\u017a u\u017cytkownika:</b> Koduj komunikaty wy\u0142\u0105cznie za pomoc\u0105 zestaw\u00f3w znak\u00f3w dost\u0119pnych dla aplikacji odbieraj\u0105cej.

JMSMQ1002 = IBM MQ classes for Java(tm) Message Service 
JMSMQ3043 = Niepoprawny poziom dla powtarzanej procedury czyszcz\u0105cej.
JMSMQ3043.documentation = Niepoprawny poziom powtarzania procedury czyszcz\u0105cej. \
<br> <b>Odpowied\u017a u\u017cytkownika: </b> Ustaw w\u0142a\u015bciwo\u015b\u0107 cleanupLevel na odpowiedni\u0105 warto\u015b\u0107. 

JMSMQ5032 = Zamykanie po\u0142\u0105czenia
JMSMQ5010 = Tworzenie po\u0142\u0105czenia
JMSMQ5034 = Przechwycono wyj\u0105tek
JMSMQ5021 = Ponowne pobranie komunikatu nie powiod\u0142o si\u0119
JMSMQ5002 = Ignorowanie flagi -icf; nie udost\u0119pniono warto\u015bci
JMSMQ5003 = Ignorowanie nieznanej flagi {0}
JMSMQ5001 = Ignorowanie flagi -url; nie udost\u0119pniono warto\u015bci
JMSMQ5006 = Nie mo\u017cna utworzy\u0107 obiektu Kontekstu_pocz\u0105tkowego! Sprawd\u017a ustawienia JNDI
JMSMQ5035 = IVT zako\u0144czone
JMSMQ5000 = Test sprawdzaj\u0105cy instalacj\u0119
JMSMQ5033 = IVT zako\u0144czone pomy\u015blnie
JMSMQ5017 = Tworzenie Komunikatu_tekstowego
JMSMQ5024 = B\u0142\u0105d! \u0141a\u0144cuch odpowiedzi jest r\u00f3\u017cny od \u0142a\u0144cucha pierwotnego
JMSMQ5023 = \u0141a\u0144cuch odpowiedzi jest r\u00f3wny \u0142a\u0144cuchowi pierwotnemu
JMSMQ5020 = Pr\u00f3ba ponownego odczytania komunikatu nie powiod\u0142a si\u0119; prawdopodobnie dlatego, \u017ce komunikatu nie odnaleziono
JMSMQ5019 = Ponowne odczytywanie komunikatu
JMSMQ5022 = Komunikat pobrany
JMSMQ5027 = Komunikat odpowiedzi nie jest komunikatem tekstowym
JMSMQ5025 = \u0141a\u0144cuch pierwotny
JMSMQ5026 = \u0141a\u0144cuch odpowiedzi
JMSMQ5018 = Wysy\u0142anie komunikatu do {0}
JMSMQ5028 = Wczytano z\u0142y typ komunikatu
JMSMQ5037 = Nie mo\u017cna znale\u017a\u0107 pliku JAR lub klasy {0}. Przyczyn\u0105 mo\u017ce by\u0107 brak odpowiedniego wpisu w \u015bcie\u017cce klasy.
JMSMQ5038 = Nie mo\u017cna znale\u017a\u0107 klasy {0}. Przyczyn\u0105 mo\u017ce by\u0107 brak wpisu dotycz\u0105cego dostawcy JNDI w \u015bcie\u017cce klasy.
JMSMQ5036 = Opcja {0} zostanie zignorowana. Nie podano warto\u015bci.
JMSMQ5064 = Parametr -port musi by\u0107 warto\u015bci\u0105 liczbow\u0105.
JMSMQ5058 = do\u0142\u0105czony wyj\u0105tek
JMSMQ5007 = Tworzenie Fabryki_po\u0142\u0105cze\u0144_kolejek
JMSMQ5009 = Nie mo\u017cna wczyta\u0107 obiektu Fabryki_po\u0142\u0105cze\u0144_kolejek z JNDI
JMSMQ5008 = Wczytywanie Fabryki_po\u0142\u0105cze\u0144_kolejek z JNDI
JMSMQ5012 = Tworzenie kolejki
JMSMQ5014 = Nie mo\u017cna wczyta\u0107 obiektu kolejki z JNDI
JMSMQ5013 = Wczytywanie kolejki z JNDI
JMSMQ5029 = Zamykanie Odbiorcy_kolejek
JMSMQ5016 = Tworzenie Odbiorcy_kolejek
JMSMQ5030 = Zamykanie Nadawcy_kolejek
JMSMQ5015 = Tworzenie Nadawcy_kolejek
JMSMQ5031 = Zamykanie sesji
JMSMQ5011 = Tworzenie sesji
JMSMQ5004 = Nale\u017cy okre\u015bli\u0107 parametr -url dostawcy URL
JMSMQ5065 = U\u017cycie:
JMSMQ5066 = IVTRun -url dostawca_URL [-icf Fabryka_kontekstu_pocz\u0105tkowego] [-t]
JMSMQ5067 = IVTRun -nojndi [-m mened\u017cer_kolejek] [-t] [-v wersja_dostawcy]
JMSMQ5068 = IVTRun -nojndi -klient -m mened\u017cer_kolejek -host nazwa_hosta [-port port] [-kana\u0142 kana\u0142] [-ccsid CCSID] [-t] [-v wersja_dostawcy]
JMSMQ5005 = U\u017cywa si\u0119 obiekt\u00f3w administrowanych; sprawd\u017a, czy s\u0105 one dost\u0119pne
JMSMQ5100 = Komunikat
JMSMQ5101 = Klasa
JMSMQ5102 = Stos
JMSMQ5103 = Spowodowany przez [{0}] --> Komunikat
JMSMQ5104 = Kod b\u0142\u0119du
JMSMQ5105 = Wyja\u015bnienie
JMSMQ5106 = Dzia\u0142anie u\u017cytkownika
JMSMQ5107 = Kod zako\u0144czenia
JMSMQ5108 = Kod przyczyny
JMSMQ5109 = Komunikat dziennika
JMSMQ5110 = Wyja\u015bnienie dziennika
JMSMQ5111 = Poziom istotno\u015bci dziennika
JMSMQ5112 = Podsumowanie dziennika
JMSMQ5113 = Odpowied\u017a u\u017cytkownika
JMSMQ5114 = Uruchamianie {0} z {1}
JMSMQ5115 = Ustawianie w\u0142a\u015bciwo\u015bci w fabryce po\u0142\u0105cze\u0144 kolejki nie powiod\u0142o si\u0119


#MQJMSPSIVT messages
JMSMQ5039 = Zg\u0142o\u015b/subskrybuj test sprawdzaj\u0105cy instalacj\u0119
JMSMQ5040 = Wczytywanie obiektu Fabryki_po\u0142\u0105cze\u0144_sekcji z JNDI
JMSMQ5041 = Nie mo\u017cna wczyta\u0107 obiektu Fabryki_po\u0142\u0105cze\u0144_sekcji z JNDI
JMSMQ5042 = Wczytywanie sekcji z JNDI
JMSMQ5043 = Nie mo\u017cna wczyta\u0107 sekcji z JNDI
JMSMQ5044 = Tworzenie Fabryki_po\u0142\u0105cze\u0144_sekcji
JMSMQ5045 = Nie mo\u017cna utworzy\u0107 Fabryki_po\u0142\u0105cze\u0144_sekcji
JMSMQ5046 = Tworzenie sekcji
JMSMQ5047 = Nie mo\u017cna utworzy\u0107 sekcji za pomoc\u0105 metod innych ni\u017c metody JNDI
JMSMQ5048 = Tworzenie obiektu Subskrybent_sekcji
JMSMQ5049 = Tworzenie obiektu Subskrybent_sekcji
JMSMQ5050 = Dodawanie tekstu
JMSMQ5051 = Publikowanie komunikatu w obiekcie {0}
JMSMQ5052 = Oczekiwanie na przybycie komunikatu [maksymalnie 5 sekund]...
JMSMQ5053 = *** Brak odpowiedzi brokera. Sprawd\u017a, czy broker zosta\u0142 uruchomiony. W przypadku brokera IBM MQ sprawd\u017a, czy wersja brokera to 1. \
***
JMSMQ5053.documentation = Brak odpowiedzi brokera. \
<br> <b>Wyja\u015bnienie:</b> Mo\u017cliwe przyczyny: <sl> <li>Broker nie dzia\u0142a. \
<li>W obiekcie TopicConnectionFactory u\u017cywana jest wersja brokera \
BrokerVersion=V2 wraz z brokerem publikowania/subskrypcji produktu \
IBM MQ, kt\u00f3ry nie obs\u0142uguje tej wersji. \
<li>Broker odrzuci\u0142 publikacj\u0119 lub subskrypcj\u0119 i umie\u015bci\u0142 j\u0105 w kolejce SYSTEM.DEAD.LETTER.QUEUE </sl> <br> <b>Odpowied\u017a u\u017cytkownika:</b> Sprawd\u017a, czy broker dzia\u0142a. \
Sprawd\u017a, czy w dzienniku zdarze\u0144 systemowych zosta\u0142y zapisane komunikaty o b\u0142\u0119dach brokera. \
Sprawd\u017a, czy ten broker obs\u0142uguje u\u017cywan\u0105 wersj\u0119 brokera. \
Sprawd\u017a, czy w kolejce SYSTEM.DEAD.LETTER.QUEUE istniej\u0105 odrzucone komunikaty.

JMSMQ5054 = Broker prawdopodobnie zosta\u0142 uruchomiony, ale komunikat nie zosta\u0142 dostarczony.
JMSMQ5054.documentation = Broker prawdopodobnie zosta\u0142 uruchomiony, ale komunikat nie zosta\u0142 dostarczony. \
<br> <b>Wyja\u015bnienie:</b> Ten komunikat zosta\u0142 wygenerowany podczas testu weryfikuj\u0105cego instalacj\u0119, gdy subskrybent nie odebra\u0142 opublikowanego komunikatu. \
<br> <b>Odpowied\u017a u\u017cytkownika:</b> Sprawd\u017a, czy broker zosta\u0142 poprawnie skonfigurowany. \
Sprawd\u017a, czy w dzienniku zdarze\u0144 systemowych zosta\u0142y zapisane komunikaty o b\u0142\u0119dach brokera. \
Sprawd\u017a, czy w kolejce SYSTEM.DEAD.LETTER.QUEUE istniej\u0105 komunikaty odrzucone przez brokera.

JMSMQ5055 = PSIVT zako\u0144czone niepomy\u015blnie!
JMSMQ5056 = Zamykanie obiektu Subskrybent_sekcji
JMSMQ5057 = Zamykanie obiektu Wydawca_sekcji
JMSMQ5059 = PSIVT zako\u0144czone
JMSMQ5060 = Nie mo\u017cna po\u0142\u0105czy\u0107 si\u0119 z mened\u017cerem kolejek.
JMSMQ5060.documentation = Nie mo\u017cna po\u0142\u0105czy\u0107 si\u0119 z mened\u017cerem kolejek. \
<br> <b>Wyja\u015bnienie:</b> Ten komunikat zosta\u0142 wygenerowany podczas testu weryfikuj\u0105cego instalacj\u0119. \
<br> <b>Odpowied\u017a u\u017cytkownika:</b> Sprawd\u017a, czy mened\u017cer kolejek dzia\u0142a i czy jego nazwa zosta\u0142a poprawnie okre\u015blona w parametrach testu IVTTest.

JMSMQ5061 = Nie mo\u017cna uzyska\u0107 dost\u0119pu do kolejki kontrolnej brokera w mened\u017cerze kolejek.
JMSMQ5061.documentation = Nie mo\u017cna uzyska\u0107 dost\u0119pu do kolejki kontrolnej brokera w mened\u017cerze kolejek. \
<br> <b>Odpowied\u017a u\u017cytkownika:</b> Sprawd\u017a, czy kolejka kontrolna istnieje. \
Domy\u015blna nazwa: SYSTEM.BROKER.CONTROL.QUEUE.

JMSMQ5062 = Sprawd\u017a, czy broker zosta\u0142 zainstalowany w mened\u017cerze kolejek
JMSMQ5063 = Wyj\u0105tek komunikatu 'broker jest uruchomiony'
JMSMQ5069 = U\u017cycie:
JMSMQ5070 = PSIVTRun -url dostawca_URL [-icf Fabryka_kontekstu_pocz\u0105tkowego] [-t]
JMSMQ5071 = PSIVTRun -nojndi [-m mened\u017cer_kolejek] [-bqm broker] [-t] [-v wersja_dostawcy]
JMSMQ5072 = PSIVTRun -nojndi -klient -m mened\u017cer_kolejek -host nazwa_hosta [-port port] [-kana\u0142 kana\u0142] [-bqm broker] [-ccsid CCSID] [-t] [-v wersja_dostawcy]
JMSMQ5073 = Tworzenie sesji synchronicznej
JMSMQ5074 = Tworzenie sesji asynchronicznej
JMSMQ5075 = Uruchamianie po\u0142\u0105czenia
JMSMQ5076 = Uruchomiono obiekt nas\u0142uchiwania komunikat\u00f3w
JMSMQ5077 = Ustawiono obiekt nas\u0142uchiwania komunikat\u00f3w
JMSMQ5078 = Host, port lub kana\u0142 nie mo\u017ce zosta\u0107 ustawiony bez po\u0142\u0105czenia klienta
JMSMQ5079 = Zg\u0142o\u015b/subskrybuj program narz\u0119dziowy czyszczenia
JMSMQ5080 = U\u017cycie:
JMSMQ5081 = Czyszczenie [-m mened\u017cer_kolejek] [-r interwa\u0142] [SAFE | STRONG | FORCE | NONDUR] [-t]
JMSMQ5082 = Czyszczenie -klient [-m mened\u017cer_kolejek] -host nazwa_hosta [-port port] [-channel kana\u0142]
JMSMQ5083 =         -r interwa\u0142 [SAFE | STRONG | FORCE | NONDUR] [-t]
JMSMQ5084 = Procedura czyszcz\u0105ca zosta\u0142a zako\u0144czona
JMSMQ5085 = Wyj\u0105tek podczas wykonywania procedury czyszcz\u0105cej:
JMSMQ5086 = Za\u0142\u0105czony wyj\u0105tek:
JMSMQ5090 = Nale\u017cy poda\u0107 jedn\u0105 z warto\u015bci SAFE, STRONG, FORCE lub NONDUR
JMSMQ5091 = Je\u015bli u\u017cywane jest po\u0142\u0105czenie klienta, nale\u017cy okre\u015bli\u0107 nazw\u0119 hosta
JMSMQ5092 = Po {0} znajduje si\u0119 warto\u015b\u0107 nieliczbowa
JMSMQ5093 = Nierozpoznany parametr {0}
JMSMQ5094 = Oczekiwany argument nast\u0119puje po elemencie {0}
JMSMQ5095 = Dzia\u0142anie programu IVT nie powiod\u0142o si\u0119, wi\u0119cej informacji mo\u017cna znale\u017a\u0107 w poprzedni komunikat o b\u0142\u0119dzie.

#MQJMS messages
JMSMQ0003 = Miejsce docelowe nie jest rozpoznawane lub nie jest ju\u017c poprawne.
JMSMQ0003.explanation = Kolejka lub temat mog\u0142y sta\u0107 si\u0119 niedost\u0119pne, aplikacja mo\u017ce u\u017cywa\u0107 niepoprawnego po\u0142\u0105czenia dla kolejki lub tematu b\u0105d\u017a typ podanego miejsca docelowego nie jest poprawny dla tej metody.
JMSMQ0003.useraction = Sprawd\u017a, czy produkt IBM MQ jest \
nadal uruchomiony i czy jest dost\u0119pny mened\u017cer kolejek. Sprawd\u017a, czy dla kolejki lub tematu jest u\u017cywane w\u0142a\u015bciwe po\u0142\u0105czenie.
JMSMQ0003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException
JMSMQ0003.documentation = Obiekt ProviderDestination nie zosta\u0142 rozpoznany lub nie jest ju\u017c poprawny. \
<br> <b>Wyja\u015bnienie:</b> Kolejka lub temat mog\u0142y sta\u0107 si\u0119 niedost\u0119pne, aplikacja mo\u017ce u\u017cywa\u0107 dla kolejki lub tematu niepoprawnego po\u0142\u0105czenia albo podane miejsce docelowe nale\u017cy do typu, kt\u00f3ry nie jest poprawny dla tej metody. \
<br> <b>Odpowied\u017a u\u017cytkownika:</b> Sprawd\u017a, czy produkt IBM MQ nadal \
dzia\u0142a i czy jest dost\u0119pny mened\u017cer kolejek. \
Sprawd\u017a, czy dla kolejki lub tematu jest u\u017cywane w\u0142a\u015bciwe po\u0142\u0105czenie.

JMSMQ1006 = Niepoprawna warto\u015b\u0107 w\u0142a\u015bciwo\u015bci {0}: {1}.
JMSMQ1006.explanation = Warto\u015b\u0107 podana dla w\u0142a\u015bciwo\u015bci jest spoza zakresu poprawnych warto\u015bci.
JMSMQ1006.useraction = Sprawd\u017a warto\u015b\u0107, kt\u00f3ra zosta\u0142a podana.
JMSMQ1006.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_VALUE
JMSMQ1006.documentation = Warto\u015b\u0107 dla {0}:{1} nie jest poprawna. \
<br> <b>Wyja\u015bnienie: </b> Warto\u015b\u0107 {1} dla w\u0142a\u015bciwo\u015bci {0} nie jest poprawna. \
<br> <b>Odpowied\u017a u\u017cytkownika: </b> Sprawd\u017a podan\u0105 warto\u015b\u0107. 

JMSMQ0012 = Po utworzeniu fabryki po\u0142\u0105cze\u0144 lub miejsca docelowego nie mo\u017cna zmieni\u0107 wersji.
JMSMQ0012.useraction = Okre\u015bl poprawn\u0105 wersj\u0119 podczas tworzenia fabryki po\u0142\u0105cze\u0144 lub miejsca docelowego.
JMSMQ0012.documentation = Po utworzeniu fabryki po\u0142\u0105cze\u0144 nie mo\u017cna zmieni\u0107 wersji.

JMSMQ1096 = Niepoprawne odwo\u0142anie komunikatu.
JMSMQ1096.explanation = Do tej metody zosta\u0142o przekazane niepoprawnie zbudowane odwo\u0142anie MessageReference. Odwo\u0142anie komunikatu musi by\u0107 instancj\u0105 obiektu MQMessageReference.
JMSMQ1096.useraction = Sprawd\u017a, czy s\u0105 u\u017cywane poprawne odwo\u0142ania MessageReference.
JMSMQ1096.documentation = Niepoprawne odwo\u0142anie komunikatu.

JMSMQ1112 = Operacja wykonywana na obiekcie specyficznym dla domeny jest niepoprawna. Operacja {0} nie jest poprawna w przypadku typu {1}.
JMSMQ1112.explanation = Aplikacja JMS podj\u0119\u0142a pr\u00f3b\u0119 wykonania operacji na obiekcie specyficznym dla domeny, ale operacja jest poprawna tylko w przypadku innych domen przesy\u0142ania komunikat\u00f3w.
JMSMQ1112.useraction = Upewnij si\u0119, \u017ce obiekty i operacje JMS u\u017cywane przez aplikacj\u0119 s\u0105 odpowiednie dla wymaganej domeny przesy\u0142ania komunikat\u00f3w. Je\u015bli aplikacja u\u017cywa obu domen przesy\u0142ania komunikat\u00f3w, warto rozwa\u017cy\u0107 u\u017cycie w aplikacji obiekt\u00f3w niezale\u017cnych od domeny.
JMSMQ1112.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_TYPE
JMSMQ1112.documentation = Operacja wykonywana na obiekcie specyficznym dla domeny jest niepoprawna. \
<br> <b>Wyja\u015bnienie:</b> Aplikacja JMS podj\u0119\u0142a pr\u00f3b\u0119 wykonania operacji na obiekcie specyficznym dla domeny, ale operacja jest poprawna tylko w przypadku innych domen przesy\u0142ania komunikat\u00f3w. \
<br> <b>Odpowied\u017a u\u017cytkownika:</b> Upewnij si\u0119, \u017ce obiekty JMS u\u017cywane przez aplikacj\u0119 s\u0105 odpowiednie dla wymaganej domeny przesy\u0142ania komunikat\u00f3w. \
Je\u015bli aplikacja u\u017cywa obu domen przesy\u0142ania komunikat\u00f3w, warto rozwa\u017cy\u0107 u\u017cycie w aplikacji obiekt\u00f3w niezale\u017cnych od domeny.

JMSMQ1113 = Nie zosta\u0142a ustawiona nazwa miejsca docelowego.
JMSMQ1113.explanation = Zosta\u0142a podj\u0119ta pr\u00f3ba u\u017cycia kolejki MQQueue lub tematu MQTopic utworzonego za pomoc\u0105 konstruktora domy\u015blnego. Nazw\u0119 nale\u017cy ustawi\u0107 przed u\u017cyciem kolejki.
JMSMQ1113.useraction = Po wykonaniu operacji tworzenia ustaw nazw\u0119 kolejki MQQueue lub tematu MQTopic.
JMSMQ1113.documentation = Nie zosta\u0142a ustawiona nazwa miejsca docelowego. \
<br> <b>Wyja\u015bnienie:</b> Zosta\u0142a podj\u0119ta pr\u00f3ba u\u017cycia kolejki MQQueue lub tematu MQTopic utworzonego za pomoc\u0105 konstruktora domy\u015blnego. W takim razie nale\u017ca\u0142o ustawi\u0107 nazw\u0119 przed u\u017cyciem kolejki. \
<br> <b>Odpowied\u017a u\u017cytkownika:</b> Po wykonaniu operacji tworzenia ustaw nazw\u0119 kolejki MQQueue lub tematu MQTopic.

JMSMQ1114 = Metoda {0} jest metod\u0105 wewn\u0119trzn\u0105 i nie mo\u017cna jej wywo\u0142ywa\u0107.
JMSMQ1114.explanation = Zosta\u0142a podj\u0119ta pr\u00f3ba u\u017cycia metody przeznaczonej wy\u0142\u0105cznie do u\u017cytku wewn\u0119trznego. Ta \
metoda nie jest cz\u0119\u015bci\u0105 opublikowanego interfejsu API i nie mo\u017ce by\u0107 u\u017cywana.
JMSMQ1114.useraction = Usu\u0144 u\u017cycie tej metody z aplikacji. Aby uzyska\u0107 dodatkowe informacje, skontaktuj si\u0119 z serwisem IBM.
JMSMQ1114.inserts = XMSC_INSERT_METHOD
JMSMQ1114.documentation = Okre\u015blona metoda jest metod\u0105 wewn\u0119trzn\u0105 i nie mo\u017cna jej wywo\u0142ywa\u0107. \
<br> <b>Wyja\u015bnienie:</b> Zosta\u0142a podj\u0119ta pr\u00f3ba u\u017cycia metody przeznaczonej wy\u0142\u0105cznie do u\u017cytku wewn\u0119trznego. \
Ta metoda nie jest cz\u0119\u015bci\u0105 opublikowanego interfejsu API i nie mo\u017ce by\u0107 u\u017cywana. \
<br> <b>Odpowied\u017a u\u017cytkownika:</b> Nie u\u017cywaj tej metody w aplikacji. \
Aby uzyska\u0107 dodatkowe informacje, skontaktuj si\u0119 z serwisem IBM.

JMSMQ1115 = Nie znaleziono komponent\u00f3w.
JMSMQ1115.explanation = Mened\u017cer komponent\u00f3w nie znalaz\u0142 komponent\u00f3w.
JMSMQ1115.useraction = Sprawd\u017a, czy konfiguracja \u015bcie\u017cki klasy i instalacji jest poprawna.
JMSMQ1115.documentation = Nie znaleziono komponent\u00f3w. \
<br> <b>Wyja\u015bnienie:</b> Mened\u017cer komponent\u00f3w nie znalaz\u0142 komponent\u00f3w. \
<br> <b>Odpowied\u017a u\u017cytkownika:</b> Sprawd\u017a, czy konfiguracja \u015bcie\u017cki klasy i instalacji jest poprawna.

JMSMQ1120 = Funkcja czyszczenia nie jest obs\u0142ugiwana w \u017c\u0105danej wersji dostawcy {0}.
JMSMQ1120.explanation = Operacje wykonywane przez funkcj\u0119 czyszczenia nie s\u0105 wymagane przez \u017c\u0105dan\u0105 wersj\u0119 dostawcy.
JMSMQ1120.useraction = Sprawd\u017a, czy podana wersja dostawcy jest poprawna.
JMSMQ1120.inserts = XMSC_WMQ_PROVIDER_VERSION
JMSMQ1120.documentation = Funkcja czyszczenia nie jest obs\u0142ugiwana w \u017c\u0105danej wersji dostawcy. \
<br> <b>Wyja\u015bnienie:</b> Operacje wykonywane przez funkcj\u0119 czyszczenia nie s\u0105 wymagane przez \u017c\u0105dan\u0105 wersj\u0119 dostawcy. <br> <b>Odpowied\u017a u\u017cytkownika:</b> Sprawd\u017a, czy podana wersja dostawcy jest poprawna.

JMSMQ1121 = Obiekt ConnectionMetaData zosta\u0142 utworzony za pomoc\u0105 konstruktora, a nie uzyskany w wyniku nawi\u0105zania po\u0142\u0105czenia.
JMSMQ1121.explanation = Obiekty ConnectionMetaData powinny by\u0107 uzyskiwane w wyniku nawi\u0105zania po\u0142\u0105czenia, a nie tworzone bezpo\u015brednio. \
Zwr\u00f3cone informacje o wersji mog\u0105 by\u0107 niepoprawne.
JMSMQ1121.useraction = Uzyskaj obiekt ConnectionMetaData z po\u0142\u0105czenia lub u\u017cyj funkcji API version, aby uzyska\u0107 statyczne informacje o wersji.

JMSMQ1122 = Podj\u0119to pr\u00f3b\u0119 ustawienia w\u0142a\u015bciwo\u015bci lub \
wykonania zapytania dotycz\u0105cego w\u0142a\u015bciwo\u015bci, kt\u00f3ra jest nieaktualna i nie jest \
ju\u017c obs\u0142ugiwana.
JMSMQ1122.explanation = W\u0142a\u015bciwo\u015b\u0107 nie jest ju\u017c u\u017cywana przez \
klient JMS, wi\u0119c nie nale\u017cy wywo\u0142ywa\u0107 metod s\u0142u\u017c\u0105cych do ustawiania tej \
w\u0142a\u015bciwo\u015bci ani wykonywania zapyta\u0144 dotycz\u0105cych tej w\u0142a\u015bciwo\u015bci.

JMSMQ1123 = Zostanie przyj\u0119ta instalacja klienta, poniewa\u017c nie znaleziono biblioteki JNI 

