#
#  <copyright
#   notice="lm-source-program"
#   pids="5724-H72"
#   years="2008,2017"
#   crc="2248028677" >
#   Licensed Materials - Property of IBM
#                                          
#   5724-H72                           
#                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.
#                                                      
#   US Government Users Restricted Rights - Use, duplication or
#   disclosure restricted by GSA ADP Schedule Contract with
#   IBM Corp.                                           
#   </copyright>   
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
SEVERITY=30
PROGNOTE=rrcE_SSLTC_LOAD_LIBRARY 63H9336 (C) Copyright IBM Corp. 2001 Todos os direitos reservados
MSG=A biblioteca \'&3\' n\u00e3o foi localizada.
XPL=Uma tentativa de carregar dinamicamente a biblioteca \'&3\' falhou porque a biblioteca n\u00e3o foi localizada. No caso da biblioteca &MQ_long, ela s\u00f3 estar\u00e1 dispon\u00edvel nas instala\u00e7\u00f5es do servidor &MQ_long e ser\u00e1 obrigat\u00f3ria quando o comando Transferir Certificados (amqtcert) \u00e9 utilizado para executar uma opera\u00e7\u00e3o do gerenciador de filas. Se for uma biblioteca GSKit, ela deveria ter sido instalada durante a instala\u00e7\u00e3o do &MQ_long.
URESP=N\u00e3o utilize o comando para executar uma opera\u00e7\u00e3o do gerenciador de filas em uma instala\u00e7\u00e3o somente cliente do &MQ_long. Se o comando tiver sido gerado em uma instala\u00e7\u00e3o de servidor do &MQ_long, ou se for uma biblioteca GSKit que est\u00e1 ausente, registre o identificador do problema, salve os arquivos de sa\u00edda gerados e, em seguida, use o site de Suporte do &MQ_short, http//www.ibm.com/software/integration/wmq/support/, ou o IBM Support Assistant (ISA) http//www.ibm.com/software/support/isa/, para verificar se uma solu\u00e7\u00e3o j\u00e1 est\u00e1 dispon\u00edvel. Se n\u00e3o for poss\u00edvel localizar uma correspond\u00eancia, entre em contato com o centro de suporte da IBM. N\u00e3o elimine estes arquivos at\u00e9 o problema ter sido solucionado.
# THIS FILE MUST BE MAINTAINED CONSISTENTLY WITH THE EQUIVALENT '.MSG' FILE IN THE mqdist_nls COMPONENT
