# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR

JMSCS0001 = Les propri\u00e9t\u00e9s du fichier de propri\u00e9t\u00e9s ''{0}'' n''ont pas pu \u00eatre charg\u00e9es en raison d''une exception d''E-S.
JMSCS0001.useraction = V\u00e9rifiez que le fichier de propri\u00e9t\u00e9s existe et qu'il dispose des droits appropri\u00e9s.
JMSCS0002 = L'appel n'a pas pu \u00eatre effectu\u00e9 car CommonServices n'a pas \u00e9t\u00e9 initialis\u00e9.
JMSCS0002.explanation = CommonServices est un composant interne et doit \u00eatre initialis\u00e9 au d\u00e9marrage, mais il a \u00e9chou\u00e9.
JMSCS0002.useraction = V\u00e9rifiez que l'installation et la configuration du chemin d'acc\u00e8s aux classes sont corrects.
JMSCS0003 = Un composant CommonServices est introuvable.
JMSCS0003.explanation = CommonServices est un composant interne et il est introuvable.
JMSCS0003.useraction = V\u00e9rifiez que l'installation et la configuration du chemin d'acc\u00e8s aux classes sont corrects.
JMSCS0004 = Un composant Fournisseur de messagerie est introuvable.
JMSCS0004.explanation = Demande d'utilisation d'un fournisseur de messagerie qui ne se trouve pas dans la configuration actuelle.
JMSCS0004.useraction = V\u00e9rifiez que le fichier JAR contenant le fournisseur de messagerie est pr\u00e9sent dans le chemin d'acc\u00e8s aux classes ou qu'il a \u00e9t\u00e9 enregistr\u00e9.
JMSCS0005 = Un composant n'a pas pu \u00eatre d\u00e9tect\u00e9 par le gestionnaire de composants.
JMSCS0005.explanation = Demande d'utilisation d'un composant qui ne se trouve pas dans la configuration actuelle.
JMSCS0005.useraction = V\u00e9rifiez que le fichier JAR contenant le composant est pr\u00e9sent dans le chemin d'acc\u00e8s aux classes ou qu'il a \u00e9t\u00e9 enregistr\u00e9.
JMSCS0006 = Un incident interne s''est produit. Les informations de diagnostic du service ont \u00e9t\u00e9 enregistr\u00e9es dans ''{0}''. Arr\u00eatez l''application car le produit est dans un \u00e9tat interne incoh\u00e9rent.
JMSCS0006.useraction = Sauvegardez les fichiers de sortie g\u00e9n\u00e9r\u00e9s et utilisez le site de support de WMQ (http://www.ibm.com/software/integration/wmq/support) ou IBM Support Assistant (ISA) (http://www.ibm.com/software/support/isa/) pour v\u00e9rifier si une solution est d\u00e9j\u00e0 disponible.  Si vous n'en trouvez pas, adressez-vous \u00e0 votre service d'assistance IBM.
JMSCS0007 = EXPLICATION :
JMSCS0008 = ACTION :

JMSCS0009 = Les propri\u00e9t\u00e9 syst\u00e8me n'ont pas pu \u00eatre charg\u00e9es en raison d'une exception de contr\u00f4le d'acc\u00e8s.
JMSCS0009.explanation = Le magasin de propri\u00e9t\u00e9s n'a pas pu interroger les propri\u00e9t\u00e9s syst\u00e8me car la r\u00e8gle de s\u00e9curit\u00e9 ne le permet pas.
JMSCS0009.useraction = Modifiez la r\u00e8gle de s\u00e9curit\u00e9 pour que les propri\u00e9t\u00e9s syst\u00e8me puissent \u00eatre lues.

JMSCS0010 = Les services communs du client de messagerie IBM ne sont pas parvenus \u00e0 localiser ou \u00e0 initialiser un composant en raison de l''exception ''{0}''.
JMSCS0010.inserts = XMSC_INSERT_EXCEPTION

JMSCS0011 = Message
JMSCS0012 = Classe
JMSCS0013 = Pile
JMSCS0014 = Provoqu\u00e9 par [{0}] --> Message
JMSCS0015 = Etat de l'objet commun non valide

JMSCS0016 = Echec de l'op\u00e9ration du gestionnaire de commandes.

JMSC0017 = Fichier de configuration CommonServices lu \u00e0 partir de ''{0}''
JMSC0017.inserts = XMSC_CONFIG_FILE_LOCATION

JMSCS0018 = Nom de propri\u00e9t\u00e9 inconnu ''{0}'' fourni
JMSCS0018.inserts = XMSC_PROPERTY_NAME

JMSCS0019 = La propri\u00e9t\u00e9 ''{0}'' a d\u00e9j\u00e0 \u00e9t\u00e9 d\u00e9finie par ''{1}''. Elle ne peut pas \u00eatre mise \u00e0 jour.
JMSCS0019.inserts = XMSC_PROPERTY_NAME,XMSC_PROPERTY_SOURCE

JMSCS0020 = La classe ne peut pas \u00eatre s\u00e9rialis\u00e9e ou d\u00e9s\u00e9rialis\u00e9e car elle n''a pas \u00e9t\u00e9 incluse dans la liste blanche ''{0}''.
JMSCS0020.inserts = XMSC_WHITELIST

JMSCS0021 = Le fichier de liste blanche ''{0}'' ne peut pas \u00eatre ouvert
JMSCS0021.inserts = XMSC_WHITELIST

JMSCS0022 = Le fichier de liste blanche ''{0}'' existe d\u00e9j\u00e0 et ne peut pas \u00eatre remplac\u00e9
JMSCS0022.inserts = XMSC_WHITELIST

JMSCS0023 = La liste blanche ''{0}'' comporte une entr\u00e9e non valide
JMSCS0023.inserts = XMSC_WHITELIST

JMSCS0024 = Le fichier de liste blanche n'a pas pu \u00eatre \u00e9crit

JMSCS0025 = APPLICATION de la liste blanche activ\u00e9e : le fichier de liste blanche ''{0}'' est utilis\u00e9 pour valider des op\u00e9rations de s\u00e9rialisation et de d\u00e9s\u00e9rialisation ObjectMessage. L''arborescence de liste blanche est ''{1}''
JMSCS0025.inserts = XMSC_WHITELIST,XMSC_WHITELIST_CONTENTS

JMSCS0026 = RECONNAISSANCE de la liste blanche activ\u00e9e : le fichier de liste blanche ''{0}'' est utilis\u00e9 pour enregistrer les op\u00e9rations de s\u00e9rialisation et de d\u00e9s\u00e9rialisation ObjectMessage
JMSCS0026.inserts = XMSC_WHITELIST

JMSCS0027 = APPLICATION de la liste blanche activ\u00e9e : le fichier de liste blanche ''{0}'' est utilis\u00e9 pour valider les op\u00e9rations de s\u00e9rialisation et de d\u00e9s\u00e9rialisation ObjectMessage
JMSCS0027.inserts = XMSC_WHITELIST

JMSCS0028 = RECONNAISSANCE de la liste blanche demand\u00e9e, mais le nom de fichier de liste blanche ''{0}'' n''est pas un URI de fichier
JMSCS0028.inserts = XMSC_WHITELIST

JMSCS0029 = Aucune fonctionnalit\u00e9 de liste blanche activ\u00e9e : les propri\u00e9t\u00e9s n'ont pas \u00e9t\u00e9 d\u00e9finies ou les droits de s\u00e9curit\u00e9 emp\u00eachent leur lecture
