# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR

JMSCS0001 = Vlastnosti ze souboru vlastnost\u00ed {0} nelze na\u010d\u00edst v d\u016fsledku v\u00fdjimky IOException.
JMSCS0001.useraction = Zkontrolujte, \u017ee soubor vlastnost\u00ed existuje a m\u00e1 odpov\u00eddaj\u00edc\u00ed opr\u00e1vn\u011bn\u00ed.
JMSCS0002 = Vol\u00e1n\u00ed nelze dokon\u010dit, proto\u017ee komponenta CommonServices nebyla inicializov\u00e1na.
JMSCS0002.explanation = Komponenta CommonServices je intern\u00ed a je t\u0159eba inicializovat ji p\u0159i spu\u0161t\u011bn\u00ed. Do\u0161lo v\u0161ak k jej\u00edmu selh\u00e1n\u00ed.
JMSCS0002.useraction = Ov\u011b\u0159te spr\u00e1vnost instalace a nastaven\u00ed prom\u011bnn\u00e9 CLASSPATH.
JMSCS0003 = Komponenta CommonServices nebyla nalezena.
JMSCS0003.explanation = Komponenta CommonServices je intern\u00ed a nebyla nalezena.
JMSCS0003.useraction = Ov\u011b\u0159te spr\u00e1vnost instalace a nastaven\u00ed prom\u011bnn\u00e9 CLASSPATH.
JMSCS0004 = Komponenta poskytovatele syst\u00e9mu zpr\u00e1v nebyla nalezena.
JMSCS0004.explanation = Byl odesl\u00e1n po\u017eadavek na pou\u017eit\u00ed poskytovatele syst\u00e9mu zpr\u00e1v, kter\u00fd nen\u00ed obsa\u017een v aktu\u00e1ln\u00ed konfiguraci.
JMSCS0004.useraction = Ov\u011b\u0159te, \u017ee je soubor JAR obsahuj\u00edc\u00ed poskytovatele syst\u00e9mu zpr\u00e1v obsa\u017een v prom\u011bnn\u00e9 CLASSPATH nebo \u017ee byl registrov\u00e1n.
JMSCS0005 = Spr\u00e1vci komponent se nepoda\u0159ilo vyhledat komponentu.
JMSCS0005.explanation = Byl odesl\u00e1n po\u017eadavek na pou\u017eit\u00ed komponenty, kter\u00e1 nen\u00ed obsa\u017eena v aktu\u00e1ln\u00ed konfiguraci.
JMSCS0005.useraction = Ov\u011b\u0159te, \u017ee je soubor JAR obsahuj\u00edc\u00ed komponentu obsa\u017een v prom\u011bnn\u00e9 CLASSPATH nebo \u017ee byl registrov\u00e1n.
JMSCS0006 = Do\u0161lo k intern\u00edmu probl\u00e9mu. Diagnostick\u00e9 informace t\u00fdkaj\u00edc\u00ed se slu\u017eby byly zaps\u00e1ny do um\u00edst\u011bn\u00ed {0}. Ukon\u010dete aplikaci, proto\u017ee se produkt nach\u00e1z\u00ed v nekonzistentn\u00edm intern\u00edm stavu.
JMSCS0006.useraction = Ulo\u017ete v\u0161echny vygenerovan\u00e9 v\u00fdstupn\u00ed soubory a prost\u0159ednictv\u00edm webu pro podporu produktu WMQ na adrese http://www.ibm.com/software/integration/wmq/support/ nebo webu produktu ISA (IBM Support Assistant) na adrese http://www.ibm.com/software/support/isa/ zjist\u011bte, zda je ji\u017e \u0159e\u0161en\u00ed k dispozici. Pokud \u017e\u00e1dn\u00e9 vyhovuj\u00edc\u00ed nenajdete, kontaktujte sv\u00e9 centrum podpory IBM.
JMSCS0007 = VYSV\u011aTLEN\u00cd:
JMSCS0008 = AKCE:

JMSCS0009 = Vlastnosti syst\u00e9mu nelze na\u010d\u00edst v d\u016fsledku v\u00fdjimky AccessControlException.
JMSCS0009.explanation = Objekt PropertyStore nem\u016f\u017ee odeslat dotaz na syst\u00e9mov\u00e9 vlastnosti, proto\u017ee to z\u00e1sady zabezpe\u010den\u00ed neumo\u017e\u0148uj\u00ed.
JMSCS0009.useraction = Upravte z\u00e1sady zabezpe\u010den\u00ed tak, aby bylo umo\u017en\u011bno \u010dten\u00ed syst\u00e9mov\u00fdch vlastnost\u00ed.

JMSCS0010 = IBM Messaging Client Common Services nenalezl komponentu nebo ji nemohl inicializovat v d\u016fsledku v\u00fdjimky ''{0}''.
JMSCS0010.inserts = XMSC_INSERT_EXCEPTION

JMSCS0011 = Zpr\u00e1va
JMSCS0012 = T\u0159\u00edda
JMSCS0013 = Z\u00e1sobn\u00edk
JMSCS0014 = Zp\u016fsobil: {0} --> Zpr\u00e1va
JMSCS0015 = Spole\u010dn\u00fd objekt v neplatn\u00e9m stavu

JMSCS0016 = Operace spr\u00e1vce p\u0159\u00edkaz\u016f se nezda\u0159ila.

JMSC0017 = Konfigura\u010dn\u00ed soubor CommonServices na\u010d\u00edtan\u00fd z ''{0}''
JMSC0017.inserts = XMSC_CONFIG_FILE_LOCATION

JMSCS0018 = Byl dod\u00e1n nezn\u00e1m\u00fd n\u00e1zev vlastnosti ''{0}''
JMSCS0018.inserts = XMSC_PROPERTY_NAME

JMSCS0019 = Vlastnost ''{0}'' ji\u017e byla nastavena ''{1}''. Nelze ji aktualizovat.
JMSCS0019.inserts = XMSC_PROPERTY_NAME,XMSC_PROPERTY_SOURCE

JMSCS0020 = T\u0159\u00edda nesm\u00ed b\u00fdt serializov\u00e1na nebo deserializov\u00e1na, proto\u017ee nebyla zahrnuta do b\u00edl\u00e9ho seznamu ''{0}''.
JMSCS0020.inserts = XMSC_WHITELIST

JMSCS0021 = Soubor b\u00edl\u00e9ho seznamu ''{0}'' nelze otev\u0159\u00edt
JMSCS0021.inserts = XMSC_WHITELIST

JMSCS0022 = Soubor b\u00edl\u00e9ho seznamu ''{0}'' ji\u017e existuje a nesm\u00ed b\u00fdt p\u0159eps\u00e1n
JMSCS0022.inserts = XMSC_WHITELIST

JMSCS0023 = B\u00edl\u00fd seznam ''{0}'' m\u00e1 neplatnou polo\u017eku
JMSCS0023.inserts = XMSC_WHITELIST

JMSCS0024 = Soubor b\u00edl\u00e9ho seznamu nelze zapsat

JMSCS0025 = Vynucen\u00ed (ENFORCEMENT) b\u00edl\u00e9ho seznamu je povoleno - Soubor b\u00edl\u00e9ho seznamu ''{0}'' slou\u017e\u00ed k ov\u011b\u0159en\u00ed operac\u00ed ObjectMessage pro serializaci a deserializaci - strom b\u00edl\u00fdch seznam\u016f je ''{1}''
JMSCS0025.inserts = XMSC_WHITELIST,XMSC_WHITELIST_CONTENTS

JMSCS0026 = Zji\u0161\u0165ov\u00e1n\u00ed (DISCOVERY) b\u00edl\u00e9ho seznamu je povoleno - Soubor b\u00edl\u00e9ho seznamu ''{0}'' slou\u017e\u00ed k z\u00e1znamu operac\u00ed ObjectMessage pro serializaci a deserializaci
JMSCS0026.inserts = XMSC_WHITELIST

JMSCS0027 = Vynucen\u00ed (ENFORCEMENT) b\u00edl\u00e9ho seznamu je povoleno - Soubor b\u00edl\u00e9ho seznamu ''{0}'' slou\u017e\u00ed k ov\u011b\u0159en\u00ed operac\u00ed ObjectMessage pro serializaci a deserializaci
JMSCS0027.inserts = XMSC_WHITELIST

JMSCS0028 = Zji\u0161\u0165ov\u00e1n\u00ed (DISCOVERY) b\u00edl\u00e9ho seznamu je po\u017eadov\u00e1no, ale n\u00e1zev souboru b\u00edl\u00e9ho seznamu ''{0}'' nen\u00ed identifik\u00e1torem URI souboru
JMSCS0028.inserts = XMSC_WHITELIST

JMSCS0029 = Nen\u00ed povolena \u017e\u00e1dn\u00e1 funk\u010dnost b\u00edl\u00e9ho seznamu - bu\u010f nebyly nastaveny vlastnosti, nebo opr\u00e1vn\u011bn\u00ed zabezpe\u010den\u00ed zabr\u00e1nilo ve \u010dten\u00ed
