#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR

JMSADM1003 = Licenc hat\u00e1lya al\u00e1 es\u0151 anyagok - Az IBM tulajdona\n5724-H72, 5655-R36, 5724-L26, 5655-L82\n(c) Copyright IBM Corp. 2008, 2016 All Rights Reserved.\nAz Egyes\u00fclt \u00c1llamok korm\u00e1nyzati felhaszn\u00e1l\u00f3inak korl\u00e1tozott jogai - \nA haszn\u00e1latot, m\u00e1sol\u00e1st \u00e9s terjeszt\u00e9st az IBM-mel k\u00f6t\u00f6tt GSA ADP \n\u00fctemszerz\u0151d\u00e9s korl\u00e1tozza.
JMSADM1016 = Bels\u0151 hiba t\u00f6rt\u00e9nt. R\u00e9szletek: ''{0}''. Tov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt n\u00e9zze meg a hivatkozott IBM MQ kiv\u00e9tel ok- \u00e9s befejez\u00e9si k\u00f3dot.
JMSADM1016.useraction = Mentse el az el\u0151\u00e1ll\u00edtott kimeneti f\u00e1jlokat, \u00e9s vagy a WMQ term\u00e9kt\u00e1mogat\u00e1si webhely: http://www.ibm.com/software/integration/wmq/support/, vagy az IBM t\u00e1mogat\u00e1si seg\u00e9dlet (ISA): http://www.ibm.com/software/support/isa/ haszn\u00e1lat\u00e1val j\u00e1rjon ut\u00e1na, hogy van-e m\u00e1r rendelkez\u00e9sre \u00e1ll\u00f3 megold\u00e1s.  Ha nem tal\u00e1l ilyet, akkor l\u00e9pjen kapcsolatba az IBM term\u00e9kt\u00e1mogat\u00e1si k\u00f6zponttal.
JMSADM1059 = V\u00e9gzetes hiba - UTF-8 nem t\u00e1mogatott. 
JMSADM1059.explanation = A haszn\u00e1lt Java(tm) fut\u00e1si k\u00f6rnyezet nem t\u00e1mogatja az UTF-8 karakterk\u00f3dol\u00e1st. Az IBM MQ JMS oszt\u00e1lyok megk\u00f6vetelik ennek a k\u00f3dol\u00e1snak a t\u00e1mogat\u00e1s\u00e1t bizonyos m\u0171veletek v\u00e9grehajt\u00e1s\u00e1hoz. 
JMSADM1059.useraction = Az UTF-8 karakterk\u00f3dol\u00e1s t\u00e1mogat\u00e1s\u00e1nak beszerz\u00e9s\u00e9vel kapcsolatos inform\u00e1ci\u00f3kat a Java(tm) fut\u00e1si k\u00f6rnyezet dokument\u00e1ci\u00f3ja \u00e9s/vagy szolg\u00e1ltat\u00f3ja biztos\u00edt.
JMSADM4000 = Java(tm) \u00fczenetszolg\u00e1ltat\u00e1s adminisztr\u00e1ci\u00f3 IBM MQ oszt\u00e1lyainak ind\u00edt\u00e1sa
JMSADM4001 = Java(tm) \u00fczenetszolg\u00e1ltat\u00e1s adminisztr\u00e1ci\u00f3 IBM MQ oszt\u00e1lyainak le\u00e1ll\u00edt\u00e1sa
JMSADM4002 = JNDI kontextus inicializ\u00e1l\u00e1sa...
JMSADM4003 = K\u00e9sz.
JMSADM4007 = InitCtx
JMSADM4008 = Hiba
JMSADM4009 = A kontextus nem \u00fcres
JMSADM4053 = Sz\u00e1ll\u00edt\u00e1si t\u00edpus
JMSADM4085 = \u00dcdv\u00f6zli az IBM MQ JMS adminisztr\u00e1ci\u00f3s eszk\u00f6z parancssori fel\u00fclete
JMSADM4086 = Hiba a parancs beolvas\u00e1sa k\u00f6zben
JMSADM4087 = Ismeretlen parancs
JMSADM4089 = ''{0}'' tartalma
JMSADM4094 = INITIAL_CONTEXT_FACTORY
JMSADM4095 = PROVIDER_URL
JMSADM4096 = A k\u00f6t\u00e9s nem adminisztr\u00e1lhat\u00f3 vagy nem tal\u00e1lhat\u00f3
JMSADM4097 = A kontextus nem tal\u00e1lhat\u00f3
JMSADM4098 = Objektum(ok)
JMSADM4099 = Kontextus(ok)
JMSADM4100 = K\u00f6t\u00e9s(ek)
JMSADM4101 = Adminisztr\u00e1lt
JMSADM4104 = Az objektum inakt\u00edv, \u00edgy nem v\u00e9gezhet\u0151k k\u00f6nyvt\u00e1rm\u0171veletek
JMSADM4105 = Hi\u00e1nyz\u00f3 konfigur\u00e1ci\u00f3s tulajdons\u00e1gok
JMSADM4106 = Az objektum nem IBM MQ JMS oszt\u00e1lyok \u00e1ltal fel\u00fcgyelt objektum
JMSADM4110 = A JNDI inicializ\u00e1l\u00e1s meghi\u00fasult, ellen\u0151rizze a JNDI be\u00e1ll\u00edt\u00e1sokat \u00e9s szolg\u00e1ltat\u00e1st.
JMSADM4111 = Nem hozhat\u00f3 l\u00e9tre kontextus
JMSADM4112 = Nem hozhat\u00f3 l\u00e9tre \u00e9rv\u00e9nyes objektum, ellen\u0151rizze a megadott param\u00e9tereket
JMSADM4113 = Az objektum nem k\u00f6thet\u0151
JMSADM4115 = Helytelen n\u00e9v lett megadva
JMSADM4116 = A probl\u00e9ma ok\u00e1val kapcsolatos tov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt futtassa a -v param\u00e9terrel
JMSADM4117 = A(z) ''{0}'' n\u00e9v nem oldhat\u00f3 fel
JMSADM4120 = Szintaktikai hiba
JMSADM4121 = A konfigur\u00e1ci\u00f3s f\u00e1jl nem nyithat\u00f3 meg
JMSADM4122 = A MOVE nem v\u00e9gezhet\u0151 el; helyette COPY t\u00f6rt\u00e9nt
JMSADM4123 = Lexikai hiba
JMSADM4124 = A(z) ''{0}'' tulajdons\u00e1g\u00e9rt\u00e9k null
JMSADM4125 = Helytelen tulajdons\u00e1g egy ''{0}'' sz\u00e1m\u00e1ra: ''{1}''
JMSADM4127 = Helytelen tulajdons\u00e1g ebben a kontextusban
JMSADM4128 = Helytelen \u00e9rt\u00e9k a(z) ''{0}'' tulajdons\u00e1gnak: ''{1}''
JMSADM4129 = Ismeretlen tulajdons\u00e1g: ''{0}''
JMSADM4130 = A kontextus nem tal\u00e1lhat\u00f3 vagy nem t\u00e1vol\u00edthat\u00f3 el
JMSADM4131 = A v\u00e1rt \u00e9s a t\u00e9nyleges objektumt\u00edpus nem egyezik
JMSADM4132 = \u00dcgyf\u00e9lk\u00f6t\u00e9s-attrib\u00fatumok \u00fctk\u00f6znek
JMSADM4133 = EXit karaktersorozat n\u00e9lk\u00fcl megadott ExitInit karaktersorozat
JMSADM4134 = Felhaszn\u00e1l\u00f3i megk\u00fcl\u00f6nb\u00f6ztetett n\u00e9v
JMSADM4135 = Felhaszn\u00e1l\u00f3i jelsz\u00f3
JMSADM4137 = Nem hozhat\u00f3 l\u00e9tre egy WebSphere Application Server alkalmaz\u00e1skiszolg\u00e1l\u00f3ra jellemz\u0151 oszt\u00e1ly. Elk\u00e9pzelhet\u0151, hogy az oszt\u00e1lyok nem lettek telep\u00edtve, illetve felv\u00e9ve az oszt\u00e1ly\u00fatvonalra.
JMSADM4139 = Helytelen hiteles\u00edt\u00e9si t\u00edpus lett megadva - 'nincs' ker\u00fcl felhaszn\u00e1l\u00e1sra
JMSADM4140 = FIGYELMEZTET\u00c9S: ''{0}'' CipherSpec \u00e1talak\u00edt\u00e1sa erre: ''{1}'' CipherSuite
JMSADM4142 = Az INITIAL_CONTEXT_FACTORY \u00e1ltal megadott oszt\u00e1ly nem tal\u00e1lhat\u00f3 az oszt\u00e1ly\u00fatvonalon
JMSADM5003 = Ismeretlen kapcsol\u00f3 figyelmen k\u00edv\u00fcl hagy\u00e1sa
