# ===========================================================================
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# ===========================================================================
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
# %Z% %W% %I% %E% %U%

# ---------------------------------------------------------------------------------
#
# Component JMS Standard Exceptions Message Identifiers
# Group prefix '0'
#
# ---------------------------------------------------------------------------------
MQJMS0000 = \u30e1\u30bd\u30c3\u30c9 ''{0}'' \u304c\u547c\u3073\u51fa\u3055\u308c\u307e\u3057\u305f\u304c\u3001\u8981\u6c42\u3055\u308c\u305f\u64cd\u4f5c\u304c\u305d\u306e\u6642\u671f\u3067\u306f\u4e0d\u5f53\u3001\u4e0d\u9069\u5207\u3001\u307e\u305f\u306f\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306e\u72b6\u6cc1\u304c\u9069\u5207\u3067\u3042\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
MQJMS0000.inserts = XMSC_INSERT_NAME

MQJMS0002 = IBM MQ \u30af\u30e9\u30b9 (JMS \u7528) \u304c\u7121\u52b9\u306a\u63a5\u7d9a\u306e\u30af\u30e9\u30a4\u30a2\u30f3\u30c8 ID \u3092\u8a2d\u5b9a\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002
MQJMS0003 = \u5b9b\u5148\u304c\u4e0d\u660e\u307e\u305f\u306f\u7121\u52b9\u3067\u3059\u3002
MQJMS0004 = IBM MQ \u30af\u30e9\u30b9 (JMS \u7528) \u304c JMS Provider \u306b\u7121\u52b9\u306a\u69cb\u6587\u3067\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30bb\u30ec\u30af\u30bf\u30fc\u3092\u4e0e\u3048\u307e\u3057\u305f\u3002
MQJMS0005 = StreamMessage \u307e\u305f\u306f BytesMessage \u306e\u8aad\u307f\u53d6\u308a\u4e2d\u306b\u4e88\u671f\u305b\u305a\u30b9\u30c8\u30ea\u30fc\u30e0\u306e\u7d42\u308f\u308a\u306b\u9054\u3057\u307e\u3057\u305f\u3002
MQJMS0006 = IBM MQ \u30af\u30e9\u30b9 (JMS \u7528) \u304c\u30e1\u30c3\u30bb\u30fc\u30b8\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u30c7\u30fc\u30bf\u30fb\u30bf\u30a4\u30d7\u3092\u4f7f\u7528\u3057\u3088\u3046\u3068\u3057\u305f\u304b\u3001\u307e\u305f\u306f\u9593\u9055\u3063\u305f\u30bf\u30a4\u30d7\u306e\u30c7\u30fc\u30bf\u3092\u8aad\u307f\u53d6\u308d\u3046\u3068\u3057\u307e\u3057\u305f\u3002
MQJMS0007 = IBM MQ \u30af\u30e9\u30b9 (JMS \u7528) \u304c\u66f8\u304d\u8fbc\u307f\u5c02\u7528\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u8aad\u307f\u53d6\u308d\u3046\u3068\u3057\u307e\u3057\u305f\u3002
MQJMS0008 = IBM MQ \u30af\u30e9\u30b9 (JMS \u7528) \u304c\u8aad\u307f\u53d6\u308a\u5c02\u7528\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u66f8\u304d\u8fbc\u3082\u3046\u3068\u3057\u307e\u3057\u305f\u3002
MQJMS0009 = IBM MQ \u30af\u30e9\u30b9 (JMS \u7528) \u304c\u30e1\u30bd\u30c3\u30c9\u306b\u5fc5\u8981\u306a\u30ea\u30bd\u30fc\u30b9\u3092\u5272\u308a\u632f\u308c\u307e\u305b\u3093\u3002
MQJMS0010 = \u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u304c\u9032\u884c\u4e2d\u306e\u305f\u3081\u64cd\u4f5c\u304c\u7121\u52b9\u3067\u3059\u3002
MQJMS0011 = Session.commit \u306e\u547c\u3073\u51fa\u3057\u306b\u3088\u308a\u73fe\u884c\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u304c\u30ed\u30fc\u30eb\u30d0\u30c3\u30af\u3055\u308c\u307e\u3057\u305f\u3002
MQJMS0012 = URI \u304c\u6b63\u3057\u3044\u5f62\u5f0f queue://qmgrName/queueName [name-value pairs] \u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002

# ---------------------------------------------------------------------------------
#
# Component Common - group prefix '1'
#
# ---------------------------------------------------------------------------------

MQJMS1000 = JMS \u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u4f5c\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJMS1001 = \u4e0d\u660e\u306a\u5fdc\u7b54\u30e2\u30fc\u30c9 ''{0}''\u3002
MQJMS1004 = \u63a5\u7d9a\u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f\u3002
MQJMS1005 = ''{0}'' \u304b\u3089 ''{1}'' \u306e\u72b6\u614b\u9077\u79fb\u304c\u51e6\u7406\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJMS1006 = ''{0}'' \u306e\u5024\u304c\u7121\u52b9\u3067\u3059: ''{1}''\u3002
MQJMS1006.inserts = XMSC_INSERT_NAME, XMSC_INSERT_VALUE

MQJMS1007 = \u51fa\u53e3\u30af\u30e9\u30b9 ''{0}'' \u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u4f5c\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJMS1008 = transportType \u306e\u4e0d\u660e\u306a\u5024: ''{0}''\u3002
MQJMS1009 = \u30b9\u30c8\u30ea\u30f3\u30b0\u5f15\u6570\u3092\u6301\u3064\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u30fc\u304c\u3042\u308a\u307e\u305b\u3093\u3002
MQJMS1010 = \u5b9f\u88c5\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJMS1011 = MQ \u30d0\u30a4\u30f3\u30c9\u306e\u4f7f\u7528\u6642\u306b\u306f\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u8a3c\u660e\u66f8\u3092\u6307\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002
MQJMS1012 = \u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30ea\u30b9\u30ca\u30fc\u304c\u3042\u308a\u307e\u305b\u3093\u3002
MQJMS1013 = \u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u975e\u540c\u671f\u9001\u9054\u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u9593\u306f\u64cd\u4f5c\u306f\u7121\u52b9\u3067\u3059\u3002
MQJMS1014 = \u8a8d\u8b58\u3055\u308c\u305f\u30d7\u30ed\u30c7\u30e5\u30fc\u30b5\u30fc\u306b\u3064\u3044\u3066\u64cd\u4f5c\u304c\u7121\u52b9\u3067\u3059\u3002
MQJMS1015 = \u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306e\u4e0d\u660e\u306a\u5024: ''{0}''\u3002
MQJMS1016 = \u5185\u90e8\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002 \u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u8a73\u7d30: ''{0}''\u3002
MQJMS1017 = \u975e\u30ed\u30fc\u30ab\u30eb MQ \u30ad\u30e5\u30fc\u306f\u53d7\u4fe1\u307e\u305f\u306f\u53c2\u7167\u3067\u306f\u7121\u52b9\u3067\u3059\u3002
MQJMS1018 = \u6709\u52b9\u306a\u63a5\u7d9a\u304c\u4f7f\u7528\u53ef\u80fd\u306b\u306a\u3063\u3066\u3044\u307e\u305b\u3093\u3002
MQJMS1019 = \u975e\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u5316\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u64cd\u4f5c\u304c\u7121\u52b9\u3067\u3059\u3002
MQJMS1020 = \u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u5316\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u64cd\u4f5c\u304c\u7121\u52b9\u3067\u3059\u3002
MQJMS1021 = \u56de\u5fa9\u304c\u5931\u6557\u3057\u307e\u3057\u305f: \u7121\u5fdc\u7b54\u30e1\u30c3\u30bb\u30fc\u30b8\u306f\u518d\u9001\u9054\u3055\u308c\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
MQJMS1022 = \u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJMS1023 = \u30ed\u30fc\u30eb\u30d0\u30c3\u30af\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJMS1024 = \u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f\u3002
MQJMS1025 = \u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u53c2\u7167\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJMS1026 = ExceptionListener \u304c\u4f8b\u5916\u306b\u306a\u308a\u307e\u3057\u305f: ''{0}''\u3002
MQJMS1027 = ''{0}'' \u304b\u3089\u306e\u5b9b\u5148\u306e\u518d\u8a2d\u5b9a\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJMS1028 = \u30a8\u30ec\u30e1\u30f3\u30c8\u540d\u304c\u30cc\u30eb\u3067\u3059\u3002
MQJMS1029 = \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u540d\u304c\u30cc\u30eb\u3067\u3059\u3002
MQJMS1030 = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u3088\u3063\u3066\u63d0\u4f9b\u3055\u308c\u305f\u30d0\u30c3\u30d5\u30a1\u30fc\u304c\u5c0f\u3055\u3059\u304e\u307e\u3059\u3002
MQJMS1031 = \u5185\u90e8\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002 \u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MQJMS1032 = close() \u304c ''{0}'' \u306e\u305f\u3081\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJMS1033 = start() \u304c ''{0}'' \u306e\u305f\u3081\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJMS1034 = MessageListener \u304c ''{0}'' \u3092\u30b9\u30ed\u30fc\u3057\u307e\u3057\u305f\u3002
MQJMS1042 = \u7121\u52b9\u306a\u9001\u9054\u30e2\u30fc\u30c9\u3002
MQJMS1044 = \u30b9\u30c8\u30ea\u30f3\u30b0\u306f\u6709\u52b9\u306a 16 \u9032\u6570\u3067\u306f\u3042\u308a\u307e\u305b\u3093 - ''{0}''\u3002
MQJMS1045 = \u6570\u5024\u306f\u3001\u500d\u7cbe\u5ea6 S/390 \u6d6e\u52d5 ''{0}'' \u306e\u7bc4\u56f2\u306b\u3042\u308a\u307e\u305b\u3093\u3002
MQJMS1046 = \u6587\u5b57\u30bb\u30c3\u30c8 ''{0}'' \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJMS1047 = \u30de\u30c3\u30d7\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u5f62\u5f0f\u304c\u4e0d\u6b63\u3067\u3059\u3002
MQJMS1048 = \u30b9\u30c8\u30ea\u30fc\u30e0\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u5f62\u5f0f\u304c\u4e0d\u6b63\u3067\u3059\u3002
MQJMS1049 = IBM MQ \u30af\u30e9\u30b9 (JMS \u7528) \u304c\u3001\u30d0\u30a4\u30c8\u914d\u5217\u3092\u30b9\u30c8\u30ea\u30f3\u30b0\u306b\u5909\u63db\u3057\u3088\u3046\u3068\u8a66\u307f\u307e\u3057\u305f\u3002
MQJMS1050 = MQRFH2 \u30d8\u30c3\u30c0\u30fc\u306e\u5f62\u5f0f\u304c\u4e0d\u6b63\u3067\u3059\u3002
MQJMS1051 = JMS \u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30af\u30e9\u30b9\u3002
MQJMS1052 = \u8a8d\u8b58\u3067\u304d\u306a\u3044 JMS \u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30af\u30e9\u30b9\u3002
MQJMS1053 = \u7121\u52b9\u306a UTF-16 \u30b5\u30ed\u30b2\u30fc\u30c8\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f ''{0}''\u3002
MQJMS1054 = \u7121\u52b9\u306a XML \u30a8\u30b9\u30b1\u30fc\u30d7\u30fb\u30b7\u30fc\u30b1\u30f3\u30b9\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f ''{0}''\u3002
MQJMS1055 = \u30e1\u30c3\u30bb\u30fc\u30b8\u5185\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u307e\u305f\u306f\u30a8\u30ec\u30e1\u30f3\u30c8\u306b\u975e\u4e92\u63db\u306e\u30c7\u30fc\u30bf\u30fb\u30bf\u30a4\u30d7 ''{0}''\u3002
MQJMS1056 = \u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u307e\u305f\u306f\u30a8\u30ec\u30e1\u30f3\u30c8\u306e\u30c7\u30fc\u30bf\u30fb\u30bf\u30a4\u30d7 ''{0}''\u3002
MQJMS1057 = \u30e1\u30c3\u30bb\u30fc\u30b8\u306b\u306f\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u95a2\u9023\u4ed8\u3051\u3089\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJMS1058 = \u7121\u52b9\u306a\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u540d: ''{0}''\u3002
MQJMS1059 = \u81f4\u547d\u7684\u30a8\u30e9\u30fc - UTF8 \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJMS1060 = \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u76f4\u5217\u5316\u3067\u304d\u307e\u305b\u3093\u3002
MQJMS1061 = \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u975e\u76f4\u5217\u5316\u3067\u304d\u307e\u305b\u3093\u3002
MQJMS1062 = \u30e1\u30c3\u30bb\u30fc\u30b8\u672c\u6587\u3092\u8aad\u307f\u53d6\u3063\u3066\u3044\u308b\u3068\u304d\u306b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f: ''{0}''\u3002
MQJMS1063 = ''{0}'' \u6587\u5b57\u304c\u7701\u7565\u3055\u308c\u307e\u3057\u305f\u3002
MQJMS1064 = \u6574\u6570\u30a8\u30f3\u30b3\u30fc\u30c9: ''{0}''= \u6d6e\u52d5\u5c0f\u6570\u70b9\u30a8\u30f3\u30b3\u30fc\u30c9 ''{1}''\u3002
MQJMS1065 = \u30e1\u30c3\u30bb\u30fc\u30b8\u672c\u6587\u3092\u66f8\u304d\u8fbc\u3093\u3067\u3044\u308b\u3068\u304d\u306b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
MQJMS1066 = \u7121\u52b9\u306a\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30a8\u30ec\u30e1\u30f3\u30c8\u540d: ''{0}''\u3002
MQJMS1067 = MQ \u3067\u306f\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u306f\u7121\u52b9\u3067\u3059\u3002
MQJMS1068 = XAResource \u306e\u53d6\u5f97\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJMS1069 = XASession \u3067\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJMS1072 = \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u540d\u3092\u7167\u4f1a\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
MQJMS1073 = \u6307\u5b9a\u3055\u308c\u305f MQ \u30ad\u30e5\u30fc\u306f QLOCAL \u3067\u3082 QALIAS \u3067\u3082\u3042\u308a\u307e\u305b\u3093\u3002
MQJMS1074 = \u30cc\u30eb\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u51e6\u7406\u3067\u304d\u307e\u305b\u3093\u3002
MQJMS1075 = \u9001\u9054\u4e0d\u80fd\u30d8\u30c3\u30c0\u30fc\u306e\u66f8\u304d\u8fbc\u307f\u30a8\u30e9\u30fc\u3002
MQJMS1076 = \u9001\u9054\u4e0d\u80fd\u30d8\u30c3\u30c0\u30fc\u306e\u8aad\u307f\u53d6\u308a\u30a8\u30e9\u30fc\u3002
MQJMS1077 = \u63a5\u7d9a/\u5b9b\u5148\u306e\u4e0d\u4e00\u81f4\u3002
MQJMS1078 = \u7121\u52b9\u306a\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3002
MQJMS1079 = \u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u9001\u9054\u4e0d\u80fd\u30ad\u30e5\u30fc\u306b\u66f8\u304d\u8fbc\u3081\u307e\u305b\u3093\u3002
MQJMS1080 = \u300c\u30d0\u30c3\u30af\u30a2\u30a6\u30c8-\u518d\u30ad\u30e5\u30fc\u300d\u30ad\u30e5\u30fc\u304c\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJMS1081 = \u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u30ea\u30ad\u30e5\u30fc\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJMS1082 = \u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u5ec3\u68c4\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJMS1085 = RFH \u306e\u66f8\u304d\u8fbc\u307f\u30a8\u30e9\u30fc\u3002
MQJMS1086 = RFH \u306e\u8aad\u307f\u53d6\u308a\u30a8\u30e9\u30fc\u3002
MQJMS1087 = \u8a8d\u8b58\u3067\u304d\u306a\u3044\u3001\u307e\u305f\u306f\u7121\u52b9\u306a RFH \u5185\u5bb9\u3002
MQJMS1088 = \u6df7\u5408\u30c9\u30e1\u30a4\u30f3\u306e\u30b3\u30f3\u30b7\u30e5\u30fc\u30de\u30fc\u304c\u540c\u3058\u5165\u529b\u3092\u64cd\u4f5c\u3059\u308b\u306e\u306f\u7981\u6b62\u3055\u308c\u3066\u3044\u307e\u3059\u3002
MQJMS1089 = \u30e1\u30c3\u30bb\u30fc\u30b8\u672c\u6587\u3092\u8aad\u307f\u53d6\u3063\u3066\u3044\u308b\u3068\u304d\u306b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f: ''{0}''\u3002
MQJMS1091 = \u8b58\u5225\u3055\u308c\u3066\u3044\u306a\u3044\u30d7\u30ed\u30c7\u30e5\u30fc\u30b5\u30fc\u306b\u5bfe\u3059\u308b\u64cd\u4f5c\u304c\u7121\u52b9\u3067\u3059\u3002
MQJMS1093 = \u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u30fc\u306b\u30cc\u30eb\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u304c\u6e21\u3055\u308c\u307e\u3057\u305f: ''{0}''\u3002
MQJMS1094 = quantityHint \u304c\u7121\u52b9\u3067\u3059\u3002
MQJMS1096 = MessageReference \u304c\u7121\u52b9\u3067\u3059\u3002
MQJMS1098 = MessageReference \u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u304c\u7121\u52b9\u3067\u3059\u3002
MQJMS1099 = MQQueueAgentThread \u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u304c\u7121\u52b9\u3067\u3059\u3002

# ---------------------------------------------------------------------------------
#
# Component Common - group prefix '1' - multicast exceptions
#
# ---------------------------------------------------------------------------------

MQJMS1102 = \u30de\u30eb\u30c1\u30ad\u30e3\u30b9\u30c8\u63a5\u7d9a\u304c\u78ba\u7acb\u3067\u304d\u307e\u305b\u3093\u3002
MQJMS1103 = \u4fe1\u983c\u6027\u306e\u9ad8\u3044\u30de\u30eb\u30c1\u30ad\u30e3\u30b9\u30c8\u30fb\u30e2\u30fc\u30c9\u3067 ''{0}'' \u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u5931\u3044\u307e\u3057\u305f\u3002
MQJMS1104 = \u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u306b\u3088\u308a\u30de\u30eb\u30c1\u30ad\u30e3\u30b9\u30c8\u63a5\u7d9a\u304c\u5207\u65ad\u3055\u308c\u307e\u3057\u305f\u3002
MQJMS1105 = disthub \u30de\u30eb\u30c1\u30ad\u30e3\u30b9\u30c8\u7528\u306e\u7279\u5b9a\u30ed\u30fc\u30ab\u30eb\u30fb\u30dd\u30fc\u30c8\u306b\u63a5\u7d9a\u3067\u304d\u307e\u305b\u3093\u3002
MQJMS1106 = PGM/IP \u306b\u5fc5\u8981\u306a\u30cd\u30a4\u30c6\u30a3\u30d6\u30fb\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc\u3092\u30ed\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093\u3002
MQJMS1107 = \u63a5\u7d9a\u306e\u554f\u984c\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002

# ---------------------------------------------------------------------------------
#
# Component Common - group prefix '1' - JMS1.1 additional messages
#
# ---------------------------------------------------------------------------------

MQJMS1110 = JMS1.1 \u64cd\u4f5c\u306f\u3053\u306e\u30bf\u30a4\u30d7\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJMS1111 = JMS1.1 \u5fc5\u8981\u306a\u30ad\u30e5\u30fc\u307e\u305f\u306f\u30d1\u30d6\u30ea\u30c3\u30b7\u30e5/\u30b5\u30d6\u30b9\u30af\u30e9\u30a4\u30d6\u30fb\u30b5\u30fc\u30d3\u30b9\u304c\u30bb\u30c3\u30c8\u30a2\u30c3\u30d7\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJMS1112 = JMS1.1 \u30c9\u30e1\u30a4\u30f3\u7279\u5b9a\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u306f\u7121\u52b9\u306a\u64cd\u4f5c\u3067\u3059\u3002
MQJMS1113 = JMS1.1 \u30af\u30ed\u30b9\u30c9\u30e1\u30a4\u30f3\u30fb\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u306f\u7121\u52b9\u306a\u64cd\u4f5c\u3067\u3059\u3002

MQJMS1115 = \u5225\u540d\u30ad\u30e5\u30fc ''{1}'' \u306e\u57fa\u672c\u7167\u4f1a ''{0}'' \u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u554f\u3044\u5408\u308f\u305b\u304c\u5931\u6557\u3057\u305f\u305f\u3081\u3001\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30d0\u30c3\u30af\u30a2\u30a6\u30c8\u3057\u304d\u3044\u5024 ''{2}'' \u304c\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002 \u5b8c\u4e86\u30b3\u30fc\u30c9 ''{3}''\u3001\u7406\u7531\u30b3\u30fc\u30c9 ''{4}''\u3002
MQJMS1115.explanation = \u51e6\u7406\u4e2d\u306e\u30ad\u30e5\u30fc\u306f\u5225\u540d\u30ad\u30e5\u30fc\u3067\u3042\u308a\u3001\u57fa\u672c\u30ad\u30e5\u30fc\u306e backoutQueue \u304a\u3088\u3073 backoutThreshold \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u554f\u3044\u5408\u308f\u305b\u4e2d\u306b\u969c\u5bb3\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
MQJMS1115.useraction = \u5b8c\u4e86\u30b3\u30fc\u30c9\u3068\u7406\u7531\u30b3\u30fc\u30c9\u3092\u8abf\u3079\u3066\u3001\u539f\u56e0\u3092\u7279\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u7406\u7531\u30b3\u30fc\u30c9\u304c\u3001\u5fc5\u8981\u3068\u3055\u308c\u308b\u6a29\u9650\u3068\u95a2\u4fc2\u3057\u3066\u3044\u308b\u5834\u5408\u3001\u63a5\u7d9a\u3055\u308c\u3066\u3044\u308b\u30e6\u30fc\u30b6\u30fc\u306b\u3001\u5225\u540d\u30ad\u30e5\u30fc\u3067\u53c2\u7167\u3055\u308c\u3066\u3044\u308b\u57fa\u672c\u30ad\u30e5\u30fc\u306b\u5bfe\u3059\u308b\u7167\u4f1a\u6a29\u9650\u304c\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u57fa\u672c\u30ad\u30e5\u30fc\u306b\u5bfe\u3059\u308b\u7167\u4f1a\u3092\u505c\u6b62\u3057\u3001\u524d\u8ff0\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30d0\u30c3\u30af\u30a2\u30a6\u30c8\u3057\u304d\u3044\u5024\u3092\u4f7f\u7528\u3057\u3066\u3001\u3053\u306e\u3057\u304d\u3044\u5024\u306b\u9054\u3057\u305f\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u9001\u9054\u4e0d\u80fd\u30ad\u30e5\u30fc\u306b\u30ea\u30ad\u30e5\u30fc\u3059\u308b\u306b\u306f\u3001JVM property com.ibm.mq.jms.useDefaultBOValues=true \u3068\u8a2d\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MQJMS1115.inserts = XMSC_INSERT_DESTINATION_NAME\u3001XMSC_INSERT_STRING\u3001XMSC_INSERT_VALUE\u3001XMSC_INSERT_COMP_CODE\u3001XMSC_INSERT_REASON

MQJMS1116 = \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc ''{2}'' \u306e\u30ad\u30e5\u30fc ''{1}'' \u3067\u691c\u51fa\u3055\u308c\u305f\u30e1\u30c3\u30bb\u30fc\u30b8 ''{0}'' \u306f\u3001MQRFH2 \u30d8\u30c3\u30c0\u30fc\u304c\u7121\u52b9\u3067\u3042\u308b\u305f\u3081\u306b\u51e6\u7406\u3067\u304d\u305a\u3001\u9001\u9054\u4e0d\u80fd\u30ad\u30e5\u30fc ''{3}'' \u306b\u79fb\u52d5\u3055\u308c\u307e\u3057\u305f\u3002
MQJMS1116.explanation = IBM MQ \u30e1\u30c3\u30bb\u30fc\u30b8\u30f3\u30b0\u30fb\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306e\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u30fb\u30e2\u30fc\u30c9\u3067\u5b9f\u884c\u4e2d\u306b\u3001ConnectionConsumer\u3001\u6d3b\u52d5\u5316\u4ed5\u69d8\u3001\u307e\u305f\u306f WebSphere Application Server \u30ea\u30b9\u30ca\u30fc\u30fb\u30dd\u30fc\u30c8\u304c\u3001\u7121\u52b9\u306a MQRFH2 \u30d8\u30c3\u30c0\u30fc\u3092\u542b\u3093\u3060\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u691c\u51fa\u3057\u307e\u3057\u305f\u3002 \u3053\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u306b\u3064\u3044\u3066\u306e MQMD \u306e\u300c\u30ec\u30dd\u30fc\u30c8\u300d\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u306f\u30aa\u30d7\u30b7\u30e7\u30f3 MQRO_DEAD_LETTER_Q \u304c\u542b\u307e\u308c\u308b\u305f\u3081\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u306f\u9001\u9054\u4e0d\u80fd\u30ad\u30e5\u30fc\u306b\u79fb\u3055\u308c\u307e\u3057\u305f\u3002 
MQJMS1116.useraction = \u9001\u9054\u4e0d\u80fd\u30ad\u30e5\u30fc\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u8abf\u3079\u3066 MQRFH2 \u30d8\u30c3\u30c0\u30fc\u304c\u7121\u52b9\u306a\u7406\u7531\u3092\u5224\u5225\u3057\u307e\u3059\u3002\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u751f\u6210\u3057\u305f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u5909\u66f4\u3057\u3066 MQRFH2 \u30d8\u30c3\u30c0\u30fc\u304c\u6709\u52b9\u306b\u306a\u308b\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MQJMS1116.inserts = XMSC_INSERT_MESSAGE_ID\u3001XMSC_INSERT_DESTINATION_NAME\u3001XMSC_INSERT_QUEUE_MANAGER_NAME\u3001XMSC_INSERT_STRING 

MQJMS1117 = \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc ''{2}'' \u306e\u30ad\u30e5\u30fc ''{1}'' \u3067\u691c\u51fa\u3055\u308c\u305f\u30e1\u30c3\u30bb\u30fc\u30b8 ''{0}'' \u306f\u3001MQRFH2 \u30d8\u30c3\u30c0\u30fc\u304c\u7121\u52b9\u3067\u3042\u308b\u305f\u3081\u51e6\u7406\u3067\u304d\u305a\u3001\u5ec3\u68c4\u3055\u308c\u307e\u3057\u305f\u3002
MQJMS1117.explanation = IBM MQ \u30e1\u30c3\u30bb\u30fc\u30b8\u30f3\u30b0\u30fb\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306e\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u30fb\u30e2\u30fc\u30c9\u3067\u5b9f\u884c\u4e2d\u306b\u3001ConnectionConsumer\u3001\u6d3b\u52d5\u5316\u4ed5\u69d8\u3001\u307e\u305f\u306f WebSphere Application Server \u30ea\u30b9\u30ca\u30fc\u30fb\u30dd\u30fc\u30c8\u304c\u3001\u7121\u52b9\u306a MQRFH2 \u30d8\u30c3\u30c0\u30fc\u3092\u542b\u3093\u3060\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u691c\u51fa\u3057\u307e\u3057\u305f\u3002 \u3053\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u306b\u3064\u3044\u3066\u306e MQMD \u306e\u300c\u30ec\u30dd\u30fc\u30c8\u300d\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u306f\u30aa\u30d7\u30b7\u30e7\u30f3 MQRO_DISCARD_MSG \u304c\u542b\u307e\u308c\u308b\u305f\u3081\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u306f\u5ec3\u68c4\u3055\u308c\u307e\u3057\u305f\u3002 
MQJMS1117.useraction = \u3053\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u751f\u6210\u3059\u308b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u5909\u66f4\u3057\u3066\u3001\u6709\u52b9\u306a MQRFH2 \u30d8\u30c3\u30c0\u30fc\u3092\u542b\u3080\u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u751f\u6210\u3055\u308c\u308b\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MQJMS1117.inserts = XMSC_INSERT_MESSAGE_ID\u3001XMSC_INSERT_DESTINATION_NAME\u3001XMSC_INSERT_QUEUE_MANAGER_NAME 

# ---------------------------------------------------------------------------------
#
# Component BaseMQ - group prefix '2'
#
# ---------------------------------------------------------------------------------

MQJMS2000 = MQ \u30ad\u30e5\u30fc\u306e\u30af\u30ed\u30fc\u30ba\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJMS2001 = MQ \u30ad\u30e5\u30fc\u53c2\u7167\u304c\u30cc\u30eb\u3067\u3059\u3002
MQJMS2002 = MQ \u30ad\u30e5\u30fc\u304b\u3089\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
MQJMS2003 = \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306e\u5207\u65ad\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJMS2004 = MQQueueManager \u53c2\u7167\u304c\u30cc\u30eb\u3067\u3059\u3002
MQJMS2005 = ''{0}'' \u306e MQQueueManager \u306e\u4f5c\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJMS2006 = MQ \u306e\u554f\u984c: ''{0}''\u3002
MQJMS2007 = \u30e1\u30c3\u30bb\u30fc\u30b8\u3092 MQ \u30ad\u30e5\u30fc\u306b\u9001\u4fe1\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
MQJMS2008 = MQ \u30ad\u30e5\u30fc ''{0}'' \u306e\u30aa\u30fc\u30d7\u30f3\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJMS2009 = MQQueueManager.commit() \u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJMS2010 = MQ \u30ad\u30e5\u30fc definitionType \u306e\u4e0d\u660e\u306a\u5024: ''{0}''\u3002
MQJMS2011 = MQ \u30ad\u30e5\u30fc\u9805\u76ee\u6570\u306e\u7167\u4f1a\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJMS2012 = XACLOSE \u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJMS2013 = \u7121\u52b9\u306a\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u8a8d\u8a3c\u304c MQQueueManager \u306b\u6307\u5b9a\u3055\u308c\u307e\u3057\u305f\u3002
MQJMS2014 = \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c XA \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u63a5\u7d9a\u3092\u62d2\u5426\u3057\u307e\u3057\u305f\u3002

# ---------------------------------------------------------------------------------
#
# Component Domain - group prefix '3'
#
# ---------------------------------------------------------------------------------

MQJMS3000 = ''{0}'' \u304b\u3089\u306e\u4e00\u6642\u30ad\u30e5\u30fc\u306e\u4f5c\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJMS3001 = \u4e00\u6642\u30ad\u30e5\u30fc\u306f\u65e2\u306b\u30af\u30ed\u30fc\u30ba\u307e\u305f\u306f\u524a\u9664\u3055\u308c\u3066\u3044\u307e\u3059\u3002
MQJMS3002 = \u4e00\u6642\u30ad\u30e5\u30fc\u304c\u4f7f\u7528\u4e2d\u3067\u3059\u3002
MQJMS3003 = \u9759\u7684\u30ad\u30e5\u30fc\u306f\u524a\u9664\u3067\u304d\u307e\u305b\u3093\u3002
MQJMS3004 = \u4e00\u6642\u30ad\u30e5\u30fc\u306e\u524a\u9664\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJMS3005 = \u30d1\u30d6\u30ea\u30c3\u30b7\u30e5/\u30b5\u30d6\u30b9\u30af\u30e9\u30a4\u30d6\u304c ''{0}'' \u306e\u305f\u3081\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJMS3006 = \u30c8\u30d4\u30c3\u30af\u53c2\u7167\u304c\u30cc\u30eb\u3067\u3059\u3002
MQJMS3008 = \u30b3\u30de\u30f3\u30c9 ''{0}'' \u306e\u4f5c\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJMS3009 = \u30b3\u30de\u30f3\u30c9\u3092 MQ \u30ad\u30e5\u30fc\u306b\u30d1\u30d6\u30ea\u30c3\u30b7\u30e5\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
MQJMS3010 = \u30d1\u30d6\u30ea\u30c3\u30b7\u30e5\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u4f5c\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJMS3011 = \u30e1\u30c3\u30bb\u30fc\u30b8\u3092 MQ \u30ad\u30e5\u30fc\u306b\u30d1\u30d6\u30ea\u30c3\u30b7\u30e5\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
MQJMS3013 = admin \u30a8\u30f3\u30c8\u30ea\u30fc\u306e\u4fdd\u7ba1\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJMS3014 = \u30b5\u30d6\u30b9\u30af\u30e9\u30a4\u30d0\u30fc\u30fb\u30ad\u30e5\u30fc ''{0}'' \u306e\u30aa\u30fc\u30d7\u30f3\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJMS3017 = \u30b5\u30d6\u30b9\u30af\u30e9\u30a4\u30d0\u30fc\u30fb\u30ad\u30e5\u30fc ''{0}'' \u306e\u524a\u9664\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJMS3018 = \u4e0d\u660e\u306a\u6c38\u7d9a\u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3 ''{0}''\u3002
MQJMS3019 = TemporaryTopic \u306f\u65e2\u306b\u524a\u9664\u3055\u308c\u3066\u3044\u307e\u3059\u3002
MQJMS3020 = TemporaryTopic \u304c\u6709\u52b9\u7bc4\u56f2\u306b\u3042\u308a\u307e\u305b\u3093\u3002
MQJMS3021 = \u7121\u52b9\u306a\u30b5\u30d6\u30b9\u30af\u30e9\u30a4\u30d0\u30fc\u30fb\u30ad\u30e5\u30fc\u63a5\u982d\u90e8: ''{0}''\u3002
MQJMS3022 = \u6c38\u7d9a\u518d\u30b5\u30d6\u30b9\u30af\u30e9\u30a4\u30d6\u306f\u540c\u3058\u30b5\u30d6\u30b9\u30af\u30e9\u30a4\u30d0\u30fc\u30fb\u30ad\u30e5\u30fc\u3092\u4f7f\u7528\u3057\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002\u6307\u5b9a:''{0}'' \u30aa\u30ea\u30b8\u30ca\u30eb:''{1}''\u3002
MQJMS3023 = \u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u306b\u30a2\u30af\u30c6\u30a3\u30d6\u306a TopicSubscriber \u304c\u3042\u308a\u307e\u3059\u3002
MQJMS3024 = \u672a\u521d\u671f\u8a2d\u5b9a\u30af\u30e9\u30a4\u30a2\u30f3\u30c8 ID \u304c\u9593\u9055\u3063\u3066\u4f7f\u7528\u3055\u308c\u307e\u3057\u305f\u3002
MQJMS3025 = TemporaryTopic \u306f\u4f7f\u7528\u4e2d\u3067\u3059\u3002
MQJMS3026 = QueueSender \u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f\u3002
MQJMS3028 = TopicPublisher \u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f\u3002
MQJMS3031 = \u63a5\u7d9a\u306e\u4f7f\u7528\u5f8c\u306b clientID \u3092\u8a2d\u5b9a\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
MQJMS3032 = clientID \u306e\u30ea\u30bb\u30c3\u30c8\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJMS3033 = QueueReceiver \u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f\u3002
MQJMS3034 = TopicSubscriber \u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f\u3002
MQJMS3037 = Message Producer \u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f\u3002
MQJMS3038 = Message Consumer \u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f\u3002
MQJMS3039 = \u30cc\u30eb\u540d\u306e\u4f7f\u7528\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJMS3040 = \u30d6\u30ed\u30fc\u30ab\u30fc\u306e\u5236\u5fa1\u30e1\u30c3\u30bb\u30fc\u30b8\u5185\u5bb9\u304c\u7121\u52b9\u3067\u3059: ''{0}''\u3002
MQJMS3041 = \u30d5\u30a3\u30fc\u30eb\u30c9 ''{0}'' \u306f\u65e2\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002
MQJMS3042 = Pub/Sub \u30d6\u30ed\u30fc\u30ab\u30fc\u304b\u3089\u8a8d\u8b58\u3067\u304d\u306a\u3044\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u53d7\u3051\u53d6\u308a\u307e\u3057\u305f\u3002
MQJMS3043 = \u30af\u30ea\u30fc\u30f3\u30a2\u30c3\u30d7\u306e\u7e70\u308a\u8fd4\u3057\u306b\u306f\u7121\u52b9\u306a\u30ec\u30d9\u30eb\u3067\u3059\u3002
MQJMS3044 = \u30af\u30ea\u30fc\u30f3\u30a2\u30c3\u30d7\u30fb\u30ec\u30d9\u30eb NONE \u304c\u8981\u6c42\u3055\u308c\u307e\u3057\u305f\u3002
MQJMS3045 = ''{0}'' \u3092\u30aa\u30fc\u30d7\u30f3\u3067\u304d\u307e\u305b\u3093\u3002FORCE \u307e\u305f\u306f NONDUR \u30ec\u30d9\u30eb\u306e\u30af\u30ea\u30fc\u30f3\u30a2\u30c3\u30d7\u304c\u5b9f\u884c\u4e2d\u306e\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
MQJMS3046 =  ''{0}'' \u3092\u30aa\u30fc\u30d7\u30f3\u3067\u304d\u307e\u305b\u3093\u3002\u5225\u306e JMS \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u3053\u306e\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u3067 Pub/Sub \u3092\u4f7f\u7528\u4e2d\u306e\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
MQJMS3047 = \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u30fb\u30b9\u30c8\u30a2\u30fb\u30bf\u30a4\u30d7\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u305b\u3093\u3002
MQJMS3048 = \u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u30fb\u30b9\u30c8\u30a2\u30fb\u30bf\u30a4\u30d7\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002
MQJMS3049 = MQJMS_Messages.MQJMS_PS_WRONG_SUBSCRIPTION_TYPE = \u3053\u306e\u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u30fb\u30b9\u30c8\u30a2\u306e\u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u30fb\u30bf\u30a4\u30d7\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002
MQJMS3050 = \u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u306f\u65e2\u306b\u4f7f\u7528\u4e2d\u3067\u3042\u308b\u305f\u3081\u3001\u66f4\u65b0\u3067\u304d\u307e\u305b\u3093\u3002
MQJMS3051 = \u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u540d\u304c\u7121\u52b9\u3067\u3059\u3002

MQJMS3052 = ''{1}'' \u306e ''{0}'' \u306b\u30af\u30ea\u30fc\u30f3\u30a2\u30c3\u30d7\u304c\u958b\u59cb\u3055\u308c\u307e\u3057\u305f\u3002
MQJMS3052.explanation = IBM MQ classes for JMS \u306e\u30af\u30ea\u30fc\u30f3\u30a2\u30c3\u30d7\u30fb\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u5b9f\u884c\u4e2d\u3067\u3059\u3002\u3053\u306e\u30b9\u30af\u30ea\u30d7\u30c8\u306f\u3001\u6307\u5b9a\u3055\u308c\u305f\u65e5\u6642\u306b\u30af\u30ea\u30fc\u30f3\u30a2\u30c3\u30d7\u64cd\u4f5c\u3092\u958b\u59cb\u3057\u307e\u3057\u305f\u3002 \u6642\u523b\u5f62\u5f0f\u306f HHMMSSTH\u3001\u65e5\u4ed8\u5f62\u5f0f\u306f YYYYMMDD \u3067\u3059\u3002 
MQJMS3052.useraction = \u3042\u308a\u307e\u305b\u3093\u3002 
MQJMS3052.inserts = XMSC_INSERT_TIMESTAMP\u3001XMSC_INSERT_DATESTAMP

MQJMS3053 = ''{1}'' \u306e ''{0}'' \u306b\u30af\u30ea\u30fc\u30f3\u30a2\u30c3\u30d7\u304c\u7d42\u4e86\u3057\u307e\u3057\u305f\u3002
MQJMS3053.explanation = IBM MQ classes for JMS \u306e\u30af\u30ea\u30fc\u30f3\u30a2\u30c3\u30d7\u30fb\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u5b9f\u884c\u4e2d\u3067\u3059\u3002\u3053\u306e\u30b9\u30af\u30ea\u30d7\u30c8\u306f\u3001\u6307\u5b9a\u3055\u308c\u305f\u65e5\u6642\u306b\u30af\u30ea\u30fc\u30f3\u30a2\u30c3\u30d7\u64cd\u4f5c\u3092\u7d42\u4e86\u3057\u307e\u3057\u305f\u3002 \u6642\u523b\u5f62\u5f0f\u306f HHMMSSTH\u3001\u65e5\u4ed8\u5f62\u5f0f\u306f YYYYMMDD \u3067\u3059\u3002 
MQJMS3053.useraction = \u3042\u308a\u307e\u305b\u3093\u3002 
MQJMS3053.inserts = XMSC_INSERT_TIMESTAMP\u3001XMSC_INSERT_DATESTAMP

MQJMS3054 = \u6b21\u56de\u306e\u30af\u30ea\u30fc\u30f3\u30a2\u30c3\u30d7\u64cd\u4f5c\u307e\u3067\u306e\u6642\u9593: ''{0}'' \u5206\u3002
MQJMS3054.explanation = IBM MQ classes for JMS \u306e\u30af\u30ea\u30fc\u30f3\u30a2\u30c3\u30d7\u30fb\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u5b9f\u884c\u4e2d\u3067\u3059\u3002\u3053\u306e\u30b9\u30af\u30ea\u30d7\u30c8\u306f\u73fe\u5728\u3001\u6b21\u56de\u306e\u30af\u30ea\u30fc\u30f3\u30a2\u30c3\u30d7\u64cd\u4f5c\u3092\u958b\u59cb\u3059\u308b\u307e\u3067\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u306b\u793a\u3057\u305f\u6642\u9593 (\u5206\u5358\u4f4d) \u5f85\u6a5f\u3057\u3066\u3044\u307e\u3059\u3002 \u30e1\u30c3\u30bb\u30fc\u30b8\u306b\u793a\u3057\u305f\u6642\u9593\u306f\u5206\u5358\u4f4d\u306b\u306a\u308b\u3088\u3046\u306b\u7aef\u6570\u304c\u5207\u308a\u6368\u3066\u3089\u308c\u3066\u3044\u307e\u3059\u3002
MQJMS3054.useraction = \u3042\u308a\u307e\u305b\u3093\u3002 
MQJMS3054.inserts = XMSC_INSERT_STRING

# ---------------------------------------------------------------------------------
#
# Admin Domain - group prefix '4'
#
# ---------------------------------------------------------------------------------

MQJMS4124 = ''{0}'' \u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u5024\u304c\u30cc\u30eb\u3067\u3059\u3002
MQJMS4125 = ''{0}'' \u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u7121\u52b9\u3067\u3059: ''{1}''\u3002
MQJMS4131 = \u4e88\u60f3\u3055\u308c\u305f\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30fb\u30bf\u30a4\u30d7\u3068\u5b9f\u969b\u306e\u30bf\u30a4\u30d7\u304c\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002

# ---------------------------------------------------------------------------------
#
# Util Domain (IVT, sample etc.) - group prefix '5'
#
# ---------------------------------------------------------------------------------

MQJMS5053 = *** \u30d6\u30ed\u30fc\u30ab\u30fc\u306e\u5fdc\u7b54\u304c\u3042\u308a\u307e\u305b\u3093\u3002 \u30d6\u30ed\u30fc\u30ab\u30fc\u304c\u5b9f\u884c\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002 IBM MQ \u30d6\u30ed\u30fc\u30ab\u30fc\u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u5834\u5408\u306f\u3001brokerVersion \u304c V1 \u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002***
MQJMS5087 = \u5185\u90e8\u30ad\u30e5\u30fc ''{0}'' \u3078\u306e\u30a2\u30af\u30bb\u30b9\u4e2d\u306b\u4e88\u671f\u3057\u306a\u3044\u30a8\u30e9\u30fc ''{1}'' \u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002

# ---------------------------------------------------------------------------------
#
# Gryphon - group prefix '6'
#
# ---------------------------------------------------------------------------------

MQJMS6040 = \u30bd\u30b1\u30c3\u30c8\u30fb\u30d5\u30a1\u30df\u30ea\u30fc\u540d ''{0}'' \u304c\u7121\u52b9\u3067\u3059\u3002
MQJMS6041 = \u30bd\u30b1\u30c3\u30c8\u30fb\u30d5\u30a1\u30af\u30c8\u30ea\u30fc\u30fb\u30af\u30e9\u30b9 ''{0}'' \u3092\u30ed\u30fc\u30c9\u3057\u3088\u3046\u3068\u3057\u305f\u3068\u304d\u306b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u4f8b\u5916: <''{1}''>\u3002
MQJMS6056 = \u3053\u308c\u4ee5\u4e0a BaseConfig \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u5909\u66f4\u3067\u304d\u306a\u3044\u305f\u3081\u3001\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc ''{0}'' \u3092\u5909\u66f4\u3067\u304d\u307e\u305b\u3093\u3002
MQJMS6057 = \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc ''{0}'' \u3092\u5024 ''{1}'' \u306b\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002
MQJMS6058 = BaseConfig \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc ''{0}'' \u306e\u53d6\u5f97\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
MQJMS6059 = \u6700\u5c0f\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u5b9f\u88c5\u306e\u30ed\u30fc\u30c9\u4e2d\u306b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
MQJMS6060 = \u4e88\u671f\u3057\u306a\u3044\u4f8b\u5916\u304c\u6700\u5c0f\u30af\u30e9\u30a4\u30a2\u30f3\u30c8 ''{0}'' \u3067\u767a\u751f\u3057\u307e\u3057\u305f\u3002
MQJMS6061 = \u6307\u5b9a\u3055\u308c\u305f\u30c8\u30d4\u30c3\u30af\u306e\u5f62\u5f0f\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093 ''{0}''\u3002
MQJMS6062 = \u6700\u5c0f\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u3067\u30c7\u30fc\u30bf\u3092\u53d7\u4fe1\u4e2d\u306b EOF \u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002
MQJMS6063 = \u30d6\u30ed\u30fc\u30ab\u30fc\u304c\u6700\u5c0f\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u63a5\u7d9a\u3067\u306e\u30a8\u30e9\u30fc\u3092\u793a\u3057\u307e\u3057\u305f\u3002
MQJMS6064 = Connector.send \u304c\u3001\u6b63\u3057\u304f\u306a\u3044\u30e1\u30c3\u30bb\u30fc\u30b8\u5024\u3067\u547c\u3073\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
MQJMS6065 = \u6b63\u3057\u304f\u306a\u3044\u5024\u304c\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u898b\u3064\u304b\u308a\u307e\u3057\u305f: ''{0}''\u3002
MQJMS6066 = \u4e88\u671f\u3057\u306a\u3044\u5185\u90e8\u30a8\u30e9\u30fc\u304c\u6700\u5c0f\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u3067\u767a\u751f\u3057\u307e\u3057\u305f\u3002
MQJMS6067 = \u30d0\u30a4\u30c8\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u64cd\u4f5c\u304c\u3001\u30d0\u30a4\u30c8\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u3067\u306f\u306a\u3044\u9805\u76ee\u306b\u95a2\u3057\u3066\u8981\u6c42\u3055\u308c\u307e\u3057\u305f\u3002
MQJMS6068 = \u30c6\u30ad\u30b9\u30c8\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u64cd\u4f5c\u304c\u3001\u30c6\u30ad\u30b9\u30c8\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u3067\u306f\u306a\u3044\u9805\u76ee\u306b\u95a2\u3057\u3066\u8981\u6c42\u3055\u308c\u307e\u3057\u305f\u3002
MQJMS6069 = \u30b9\u30c8\u30ea\u30fc\u30e0\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u64cd\u4f5c\u304c\u3001\u30b9\u30c8\u30ea\u30fc\u30e0\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u3067\u306f\u306a\u3044\u9805\u76ee\u306b\u95a2\u3057\u3066\u8981\u6c42\u3055\u308c\u307e\u3057\u305f\u3002
MQJMS6070 = \u30de\u30c3\u30d7\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u64cd\u4f5c\u304c\u3001\u30de\u30c3\u30d7\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u3067\u306f\u306a\u3044\u9805\u76ee\u306b\u95a2\u3057\u3066\u8981\u6c42\u3055\u308c\u307e\u3057\u305f\u3002
MQJMS6071 = \u30d6\u30ed\u30fc\u30ab\u30fc\u304c\u8a8d\u8a3c\u4e2d\u306b\u7121\u52b9\u306a\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u9001\u4fe1\u3057\u307e\u3057\u305f\u3002
MQJMS6072 = \u30d6\u30ed\u30fc\u30ab\u30fc\u304c\u8a8d\u8a3c\u4e2d\u306b\u4f7f\u7528\u4e0d\u53ef\u306e\u30d7\u30ed\u30c8\u30b3\u30eb\u3092\u8981\u6c42\u3057\u307e\u3057\u305f\u3002
MQJMS6073 = \u8a8d\u8a3c\u306b\u5931\u6557\u3057\u305f\u305f\u3081\u3001\u6700\u5c0f\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u63a5\u7d9a\u304c\u62d2\u5426\u3055\u308c\u307e\u3057\u305f\u3002
MQJMS6074 = \u6700\u5c0f\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u3067\u4f7f\u7528\u53ef\u80fd\u306a QOP \u304c\u3042\u308a\u307e\u305b\u3093\u3002
MQJMS6079 = \u30b9\u30ec\u30c3\u30c9\u30fb\u30d7\u30fc\u30ea\u30f3\u30b0\u30fb\u30b5\u30dd\u30fc\u30c8\u3092\u30ed\u30fc\u30c9\u3057\u3088\u3046\u3068\u3057\u305f\u3068\u304d\u306b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f: ''{0}''\u3002
MQJMS6081 = \u524d\u306e\u8aad\u307f\u53d6\u308a\u304c\u5b8c\u4e86\u3059\u308b\u524d\u306b\u30b9\u30c8\u30ea\u30fc\u30e0\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u304b\u3089\u306e\u8aad\u307f\u53d6\u308a\u3092\u5b9f\u884c\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002
MQJMS6083 = \u30b9\u30ec\u30c3\u30c9\u30fb\u30d7\u30fc\u30eb\u30fb\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u521d\u671f\u5316\u4e2d\u306b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f: ''{0}''\u3002
MQJMS6085 = ExceptionListener \u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJMS6088 = \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30fb\u30b5\u30a4\u30c9\u306e\u63a5\u7d9a\u30e2\u30cb\u30bf\u30fc\u3092\u7d42\u4e86\u4e2d\u3067\u3059\u3002
MQJMS6090 = \u30ea\u30b9\u30ca\u30fc\u304c\u30a2\u30af\u30c6\u30a3\u30d6\u306a MessageConsumer \u4e0a\u3067\u540c\u671f\u53d7\u4fe1\u3092\u5b9f\u884c\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002
MQJMS6091 = \u63a5\u7d9a\u6642\u306e\u9001\u9054\u3092\u958b\u59cb\u307e\u305f\u306f\u505c\u6b62\u4e2d\u306b IOException \u304c\u767a\u751f\u3057\u307e\u3057\u305f: ''{0}''\u3002
MQJMS6093 = \u540c\u671f\u53d7\u4fe1\u4e2d\u306b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f: ''{0}''\u3002
MQJMS6096 = ''{0}'' \u306e JMSPriority \u30ec\u30d9\u30eb\u304c\u3001JMS \u306b\u6307\u5b9a\u3055\u308c\u305f\u7bc4\u56f2\u306e\u5916\u306b\u3042\u308a\u307e\u3059\u3002
MQJMS6097 = \u6307\u5b9a\u3055\u308c\u305f JMSMessageID ''{0}'' \u304c\u7121\u52b9\u3067\u3059\u3002
MQJMS6105 = \u3053\u308c\u4ee5\u4e0a\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30fb\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u5909\u66f4\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
MQJMS6106 = \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc ''{0}'' \u306e\u521d\u671f\u5316\u4e2d\u306b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u4f8b\u5916: ''{1}''\u3002
MQJMS6115 = TopicConnection \u306e\u4f5c\u6210\u4e2d\u306b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f: ''{0}''\u3002
MQJMS6116 = \u30af\u30ed\u30fc\u30ba\u3055\u308c\u305f\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u3067\u3053\u306e\u64cd\u4f5c\u3092\u884c\u3046\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
MQJMS6117 = \u30c8\u30d4\u30c3\u30af\u306e ''{0}'' \u5b9f\u88c5\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJMS6118 = \u30c8\u30d4\u30c3\u30af ''{0}'' \u306b\u306f\u30ef\u30a4\u30eb\u30c9\u30ab\u30fc\u30c9\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u304c\u3001\u30d1\u30d6\u30ea\u30c3\u30b7\u30e5\u306b\u306f\u7121\u52b9\u3067\u3059\u3002
MQJMS6119 = \u30d1\u30d6\u30ea\u30c3\u30b7\u30e5\u4e2d\u306b IOException \u304c\u767a\u751f\u3057\u307e\u3057\u305f: ''{0}''\u3002
MQJMS6120 = \u73fe\u884c\u63a5\u7d9a\u3067\u4f5c\u6210\u3055\u308c\u3066\u3044\u306a\u3044\u4e00\u6642\u30c8\u30d4\u30c3\u30af\u306e\u4f7f\u7528\u3092\u8a66\u307f\u307e\u3057\u305f\u3002
MQJMS6121 = \u30b5\u30d6\u30b9\u30af\u30e9\u30a4\u30d6\u4e2d\u306b IOException \u304c\u767a\u751f\u3057\u307e\u3057\u305f: ''{0}''\u3002
MQJMS6232 = TopicSubscriber \u306e\u4f5c\u6210\u4e2d\u306b\u30de\u30c3\u30c1\u30f3\u30b0\u30fb\u30a8\u30f3\u30b8\u30f3\u306b\u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u3092\u8ffd\u52a0\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u3001\u6b21\u306e\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f: ''{0}''\u3002
MQJMS6233 = \u4e88\u671f\u3057\u306a\u3044\u4f8b\u5916\u304c\u30de\u30c3\u30c1\u30f3\u30b0\u30fb\u30a8\u30f3\u30b8\u30f3\u3067\u898b\u3064\u304b\u308a\u307e\u3057\u305f: ''{0}''\u3002
MQJMS6234 = \u30c8\u30d4\u30c3\u30af ''{0}'' \u3092\u6301\u3064\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u7a7a\u306e\u30de\u30c3\u30c1\u30f3\u30b0\u30fb\u30a8\u30f3\u30b8\u30f3\u304b\u3089\u9664\u53bb\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f: ''{1}''\u3002
MQJMS6235 = \u30c8\u30d4\u30c3\u30af ''{0}'' \u3092\u6301\u3064\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u30de\u30c3\u30c1\u30f3\u30b0\u30fb\u30a8\u30f3\u30b8\u30f3\u304b\u3089\u9664\u53bb\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u3001\u30ad\u30e3\u30c3\u30b7\u30e5\u30fb\u30a8\u30f3\u30c8\u30ea\u30fc\u304c\u3042\u308a\u307e\u305b\u3093\u3067\u3057\u305f: ''{1}''\u3002
MQJMS6236 = \u30af\u30e9\u30b9 ''{0}'' \u306e\u4e0d\u660e\u306a\u691c\u67fb\u30bf\u30a4\u30d7\u304c\u30bf\u30a4\u30d7\u56fa\u6709\u306e\u30de\u30c3\u30c1\u30f3\u30b0\u30fb\u30a8\u30f3\u30b8\u30f3\u3067\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002
MQJMS6237 = ''{0}'' \u3068\u3044\u3046\u540d\u524d\u306e\u4e0d\u660e\u306a\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u30a2\u30af\u30bb\u30b9\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002
MQJMS6238 = \u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u30a2\u30af\u30bb\u30b9\u3057\u3088\u3046\u3068\u3057\u305f\u3068\u304d\u306b\u6b21\u306e\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f: ''{0}''\u3002
MQJMS6239 = \u30ad\u30e3\u30c3\u30b7\u30e5\u304c\u30ed\u30fc\u30c9\u3055\u308c\u3066\u3044\u306a\u3044\u3068\u304d\u306b EvalCache GET \u307e\u305f\u306f PUT \u64cd\u4f5c\u304c\u884c\u308f\u308c\u307e\u3057\u305f\u3002
MQJMS6240 = EvalCache GET \u307e\u305f\u306f PUT \u64cd\u4f5c\u3067\u7121\u52b9\u306a ID \u304c\u6307\u5b9a\u3055\u308c\u307e\u3057\u305f\u3002
MQJMS6241 = \u6307\u5b9a\u3055\u308c\u305f\u30b3\u30f3\u30c6\u30f3\u30c4\u306e\u5c5e\u6027\u304c\u591a\u3059\u304e\u307e\u3059\u3002
MQJMS6242 = \u91cd\u8907\u3059\u308b MatchTarget \u304c MatchSpace \u3067\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002
MQJMS6243 = MatchTarget ''{0}'' \u3092 MatchSpace \u304b\u3089\u9664\u53bb\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u3001\u30ad\u30fc (\u30c8\u30d4\u30c3\u30af) \u304c\u3042\u308a\u307e\u305b\u3093\u3002
MQJMS6244 = \u30ad\u30fc (\u30c8\u30d4\u30c3\u30af)''{0}'' \u3092\u6301\u3064 MatchTarget ''{1}'' \u304c\u898b\u3064\u304b\u3089\u306a\u304b\u3063\u305f\u305f\u3081\u306b\u3001\u305d\u308c\u3092 MatchSpace \u304b\u3089\u9664\u53bb\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
MQJMS6245 = MatchTarget \u3092 MatchSpace \u306b\u30ad\u30fc (\u30c8\u30d4\u30c3\u30af) \u306a\u3057\u3067\u8ffd\u52a0\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002
MQJMS6246 = \u30c8\u30d4\u30c3\u30af\u30fb\u30ef\u30a4\u30eb\u30c9\u30ab\u30fc\u30c9\u6587\u5b57 ''{0}'' \u306e\u4e0d\u6b63\u306a\u4f7f\u7528\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002
MQJMS6247 = \u30c8\u30d4\u30c3\u30af\u30fb\u30bb\u30b0\u30e1\u30f3\u30c8\u533a\u5207\u308a\u6587\u5b57 ''{0}'' \u304c\u4e0d\u6b63\u306a\u4f4d\u7f6e\u3067\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002
MQJMS6248 = \u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u30fb\u30bb\u30ec\u30af\u30bf\u30fc\u30fb\u30d1\u30fc\u30b5\u30fc\u306e\u30ed\u30fc\u30c9\u307e\u305f\u306f\u547c\u3073\u51fa\u3057\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
MQJMS6249 = \u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u30fb\u30bb\u30ec\u30af\u30bf\u30fc\u306e\u69cb\u6587\u89e3\u6790\u4e2d\u306b\u6b21\u306e\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f: ''{0}''\u3002
MQJMS6250 = \u6b21\u306e\u30d1\u30bf\u30fc\u30f3\u3092\u7d42\u4e86\u3059\u308b\u305f\u3081\u306b\u30a8\u30b9\u30b1\u30fc\u30d7\u6587\u5b57\u304c\u4f7f\u7528\u3055\u308c\u307e\u3057\u305f: ''{0}''\u3002
MQJMS6251 = \u30d1\u30bf\u30fc\u30f3\u30fb\u30c4\u30fc\u30eb\u306b\u6e21\u3055\u308c\u305f\u30a8\u30b9\u30b1\u30fc\u30d7\u6587\u5b57 ''{0}'' \u306e\u9577\u3055\u304c 1 \u6587\u5b57\u3092\u8d85\u3048\u3066\u3044\u307e\u3059\u3002
MQJMS6252 = \u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u306f\u30bf\u30a4\u30d7 ''{0}'' \u306e\u5024\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u3068\u4e88\u60f3\u3055\u308c\u307e\u3057\u305f\u304c\u3001\u30bf\u30a4\u30d7 ''{1}'' \u306e\u5024\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3057\u305f\u3002
MQJMS6228 = \u4f8b\u5916 ''{0}'' \u304c\u767a\u751f\u3057\u305f\u305f\u3081\u3001\u6700\u5c0f\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u8a8d\u8a3c\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJMS6229 = QOP \u304c\u8981\u6c42\u3055\u308c\u307e\u3057\u305f\u304c\u3001\u3053\u306e\u6700\u5c0f\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306b\u3064\u3044\u3066\u306f\u7121\u52b9\u306b\u306a\u3063\u3066\u3044\u307e\u3059\u3002
MQJMS6311 = \u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u5185\u306e\u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u30fb\u30bf\u30a4\u30d7 'DIRECT' \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJMS6312 = \u30c8\u30d4\u30c3\u30af ''{0}'' \u306e\u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJMS6350 = \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u64cd\u4f5c\u304c\u3001\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u3067\u306f\u306a\u3044\u9805\u76ee\u306b\u95a2\u3057\u3066\u8981\u6c42\u3055\u308c\u307e\u3057\u305f\u3002
MQJMS6351 = <''{0}'',''{1}''> \u306e\u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u3092\u4f5c\u6210\u4e2d\u306b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f: ''{2}''\u3002
MQJMS6401 = \u6c38\u7d9a\u30e1\u30c3\u30bb\u30fc\u30b8\u306f\u3001\u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u30fb\u30bf\u30a4\u30d7 'DIRECT' \u3067\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJMS6402 = \u5b58\u7d9a\u6642\u9593 > 0 \u306f\u3001\u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u30fb\u30bf\u30a4\u30d7 'DIRECT' \u3067\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJMS6403 = \u30c8\u30d4\u30c3\u30af\u671f\u9650 > 0 \u306f\u3001\u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u30fb\u30bf\u30a4\u30d7 'DIRECT' \u3067\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJMS6404 = \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u5fdc\u7b54\u306f\u3001\u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u30fb\u30bf\u30a4\u30d7 'DIRECT' \u3067\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJMS6405 = JMS 2.0 \u6a5f\u80fd\u306f\u3001ProviderVersion 6 \u3067\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJMS6406 = IBM MQ \u30e1\u30c3\u30bb\u30fc\u30b8\u30f3\u30b0\u30fb\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u79fb\u884c\u30e2\u30fc\u30c9\u306f CICS \u74b0\u5883\u3067\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJMS6407 = IBM MQ \u30e1\u30c3\u30bb\u30fc\u30b8\u30f3\u30b0\u30fb\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u79fb\u884c\u30e2\u30fc\u30c9\u306f IMS \u74b0\u5883\u3067\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
