# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR

JMSCS0001 = Las propiedades del archivo de propiedades ''{0}'' no se han podido cargar debido a una Excepci\u00f3n de E/S.
JMSCS0001.useraction = Compruebe que el archivo de propiedades existe y que tiene los permisos adecuados.
JMSCS0002 = La llamada no se ha podido realizar porque CommonServices no se ha inicializado.
JMSCS0002.explanation = CommonServices es un componente interno y tiene que inicializarse durante el arranque pero ha fallado.
JMSCS0002.useraction = Compruebe que la configuraci\u00f3n de la instalaci\u00f3n y de la v\u00eda de acceso de clases es correcta.
JMSCS0003 = No se ha encontrado un componente CommonServices.
JMSCS0003.explanation = CommonServices es un componente interno y no se ha encontrado.
JMSCS0003.useraction = Compruebe que la configuraci\u00f3n de la instalaci\u00f3n y de la v\u00eda de acceso de clases es correcta.
JMSCS0004 = No se ha encontrado un componente Proveedor de mensajer\u00eda.
JMSCS0004.explanation = Se ha realizado una petici\u00f3n para utilizar un Proveedor de mensajer\u00eda que no est\u00e1 presente en la configuraci\u00f3n actual.
JMSCS0004.useraction = Compruebe que el archivo JAR que contiene el Proveedor de mensajer\u00eda est\u00e1 presente en la v\u00eda de acceso de clases o que se ha registrado.
JMSCS0005 = El Gestor de componentes no ha podido localizar un componente.
JMSCS0005.explanation = Se ha realizado una petici\u00f3n para utilizar un componente que no est\u00e1 presente en la configuraci\u00f3n actual.
JMSCS0005.useraction = Compruebe que el archivo JAR que contiene el componente est\u00e1 presente en la v\u00eda de acceso de clases o que se ha registrado.
JMSCS0006 = Se ha producido un problema interno. La informaci\u00f3n de diagn\u00f3stico para el servicio t\u00e9cnico se ha grabado en ''{0}''. Termine la aplicaci\u00f3n ya que el producto est\u00e1 en un estado interno incoherente.
JMSCS0006.useraction = Guarde todos los archivos de salida generados y utilice el sitio de Soporte de WMQ: http://www.ibm.com/software/integration/wmq/support/, o IBM Support Assistant (ISA): http://www.ibm.com/software/support/isa/, para ver si ya hay una soluci\u00f3n disponible.  Si no puede encontrar una soluci\u00f3n, p\u00f3ngase en contacto con el centro de soporte de IBM.
JMSCS0007 = EXPLICACI\u00d3N:
JMSCS0008 = ACCI\u00d3N:

JMSCS0009 = Las propiedades del sistema no se han podido cargar debido a una excepci\u00f3n AccessControlException.
JMSCS0009.explanation = PropertyStore no ha podido consultar las propiedades del sistema porque la pol\u00edtica de seguridad no lo permite.
JMSCS0009.useraction = Modifique la pol\u00edtica de seguridad para permitir la lectura de las propiedades del sistema.

JMSCS0010 = No se han podido localizar los servicios comunes del cliente de mensajer\u00eda de IBM o inicializar un componente debido a la excepci\u00f3n ''{0}''.
JMSCS0010.inserts = XMSC_INSERT_EXCEPTION

JMSCS0011 = Mensaje
JMSCS0012 = Clase
JMSCS0013 = Pila
JMSCS0014 = Se debe a [{0}] --> Mensaje
JMSCS0015 = Objeto com\u00fan en estado no v\u00e1lido

JMSCS0016 = La operaci\u00f3n del gestor de mandatos ha fallado.

JMSC0017 = Se ha le\u00eddo el archivo de configuraci\u00f3n de CommonServices desde ''{0}''
JMSC0017.inserts = XMSC_CONFIG_FILE_LOCATION

JMSCS0018 = Se ha proporcionado un nombre de propiedad ''{0}'' desconocido
JMSCS0018.inserts = XMSC_PROPERTY_NAME

JMSCS0019 = La propiedad ''{0}'' ya ha sido establecida por ''{1}''. No se puede actualizar.
JMSCS0019.inserts = XMSC_PROPERTY_NAME,XMSC_PROPERTY_SOURCE

JMSCS0020 = La clase no se puede serializar o deserializar porque no se ha incluido en la lista blanca ''{0}''.
JMSCS0020.inserts = XMSC_WHITELIST

JMSCS0021 = El archivo de lista blanca ''{0}'' no se puede abrir
JMSCS0021.inserts = XMSC_WHITELIST

JMSCS0022 = El archivo de lista blanca ''{0}'' ya existe y no se puede alterar temporalmente
JMSCS0022.inserts = XMSC_WHITELIST

JMSCS0023 = La lista blanca ''{0}'' tiene una entrada no v\u00e1lida
JMSCS0023.inserts = XMSC_WHITELIST

JMSCS0024 = No se ha podido escribir en el archivo de lista blanca

JMSCS0025 = Lista blanca ENFORCEMENT habilitada: el archivo de lista blanca ''{0}'' se est\u00e1 utilizando para validar las operaciones de serializaci\u00f3n y deserializaci\u00f3n de ObjectMessage: el \u00e1rbol de lista blanca es ''{1}''
JMSCS0025.inserts = XMSC_WHITELIST,XMSC_WHITELIST_CONTENTS

JMSCS0026 = Lista blanca DISCOVERY habilitada: el archivo de lista blanca ''{0}'' se est\u00e1 utilizando para registrar operaciones de serializaci\u00f3n y deserializaci\u00f3n de ObjectMessage
JMSCS0026.inserts = XMSC_WHITELIST

JMSCS0027 = Lista blanca ENFORCEMENT habilitada: la lista blanca ''{0}'' se est\u00e1 utilizando para validar operaciones de serializaci\u00f3n y deserializaci\u00f3n de ObjectMessage
JMSCS0027.inserts = XMSC_WHITELIST

JMSCS0028 = Se ha solicitado la lista blanca DISCOVERY, pero el nombre de archivo de la lista blanca ''{0}'' no es un URI de archivo
JMSCS0028.inserts = XMSC_WHITELIST

JMSCS0029 = No se ha habilitado la funcionalidad de la lista blanca: o no se han definido las propiedades, o los permisos de seguridad impiden su lectura
