# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR

JMSCS0001 = Non \u00e8 stato possibile caricare le propriet\u00e0 dal file delle propriet\u00e0 ''{0}'' a causa di una IOException.
JMSCS0001.useraction = Controllare che il file delle propriet\u00e0 esista e che disponga delle autorizzazioni appropriate.
JMSCS0002 = Non \u00e8 stato possibile completare la chiamata perch\u00e9 CommonServices non \u00e8 stato inizializzato.
JMSCS0002.explanation = CommonServices \u00e8 un componente interno e deve essere inizializzato all'avvio ma si \u00e8 verificato un suo malfunzionamento.
JMSCS0002.useraction = Verificare che l'installazione e la configurazione del percorso di classe siano corrette.
JMSCS0003 = Non \u00e8 stato trovato un componente CommonServices.
JMSCS0003.explanation = CommonServices \u00e8 un componente interno e non \u00e8 stato trovato.
JMSCS0003.useraction = Verificare che l'installazione e la configurazione del percorso di classe siano corrette.
JMSCS0004 = Non \u00e8 stato trovato il componente del provider di messaggistica.
JMSCS0004.explanation = \u00c8 stata fatta una richiesta di utilizzare un provider di messaggistica che non \u00e8 presente nella configurazione corrente.
JMSCS0004.useraction = Controllare che il file JAR che contiene il provider di messaggistica sia presente nel classpath o che sia stato registrato.
JMSCS0005 = Il gestore componenti non \u00e8 stato in grado di individuare un componente.
JMSCS0005.explanation = \u00c8 stata fatta una richiesta di utilizzare un componente che non \u00e8 presente nella configurazione corrente.
JMSCS0005.useraction = Controllare che il file JAR che contiene il componente sia presente nel classpath o che sia stato registrato.
JMSCS0006 = Si \u00e8 verificato un problema interno. Le informazioni di diagnostica per il servizio sono state scritte in ''{0}''. Terminare l''applicazione poich\u00e9 il prodotto \u00e8 in uno stato interno incongruente.
JMSCS0006.useraction = Salvare tutti i file di output generati e utilizzare il sito dell'assistenza WMQ: http://www.ibm.com/software/integration/wmq/support/, o l'ISA(IBM Support Assistant): http://www.ibm.com/software/support/isa/, per vedere se \u00e8 gi\u00e0 disponibile una soluzione.  In caso di impossibilit\u00e0 di trovare una corrispondenza, contattare il centro assistenza IBM.
JMSCS0007 = SPIEGAZIONE:
JMSCS0008 = AZIONE:

JMSCS0009 = Non \u00e8 stato possibile caricare le propriet\u00e0 del sistema a causa di una AccessControlException.
JMSCS0009.explanation = PropertyStore non \u00e8 stato in grado di eseguire una query delle propriet\u00e0 del sistema perch\u00e9 la politica di sicurezza non lo consente.
JMSCS0009.useraction = Modificare la politica di sicurezza per consentire la lettura delle propriet\u00e0 del sistema.

JMSCS0010 = I servizi comuni di IBM Messaging Client non sono riusciti a localizzare e inizializzare un componente a causa dell''eccezione ''{0}''.
JMSCS0010.inserts = XMSC_INSERT_EXCEPTION

JMSCS0011 = Messaggio
JMSCS0012 = Classe
JMSCS0013 = Stack
JMSCS0014 = Causato da [{0}] --> Messaggio
JMSCS0015 = Oggetto comune in stato non valido

JMSCS0016 = Operazione del gestore comandi non riuscita.

JMSC0017 = File di configurazione CommonServices letto da ''{0}''
JMSC0017.inserts = XMSC_CONFIG_FILE_LOCATION

JMSCS0018 = \u00c8 stato fornito un nome propriet\u00e0 sconosciuto ''{0}''
JMSCS0018.inserts = XMSC_PROPERTY_NAME

JMSCS0019 = La propriet\u00e0 ''{0}'' \u00e8 gi\u00e0 stata impostata da ''{1}''. Non pu\u00f2 essere aggiornata.
JMSCS0019.inserts = XMSC_PROPERTY_NAME,XMSC_PROPERTY_SOURCE

JMSCS0020 = La classe non pu\u00f2 essere serializzata o deserializzata poich\u00e9 non \u00e8 stata inclusa nella whitelist ''{0}''.
JMSCS0020.inserts = XMSC_WHITELIST

JMSCS0021 = Impossibile aprire il file di whitelist ''{0}''
JMSCS0021.inserts = XMSC_WHITELIST

JMSCS0022 = Il file di whitelist ''{0}'' gi\u00e0 esiste e non pu\u00f2 essere sovrascritto
JMSCS0022.inserts = XMSC_WHITELIST

JMSCS0023 = la whitelist ''{0}'' ha una voce non valida
JMSCS0023.inserts = XMSC_WHITELIST

JMSCS0024 = Non \u00e8 stato possibile scrivere il file di whitelist

JMSCS0025 = Whitelist ENFORCEMENT abilitata - si sta utilizzando il file di whitelist ''{0}'' per convalidare le operazioni di serializzazione e deserializzazione ObjectMessage - la struttura ad albero della whitelist \u00e8 ''{1}''
JMSCS0025.inserts = XMSC_WHITELIST,XMSC_WHITELIST_CONTENTS

JMSCS0026 = Whitelist DISCOVERY abilitata - si sta utilizzando il file di whitelist ''{0}'' per registrare le operazioni di serializzazione e deserializzazione ObjectMessage
JMSCS0026.inserts = XMSC_WHITELIST

JMSCS0027 = Whitelist ENFORCEMENT abilitata - si sta utilizzando la whitelist ''{0}'' per convalidare le operazioni di serializzazione e deserializzazione ObjectMessage
JMSCS0027.inserts = XMSC_WHITELIST

JMSCS0028 = WhiteList DISCOVERY richiesta ma il nome file di whitelist ''{0}'' non \u00e8 un URI di file
JMSCS0028.inserts = XMSC_WHITELIST

JMSCS0029 = Non \u00e8 stata abilitata alcuna funzionalit\u00e0 di whitelist; le propriet\u00e0 non erano state impostate oppure le autorizzazioni di sicurezza ne impediscono la lettura
