# %Z% %W% %I% %E% %U%
#
#   <copyright 
#   notice="oco-source" 
#   pids="5724-H72" 
#   years="2008,2017" 
#   crc="775383328" > 
#   IBM Confidential 
#    
#   OCO Source Materials 
#    
#   5724-H72,5655-R36,5655-L82,5724-L26, 
#    
#   (C) Copyright IBM Corp. 2008, 2017 
#    
#   The source code for the program is not published 
#   or otherwise divested of its trade secrets, 
#   irrespective of what has been deposited with the 
#   U.S. Copyright Office. 
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR

JMSCC0001 = Se ha producido un error interno. No ha sido posible crear una instancia de una clase necesaria: ''{0}''.
JMSCC0001.useraction = Guarde todos los archivos de salida generados y \
utilice el sitio de Soporte de MQ: http://www.ibm.com/software/integration/wmq/support/, o IBM Support Assistant (ISA): http://www.ibm.com/software/support/isa/, para ver si ya \
hay una soluci\u00f3n disponible.  Si no puede encontrar una soluci\u00f3n, p\u00f3ngase en contacto con el centro de soporte de IBM.
JMSCC0001.inserts = XMSC_INSERT_EXCEPTION

JMSCC0002 = IBM MQ classes for JMS ha intentado establecer un ID de cliente no v\u00e1lido en una conexi\u00f3n.
JMSCC0002.explanation = Una aplicaci\u00f3n ha intentado establecer la propiedad de ID de cliente de una conexi\u00f3n v\u00e1lida en nulo, o ha intentado establecer la propiedad clientId de una conexi\u00f3n no v\u00e1lida.
JMSCC0002.useraction = La propiedad clientId de una conexi\u00f3n s\u00f3lo se puede establecer una vez, s\u00f3lo en un valor no nulo y s\u00f3lo antes de que se utilice la conexi\u00f3n. Aseg\u00farese de que la conexi\u00f3n sea v\u00e1lida y de que el ID de cliente no sea nulo.
JMSCC0002.exception = com.ibm.msg.client.jms.DetailedInvalidClientIDException

JMSCC0003 = El valor especificado ''{1}'' no est\u00e1 permitido para ''{0}''.
JMSCC0003.explanation = El valor indicado no est\u00e1 permitido para la propiedad especificada.
JMSCC0003.useraction = Cambie el valor a un valor que est\u00e9 soportado para la propiedad.
JMSCC0003.inserts = XMSC_INSERT_NAME, XMSC_INSERT_VALUE
JMSCC0003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0004 = Llamar a receive no devolver\u00e1 un mensaje para una conexi\u00f3n que est\u00e9 detenida.
JMSCC0004.explanation = La especificaci\u00f3n de JMS declara que llamar al m\u00e9todo receive() no debe devolver un mensaje si la conexi\u00f3n est\u00e1 detenida. Llamar a receiveNoWait o receive con un tiempo de espera devolver\u00e1 nulo cuando se exceda el tiempo de espera. Llamar a receive sin ning\u00fan tiempo de espera no devolver\u00e1 el control hasta que la conexi\u00f3n se inicie o se cierre o la aplicaci\u00f3n termine.
JMSCC0004.useraction = Inicie la conexi\u00f3n llamando a javax.jms.Connection.start(). 

# JMSCC0005 is the same as JMSCC0003 except that JMSCC0003 throws a InvalidDestinationException
# whereas JMSCC0005 throws an JMSException.
JMSCC0005 = El valor especificado ''{1}'' no est\u00e1 permitido para ''{0}''.
JMSCC0005.explanation = El valor indicado no est\u00e1 permitido para la propiedad especificada.
JMSCC0005.useraction = Cambie el valor a un valor que est\u00e9 soportado para la propiedad.
JMSCC0005.inserts = XMSC_INSERT_NAME, XMSC_INSERT_VALUE

JMSCC0007 = Se ha recibido una excepci\u00f3n durante la llamada al m\u00e9todo ''{1}'': ''{0}''.
JMSCC0007.explanation = Otro componente ha emitido una excepci\u00f3n mientras el m\u00e9todo especificado estaba en ejecuci\u00f3n.
JMSCC0007.useraction = Consulte la excepci\u00f3n enlazada para obtener m\u00e1s informaci\u00f3n.
JMSCC0007.inserts = XMSC_INSERT_EXCEPTION, XMSC_INSERT_METHOD

JMSCC0008 = Esta conexi\u00f3n est\u00e1 cerrada.
JMSCC0008.explanation = Una aplicaci\u00f3n ha llamado a un m\u00e9todo que no debe utilizarse una vez que la conexi\u00f3n est\u00e9 cerrada.
JMSCC0008.useraction = Aseg\u00farese de que la conexi\u00f3n no est\u00e9 cerrada antes de llamar al m\u00e9todo.
JMSCC0008.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0011 = El m\u00e9todo ''{0}'' no est\u00e1 permitido en este contenedor.
JMSCC0011.explanation = Se ha llamado a un m\u00e9todo que no est\u00e1 permitido en el contenedor actual.
JMSCC0011.useraction = Elimine la llamada al m\u00e9todo.
JMSCC0011.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0011.inserts = XMSC_INSERT_METHOD

JMSCC0012 = Es posible que no se pueda llamar al m\u00e9todo ''{0}'' desde una Escucha {1}.
JMSCC0012.explanation = Se ha llamado a un m\u00e9todo que no est\u00e1 permitido en el contexto actual.
JMSCC0012.useraction = Elimine la llamada al m\u00e9todo.
JMSCC0012.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0012.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_NAME

JMSCC0014 = No es v\u00e1lido llamar al m\u00e9todo ''{0}'' en una sesi\u00f3n sin transacci\u00f3n.
JMSCC0014.explanation = La aplicaci\u00f3n ha llamado a un m\u00e9todo que no debe llamarse en una sesi\u00f3n sin transacci\u00f3n.
JMSCC0014.useraction = Cambie el programa de aplicaci\u00f3n para eliminar este comportamiento.
JMSCC0014.inserts = XMSC_INSERT_METHOD
JMSCC0014.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0020 = Esta sesi\u00f3n est\u00e1 cerrada.
JMSCC0020.explanation = Una aplicaci\u00f3n ha llamado a un m\u00e9todo que no debe utilizarse una vez que la sesi\u00f3n est\u00e9 cerrada.
JMSCC0020.useraction = Aseg\u00farese de que la sesi\u00f3n no est\u00e9 cerrada antes de llamar al m\u00e9todo.
JMSCC0020.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0021 = No es v\u00e1lido llamar al m\u00e9todo ''{0}'' en una sesi\u00f3n con transacci\u00f3n.
JMSCC0021.explanation = La aplicaci\u00f3n ha llamado a un m\u00e9todo que no debe llamarse en una sesi\u00f3n con transacci\u00f3n.
JMSCC0021.useraction = Cambie el programa de aplicaci\u00f3n para eliminar este comportamiento.
JMSCC0021.inserts = XMSC_INSERT_METHOD
JMSCC0021.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0026 = Este productor de mensajes est\u00e1 cerrado.
JMSCC0026.explanation = Una aplicaci\u00f3n ha llamado a un m\u00e9todo que no debe utilizarse una vez que el productor de mensajes est\u00e9 cerrado.
JMSCC0026.useraction = Aseg\u00farese de que el productor de mensajes no est\u00e9 cerrado antes de llamar al m\u00e9todo.
JMSCC0026.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0029 = Debe especificarse un destino al enviar desde este productor.
JMSCC0029.explanation = El productor se ha creado con un destino nulo y no se ha proporcionado un destino en el m\u00e9todo send.
JMSCC0029.useraction = Modifique la aplicaci\u00f3n para que se utilice un m\u00e9todo send() que especifique un destino, o especifique un destino al crear el productor.
JMSCC0029.exception = java.lang.UnsupportedOperationException

JMSCC0030 = No es v\u00e1lido especificar un destino al enviar desde este productor.
JMSCC0030.explanation = El productor se ha creado con un destino especificado; no es v\u00e1lido especificar de nuevo un destino al enviar un mensaje.
JMSCC0030.useraction = Modifique la aplicaci\u00f3n para que se utilice un m\u00e9todo send que no especifique un destino, o especifique un destino nulo al crear el productor.
JMSCC0030.exception = java.lang.UnsupportedOperationException

JMSCC0031 = No es v\u00e1lido especificar una escucha de terminaci\u00f3n nula.
JMSCC0031.explanation = La llamada al m\u00e9todo de env\u00edo inclu\u00eda una escucha de terminaci\u00f3n, pero la escucha era nula.
JMSCC0031.useraction = Cambie la aplicaci\u00f3n para que se utilice un m\u00e9todo de env\u00edo que no especifique ninguna escucha de terminaci\u00f3n o especifique una escucha de terminaci\u00f3n que no sea nula al realizar una llamada de env\u00edo.
JMSCC0031.exception = java.lang.IllegalArgumentException

JMSCC0032 = Este consumidor de mensajes est\u00e1 cerrado.
JMSCC0032.explanation = Una aplicaci\u00f3n ha llamado a un m\u00e9todo que no debe utilizarse una vez que el consumidor de mensajes est\u00e9 cerrado.
JMSCC0032.useraction = Aseg\u00farese de que el consumidor de mensajes no est\u00e9 cerrado antes de llamar al m\u00e9todo.
JMSCC0032.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0033 = No se permite una llamada a un m\u00e9todo s\u00edncrono cuando una sesi\u00f3n se est\u00e1 utilizando de forma as\u00edncrona: ''{0}''.
JMSCC0033.explanation = La especificaci\u00f3n de JMS no permite el uso de una sesi\u00f3n para m\u00e9todos s\u00edncronos cuando se est\u00e1 ejecutando la entrega de mensajes asincrona.
JMSCC0033.useraction = Cree una sesi\u00f3n aparte si desea utilizar m\u00e9todos s\u00edncronos y entrega as\u00edncrona simult\u00e1neamente.
JMSCC0033.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0033.inserts = XMSC_INSERT_METHOD

JMSCC0034 = El mecanismo de entrega as\u00edncrona est\u00e1 en estado incoherente en el m\u00e9todo: ''{0}''.
JMSCC0034.explanation = Se ha detectado una secuencia de sucesos inesperada durante la entrega de mensajes a un bean controlado por mensajes (MDB). Esto podr\u00eda deberse a errores en la aplicaci\u00f3n de programaci\u00f3n del cliente.
JMSCC0034.useraction = Compruebe, en los archivos de anotaciones del servidor de aplicaciones, si existen otros problemas asociados con el bean controlado por mensajes. Guarde todos los archivos de salida generados y \
utilice el sitio de Soporte de WMQ: \
http://www.ibm.com/software/integration/wmq/support/, o IBM Support \
Assistant (ISA): http://www.ibm.com/software/support/isa/, para ver si ya \
hay una soluci\u00f3n disponible.  Si no puede encontrar una soluci\u00f3n, p\u00f3ngase en contacto con el centro de soporte de IBM.
JMSCC0034.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0034.inserts = XMSC_INSERT_METHOD

JMSCC0037 = El m\u00e9todo MessageListener.onMessage() ha emitido una excepci\u00f3n de ejecuci\u00f3n.
JMSCC0037.explanation = Un consumidor de mensajes con un escucha de mensajes registrado ha recibido una excepci\u00f3n del m\u00e9todo onMessage().
JMSCC0037.useraction = El m\u00e9todo onMessage() deber\u00eda modificarse para evitar que emita excepciones.

JMSCC0038 = El usuario no tienen autorizaci\u00f3n para realizar esta operaci\u00f3n. Consulte la excepci\u00f3n enlazada para obtener detalles.
JMSCC0038.explanation = La excepci\u00f3n enlazada contiene detalles de la autorizaci\u00f3n que se requiere para realizar esta operaci\u00f3n.
JMSCC0038.useraction = El administrador debe otorgar la autorizaci\u00f3n necesaria al usuario pertinente.

JMSCC0039 = El tipo ''{0}'' no es v\u00e1lido para utilizarlo como la propiedad de objeto ''{1}''.
JMSCC0039.explanation = Una aplicaci\u00f3n ha intentado establecer una propiedad de objeto utilizando un tipo de objeto que no est\u00e1 permitido por la especificaci\u00f3n de JMS.
JMSCC0039.useraction = Utilice un tipo de objeto permitido. Las clases wrapper primitivas y los objetos String son tipos de objetos permitidos.
JMSCC0039.inserts = XMSC_INSERT_TYPE, XMSC_INSERT_PROPERTY
JMSCC0039.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0040 = Se ha producido una excepci\u00f3n al recibir un mensaje: ''{0}''.
JMSCC0040.explanation = Mientras se recib\u00eda un mensaje se ha emitido una excepci\u00f3n que ha hecho que la operaci\u00f3n no se realice satisfactoriamente.
JMSCC0040.useraction = Examine la excepci\u00f3n especificada y el objeto de excepci\u00f3n enlazada para obtener m\u00e1s informaci\u00f3n.
JMSCC0040.inserts = XMSC_INSERT_EXCEPTION
JMSCC0040.exception = com.ibm.msg.client.jms.internal.JmsQueueBrowserImpl.MessageConversionFailed

JMSCC0041 = La conversi\u00f3n del elemento ''{0}'' del tipo ''{1}'' al tipo ''{2}'' no est\u00e1 permitida.
JMSCC0041.explanation = La conversi\u00f3n entre los dos tipos de datos especificados no est\u00e1 permitida por la especificaci\u00f3n de JMS.
JMSCC0041.useraction = Recupere el elemento especificado utilizando una de las conversiones permitidas.
JMSCC0041.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE

JMSCC0042 = El campo de mensaje ''{0}'' no se ha establecido.
JMSCC0042.explanation = Una aplicaci\u00f3n ha intentado recuperar el valor de un campo que no se ha establecido.
JMSCC0042.useraction = Establezca el valor del campo antes de recuperarlo.
JMSCC0042.inserts = XMSC_INSERT_FIELD

JMSCC0043 = No est\u00e1 permitido un nombre de campo que sea nulo o una serie vac\u00eda.
JMSCC0043.explanation = Una aplicaci\u00f3n de usuario ha intentado establecer un campo utilizando un nombre que no es v\u00e1lido, por ejemplo, nulo o serie vac\u00eda.
JMSCC0043.useraction = Utilice un nombre de campo v\u00e1lido.
JMSCC0043.exception = java.lang.IllegalArgumentException

JMSCC0044 = No se permite llamar al m\u00e9todo ''{0}'' en el mensaje porque el cuerpo del mensaje es de s\u00f3lo lectura.
JMSCC0044.explanation = Una aplicaci\u00f3n de usuario ha intentado establecer un cuerpo de mensaje de s\u00f3lo lectura.
JMSCC0044.useraction = Cambie el programa de aplicaci\u00f3n para eliminar este comportamiento o llame primero al m\u00e9todo clearBody().
JMSCC0044.inserts = XMSC_INSERT_METHOD
JMSCC0044.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSCC0045 = No se permite llamar al m\u00e9todo ''{0}'' en el mensaje porque las propiedades del mensaje son de s\u00f3lo lectura.
JMSCC0045.explanation = Una aplicaci\u00f3n de usuario ha intentado establecer una propiedad de mensaje de s\u00f3lo lectura.
JMSCC0045.useraction = Cambie el programa de aplicaci\u00f3n para eliminar este comportamiento o llame primero al m\u00e9todo clearProperties().
JMSCC0045.inserts = XMSC_INSERT_METHOD
JMSCC0045.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSCC0046 = No se permite llamar al m\u00e9todo ''{0}'' en el mensaje porque el cuerpo del mensaje es de s\u00f3lo escritura.
JMSCC0046.explanation = Una aplicaci\u00f3n de usuario ha intentado leer un cuerpo de mensaje de s\u00f3lo escritura.
JMSCC0046.useraction = Cambie el programa de aplicaci\u00f3n para eliminar este comportamiento o llame primero al m\u00e9todo reset().
JMSCC0046.inserts = XMSC_INSERT_METHOD
JMSCC0046.exception = com.ibm.msg.client.jms.DetailedMessageNotReadableException

JMSCC0048 = Se ha producido un error al intentar crear el mensaje. Consulte la excepci\u00f3n enlazada para obtener m\u00e1s detalles.
JMSCC0048.explanation = No ha sido posible crear el mensaje debido a un error.
JMSCC0048.useraction = Examine la excepci\u00f3n enlazada para obtener detalles del error.

JMSCC0049 = El nombre de propiedad ''{0}'' no es un identificador Java(tm) v\u00e1lido.
JMSCC0049.explanation = El nombre de propiedad suministrado no se ajusta al formato permitido que se describe en la especificaci\u00f3n de JMS.
JMSCC0049.useraction = Compruebe los caracteres utilizados en el nombre de propiedad y modif\u00edquelos seg\u00fan sea necesario.
JMSCC0049.inserts = XMSC_INSERT_PROPERTY
JMSCC0049.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0050 = El nombre de propiedad ''{0}'' est\u00e1 reservado y no se puede establecer.
JMSCC0050.explanation = El nombre de propiedad suministrado empieza con el prefijo JMS pero no es una de las propiedades soportadas que se pueden establecer.
JMSCC0050.useraction = Compruebe el nombre de propiedad y corrija los errores.
JMSCC0050.inserts = XMSC_INSERT_PROPERTY
JMSCC0050.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0051 = La propiedad ''{0}'' debe establecerse utilizando el tipo ''{1}'', no ''{2}''.
JMSCC0051.explanation = Las propiedades JMS_IBM s\u00f3lo se pueden establecer utilizando un tipo de variable espec\u00edfico.
JMSCC0051.useraction = Corrija el c\u00f3digo de la aplicaci\u00f3n para utilizar el tipo de variable requerido al establecer esta propiedad JMS_IBM.
JMSCC0051.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE
JMSCC0051.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0052 = Se ha producido una excepci\u00f3n al serializar el objeto: ''{0}''.
JMSCC0052.explanation = No ha sido posible serializar el objeto debido a la excepci\u00f3n.
JMSCC0052.useraction = Examine la excepci\u00f3n enlazada para obtener detalles del error.
JMSCC0052.inserts = XMSC_INSERT_EXCEPTION
JMSCC0052.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0053 = Se ha producido una excepci\u00f3n al deserializar un mensaje, excepci\u00f3n: ''{0}''.
JMSCC0053.explanation = No ha sido posible deserializar el mensaje debido a la excepci\u00f3n indicada.
JMSCC0053.useraction = Examine la excepci\u00f3n enlazada para obtener detalles del error.
JMSCC0053.inserts = XMSC_INSERT_EXCEPTION
JMSCC0053.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0054 = El examinador de colas no tiene ning\u00fan mensaje disponible.
JMSCC0054.explanation = Una aplicaci\u00f3n de usuario ha solicitado un mensaje de un examinador de colas cuando no hab\u00eda ninguno disponible.
JMSCC0054.useraction = Aseg\u00farese de que la aplicaci\u00f3n no llame a este m\u00e9todo cuando no haya ning\u00fan mensaje disponible, o aseg\u00farese de que la aplicaci\u00f3n maneja esta excepci\u00f3n.
JMSCC0054.exception = java.util.NoSuchElementException

JMSCC0055 = Este examinador de colas est\u00e1 cerrado.
JMSCC0055.explanation = Una aplicaci\u00f3n ha llamado a un m\u00e9todo que no debe utilizarse una vez que el examinador de colas est\u00e9 cerrado.
JMSCC0055.useraction = Aseg\u00farese de que el examinador de colas no est\u00e9 cerrado antes de llamar al m\u00e9todo.
JMSCC0055.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0059 = El almacenamiento intermedio de lectura es nulo.
JMSCC0059.explanation = Se ha pasado una referencia nula al m\u00e9todo StreamMessage.readBytes(), por lo que no se ha podido devolver ning\u00fan dato.
JMSCC0059.useraction = Pase un almacenamiento intermedio de tama\u00f1o adecuado al m\u00e9todo readBytes().
JMSCC0059.exception = java.lang.NullPointerException

JMSCC0060 = Se ha alcanzado el final de la corriente de datos del mensaje.
JMSCC0060.explanation = Se ha alcanzado el final del contenido de mensaje. Esto es normal si la aplicaci\u00f3n que lee el mensaje no sabe la cantidad de datos que ha de esperar.
JMSCC0060.useraction = No se requiere ninguna acci\u00f3n.
JMSCC0060.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCC0061 = La matriz de bytes StreamMessage se ha le\u00eddo de forma incompleta.
JMSCC0061.explanation = Se ha intentado leer el siguiente campo de la corriente de datos a pesar de que una matriz de bytes se ha le\u00eddo parcialmente.
JMSCC0061.useraction = Aseg\u00farese de que el c\u00f3digo de usuario completa la lectura de cualquier matriz de bytes antes de intentar leer el siguiente campo.
JMSCC0061.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0062 = No es posible devolver nulo como un car\u00e1cter.
JMSCC0062.explanation = Se ha intentado leer un campo StreamMessage que contiene nulo utilizando el m\u00e9todo readChar().
JMSCC0062.useraction = Evite leer nulos utilizando el m\u00e9todo readChar().
JMSCC0062.exception = java.lang.NullPointerException

JMSCC0063 = La codificaci\u00f3n no es v\u00e1lida para la serie ''{0}''.
JMSCC0063.explanation = El valor suministrado no tiene una codificaci\u00f3n conocida.
JMSCC0063.useraction = Aseg\u00farese de que la aplicaci\u00f3n suministre un valor de la lista definida de codificaciones.
JMSCC0063.inserts = JMS_IBM_Encoding

JMSCC0064 = Se ha producido un error interno al escribir en la corriente de datos.
JMSCC0064.explanation = Se ha producido un problema con las corrientes de datos utilizadas para la conversi\u00f3n de formato de valores flotantes y dobles.
JMSCC0064.useraction = Guarde todos los archivos de salida generados y \
utilice el sitio de Soporte de WMQ: \
http://www.ibm.com/software/integration/wmq/support/, o IBM Support \
Assistant (ISA): http://www.ibm.com/software/support/isa/, para ver si ya \
hay una soluci\u00f3n disponible.  Si no puede encontrar una soluci\u00f3n, p\u00f3ngase en contacto con el centro de soporte de IBM.

JMSCC0065 = Se ha intentado leer m\u00e1s all\u00e1 del final del \
mensaje.
JMSCC0065.explanation = Se ha intentado leer m\u00e1s all\u00e1 del final del \
mensaje. Esto puede ser una condici\u00f3n normal si una aplicaci\u00f3n se ha codificado para leer datos de longitud variable utilizando la especificaci\u00f3n JMS 1.0.2.
JMSCC0065.useraction = Si es necesario, vuelva a codificar la aplicaci\u00f3n para utilizar el nuevo m\u00e9todo getBodyLength().
JMSCC0065.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCC0066 = La conversi\u00f3n UTF-8 ha fallado.
JMSCC0066.explanation = Ha surgido un problema durante la lectura o escritura de una serie UTF-8. El problema m\u00e1s com\u00fan es intentar escribir una serie con una longitud superior a 65535 caracteres.
JMSCC0066.useraction = Consulte la excepci\u00f3n enlazada para obtener m\u00e1s informaci\u00f3n.
JMSCC0066.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0067 = Se ha producido un error interno. Hay un problema al escribir en el mensaje.
JMSCC0067.explanation = Se ha encontrado un error al intentar escribir un elemento en el mensaje.
JMSCC0067.useraction = Guarde todos los archivos de salida generados y \
utilice el sitio de Soporte de WMQ: \
http://www.ibm.com/software/integration/wmq/support/, o IBM Support \
Assistant (ISA): http://www.ibm.com/software/support/isa/, para ver si ya \
hay una soluci\u00f3n disponible.  Si no puede encontrar una soluci\u00f3n, p\u00f3ngase en contacto con el centro de soporte de IBM.
JMSCC0067.exception = com.ibm.msg.client.jms.DetailedResourceAllocationException

JMSCC0068 = La propiedad ''{0}'' se debe establecer utilizando un valor de tipo ''{1}'' o un tipo convertible a este tipo seg\u00fan la especificaci\u00f3n de JMS. No se puede convertir a partir del tipo proporcionado ''{2}''. 
JMSCC0068.explanation = La conversi\u00f3n entre los dos tipos de datos especificados no est\u00e1 permitida por la especificaci\u00f3n de JMS.
JMSCC0068.useraction = Establezca la propiedad mencionada utilizando una de las conversiones permitidas.
JMSCC0068.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC0068.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE

JMSCC0069 = La propiedad ''{0}'' se debe establecer utilizando un valor de tipo ''{1}''. No se puede convertir a partir del tipo proporcionado ''{2}'' con el valor ''{3}''. 
JMSCC0069.explanation = Se ha encontrado un error al intentar establecer una propiedad de mensaje.
JMSCC0069.useraction = Establezca la propiedad mencionada utilizando una de las conversiones permitidas con un valor apropiado.
JMSCC0069.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC0069.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE, XMSC_INSERT_VALUE

JMSCC0070 = Se ha producido un error interno. Ha habido un problema al establecer la propiedad de mensaje JMS ''{0}'', tipo esperado ''{1}'', utilizando un objeto de tipo ''{2}''.
JMSCC0070.explanation = Se ha encontrado un error al intentar establecer una propiedad de mensaje.
JMSCC0070.useraction = Guarde todos los archivos de salida generados y \
utilice el sitio de Soporte de WMQ: \
http://www.ibm.com/software/integration/wmq/support/, o IBM Support \
Assistant (ISA): http://www.ibm.com/software/support/isa/, para ver si ya \
hay una soluci\u00f3n disponible.  Si no puede encontrar una soluci\u00f3n, p\u00f3ngase en contacto con el centro de soporte de IBM.
JMSCC0070.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC0070.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE

JMSCC0083 = Se ha proporcionado un objeto incorrecto de tipo ''{0}''.
JMSCC0083.explanation = Se ha proporcionado un objeto al m\u00e9todo writeObject() que no era un tipo wrapper primitivo de Java(tm).
JMSCC0083.useraction = Corrija la aplicaci\u00f3n para asegurarse de que s\u00f3lo los objetos de los tipos permitidos se pasan como par\u00e1metros al m\u00e9todo writeObject().
JMSCC0083.inserts = XMSC_INSERT_OBJECT
JMSCC0083.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0084 = No se ha establecido una propiedad de nombre ''{0}''.
JMSCC0084.inserts = XMSC_INSERT_PROPERTY

JMSCC0085 = No se ha especificado un destino.
JMSCC0085.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0086 = El tama\u00f1o de lote ''{0}'' era incorrecto.
JMSCC0086.inserts = XMSC_INSERT_BATCH_SIZE

JMSCC0087 = No se ha especificado una agrupaci\u00f3n de sesiones de servidor.

JMSCC0088 = No se ha podido obtener una sesi\u00f3n de la agrupaci\u00f3n de sesiones de servidor.

JMSCC0089 = La sesi\u00f3n ''{0}'' no era v\u00e1lida.
JMSCC0089.inserts = XMSC_INSERT_SESSION

JMSCC0091 = La f\u00e1brica de proveedor para el tipo de conexi\u00f3n ''{0}'' no se ha podido cargar.
JMSCC0091.inserts = XMSC_CONNECTION_TYPE

JMSCC0092 = Se esperaba que el tipo de conexi\u00f3n fuera ''{0}'' pero en cambio era ''{1}''.
JMSCC0092.inserts = XMSC_CONNECTION_TYPE_NAME, XMSC_CONNECTION_TYPE
JMSCC0092.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0093 = El destino no era v\u00e1lido. La suscripci\u00f3n duradera a un destino temporal con tipo ''{0}'' y nombre ''{1}'' no se puede crear.
JMSCC0093.inserts = XMSC_INSERT_TYPE, XMSC_DESTINATION_NAME
JMSCC0093.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0094 = Este examinador de conexiones est\u00e1 cerrado.
JMSCC0094.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0095 = El nombre de destino ''{0}'' no es v\u00e1lido.
JMSCC0095.explanation = El nombre de destino especificado no sigue la sintaxis de destino publicada.
JMSCC0095.useraction = Corrija el nombre de destino especificado e int\u00e9ntelo de nuevo.
JMSCC0095.inserts = XMSC_DESTINATION_NAME
JMSCC0095.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0097 = Modalidad de acuse de recibo incorrecta ''{0}''. Se solicit\u00f3 a Connection.createSession() que crease una sesi\u00f3n sin transacci\u00f3n (su valor era false) pero la modalidad de acuse de recibo no era AUTO_ACKNOWLEDGE, DUPS_OK_ACKNOWLEDGE o CLIENT_ACKNOWLEDGE.
JMSCC0097.inserts = XMSC_ACKNOWLEDGE_MODE

JMSCC0098 = El mensaje no puede ser nulo.
JMSCC0098.useraction = Especifique un mensaje no nulo.
JMSCC0098.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0099 = El destino ''{0}'' no es una instancia de com.ibm.msg.client.jms.JmsDestination.
JMSCC0099.useraction = Especifique una instancia de com.ibm.msg.client.jms.JmsDestination.
JMSCC0099.inserts = XMSC_DESTINATION_NAME
JMSCC0099.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0100 = El nombre de suscripci\u00f3n no puede ser nulo.
JMSCC0100.useraction = Especifique un nombre de suscripci\u00f3n no nulo.
JMSCC0100.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0101 = El ID de cliente no puede ser nulo.
JMSCC0101.useraction = Especifique un ID de cliente no nulo.
JMSCC0101.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0102 = El nombre de propiedad ''{0}'' en el mensaje no es un identificador Java(tm) v\u00e1lido.
JMSCC0102.explanation = El nombre de propiedad suministrado no se ajusta al formato permitido que se describe en la especificaci\u00f3n de JMS.
JMSCC0102.useraction = Compruebe los caracteres utilizados en el nombre de propiedad y modif\u00edquelos seg\u00fan sea necesario.
JMSCC0102.inserts = XMSC_INSERT_PROPERTY
JMSCC0102.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0103 = Se ha proporcionado un objeto nulo.
JMSCC0103.explanation = Se ha proporcionado un objeto al m\u00e9todo writeObject() que era nulo.
JMSCC0103.useraction = Corrija la aplicaci\u00f3n para asegurarse de que s\u00f3lo se pasan objetos no nulos como par\u00e1metros al m\u00e9todo writeObject().
JMSCC0103.exception = java.lang.NullPointerException

JMSCC0105 = La conversi\u00f3n del elemento ''{0}'' del tipo ''{1}'' al tipo ''{2}'' no est\u00e1 permitida.
JMSCC0105.explanation = La conversi\u00f3n entre los dos tipos de datos especificados no est\u00e1 permitida por la especificaci\u00f3n de JMS.
JMSCC0105.useraction = Recupere el elemento especificado utilizando una de las conversiones permitidas.
JMSCC0105.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE
JMSCC0105.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0106 = No se ha podido obtener un recurso XA. ''{0}''.
JMSCC0106.useraction = Consulte la causa del error para obtener m\u00e1s informaci\u00f3n.
JMSCC0106.inserts = XMSC_INSERT_EXCEPTION
JMSCC0106.exception = java.lang.RuntimeException

JMSCC0107 = Tiempo de espera incorrecto ''{0}''.
JMSCC0107.explanation = El tiempo de espera debe ser positivo o cero, medido en milisegundos.
JMSCC0107.useraction = No pase un tiempo de espera negativo.
JMSCC0107.inserts = XMSC_INSERT_TIMEOUT

# Message changed for APAR IT16300
JMSCC0108 = Las clases IBM MQ para JMS hab\u00edan detectado un mensaje, listo para la entrega as\u00edncrona a una aplicaci\u00f3n. Cuando se intent\u00f3 la entrega, el mensaje ya no estaba disponible. Consulte el tema "Troubleshooting JMSCC0108 messages" (Resoluci\u00f3n de problemas de mensajes JMSCC0108) en la secci\u00f3n IBM MQ V9.0 de IBM Knowledge Center para obtener las causas posibles y las acciones.
JMSCC0108.explanation = Una hebra interna dentro de las clases IBM MQ para JMS hab\u00eda detectado un mensaje y solicitado que otra hebra interna obtuviera el mensaje y lo entregara a una aplicaci\u00f3n para su proceso. Cuando esa hebra intent\u00f3 obtener el mensaje, ya no estaba disponible.
JMSCC0108.useraction = Consulte el tema "Troubleshooting JMSCC0108 messages" (Resoluci\u00f3n de problemas de mensajes JMSCC0108) en la secci\u00f3n IBM MQ V9.0 de IBM Knowledge Center para obtener m\u00e1s informaci\u00f3n.

JMSCC0109 = Un bean controlado por mensajes ha emitido una excepci\u00f3n de ejecuci\u00f3n ''{0}''.
JMSCC0109.explanation = Esto podr\u00eda indicar un problema del escucha de mensajes.
JMSCC0109.useraction = Si la excepci\u00f3n de ejecuci\u00f3n la ha generado el escucha de mensajes sin motivo, utilice la excepci\u00f3n enlazada para determinar la causa del problema.
JMSCC0109.inserts = XMSC_INSERT_EXCEPTION
JMSCC0109.exception = java.lang.RuntimeException

JMSCC0110 = Se ha capturado una excepci\u00f3n ''{0}'' al procesar un mensaje para su entrega a un bean controlado por mensajes.
JMSCC0110.useraction = Examine la excepci\u00f3n enlazada para obtener m\u00e1s informaci\u00f3n.
JMSCC0110.inserts = XMSC_INSERT_EXCEPTION
JMSCC0110.exception = java.lang.RuntimeException

JMSCC0111 = IBM MQ classes for JMS ha intentado establecer un ID de cliente preexistente en una conexi\u00f3n o JMSContext.
JMSCC0111.explanation = Una aplicaci\u00f3n ha intentado establecer la propiedad de ID de cliente de una conexi\u00f3n v\u00e1lida o JMSContext en el valor ''{0}'' pero dicho valor ya \
estaba en uso.\n\
El ID de cliente ya se hab\u00eda establecido mediante {1}.
JMSCC0111.useraction = Aseg\u00farese de que la conexi\u00f3n sea v\u00e1lida y de que el ID de cliente sea exclusivo.
JMSCC0111.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_STRING
JMSCC0111.exception = com.ibm.msg.client.jms.DetailedInvalidClientIDException

JMSCC0112 = Este proveedor no admite el retardo de entrega
JMSCC0112.explanation = Una aplicaci\u00f3n ha intentado definir un retardo de entrega pero el proveedor JMS no lo admite

JMSCC0113 = El retardo de entrega debe ser menor que el tiempo de vida
JMSCC0113.explanation = Una aplicaci\u00f3n ha intentado establecer un retardo de entrega, pero el tiempo de vida no era superior a este retardo.

JMSCC0114 = El retardo de la entrega no se admite para publicaciones retenidas
JMSCC0114.explanation = Una aplicaci\u00f3n ha intentado definir un retardo de entrega en un mensaje retenido, no se admite

JMSCC0115 = El retardo de entrega no puede utilizarse con la agrupaci\u00f3n
JMSCC0115.explanation = Una aplicaci\u00f3n ha intentado establecer un retardo de entrega en un mensaje que tambi\u00e9n ten\u00eda establecido un ID de grupo y/o un n\u00famero de secuencia de grupo, lo que no se admite

# Message for FFST - additional fields not required
JMSCC1026 = Se ha emitido una excepci\u00f3n mientras el escucha de excepciones del usuario estaba ejecut\u00e1ndose.

# Message for FFST - additional fields not required
JMSCC1027 = El escucha de excepciones no se ha ejecutado.

JMSCC1069 = La operaci\u00f3n para una sesi\u00f3n con transacci\u00f3n XA no era v\u00e1lida.
JMSCC1069.explanation = La modalidad de acuse de recibo para una sesi\u00f3n con transacci\u00f3n no era v\u00e1lida. Commit(), rollback(), acknowledge() y recover() no son operaciones v\u00e1lidas en sesiones con transacci\u00f3n.
JMSCC1069.useraction = No llame a este m\u00e9todo cuando utilice XA.
JMSCC1069.exception = com.ibm.msg.client.jms.DetailedTransactionInProgressException

JMSCC1083 = Tama\u00f1o de lote de mensajes incorrecto (debe ser mayor que cero).
JMSCC1083.explanation = Se ha pasado un par\u00e1metro de tama\u00f1o de lote incorrecto a createConnectionConsumer() o createDurableConnectionConsumer().
JMSCC1083.useraction = Establezca un tama\u00f1o de lote mayor que cero. En un servidor de aplicaciones compatible con JEE, esto puede representar un error en el servidor de aplicaciones. Consulte la documentaci\u00f3n del servidor de aplicaciones.

JMSCC1084 = Se ha proporcionado una agrupaci\u00f3n de sesiones de servidor nula.
JMSCC1084.explanation = La agrupaci\u00f3n de sesiones de servidor especificada en createConnectionConsumer() o createDurableConnectionConsumer() era nula.
JMSCC1084.useraction = Establezca una agrupaci\u00f3n de sesiones de servidor adecuada. En un servidor de aplicaciones compatible con JEE, esto puede representar un error en el servidor de aplicaciones. Consulte la documentaci\u00f3n del servidor de aplicaciones.

JMSCC1093 = Se ha pasado un par\u00e1metro nulo.
JMSCC1093.explanation = Un objeto requerido por este m\u00e9todo no se ha inicializado correctamente.
JMSCC1093.useraction = Aseg\u00farese de que todos los par\u00e1metros que se pasan a este m\u00e9todo est\u00e1n inicializados correctamente.

JMSCC1094 = QuantityHint no es v\u00e1lido
JMSCC1094.explanation = Se ha intentado crear un examinador de conexiones con una indicaci\u00f3n de cantidad de datos incorrecta.
JMSCC1094.useraction = Especifique NO_DATA, HEADER_DATA o FULL_DATA.
JMSCC1094.exception = java.lang.IllegalArgumentException

JMSCC1096 = La referencia de mensaje no es v\u00e1lida.
JMSCC1096.explanation = Se ha pasado una referencia de mensaje formada incorrectamente a este m\u00e9todo. La referencia de mensaje debe ser una instancia de JmsMessageReference.
JMSCC1096.useraction = Aseg\u00farese de que se est\u00e1n utilizando referencias de mensaje correctas.

JMSCC1112 = La operaci\u00f3n para un objeto espec\u00edfico del dominio no era v\u00e1lida. La operaci\u00f3n ''{0}'' no es v\u00e1lida para el tipo ''{1}''.
JMSCC1112.explanation = Una aplicaci\u00f3n JMS ha intentado realizar una operaci\u00f3n en un objeto espec\u00edfico del dominio pero la operaci\u00f3n s\u00f3lo es v\u00e1lida para el otro dominio de mensajer\u00eda.
JMSCC1112.useraction = Aseg\u00farese de que los objetos y las operaciones JMS utilizados por su aplicaci\u00f3n son apropiados para el dominio de mensajer\u00eda requerido. Si su aplicaci\u00f3n utiliza ambos dominios de mensajer\u00eda, considere la posibilidad de utilizar objetos independientes del dominio en toda la aplicaci\u00f3n.
JMSCC1112.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_TYPE
JMSCC1112.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC1113 = La operaci\u00f3n para un objeto espec\u00edfico del dominio no era v\u00e1lida. La operaci\u00f3n ''{0}'' no es v\u00e1lida para el tipo ''{1}'' ya que la sesi\u00f3n es de tipo ''{2}''.
JMSCC1113.explanation = Una aplicaci\u00f3n JMS ha intentado realizar una operaci\u00f3n en un objeto espec\u00edfico del dominio pero la operaci\u00f3n s\u00f3lo es v\u00e1lida para el otro dominio de mensajer\u00eda.
JMSCC1113.useraction = Aseg\u00farese de que los objetos, las operaciones y las f\u00e1bricas de conexiones de JMS que utiliza la aplicaci\u00f3n son apropiados para el dominio de mensajer\u00eda requerido. Si su aplicaci\u00f3n utiliza ambos dominios de mensajer\u00eda, considere la posibilidad de utilizar objetos independientes del dominio en toda la aplicaci\u00f3n.
JMSCC1113.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_TYPE,XMSC_INSERT_SESSION
JMSCC1113.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC3002 = El destino de cola temporal ''{0}'' no se puede suprimir ya que todav\u00eda est\u00e1 en uso.
JMSCC3002.explanation = Se ha intentado suprimir un destino temporal mientras todav\u00eda lo est\u00e1 utilizando un consumidor o examinador.
JMSCC3002.useraction = Cierre todos los consumidores y examinadores que dependan del destino antes de suprimirlo.
JMSCC3002.inserts = XMSC_DESTINATION_NAME

JMSCC3003 = Uso incorrecto del destino temporal ''{0}'' .
JMSCC3003.explanation = El uso de destinos temporales por parte de consumidores de mensajes y examinadores est\u00e1 restringido a los que se crean utilizando la misma conexi\u00f3n.
JMSCC3003.useraction = Modifique la aplicaci\u00f3n para utilizar un destino temporal creado por la misma conexi\u00f3n e int\u00e9ntelo de nuevo.
JMSCC3003.inserts = XMSC_DESTINATION_NAME
JMSCC3003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException


JMSCC3019 = El destino temporal ya se ha suprimido ''{0}'' .
JMSCC3019.explanation = El destino temporal ya se hab\u00eda suprimido cuando se ha intentado utilizarlo.
JMSCC3019.useraction = Modifique la aplicaci\u00f3n para que no cierre el destino temporal o utilice un destino distinto.
JMSCC3019.inserts = XMSC_DESTINATION_NAME
JMSCC3019.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC3025 = El destino de tema temporal ''{0}'' no se puede suprimir ya que todav\u00eda est\u00e1 en uso.
JMSCC3025.explanation = Se ha intentado suprimir un destino temporal mientras todav\u00eda lo est\u00e1 utilizando un consumidor o examinador.
JMSCC3025.useraction = Cierre todos los consumidores y examinadores que dependan del destino antes de suprimirlo.
JMSCC3025.inserts = XMSC_DESTINATION_NAME

JMSCC3031 = No se puede establecer un ID de cliente despu\u00e9s de haber utilizado la conexi\u00f3n.
JMSCC3031.explanation = El ID de cliente de una conexi\u00f3n s\u00f3lo se puede establecer una vez y s\u00f3lo antes de que se utilice la conexi\u00f3n.
JMSCC3031.useraction = Establezca el ID de cliente antes de utilizar la conexi\u00f3n.
JMSCC3031.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC3032 = No est\u00e1 permitido restablecer el ID de cliente.
JMSCC3032.explanation = El ID de cliente de una conexi\u00f3n s\u00f3lo se puede establecer una vez y s\u00f3lo antes de que se utilice la conexi\u00f3n.
JMSCC3032.useraction = Establezca el ID de cliente antes de utilizar la conexi\u00f3n.
JMSCC3032.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC3033 = La llamada a close() dentro del escucha de mensajes debe haber llegado a un punto muerto.
JMSCC3033.explanation = Se ha llamado al m\u00e9todo close() desde un escucha de mensajes. No se permite que la llamada a close() devuelva el control mientras el escucha de mensajes est\u00e1 en ejecuci\u00f3n y, por lo tanto, estar\u00e1 en punto muerto.
JMSCC3033.useraction = Modifique la aplicaci\u00f3n para que no llame a ning\u00fan m\u00e9todo close() desde un escucha de mensajes.
JMSCC3033.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

# Log message
JMSCC3034 = Se hace caso omiso de la excepci\u00f3n ya que no hay ning\u00fan escucha de excepciones registrado: ''{0}''.
JMSCC3034.explanation = Se ha intentado enviar una excepci\u00f3n al escucha de excepciones de la conexi\u00f3n pero no se hab\u00eda registrado un escucha.
JMSCC3034.useraction = Debe registrarse un escucha de excepciones con la conexi\u00f3n para recibir sus excepciones.
JMSCC3034.inserts = XMSC_INSERT_EXCEPTION

# Log message
JMSCC3035 = Se hace caso omiso de la excepci\u00f3n ya que su tipo est\u00e1 fuera de los seleccionados para el escucha de excepciones: ''{0}''.
JMSCC3035.explanation = La excepci\u00f3n no est\u00e1 incluida dentro de los tipos seleccionados para su entrega al escucha de excepciones de la conexi\u00f3n y, por lo tanto, se ha pasado por alto.
JMSCC3035.useraction = Revise el valor de conexi\u00f3n ASYNC_EXCEPTIONS para asegurarse de que el filtrado de excepciones est\u00e1 establecido seg\u00fan lo previsto.
JMSCC3035.inserts = XMSC_INSERT_EXCEPTION

# Log message
JMSCC3036 = Se ha enviado una excepci\u00f3n al escucha de excepciones de la conexi\u00f3n: ''{0}''.
JMSCC3036.useraction = Revise los detalles de la excepci\u00f3n para obtener m\u00e1s informaci\u00f3n.
JMSCC3036.inserts = XMSC_INSERT_EXCEPTION

JMSCC3039 = El nombre de suscripci\u00f3n era nulo o una serie vac\u00eda.
JMSCC3039.explanation = Los consumidores de conexiones duraderas deben tener un nombre de suscripci\u00f3n que no sea nulo ni una serie vac\u00eda.
JMSCC3039.useraction = Pase un nombre de suscripci\u00f3n que no sea nulo ni sea una serie vac\u00eda.

JMSCC3040 = Se ha ignorado el intento de modificaci\u00f3n de los metadatos de conexi\u00f3n. 
JMSCC3040.explanation = Los metadatos de conexi\u00f3n son de s\u00f3lo lectura, las propiedades no se pueden modificar.
JMSCC3040.useraction = Modifique la aplicaci\u00f3n para que no intente modificar los metadatos de conexi\u00f3n.

JMSCC3041 = El intento de establecer varias propiedades simult\u00e1neamente ha fallado. Las propiedades son ''{0}''.
JMSCC3041.explanation = Una o m\u00e1s de las propiedades ha fallado la validaci\u00f3n, por lo que no se ha realizado ninguno de los cambios.
JMSCC3041.useraction = Compruebe que la combinaci\u00f3n de propiedades tengan valores v\u00e1lidos. 
JMSCC3041.inserts = XMSC_INSERT_PROPERTY

# XA unavailable. An attempt was made to perform and action that requires XA when XA is not supported.
JMSCC4001 = Las transacciones distribuidas no est\u00e1n disponibles.
JMSCC4001.explanation = Se han intentado utilizar transacciones distribuidas en un entorno en el que no est\u00e1n disponibles.


JMSCC5001 = No se puede obtener un cuerpo porque el mensaje es StreamMessage
JMSCC5001.explanation = No ha sido posible obtener el cuerpo porque el mensaje es StreamMessage y la especificaci\u00f3n de JMS no lo permite
JMSCC5001.useraction = Se tendr\u00e1 que cambiar el tipo de aplicaci\u00f3n o de mensaje enviado
JMSCC5001.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC5002 = El mensaje del tipo {0} no puede tener asignado su cuerpo a {1}
JMSCC5002.explanation = La especificaci\u00f3n de JMS no permite una asignaci\u00f3n de este tipo
JMSCC5002.useraction = Se tendr\u00e1 que cambiar el tipo de aplicaci\u00f3n o de mensaje enviado
JMSCC5002.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC5002.inserts = XMSC_INSERT_MESSAGE_TYPE, XMSC_INSERT_BODY_TYPE

JMSCC5003 = Se ha producido una excepci\u00f3n al deserializar un mensaje, excepci\u00f3n: ''{0}''.
JMSCC5003.explanation = No ha sido posible deserializar el mensaje debido a la excepci\u00f3n indicada.
JMSCC5003.useraction = Examine la excepci\u00f3n enlazada para obtener detalles del error.
JMSCC5003.inserts = XMSC_INSERT_EXCEPTION
JMSCC5003.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC5004 = El mensaje no tiene cuerpo
JMSCC5004.explanation = El mensaje no tiene cuerpo, por lo que, no se puede convertir al tipo especificado
JMSCC5004.useraction = Se tendr\u00e1 que cambiar el tipo de aplicaci\u00f3n o de mensaje enviado
JMSCC5004.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC5005 = No est\u00e1 permitido enviar este mensaje porque el cuerpo del mensaje no es de s\u00f3lo lectura y se ha realizado una llamada JmsProducer.setProperty
JMSCC5005.explanation = Una aplicaci\u00f3n de usuario ha intentado establecer un cuerpo de mensaje de s\u00f3lo lectura, a trav\u00e9s de una llamada JmsProducer.setProperty.
JMSCC5005.useraction = Cambie el programa de aplicaci\u00f3n para eliminar este comportamiento o llame primero al m\u00e9todo clearBody().
JMSCC5005.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSCC5006 = No est\u00e1 permitido enviar este mensaje porque el almacenamiento intermedio de env\u00edo as\u00edncrono del cliente est\u00e1 lleno
JMSCC5006.explanation = Una aplicaci\u00f3n de usuario ha intentado enviar de forma as\u00edncrona un mensaje JMS y ya hay trabajos pendientes de mensajes as\u00edncronos en el cliente.
JMSCC5006.useraction = Cambie el programa de aplicaci\u00f3n para llamar a m\u00e9todos de env\u00edo as\u00edncronos menos frecuentemente o consulte la documentaci\u00f3n sobre las opciones de configuraci\u00f3n.

JMSCC5007 = El uso de la API de JMS2.0 ''{0}'' no est\u00e1 soportado con esta instancia de esta conexi\u00f3n
JMSCC5007.explanation = S\u00f3lo las conexiones con un tipo de conexi\u00f3n correcto pueden dar soporte al uso de la API de JMS2.0
JMSCC5007.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC5007.inserts =XMSC_INSERT_METHOD

JMSCC5008 = El uso de la Funci\u00f3n de JMS2.0 ''{0}'' no est\u00e1 soportado con esta instancia de esta conexi\u00f3n
JMSCC5008.explanation = El uso de la funcionalidad de JMS2.0 indicada en el mensaje s\u00f3lo se admite al conectarse a un gestor de colas de IBM MQ V8 utilizando la modalidad V8 del proveedor de mensajer\u00eda de IBM MQ.
JMSCC5008.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC5008.inserts =XMSC_INSERT_METHOD

JMSCC5009 = No hay respuesta de la hebra de env\u00edo. Es posible que el mensaje no se haya enviado
JMSCC5009.explanation = La hebra de env\u00edo as\u00edncrono no responde. Es posible que la hebra haya finalizado inesperadamente.

JMSCC5010 = Alterando temporalmente las propiedades ConnectionFactory de PropertyStore:\n {0}
JMSCC5010.inserts = XMSC_INSERT_PROPERTY_OVERRIDE_LIST

JMSCC5011 = Alterando temporalmente la propiedad {0}:\n\
\tValor original = {1}\n\
\tValor nuevo    = {2}
JMSCC5011.inserts = XMSC_OVERRIDDEN_PROPERTY, XMSC_ORIGINAL__PROPERTY_VALUE, XMSC_NEW_PROPERTY_VALUE

#CICS related messages. JMSCC6 used to prevent issues when back porting.
#The first two exceptions have the same text but different exception types
JMSCC6001 = El m\u00e9todo ''{0}'' no se soporta al ejecutar en un entorno CICS.
JMSCC6001.explanation = El m\u00e9todo especificado no se puede utilizar con una conexi\u00f3n de modalidad de enlaces a MQ en un entorno CICS.
JMSCC6001.useraction = Modifique la aplicaci\u00f3n para que no llame al m\u00e9todo especificado.
JMSCC6001.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6001.inserts = XMSC_INSERT_METHOD
 
JMSCC6002 = El m\u00e9todo ''{0}'' no se soporta al ejecutar en un entorno CICS.
JMSCC6002.explanation = El m\u00e9todo especificado no se puede utilizar con una conexi\u00f3n de modalidad de enlaces a MQ en un entorno CICS.
JMSCC6002.useraction = Modifique la aplicaci\u00f3n para que no llame al m\u00e9todo especificado.
JMSCC6002.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC6002.inserts = XMSC_INSERT_METHOD
 
JMSCC6003 = Solo una instancia de sesi\u00f3n por conexi\u00f3n puede estar activa a la vez al ejecutar en un entorno CICS.
JMSCC6003.explanation = Solo una instancia de sesi\u00f3n individual por conexi\u00f3n de modalidad de enlaces a MQ puede estar activa a la vez en un entorno CICS.
JMSCC6003.useraction = Modifique la aplicaci\u00f3n para que cree una sesi\u00f3n desde una conexi\u00f3n diferente o para que cierre la sesi\u00f3n existente que utiliza la conexi\u00f3n actual.
JMSCC6003.exception = com.ibm.msg.client.jms.DetailedJMSException
 
JMSCC6004 = No se soporta la creaci\u00f3n de una conexi\u00f3n o un contexto JMS con un ID de usuario o una contrase\u00f1a no soportados al ejecutar en un entorno CICS.
JMSCC6004.explanation = El gestor de colas no soporta la autenticaci\u00f3n o autorizaci\u00f3n con un ID de usuario y una contrase\u00f1a proporcionados al crear una conexi\u00f3n de modalidad de enlaces o un contexto JMS en un entorno CICS. En su lugar, se utiliza el ID de usuario asociado con el espacio de direcciones de CICS o la transacci\u00f3n.
JMSCC6004.useraction = Modifique la aplicaci\u00f3n para que no especifique un ID de usuario o una contrase\u00f1a.
JMSCC6004.exception = com.ibm.msg.client.jms.DetailedJMSException

#The first two exceptions have the same text but different exception types
JMSCC6011 = El m\u00e9todo ''{0}'' no se soporta al ejecutar en un entorno IMS.
JMSCC6011.explanation = El m\u00e9todo especificado no se puede utilizar con una conexi\u00f3n de modalidad de enlaces a MQ en un entorno IMS.
JMSCC6011.useraction = Modifique la aplicaci\u00f3n para que no llame al m\u00e9todo especificado.
JMSCC6011.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6011.inserts = XMSC_INSERT_METHOD
 
JMSCC6012 = El m\u00e9todo ''{0}'' no se soporta al ejecutar en un entorno IMS.
JMSCC6012.explanation = El m\u00e9todo especificado no se puede utilizar con una conexi\u00f3n de modalidad de enlaces a MQ en un entorno IMS.
JMSCC6012.useraction = Modifique la aplicaci\u00f3n para que no llame al m\u00e9todo especificado.
JMSCC6012.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC6012.inserts = XMSC_INSERT_METHOD
 
JMSCC6013 = Solo una instancia de sesi\u00f3n por conexi\u00f3n puede estar activa a la vez al ejecutar en un entorno IMS.
JMSCC6013.explanation = Solo una instancia de sesi\u00f3n individual por conexi\u00f3n de modalidad de enlaces a MQ puede estar activa a la vez en un entorno IMS.
JMSCC6013.useraction = Modifique la aplicaci\u00f3n para que cree una sesi\u00f3n desde una conexi\u00f3n diferente o para que cierre la sesi\u00f3n existente que utiliza la conexi\u00f3n actual.
JMSCC6013.exception = com.ibm.msg.client.jms.DetailedJMSException
 
JMSCC6014 = No se soporta la creaci\u00f3n de una conexi\u00f3n o un contexto JMS con un ID de usuario o una contrase\u00f1a no soportados al ejecutar en un entorno IMS.
JMSCC6014.explanation = El gestor de colas no soporta la autenticaci\u00f3n o autorizaci\u00f3n con un ID de usuario y una contrase\u00f1a proporcionados al crear una conexi\u00f3n de modalidad de enlaces o un contexto JMS en un entorno IMS. En su lugar, se utiliza el ID de usuario asociado con el espacio de direcciones de IMS, transacci\u00f3n, nombre LTERM o PSBNAME.
JMSCC6014.useraction = Modifique la aplicaci\u00f3n para que no especifique un ID de usuario o una contrase\u00f1a.
JMSCC6014.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSCC6015 = No se admite el m\u00e9todo ''{0}'' cuando se ejecuta en un servidor de aplicaciones
JMSCC6015.explanation = El m\u00e9todo especificado no se debe utilizar en un Java EE EJB o contenedor web.
JMSCC6015.useraction = Modifique la aplicaci\u00f3n para que no llame al m\u00e9todo especificado.
JMSCC6015.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6015.inserts = XMSC_INSERT_METHOD

JMSCC6016 = Se ha producido un tiempo de espera excedido al esperar que el servidor de aplicaciones obtuviera una sesi\u00f3n con el servidor. El tiempo de espera excedido est\u00e1 definido en ''{0}''
JMSCC6016.explanation = Despu\u00e9s de que el valor de tiempo de espera caduca, el adaptador de recursos MQ tiene que abortar la espera de sesi\u00f3n con el servidor.
JMSCC6016.useraction = Considere aumentar este tiempo de espera excedido con la propiedad de configuraci\u00f3n JMS 'com.ibm.msg.client.wmq.getServerSessionTimeout'
JMSCC6016.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6016.inserts = XMSC_INSERT_TIMEOUT
 
