# %Z% %W% %I% %E% %U%
#
#   <copyright 
#   notice="oco-source" 
#   pids="5724-H72" 
#   years="2008,2017" 
#   crc="775383328" > 
#   IBM Confidential 
#    
#   OCO Source Materials 
#    
#   5724-H72,5655-R36,5655-L82,5724-L26, 
#    
#   (C) Copyright IBM Corp. 2008, 2017 
#    
#   The source code for the program is not published 
#   or otherwise divested of its trade secrets, 
#   irrespective of what has been deposited with the 
#   U.S. Copyright Office. 
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR

JMSCC0001 = \u5185\u90e8\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002 \u5fc5\u9808\u30af\u30e9\u30b9 ''{0}'' \u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u5316\u306f\u4e0d\u53ef\u80fd\u3067\u3057\u305f\u3002
JMSCC0001.useraction = \u751f\u6210\u3055\u308c\u305f\u3059\u3079\u3066\u306e\u51fa\u529b\u30d5\u30a1\u30a4\u30eb\u3092\u4fdd\u5b58\u3057\u3001MQ \u30b5\u30dd\u30fc\u30c8\u30fb\u30b5\u30a4\u30c8 (http://www.ibm.com/software/integration/wmq/support/) \u307e\u305f\u306f IBM Support Assistant (ISA) (http://www.ibm.com/software/support/isa/) \u306e\u3044\u305a\u308c\u304b\u3092\u4f7f\u7528\u3057\u3066\u3001\u89e3\u6c7a\u7b56\u304c\u65e2\u306b\u793a\u3055\u308c\u3066\u3044\u308b\u304b\u3069\u3046\u304b\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002  \u4e00\u81f4\u3059\u308b\u9805\u76ee\u304c\u898b\u3064\u304b\u3089\u306a\u3044\u5834\u5408\u306b\u306f\u3001\
IBM \u30b5\u30dd\u30fc\u30c8\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0001.inserts = XMSC_INSERT_EXCEPTION

JMSCC0002 = IBM MQ \u30af\u30e9\u30b9 (JMS \u7528) \u304c\u7121\u52b9\u306a\u30af\u30e9\u30a4\u30a2\u30f3\u30c8 ID \u3092\u63a5\u7d9a\u306b\u8a2d\u5b9a\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002
JMSCC0002.explanation = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u6709\u52b9\u306a\u63a5\u7d9a\u306e\u30af\u30e9\u30a4\u30a2\u30f3\u30c8 ID \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u30cc\u30eb\u306b\u8a2d\u5b9a\u3057\u3088\u3046\u3068\u3057\u305f\u304b\u3001\u307e\u305f\u306f\u7121\u52b9\u306a\u63a5\u7d9a\u306e clientId \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u8a2d\u5b9a\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002
JMSCC0002.useraction = \u63a5\u7d9a\u306e clientId \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306f\u4e00\u5ea6\u3060\u3051\u3001\u975e\u30cc\u30eb\u5024\u306e\u307f\u306b\u3001\u305d\u306e\u63a5\u7d9a\u304c\u4f7f\u7528\u3055\u308c\u308b\u524d\u3060\u3051\u306b\u8a2d\u5b9a\u3067\u304d\u307e\u3059\u3002 \u63a5\u7d9a\u304c\u6709\u52b9\u3067\u3042\u308a\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8 ID \u304c\u975e\u30cc\u30eb\u3067\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0002.exception = com.ibm.msg.client.jms.DetailedInvalidClientIDException

JMSCC0003 = \u6307\u5b9a\u3055\u308c\u305f\u5024 ''{1}'' \u306f\u3001''{0}'' \u3067\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSCC0003.explanation = \u3053\u306e\u5024\u306f\u3001\u6307\u5b9a\u3055\u308c\u305f\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306b\u5bfe\u3057\u3066\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSCC0003.useraction = \u5024\u3092\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u5024\u306b\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0003.inserts = XMSC_INSERT_NAME, XMSC_INSERT_VALUE
JMSCC0003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0004 = receive \u306e\u547c\u3073\u51fa\u3057\u306f\u3001\u505c\u6b62\u3055\u308c\u305f\u63a5\u7d9a\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u623b\u3057\u307e\u305b\u3093\u3002
JMSCC0004.explanation = JMS \u306e\u4ed5\u69d8\u3067\u306f\u3001receive() \u30e1\u30bd\u30c3\u30c9\u306e\u547c\u3073\u51fa\u3057\u306f\u3001\u63a5\u7d9a\u304c\u505c\u6b62\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u306f\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u623b\u3057\u3066\u306f\u3044\u3051\u306a\u3044\u3053\u3068\u306b\u306a\u3063\u3066\u3044\u307e\u3059\u3002 receiveNoWait \u307e\u305f\u306f\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u304c\u3042\u308b receive \u306e\u547c\u3073\u51fa\u3057\u306f\u3001\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u306e\u6709\u52b9\u671f\u9650\u304c\u5207\u308c\u308b\u5834\u5408\u306f\u30cc\u30eb\u3092\u623b\u3057\u307e\u3059\u3002 \u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u306a\u3057\u306e receive \u306e\u547c\u3073\u51fa\u3057\u306f\u3001\u63a5\u7d9a\u304c\u958b\u59cb\u3059\u308b\u304b\u30af\u30ed\u30fc\u30ba\u3059\u308b\u307e\u3067\u3001\u307e\u305f\u306f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u7d42\u4e86\u3059\u308b\u307e\u3067\u623b\u3057\u307e\u305b\u3093\u3002
JMSCC0004.useraction = javax.jms.Connection.start() \u3092\u547c\u3073\u51fa\u3057\u3066\u63a5\u7d9a\u3092\u958b\u59cb\u3057\u3066\u304f\u3060\u3055\u3044\u3002 

# JMSCC0005 is the same as JMSCC0003 except that JMSCC0003 throws a InvalidDestinationException
# whereas JMSCC0005 throws an JMSException.
JMSCC0005 = \u6307\u5b9a\u3055\u308c\u305f\u5024 ''{1}'' \u306f\u3001''{0}'' \u3067\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSCC0005.explanation = \u3053\u306e\u5024\u306f\u3001\u6307\u5b9a\u3055\u308c\u305f\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306b\u5bfe\u3057\u3066\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSCC0005.useraction = \u5024\u3092\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u5024\u306b\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0005.inserts = XMSC_INSERT_NAME, XMSC_INSERT_VALUE

JMSCC0007 = \u30e1\u30bd\u30c3\u30c9 ''{1}'': ''{0}'' \u306e\u547c\u3073\u51fa\u3057\u4e2d\u306b\u4f8b\u5916\u3092\u53d7\u3051\u53d6\u308a\u307e\u3057\u305f\u3002
JMSCC0007.explanation = \u6307\u5b9a\u3055\u308c\u305f\u30e1\u30bd\u30c3\u30c9\u306e\u5b9f\u884c\u4e2d\u306b\u3001\u5225\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306b\u3088\u3063\u3066\u4f8b\u5916\u304c\u30b9\u30ed\u30fc\u3055\u308c\u307e\u3057\u305f\u3002
JMSCC0007.useraction = \u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044
JMSCC0007.inserts = XMSC_INSERT_EXCEPTION, XMSC_INSERT_METHOD

JMSCC0008 = \u3053\u306e\u63a5\u7d9a\u306f\u30af\u30ed\u30fc\u30ba\u3055\u308c\u3066\u3044\u307e\u3059\u3002
JMSCC0008.explanation = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u3001\u63a5\u7d9a\u306e\u30af\u30ed\u30fc\u30ba\u5f8c\u306b\u306f\u4f7f\u7528\u3067\u304d\u306a\u3044\u30e1\u30bd\u30c3\u30c9\u3092\u547c\u3073\u51fa\u3057\u307e\u3057\u305f\u3002
JMSCC0008.useraction = \u30e1\u30bd\u30c3\u30c9\u3092\u547c\u3073\u51fa\u3059\u524d\u306b\u3001\u63a5\u7d9a\u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u3066\u3044\u306a\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0008.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0011 = \u30e1\u30bd\u30c3\u30c9 ''{0}'' \u306f\u3053\u306e\u30b3\u30f3\u30c6\u30ca\u30fc\u3067\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSCC0011.explanation = \u73fe\u5728\u306e\u30b3\u30f3\u30c6\u30ca\u30fc\u3067\u8a31\u53ef\u3055\u308c\u3066\u3044\u306a\u3044\u30e1\u30bd\u30c3\u30c9\u304c\u547c\u3073\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
JMSCC0011.useraction = \u30e1\u30bd\u30c3\u30c9\u3078\u306e\u547c\u3073\u51fa\u3057\u3092\u524a\u9664\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0011.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0011.inserts = XMSC_INSERT_METHOD

JMSCC0012 = \u30e1\u30bd\u30c3\u30c9 ''{0}'' \u306f\u3001\u30ea\u30b9\u30ca\u30fc {1} \u304b\u3089\u547c\u3073\u51fa\u3059\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
JMSCC0012.explanation = \u73fe\u5728\u306e\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u3067\u8a31\u53ef\u3055\u308c\u3066\u3044\u306a\u3044\u30e1\u30bd\u30c3\u30c9\u304c\u547c\u3073\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
JMSCC0012.useraction = \u30e1\u30bd\u30c3\u30c9\u3078\u306e\u547c\u3073\u51fa\u3057\u3092\u524a\u9664\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0012.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0012.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_NAME

JMSCC0014 = \u975e\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u5316\u30bb\u30c3\u30b7\u30e7\u30f3\u3067\u306e ''{0}'' \u30e1\u30bd\u30c3\u30c9\u306e\u547c\u3073\u51fa\u3057\u306f\u7121\u52b9\u3067\u3059\u3002
JMSCC0014.explanation = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u3001\u975e\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u5316\u30bb\u30c3\u30b7\u30e7\u30f3\u3067\u547c\u3073\u51fa\u3059\u3053\u3068\u304c\u3067\u304d\u306a\u3044\u30e1\u30bd\u30c3\u30c9\u3092\u547c\u3073\u51fa\u3057\u307e\u3057\u305f\u3002
JMSCC0014.useraction = \u3053\u306e\u52d5\u4f5c\u3092\u524a\u9664\u3059\u308b\u3088\u3046\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30d7\u30ed\u30b0\u30e9\u30e0\u3092\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0014.inserts = XMSC_INSERT_METHOD
JMSCC0014.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0020 = \u3053\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u306f\u30af\u30ed\u30fc\u30ba\u3055\u308c\u3066\u3044\u307e\u3059\u3002
JMSCC0020.explanation = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u3001\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u30af\u30ed\u30fc\u30ba\u5f8c\u306b\u4f7f\u7528\u3067\u304d\u306a\u3044\u30e1\u30bd\u30c3\u30c9\u3092\u547c\u3073\u51fa\u3057\u307e\u3057\u305f\u3002
JMSCC0020.useraction = \u30e1\u30bd\u30c3\u30c9\u306e\u547c\u3073\u51fa\u3057\u524d\u306b\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u3066\u3044\u306a\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0020.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0021 = \u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u5316\u30bb\u30c3\u30b7\u30e7\u30f3\u3067\u306e ''{0}'' \u30e1\u30bd\u30c3\u30c9\u306e\u547c\u3073\u51fa\u3057\u306f\u7121\u52b9\u3067\u3059\u3002
JMSCC0021.explanation = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u3001\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u5316\u30bb\u30c3\u30b7\u30e7\u30f3\u3067\u547c\u3073\u51fa\u3059\u3053\u3068\u304c\u3067\u304d\u306a\u3044\u30e1\u30bd\u30c3\u30c9\u3092\u547c\u3073\u51fa\u3057\u307e\u3057\u305f\u3002
JMSCC0021.useraction = \u3053\u306e\u52d5\u4f5c\u3092\u524a\u9664\u3059\u308b\u3088\u3046\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30d7\u30ed\u30b0\u30e9\u30e0\u3092\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0021.inserts = XMSC_INSERT_METHOD
JMSCC0021.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0026 = \u3053\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30d7\u30ed\u30c7\u30e5\u30fc\u30b5\u30fc\u306f\u3001\u30af\u30ed\u30fc\u30ba\u3055\u308c\u3066\u3044\u307e\u3059\u3002
JMSCC0026.explanation = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30d7\u30ed\u30c7\u30e5\u30fc\u30b5\u30fc\u306e\u30af\u30ed\u30fc\u30ba\u5f8c\u306b\u4f7f\u7528\u3067\u304d\u306a\u3044\u30e1\u30bd\u30c3\u30c9\u3092\u547c\u3073\u51fa\u3057\u307e\u3057\u305f\u3002
JMSCC0026.useraction = \u30e1\u30bd\u30c3\u30c9\u3092\u547c\u3073\u51fa\u3059\u524d\u306b\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30d7\u30ed\u30c7\u30e5\u30fc\u30b5\u30fc\u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u3066\u3044\u306a\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0026.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0029 = \u3053\u306e\u30d7\u30ed\u30c7\u30e5\u30fc\u30b5\u30fc\u304b\u3089\u306e\u9001\u4fe1\u6642\u306b\u306f\u3001\u5b9b\u5148\u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
JMSCC0029.explanation = \u30d7\u30ed\u30c7\u30e5\u30fc\u30b5\u30fc\u306f\u5b9b\u5148\u3092\u30cc\u30eb\u306b\u8a2d\u5b9a\u3057\u3066\u4f5c\u6210\u3055\u308c\u3066\u3044\u307e\u3059\u304c\u3001send \u30e1\u30bd\u30c3\u30c9\u306b\u306f\u5b9b\u5148\u304c\u63d0\u4f9b\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002
JMSCC0029.useraction = \u5b9b\u5148\u3092\u6307\u5b9a\u3059\u308b send() \u30e1\u30bd\u30c3\u30c9\u304c\u4f7f\u7528\u3055\u308c\u308b\u3088\u3046\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u5909\u66f4\u3059\u308b\u304b\u3001\u307e\u305f\u306f\u30d7\u30ed\u30c7\u30e5\u30fc\u30b5\u30fc\u306e\u4f5c\u6210\u6642\u306b\u5b9b\u5148\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0029.exception = java.lang.UnsupportedOperationException

JMSCC0030 = \u3053\u306e\u30d7\u30ed\u30c7\u30e5\u30fc\u30b5\u30fc\u304b\u3089\u306e\u9001\u4fe1\u6642\u306b\u306f\u3001\u5b9b\u5148\u3092\u6307\u5b9a\u3059\u308b\u3053\u3068\u306f\u7121\u52b9\u3067\u3059\u3002
JMSCC0030.explanation = \u30d7\u30ed\u30c7\u30e5\u30fc\u30b5\u30fc\u306f\u5b9b\u5148\u3092\u6307\u5b9a\u3057\u3066\u4f5c\u6210\u3055\u308c\u3066\u3044\u308b\u305f\u3081\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u9001\u4fe1\u6642\u306b\u5b9b\u5148\u3092\u518d\u5ea6\u6307\u5b9a\u3059\u308b\u3053\u3068\u306f\u7121\u52b9\u3067\u3059\u3002
JMSCC0030.useraction = \u5b9b\u5148\u3092\u6307\u5b9a\u3057\u3066\u3044\u306a\u3044 send \u30e1\u30bd\u30c3\u30c9\u3092\u4f7f\u7528\u3059\u308b\u3088\u3046\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u5909\u66f4\u3059\u308b\u304b\u3001\u307e\u305f\u306f\u30d7\u30ed\u30c7\u30e5\u30fc\u30b5\u30fc\u306e\u4f5c\u6210\u6642\u306b\u30cc\u30eb\u306e\u5b9b\u5148\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0030.exception = java.lang.UnsupportedOperationException

JMSCC0031 = \u30cc\u30eb\u5b8c\u4e86\u30ea\u30b9\u30ca\u30fc\u3092\u6307\u5b9a\u3059\u308b\u3053\u3068\u306f\u7121\u52b9\u3067\u3059\u3002
JMSCC0031.explanation = send \u30e1\u30bd\u30c3\u30c9\u306e\u547c\u3073\u51fa\u3057\u306b\u5b8c\u4e86\u30ea\u30b9\u30ca\u30fc\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3057\u305f\u304c\u3001\u30ea\u30b9\u30ca\u30fc\u306f\u30cc\u30eb\u3067\u3057\u305f\u3002
JMSCC0031.useraction = \u5b8c\u4e86\u30ea\u30b9\u30ca\u30fc\u3092\u6307\u5b9a\u3057\u3066\u3044\u306a\u3044 send \u30e1\u30bd\u30c3\u30c9\u3092\u4f7f\u7528\u3059\u308b\u3088\u3046\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u5909\u66f4\u3059\u308b\u304b\u3001\u307e\u305f\u306f send \u3092\u547c\u3073\u51fa\u3059\u3068\u304d\u306b\u975e\u30cc\u30eb\u5b8c\u4e86\u30ea\u30b9\u30ca\u30fc\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0031.exception = java.lang.IllegalArgumentException

JMSCC0032 = \u3053\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30b3\u30f3\u30b7\u30e5\u30fc\u30de\u30fc\u306f\u30af\u30ed\u30fc\u30ba\u3055\u308c\u3066\u3044\u307e\u3059\u3002
JMSCC0032.explanation = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30b3\u30f3\u30b7\u30e5\u30fc\u30de\u30fc\u306e\u30af\u30ed\u30fc\u30ba\u5f8c\u306b\u306f\u4f7f\u7528\u3067\u304d\u306a\u3044\u30e1\u30bd\u30c3\u30c9\u3092\u547c\u3073\u51fa\u3057\u307e\u3057\u305f\u3002
JMSCC0032.useraction = \u30e1\u30bd\u30c3\u30c9\u3092\u547c\u3073\u51fa\u3059\u524d\u306b\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30b3\u30f3\u30b7\u30e5\u30fc\u30de\u30fc\u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u3066\u3044\u306a\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0032.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0033 = \u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u975e\u540c\u671f\u306b\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u3068\u304d\u306b\u540c\u671f\u30e1\u30bd\u30c3\u30c9\u3092\u547c\u3073\u51fa\u3059\u3053\u3068\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093: ''{0}''\u3002
JMSCC0033.explanation = JMS \u4ed5\u69d8\u3067\u306f\u3001\u975e\u540c\u671f\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u914d\u4fe1\u306e\u5b9f\u884c\u4e2d\u306b\u540c\u671f\u30e1\u30bd\u30c3\u30c9\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u3092\u4f7f\u7528\u3059\u308b\u3053\u3068\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
JMSCC0033.useraction = \u540c\u671f\u30e1\u30bd\u30c3\u30c9\u3068\u975e\u540c\u671f\u914d\u4fe1\u306e\u4e21\u65b9\u3092\u540c\u6642\u306b\u4f7f\u7528\u3059\u308b\u5834\u5408\u306f\u3001\u5225\u3005\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u3092\u4f5c\u6210\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0033.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0033.inserts = XMSC_INSERT_METHOD

JMSCC0034 = \u30e1\u30bd\u30c3\u30c9 ''{0}'' \u5185\u3067\u975e\u540c\u671f\u9001\u9054\u30e1\u30ab\u30cb\u30ba\u30e0\u304c\u4e0d\u6574\u5408\u72b6\u614b\u3067\u3059\u3002
JMSCC0034.explanation = \u30e1\u30c3\u30bb\u30fc\u30b8\u99c6\u52d5\u578b Bean (MDB) \u3078\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u9001\u9054\u4e2d\u306b\u3001\u4e88\u671f\u3057\u306a\u3044\u30a4\u30d9\u30f3\u30c8\u30fb\u30b7\u30fc\u30b1\u30f3\u30b9\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002 \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30fb\u30d7\u30ed\u30b0\u30e9\u30df\u30f3\u30b0\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30a8\u30e9\u30fc\u304c\u539f\u56e0\u3067\u3042\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
JMSCC0034.useraction = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u30fb\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb\u3092\u8abf\u3079\u3066\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u99c6\u52d5\u578b Bean \u306b\u95a2\u9023\u3059\u308b\u4ed6\u306e\u554f\u984c\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u751f\u6210\u3055\u308c\u305f\u3059\u3079\u3066\u306e\u51fa\u529b\u30d5\u30a1\u30a4\u30eb\u3092\u4fdd\u5b58\u3057\u3001WMQ \u30b5\u30dd\u30fc\u30c8\u30fb\u30b5\u30a4\u30c8 (http://www.ibm.com/software/integration/wmq/support/) \u307e\u305f\u306f IBM Support Assistant (ISA) (http://www.ibm.com/software/support/isa/) \u306e\u3044\u305a\u308c\u304b\u3092\u4f7f\u7528\u3057\u3066\u3001\u89e3\u6c7a\u7b56\u304c\u65e2\u306b\u793a\u3055\u308c\u3066\u3044\u308b\u304b\u3069\u3046\u304b\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002  \u4e00\u81f4\u3059\u308b\u9805\u76ee\u304c\u898b\u3064\u304b\u3089\u306a\u3044\u5834\u5408\u306b\u306f\u3001\
IBM \u30b5\u30dd\u30fc\u30c8\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0034.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0034.inserts = XMSC_INSERT_METHOD

JMSCC0037 = \u5b9f\u884c\u6642\u4f8b\u5916\u304c MessageListener.onMessage() \u30e1\u30bd\u30c3\u30c9\u306b\u3088\u308a\u30b9\u30ed\u30fc\u3055\u308c\u307e\u3057\u305f\u3002
JMSCC0037.explanation = \u767b\u9332\u6e08\u307f\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30ea\u30b9\u30ca\u30fc\u304c\u3042\u308b\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30b3\u30f3\u30b7\u30e5\u30fc\u30de\u30fc\u304c onMessage() \u30e1\u30bd\u30c3\u30c9\u304b\u3089\u4f8b\u5916\u3092\u53d7\u3051\u53d6\u308a\u307e\u3057\u305f\u3002
JMSCC0037.useraction = onMessage() \u30e1\u30bd\u30c3\u30c9\u3092\u4f8b\u5916\u3092\u30b9\u30ed\u30fc\u3057\u306a\u3044\u3088\u3046\u306b\u5909\u66f4\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002

JMSCC0038 = \u30e6\u30fc\u30b6\u30fc\u306b\u306f\u3053\u306e\u64cd\u4f5c\u3092\u5b9f\u884c\u3059\u308b\u6a29\u9650\u304c\u3042\u308a\u307e\u305b\u3093\u3002 \u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0038.explanation = \u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u306b\u306f\u3001\u3053\u306e\u64cd\u4f5c\u3092\u5b9f\u884c\u3059\u308b\u306e\u306b\u5fc5\u8981\u306a\u6a29\u9650\u306e\u8a73\u7d30\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
JMSCC0038.useraction = \u7ba1\u7406\u8005\u306f\u95a2\u4fc2\u306e\u3042\u308b\u30e6\u30fc\u30b6\u30fc\u306b\u3001\u5fc5\u8981\u306a\u6a29\u9650\u3092\u4ed8\u4e0e\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002

JMSCC0039 = \u30bf\u30a4\u30d7 ''{0}'' \u3092\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc ''{1}'' \u3068\u3057\u3066\u4f7f\u7528\u3059\u308b\u306e\u306f\u7121\u52b9\u3067\u3059\u3002
JMSCC0039.explanation = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u3001JMS \u4ed5\u69d8\u3067\u8a31\u53ef\u3055\u308c\u3066\u3044\u306a\u3044\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30fb\u30bf\u30a4\u30d7\u3092\u4f7f\u7528\u3057\u3066\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u8a2d\u5b9a\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002
JMSCC0039.useraction = \u8a31\u53ef\u3055\u308c\u3066\u3044\u308b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30fb\u30bf\u30a4\u30d7\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u30d7\u30ea\u30df\u30c6\u30a3\u30d6\u30fb\u30e9\u30c3\u30d1\u30fc\u30fb\u30af\u30e9\u30b9\u3068\u30b9\u30c8\u30ea\u30f3\u30b0\u30fb\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c\u3001\u8a31\u53ef\u3055\u308c\u3066\u3044\u308b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30fb\u30bf\u30a4\u30d7\u3067\u3059\u3002
JMSCC0039.inserts = XMSC_INSERT_TYPE, XMSC_INSERT_PROPERTY
JMSCC0039.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0040 = \u30e1\u30c3\u30bb\u30fc\u30b8 ''{0}'' \u306e\u53d7\u3051\u53d6\u308a\u6642\u306b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
JMSCC0040.explanation = \u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u53d7\u4fe1\u4e2d\u306b\u3001\u4f8b\u5916\u304c\u30b9\u30ed\u30fc\u3055\u308c\u3001\u305d\u306e\u305f\u3081\u306b\u64cd\u4f5c\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSCC0040.useraction = \u8a73\u3057\u304f\u306f\u3001\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u304a\u3088\u3073\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u8abf\u3079\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0040.inserts = XMSC_INSERT_EXCEPTION
JMSCC0040.exception = com.ibm.msg.client.jms.internal.JmsQueueBrowserImpl.MessageConversionFailed

JMSCC0041 = \u9805\u76ee ''{0}'' \u306f\u30bf\u30a4\u30d7  ''{1}'' \u304b\u3089\u30bf\u30a4\u30d7 ''{2}'' \u3078\u306e\u5909\u63db\u304c\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSCC0041.explanation = \u6307\u5b9a\u3055\u308c\u305f 2 \u3064\u306e\u30c7\u30fc\u30bf\u30fb\u30bf\u30a4\u30d7\u9593\u306e\u5909\u63db\u306f JMS \u4ed5\u69d8\u306b\u3088\u3063\u3066\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSCC0041.useraction = \u8a31\u53ef\u3055\u308c\u3066\u3044\u308b\u5909\u63db\u306e\u3044\u305a\u308c\u304b\u3092\u4f7f\u7528\u3057\u3066\u6307\u5b9a\u3055\u308c\u305f\u9805\u76ee\u3092\u691c\u7d22\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0041.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE

JMSCC0042 = \u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30d5\u30a3\u30fc\u30eb\u30c9 ''{0}'' \u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSCC0042.explanation = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u3001\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044\u30d5\u30a3\u30fc\u30eb\u30c9\u306e\u5024\u3092\u53d6\u5f97\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002
JMSCC0042.useraction = \u5024\u3092\u53d6\u5f97\u3059\u308b\u524d\u306b\u30d5\u30a3\u30fc\u30eb\u30c9\u306e\u5024\u3092\u8a2d\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0042.inserts = XMSC_INSERT_FIELD

JMSCC0043 = \u30cc\u30eb\u307e\u305f\u306f\u7a7a\u30b9\u30c8\u30ea\u30f3\u30b0\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u540d\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSCC0043.explanation = \u30e6\u30fc\u30b6\u30fc\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u3001\u30cc\u30eb\u3084\u7a7a\u30b9\u30c8\u30ea\u30f3\u30b0\u306a\u3069\u306e\u6709\u52b9\u3067\u306a\u3044\u540d\u524d\u3092\u4f7f\u7528\u3057\u3066\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u8a2d\u5b9a\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002
JMSCC0043.useraction = \u6709\u52b9\u306a\u30d5\u30a3\u30fc\u30eb\u30c9\u540d\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0043.exception = java.lang.IllegalArgumentException

JMSCC0044 = \u30e1\u30c3\u30bb\u30fc\u30b8\u672c\u4f53\u306f\u8aad\u307f\u53d6\u308a\u5c02\u7528\u3067\u3042\u308b\u305f\u3081\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u3067\u306e\u30e1\u30bd\u30c3\u30c9 ''{0}'' \u306e\u547c\u3073\u51fa\u3057\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSCC0044.explanation = \u30e6\u30fc\u30b6\u30fc\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u3001\u8aad\u307f\u53d6\u308a\u5c02\u7528\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u672c\u4f53\u3092\u8a2d\u5b9a\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002
JMSCC0044.useraction = \u3053\u306e\u52d5\u4f5c\u3092\u524a\u9664\u3059\u308b\u3088\u3046\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30d7\u30ed\u30b0\u30e9\u30e0\u3092\u5909\u66f4\u3059\u308b\u304b\u3001\u307e\u305f\u306f clearBody() \u30e1\u30bd\u30c3\u30c9\u3092\u307e\u305a\u547c\u3073\u51fa\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0044.inserts = XMSC_INSERT_METHOD
JMSCC0044.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSCC0045 = \u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306f\u8aad\u307f\u53d6\u308a\u5c02\u7528\u3067\u3042\u308b\u305f\u3081\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u3067\u306e\u30e1\u30bd\u30c3\u30c9 ''{0}'' \u306e\u547c\u3073\u51fa\u3057\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSCC0045.explanation = \u30e6\u30fc\u30b6\u30fc\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u3001\u8aad\u307f\u53d6\u308a\u5c02\u7528\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u8a2d\u5b9a\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002
JMSCC0045.useraction = \u3053\u306e\u52d5\u4f5c\u3092\u524a\u9664\u3059\u308b\u3088\u3046\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30d7\u30ed\u30b0\u30e9\u30e0\u3092\u5909\u66f4\u3059\u308b\u304b\u3001\u307e\u305f\u306f clearProperties() \u30e1\u30bd\u30c3\u30c9\u3092\u307e\u305a\u547c\u3073\u51fa\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0045.inserts = XMSC_INSERT_METHOD
JMSCC0045.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSCC0046 = \u30e1\u30c3\u30bb\u30fc\u30b8\u672c\u4f53\u306f\u66f8\u304d\u8fbc\u307f\u5c02\u7528\u3067\u3042\u308b\u305f\u3081\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u3067\u306e\u30e1\u30bd\u30c3\u30c9 ''{0}'' \u306e\u547c\u3073\u51fa\u3057\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSCC0046.explanation = \u30e6\u30fc\u30b6\u30fc\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u3001\u66f8\u304d\u8fbc\u307f\u5c02\u7528\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u672c\u4f53\u3092\u8aad\u307f\u53d6\u308d\u3046\u3068\u3057\u307e\u3057\u305f\u3002
JMSCC0046.useraction = \u3053\u306e\u52d5\u4f5c\u3092\u524a\u9664\u3059\u308b\u3088\u3046\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30d7\u30ed\u30b0\u30e9\u30e0\u3092\u5909\u66f4\u3059\u308b\u304b\u3001\u307e\u305f\u306f reset() \u30e1\u30bd\u30c3\u30c9\u3092\u307e\u305a\u547c\u3073\u51fa\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0046.inserts = XMSC_INSERT_METHOD
JMSCC0046.exception = com.ibm.msg.client.jms.DetailedMessageNotReadableException

JMSCC0048 = \u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u4f5c\u6210\u3057\u3088\u3046\u3068\u3057\u3066\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002 \u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0048.explanation = \u30a8\u30e9\u30fc\u306e\u305f\u3081\u306b\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
JMSCC0048.useraction = \u30a8\u30e9\u30fc\u306b\u3064\u3044\u3066\u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u8abf\u3079\u3066\u304f\u3060\u3055\u3044\u3002

JMSCC0049 = \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u540d ''{0}'' \u306f\u6709\u52b9\u306a Java(tm) ID \u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
JMSCC0049.explanation = \u6307\u5b9a\u3055\u308c\u305f\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u540d\u306f\u3001JMS \u4ed5\u69d8\u306b\u8a18\u8ff0\u3055\u308c\u3066\u3044\u308b\u8a31\u53ef\u3055\u308c\u305f\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u306b\u6e96\u62e0\u3057\u3066\u3044\u307e\u305b\u3093\u3002
JMSCC0049.useraction = \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u540d\u306b\u4f7f\u7528\u3055\u308c\u305f\u6587\u5b57\u3092\u78ba\u8a8d\u3057\u3066\u3001\u5fc5\u8981\u3067\u3042\u308c\u3070\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0049.inserts = XMSC_INSERT_PROPERTY
JMSCC0049.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0050 = \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u540d ''{0}'' \u306f\u4e88\u7d04\u6e08\u307f\u3067\u3001\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002
JMSCC0050.explanation = \u6307\u5b9a\u3055\u308c\u305f\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u540d\u306f JMS \u63a5\u982d\u90e8\u3067\u958b\u59cb\u3055\u308c\u3066\u3044\u307e\u3059\u304c\u3001\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u8a2d\u5b9a\u53ef\u80fd\u306a\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
JMSCC0050.useraction = \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u540d\u3092\u78ba\u8a8d\u3057\u3066\u30a8\u30e9\u30fc\u3092\u8a02\u6b63\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0050.inserts = XMSC_INSERT_PROPERTY
JMSCC0050.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0051 = \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc ''{0}'' \u306f\u3001\u30bf\u30a4\u30d7 ''{2}'' \u3067\u306f\u306a\u304f\u30bf\u30a4\u30d7 ''{1}'' \u3092\u4f7f\u7528\u3057\u3066\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
JMSCC0051.explanation = JMS_IBM \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306f\u3001\u7279\u5b9a\u306e\u5909\u6570\u30bf\u30a4\u30d7\u3092\u4f7f\u7528\u3057\u3066\u306e\u307f\u8a2d\u5b9a\u3067\u304d\u307e\u3059\u3002
JMSCC0051.useraction = \u3053\u306e JMS_IBM \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u8a2d\u5b9a\u3059\u308b\u969b\u306b\u306f\u5fc5\u8981\u306a\u5909\u6570\u30bf\u30a4\u30d7\u3092\u4f7f\u7528\u3059\u308b\u3088\u3046\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b3\u30fc\u30c9\u3092\u8a02\u6b63\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0051.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE
JMSCC0051.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0052 = \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u76f4\u5217\u5316\u6642\u306b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f:  ''{0}'' \u3002
JMSCC0052.explanation = \u4f8b\u5916\u306e\u305f\u3081\u306b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u76f4\u5217\u5316\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
JMSCC0052.useraction = \u30a8\u30e9\u30fc\u306b\u3064\u3044\u3066\u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u8abf\u3079\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0052.inserts = XMSC_INSERT_EXCEPTION
JMSCC0052.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0053 = \u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u975e\u76f4\u5217\u5316\u6642\u306b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u4f8b\u5916: ''{0}''\u3002
JMSCC0053.explanation = \u4f8b\u5916\u304c\u8868\u793a\u3055\u308c\u305f\u305f\u3081\u306b\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u975e\u76f4\u5217\u5316\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
JMSCC0053.useraction = \u30a8\u30e9\u30fc\u306b\u3064\u3044\u3066\u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u8abf\u3079\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0053.inserts = XMSC_INSERT_EXCEPTION
JMSCC0053.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0054 = \u30ad\u30e5\u30fc\u30fb\u30d6\u30e9\u30a6\u30b6\u30fc\u306b\u306f\u4f7f\u7528\u3067\u304d\u308b\u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u3042\u308a\u307e\u305b\u3093\u3002
JMSCC0054.explanation = \u30e6\u30fc\u30b6\u30fc\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u3001\u4f7f\u7528\u53ef\u80fd\u306a\u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u306a\u3044\u30ad\u30e5\u30fc\u30fb\u30d6\u30e9\u30a6\u30b6\u30fc\u306b\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u8981\u6c42\u3057\u307e\u3057\u305f\u3002
JMSCC0054.useraction = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3067\u3001\u4f7f\u7528\u53ef\u80fd\u306a\u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u306a\u3044\u3068\u304d\u306b\u3053\u306e\u30e1\u30bd\u30c3\u30c9\u3092\u547c\u3073\u51fa\u3055\u306a\u3044\u3088\u3046\u306b\u3059\u308b\u304b\u3001\u3042\u308b\u3044\u306f\u3053\u306e\u4f8b\u5916\u3092\u30cf\u30f3\u30c9\u30eb\u3059\u308b\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0054.exception = java.util.NoSuchElementException

JMSCC0055 = \u3053\u306e\u30ad\u30e5\u30fc\u30fb\u30d6\u30e9\u30a6\u30b6\u30fc\u306f\u30af\u30ed\u30fc\u30ba\u3055\u308c\u3066\u3044\u307e\u3059\u3002
JMSCC0055.explanation = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u3001\u30ad\u30e5\u30fc\u30fb\u30d6\u30e9\u30a6\u30b6\u30fc\u306e\u30af\u30ed\u30fc\u30ba\u5f8c\u306b\u4f7f\u7528\u3067\u304d\u306a\u3044\u30e1\u30bd\u30c3\u30c9\u3092\u547c\u3073\u51fa\u3057\u307e\u3057\u305f\u3002
JMSCC0055.useraction = \u30e1\u30bd\u30c3\u30c9\u3092\u547c\u3073\u51fa\u3059\u524d\u306b\u3001\u30ad\u30e5\u30fc\u30fb\u30d6\u30e9\u30a6\u30b6\u30fc\u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u3066\u3044\u306a\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0055.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0059 = \u8aad\u307f\u53d6\u308a\u30d0\u30c3\u30d5\u30a1\u30fc\u304c\u30cc\u30eb\u3067\u3059\u3002
JMSCC0059.explanation = \u30cc\u30eb\u53c2\u7167\u304c StreamMessage.readBytes() \u30e1\u30bd\u30c3\u30c9\u306b\u6e21\u3055\u308c\u305f\u306e\u3067\u3001\u30c7\u30fc\u30bf\u3092\u623b\u3059\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
JMSCC0059.useraction = \u9069\u5207\u306b\u30b5\u30a4\u30ba\u8a2d\u5b9a\u3055\u308c\u305f\u30d0\u30c3\u30d5\u30a1\u30fc\u3092 readBytes() \u30e1\u30bd\u30c3\u30c9\u306b\u6e21\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0059.exception = java.lang.NullPointerException

JMSCC0060 = \u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30b9\u30c8\u30ea\u30fc\u30e0\u306e\u6700\u5f8c\u306b\u9054\u3057\u307e\u3057\u305f\u3002
JMSCC0060.explanation = \u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30b3\u30f3\u30c6\u30f3\u30c4\u306e\u6700\u5f8c\u306b\u9054\u3057\u307e\u3057\u305f\u3002 \u3053\u308c\u306f\u3001\u8aad\u307f\u53d6\u308a\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u3069\u308c\u3060\u3051\u30c7\u30fc\u30bf\u304c\u3042\u308b\u304b\u8a8d\u8b58\u3057\u3066\u3044\u306a\u3044\u5834\u5408\u306f\u6b63\u5e38\u3067\u3059\u3002
JMSCC0060.useraction = \u30a2\u30af\u30b7\u30e7\u30f3\u306f\u4e0d\u8981\u3067\u3059\u3002
JMSCC0060.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCC0061 = StreamMessage \u30d0\u30a4\u30c8\u914d\u5217\u3092\u5b8c\u5168\u306b\u8aad\u307f\u53d6\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002
JMSCC0061.explanation = \u30d0\u30a4\u30c8\u914d\u5217\u306e\u4e00\u90e8\u306e\u8aad\u307f\u53d6\u308a\u4e2d\u306b\u3001\u30b9\u30c8\u30ea\u30fc\u30e0\u304b\u3089\u6b21\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u8aad\u307f\u53d6\u308d\u3046\u3068\u3057\u307e\u3057\u305f\u3002
JMSCC0061.useraction = \u6b21\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306e\u8aad\u307f\u53d6\u308a\u3092\u8a66\u884c\u3059\u308b\u524d\u306b\u3001\u30e6\u30fc\u30b6\u30fc\u30fb\u30b3\u30fc\u30c9\u306b\u3088\u308b\u30d0\u30a4\u30c8\u914d\u5217\u306e\u8aad\u307f\u53d6\u308a\u304c\u5b8c\u4e86\u3057\u3066\u3044\u308b\u304b\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0061.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0062 = \u30cc\u30eb\u3092\u6587\u5b57\u3068\u3057\u3066\u623b\u3059\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
JMSCC0062.explanation = readChar() \u30e1\u30bd\u30c3\u30c9\u3092\u4f7f\u7528\u3057\u3066\u30cc\u30eb\u3092\u542b\u3080 StreamMessage \u30d5\u30a3\u30fc\u30eb\u30c9\u306e\u8aad\u307f\u53d6\u308a\u3092\u8a66\u884c\u3057\u307e\u3057\u305f\u3002
JMSCC0062.useraction = readChar() \u30e1\u30bd\u30c3\u30c9\u3092\u4f7f\u7528\u3057\u3066\u30cc\u30eb\u3092\u8aad\u307f\u53d6\u3089\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002
JMSCC0062.exception = java.lang.NullPointerException

JMSCC0063 = \u30b9\u30c8\u30ea\u30f3\u30b0 ''{0}'' \u306e\u30a8\u30f3\u30b3\u30fc\u30c9\u306f\u7121\u52b9\u3067\u3059\u3002
JMSCC0063.explanation = \u63d0\u4f9b\u3055\u308c\u305f\u5024\u306b\u306f\u65e2\u77e5\u306e\u30a8\u30f3\u30b3\u30fc\u30c9\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSCC0063.useraction = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u5b9a\u7fa9\u6e08\u307f\u30a8\u30f3\u30b3\u30fc\u30c9\u30fb\u30ea\u30b9\u30c8\u304b\u3089\u5024\u3092\u63d0\u4f9b\u3057\u3066\u3044\u308b\u304b\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0063.inserts = JMS_IBM_Encoding

JMSCC0064 = \u30c7\u30fc\u30bf\u30fb\u30b9\u30c8\u30ea\u30fc\u30e0\u3078\u306e\u66f8\u304d\u8fbc\u307f\u4e2d\u306b\u5185\u90e8\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
JMSCC0064.explanation = float \u5024\u3068 double \u5024\u306e\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u5909\u63db\u306b\u4f7f\u7528\u3055\u308c\u308b\u30c7\u30fc\u30bf\u30fb\u30b9\u30c8\u30ea\u30fc\u30e0\u3067\u554f\u984c\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
JMSCC0064.useraction = \u751f\u6210\u3055\u308c\u305f\u3059\u3079\u3066\u306e\u51fa\u529b\u30d5\u30a1\u30a4\u30eb\u3092\u4fdd\u5b58\u3057\u3001WMQ \u30b5\u30dd\u30fc\u30c8\u30fb\u30b5\u30a4\u30c8 (http://www.ibm.com/software/integration/wmq/support/) \u307e\u305f\u306f IBM Support Assistant (ISA) (http://www.ibm.com/software/support/isa/) \u306e\u3044\u305a\u308c\u304b\u3092\u4f7f\u7528\u3057\u3066\u3001\u89e3\u6c7a\u7b56\u304c\u65e2\u306b\u793a\u3055\u308c\u3066\u3044\u308b\u304b\u3069\u3046\u304b\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002  \u4e00\u81f4\u3059\u308b\u9805\u76ee\u304c\u898b\u3064\u304b\u3089\u306a\u3044\u5834\u5408\u306b\u306f\u3001\
IBM \u30b5\u30dd\u30fc\u30c8\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSCC0065 = \u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u6700\u5f8c\u3092\u8d85\u3048\u3066\u8aad\u307f\u53d6\u308d\u3046\u3068\u3057\u307e\u3057\u305f\u3002
JMSCC0065.explanation = \u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u6700\u5f8c\u3092\u8d85\u3048\u3066\u8aad\u307f\u53d6\u308d\u3046\u3068\u3057\u307e\u3057\u305f\u3002 \u3053\u308c\u306f\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c JMS 1.0.2 \u4ed5\u69d8\u3092\u4f7f\u7528\u3057\u3066\u53ef\u5909\u9577\u30c7\u30fc\u30bf\u3092\u8aad\u307f\u53d6\u308b\u3088\u3046\u306b\u30b3\u30fc\u30c7\u30a3\u30f3\u30b0\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u306f\u6b63\u5e38\u306e\u72b6\u614b\u3068\u8003\u3048\u3089\u308c\u307e\u3059\u3002
JMSCC0065.useraction = \u5fc5\u8981\u306a\u5834\u5408\u306f\u3001\u65b0\u898f\u306e getBodyLength() \u30e1\u30bd\u30c3\u30c9\u3092\u4f7f\u7528\u3059\u308b\u3088\u3046\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u518d\u30b3\u30fc\u30c7\u30a3\u30f3\u30b0\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0065.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCC0066 = UTF-8 \u5909\u63db\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSCC0066.explanation = UTF-8 \u30b9\u30c8\u30ea\u30f3\u30b0\u306e\u8aad\u307f\u53d6\u308a\u307e\u305f\u306f\u66f8\u304d\u8fbc\u307f\u4e2d\u306b\u554f\u984c\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002 \u6700\u3082\u4e00\u822c\u7684\u306a\u554f\u984c\u306f\u300165535 \u6587\u5b57\u3092\u8d85\u3048\u308b\u30b9\u30c8\u30ea\u30f3\u30b0\u306e\u66f8\u304d\u8fbc\u307f\u3092\u8a66\u884c\u3059\u308b\u3053\u3068\u3067\u3059\u3002
JMSCC0066.useraction = \u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0066.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0067 = \u5185\u90e8\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002 \u30e1\u30c3\u30bb\u30fc\u30b8\u3078\u306e\u66f8\u304d\u8fbc\u307f\u4e2d\u306b\u554f\u984c\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
JMSCC0067.explanation = \u30e1\u30c3\u30bb\u30fc\u30b8\u3078\u306e\u9805\u76ee\u306e\u66f8\u304d\u8fbc\u307f\u8a66\u884c\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
JMSCC0067.useraction = \u751f\u6210\u3055\u308c\u305f\u3059\u3079\u3066\u306e\u51fa\u529b\u30d5\u30a1\u30a4\u30eb\u3092\u4fdd\u5b58\u3057\u3001WMQ \u30b5\u30dd\u30fc\u30c8\u30fb\u30b5\u30a4\u30c8 (http://www.ibm.com/software/integration/wmq/support/) \u307e\u305f\u306f IBM Support Assistant (ISA) (http://www.ibm.com/software/support/isa/) \u306e\u3044\u305a\u308c\u304b\u3092\u4f7f\u7528\u3057\u3066\u3001\u89e3\u6c7a\u7b56\u304c\u65e2\u306b\u793a\u3055\u308c\u3066\u3044\u308b\u304b\u3069\u3046\u304b\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002  \u4e00\u81f4\u3059\u308b\u9805\u76ee\u304c\u898b\u3064\u304b\u3089\u306a\u3044\u5834\u5408\u306b\u306f\u3001\
IBM \u30b5\u30dd\u30fc\u30c8\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0067.exception = com.ibm.msg.client.jms.DetailedResourceAllocationException

JMSCC0068 = \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc ''{0}'' \u306f\u3001\u30bf\u30a4\u30d7 ''{1}'' \u306e\u5024\u3001\u307e\u305f\u306f JMS \u4ed5\u69d8\u306b\u5f93\u3063\u3066\u3053\u306e\u30bf\u30a4\u30d7\u3068\u4e92\u63db\u6027\u306e\u3042\u308b\u30bf\u30a4\u30d7\u306e\u5024\u3092\u4f7f\u7528\u3057\u3066\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 \u6307\u5b9a\u3055\u308c\u305f\u30bf\u30a4\u30d7 ''{2}'' \u304b\u3089\u306f\u5909\u63db\u3067\u304d\u307e\u305b\u3093\u3002 
JMSCC0068.explanation = \u6307\u5b9a\u3055\u308c\u305f 2 \u3064\u306e\u30c7\u30fc\u30bf\u30fb\u30bf\u30a4\u30d7\u9593\u306e\u5909\u63db\u306f JMS \u4ed5\u69d8\u306b\u3088\u3063\u3066\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSCC0068.useraction = \u8a31\u53ef\u3055\u308c\u3066\u3044\u308b\u5909\u63db\u306e\u3044\u305a\u308c\u304b\u3092\u4f7f\u7528\u3057\u3066\u6307\u5b9a\u3055\u308c\u305f\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u8a2d\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0068.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC0068.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE

JMSCC0069 = \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc ''{0}'' \u306f\u3001\u30bf\u30a4\u30d7 ''{1}'' \u306e\u5024\u3092\u4f7f\u7528\u3057\u3066\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 \u5024\u304c ''{3}'' \u306e\u6307\u5b9a\u3055\u308c\u305f\u30bf\u30a4\u30d7 ''{2}'' \u304b\u3089\u306f\u5909\u63db\u3067\u304d\u307e\u305b\u3093\u3002 
JMSCC0069.explanation = \u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u8a2d\u5b9a\u3092\u8a66\u884c\u4e2d\u306b\u3001\u30a8\u30e9\u30fc\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
JMSCC0069.useraction = \u9069\u5207\u306a\u5024\u3067\u3001\u8a31\u53ef\u3055\u308c\u3066\u3044\u308b\u5909\u63db\u306e\u3044\u305a\u308c\u304b\u3092\u4f7f\u7528\u3057\u3066\u3001\u6307\u5b9a\u3055\u308c\u305f\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u8a2d\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0069.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC0069.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE, XMSC_INSERT_VALUE

JMSCC0070 = \u5185\u90e8\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002 \u30bf\u30a4\u30d7 ''{2}'' \u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u4f7f\u7528\u3057\u305f\u3001JMS \u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc ''{0}'', \u5fc5\u8981\u306a\u30bf\u30a4\u30d7 ''{1}'' \u306e\u8a2d\u5b9a\u4e2d\u306b\u554f\u984c\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
JMSCC0070.explanation = \u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u8a2d\u5b9a\u3092\u8a66\u884c\u4e2d\u306b\u3001\u30a8\u30e9\u30fc\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
JMSCC0070.useraction = \u751f\u6210\u3055\u308c\u305f\u3059\u3079\u3066\u306e\u51fa\u529b\u30d5\u30a1\u30a4\u30eb\u3092\u4fdd\u5b58\u3057\u3001WMQ \u30b5\u30dd\u30fc\u30c8\u30fb\u30b5\u30a4\u30c8 (http://www.ibm.com/software/integration/wmq/support/) \u307e\u305f\u306f IBM Support Assistant (ISA) (http://www.ibm.com/software/support/isa/) \u306e\u3044\u305a\u308c\u304b\u3092\u4f7f\u7528\u3057\u3066\u3001\u89e3\u6c7a\u7b56\u304c\u65e2\u306b\u793a\u3055\u308c\u3066\u3044\u308b\u304b\u3069\u3046\u304b\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002  \u4e00\u81f4\u3059\u308b\u9805\u76ee\u304c\u898b\u3064\u304b\u3089\u306a\u3044\u5834\u5408\u306b\u306f\u3001\
IBM \u30b5\u30dd\u30fc\u30c8\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0070.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC0070.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE

JMSCC0083 = \u30bf\u30a4\u30d7 ''{0}'' \u306e\u6b63\u3057\u304f\u306a\u3044\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c\u63d0\u4f9b\u3055\u308c\u307e\u3057\u305f\u3002
JMSCC0083.explanation = Java(tm) \u30d7\u30ea\u30df\u30c6\u30a3\u30d6\u30fb\u30e9\u30c3\u30d1\u30fc\u30fb\u30bf\u30a4\u30d7\u3067\u306f\u306a\u3044\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c writeObject() \u30e1\u30bd\u30c3\u30c9\u306b\u63d0\u4f9b\u3055\u308c\u307e\u3057\u305f\u3002
JMSCC0083.useraction = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u8a02\u6b63\u3057\u3066\u3001\u8a31\u53ef\u3055\u308c\u305f\u30bf\u30a4\u30d7\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3060\u3051\u304c\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3068\u3057\u3066 writeObject() \u30e1\u30bd\u30c3\u30c9\u306b\u6e21\u3055\u308c\u308b\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0083.inserts = XMSC_INSERT_OBJECT
JMSCC0083.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0084 = ''{0}'' \u3068\u3044\u3046\u540d\u524d\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSCC0084.inserts = XMSC_INSERT_PROPERTY

JMSCC0085 = \u5b9b\u5148\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSCC0085.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0086 = \u30d0\u30c3\u30c1\u30fb\u30b5\u30a4\u30ba ''{0}'' \u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002
JMSCC0086.inserts = XMSC_INSERT_BATCH_SIZE

JMSCC0087 = \u30b5\u30fc\u30d0\u30fc\u30fb\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30d7\u30fc\u30eb\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002

JMSCC0088 = \u6307\u5b9a\u3055\u308c\u305f\u30b5\u30fc\u30d0\u30fc\u30fb\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30d7\u30fc\u30eb\u304b\u3089\u30bb\u30c3\u30b7\u30e7\u30f3\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002

JMSCC0089 = \u30bb\u30c3\u30b7\u30e7\u30f3 ''{0}'' \u306f\u7121\u52b9\u3067\u3057\u305f\u3002
JMSCC0089.inserts = XMSC_INSERT_SESSION

JMSCC0091 = \u63a5\u7d9a\u30bf\u30a4\u30d7 ''{0}'' \u306e\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u30fb\u30d5\u30a1\u30af\u30c8\u30ea\u30fc\u306f\u30ed\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
JMSCC0091.inserts = XMSC_CONNECTION_TYPE

JMSCC0092 = \u63a5\u7d9a\u30bf\u30a4\u30d7\u306f ''{0}'' \u3067\u3042\u308b\u3068\u4e88\u671f\u3055\u308c\u3066\u3044\u307e\u3057\u305f\u304c\u3001\u5b9f\u969b\u306b\u306f ''{1}'' \u3067\u3057\u305f\u3002
JMSCC0092.inserts = XMSC_CONNECTION_TYPE_NAME, XMSC_CONNECTION_TYPE
JMSCC0092.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0093 = \u5b9b\u5148\u306f\u7121\u52b9\u3067\u3057\u305f\u3002 \u30bf\u30a4\u30d7\u304c ''{0}'' \u3067\u540d\u524d\u304c ''{1}'' \u306e\u4e00\u6642\u5b9b\u5148\u306b\u6c38\u7d9a\u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002
JMSCC0093.inserts = XMSC_INSERT_TYPE, XMSC_DESTINATION_NAME
JMSCC0093.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0094 = \u3053\u306e\u63a5\u7d9a\u30d6\u30e9\u30a6\u30b6\u30fc\u306f\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f\u3002
JMSCC0094.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0095 = \u5b9b\u5148\u540d ''{0}'' \u306f\u7121\u52b9\u3067\u3059\u3002
JMSCC0095.explanation = \u6307\u5b9a\u3055\u308c\u305f\u5b9b\u5148\u540d\u306f\u3001\u516c\u958b\u3055\u308c\u305f\u5b9b\u5148\u69cb\u6587\u306b\u6e96\u62e0\u3057\u3066\u3044\u307e\u305b\u3093\u3002
JMSCC0095.useraction = \u6307\u5b9a\u3057\u305f\u5b9b\u5148\u540d\u3092\u8a02\u6b63\u3057\u3066\u3001\u518d\u8a66\u884c\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0095.inserts = XMSC_DESTINATION_NAME
JMSCC0095.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0097 = \u4e0d\u9069\u5207\u306a\u78ba\u8a8d\u5fdc\u7b54\u30e2\u30fc\u30c9 ''{0}''\u3002 Connection.createSession() \u306f\u975e\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u5316\u30bb\u30c3\u30b7\u30e7\u30f3 (\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u5316\u304c false \u3067\u3042\u3063\u305f) \u3092\u4f5c\u6210\u3059\u308b\u3088\u3046\u306b\u4f9d\u983c\u3055\u308c\u307e\u3057\u305f\u304c\u3001\u80af\u5b9a\u5fdc\u7b54\u30e2\u30fc\u30c9\u306f AUTO_ACKNOWLEDGE\u3001DUPS_OK_ACKNOWLEDGE\u3001\u307e\u305f\u306f CLIENT_ACKNOWLEDGE \u306e\u3044\u305a\u308c\u304b 1 \u3064\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
JMSCC0097.inserts = XMSC_ACKNOWLEDGE_MODE

JMSCC0098 = \u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u30cc\u30eb\u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
JMSCC0098.useraction = \u975e\u30cc\u30eb\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0098.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0099 = \u5b9b\u5148 ''{0}'' \u306f com.ibm.msg.client.jms.JmsDestination \u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
JMSCC0099.useraction = \u4ee3\u308f\u308a\u306b com.ibm.msg.client.jms.JmsDestination \u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0099.inserts = XMSC_DESTINATION_NAME
JMSCC0099.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0100 = \u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u540d\u3092\u30cc\u30eb\u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
JMSCC0100.useraction = \u975e\u30cc\u30eb\u306e\u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u540d\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0100.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0101 = \u30af\u30e9\u30a4\u30a2\u30f3\u30c8 ID \u306f\u30cc\u30eb\u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
JMSCC0101.useraction = \u975e\u30cc\u30eb\u306e\u30af\u30e9\u30a4\u30a2\u30f3\u30c8 ID \u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0101.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0102 = \u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u540d ''{0}'' \u306f\u6709\u52b9\u306a Java(tm) ID \u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
JMSCC0102.explanation = \u6307\u5b9a\u3055\u308c\u305f\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u540d\u306f\u3001JMS \u4ed5\u69d8\u306b\u8a18\u8ff0\u3055\u308c\u3066\u3044\u308b\u8a31\u53ef\u3055\u308c\u305f\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u306b\u6e96\u62e0\u3057\u3066\u3044\u307e\u305b\u3093\u3002
JMSCC0102.useraction = \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u540d\u306b\u4f7f\u7528\u3055\u308c\u305f\u6587\u5b57\u3092\u78ba\u8a8d\u3057\u3066\u3001\u5fc5\u8981\u3067\u3042\u308c\u3070\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0102.inserts = XMSC_INSERT_PROPERTY
JMSCC0102.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0103 = \u30cc\u30eb\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c\u63d0\u4f9b\u3055\u308c\u307e\u3057\u305f\u3002
JMSCC0103.explanation = \u30cc\u30eb\u3067\u3042\u3063\u305f writeObject() \u30e1\u30bd\u30c3\u30c9\u306b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c\u63d0\u4f9b\u3055\u308c\u307e\u3057\u305f\u3002
JMSCC0103.useraction = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u8a02\u6b63\u3057\u3066\u3001\u975e\u30cc\u30eb\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3060\u3051\u304c\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3068\u3057\u3066 writeObject() \u30e1\u30bd\u30c3\u30c9\u306b\u6e21\u3055\u308c\u308b\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0103.exception = java.lang.NullPointerException

JMSCC0105 = \u9805\u76ee ''{0}'' \u306f\u30bf\u30a4\u30d7  ''{1}'' \u304b\u3089\u30bf\u30a4\u30d7 ''{2}'' \u3078\u306e\u5909\u63db\u304c\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSCC0105.explanation = 2 \u3064\u306e\u6307\u5b9a\u3055\u308c\u305f\u30c7\u30fc\u30bf\u30fb\u30bf\u30a4\u30d7\u9593\u3067\u306e\u5909\u63db\u306f\u3001JMS \u306e\u4ed5\u69d8\u3067\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSCC0105.useraction = \u8a31\u53ef\u3055\u308c\u3066\u3044\u308b\u5909\u63db\u306e\u3044\u305a\u308c\u304b\u3092\u4f7f\u7528\u3057\u3066\u6307\u5b9a\u3055\u308c\u305f\u9805\u76ee\u3092\u691c\u7d22\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0105.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE
JMSCC0105.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0106 = XA \u30ea\u30bd\u30fc\u30b9\u306e\u53d6\u5f97\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002 ''{0}''\u3002
JMSCC0106.useraction = \u8a73\u3057\u304f\u306f\u3001\u539f\u56e0\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0106.inserts = XMSC_INSERT_EXCEPTION
JMSCC0106.exception = java.lang.RuntimeException

JMSCC0107 = \u4e0d\u9069\u5207\u306a\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8 ''{0}''\u3002
JMSCC0107.explanation = \u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u306f\u6b63\u307e\u305f\u306f\u30bc\u30ed\u3067\u306a\u3051\u308c\u3070\u306a\u3089\u305a\u3001\u30df\u30ea\u79d2\u5358\u4f4d\u3067\u3059\u3002
JMSCC0107.useraction = \u8ca0\u306e\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u3092\u6e21\u3055\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002
JMSCC0107.inserts = XMSC_INSERT_TIMEOUT

# Message changed for APAR IT16300
JMSCC0108 = IBM MQ classes for JMS \u306f\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3078\u306e\u975e\u540c\u671f\u914d\u4fe1\u306e\u6e96\u5099\u304c\u3067\u304d\u3066\u3044\u308b\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u691c\u51fa\u3057\u307e\u3057\u305f\u3002 \u914d\u4fe1\u304c\u8a66\u884c\u3055\u308c\u305f\u6642\u70b9\u3067\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u306f\u4f7f\u7528\u53ef\u80fd\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u8003\u3048\u3089\u308c\u308b\u539f\u56e0\u3068\u30a2\u30af\u30b7\u30e7\u30f3\u306b\u3064\u3044\u3066\u306f\u3001IBM Knowledge Center \u306e IBM MQ V9.0 \u30bb\u30af\u30b7\u30e7\u30f3\u306b\u3042\u308b\u300cTroubleshooting JMSCC0108 messages\u300d\u30c8\u30d4\u30c3\u30af\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0108.explanation = IBM MQ classes for JMS \u5185\u306e\u5185\u90e8\u30b9\u30ec\u30c3\u30c9\u306f\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u691c\u51fa\u3057\u3001\u305d\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u5225\u306e\u5185\u90e8\u30b9\u30ec\u30c3\u30c9\u304c\u53d6\u5f97\u3057\u3066\u51e6\u7406\u306e\u305f\u3081\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u914d\u4fe1\u3059\u308b\u3053\u3068\u3092\u8981\u6c42\u3057\u307e\u3057\u305f\u3002 \u305d\u306e\u30b9\u30ec\u30c3\u30c9\u304c\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u53d6\u5f97\u3057\u3088\u3046\u3068\u3057\u305f\u6642\u70b9\u3067\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u306f\u4f7f\u7528\u53ef\u80fd\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
JMSCC0108.useraction = \u8a73\u3057\u304f\u306f\u3001IBM Knowledge Center \u306e IBM MQ V9.0 \u30bb\u30af\u30b7\u30e7\u30f3\u306b\u3042\u308b\u300cTroubleshooting JMSCC0108 messages\u300d\u30c8\u30d4\u30c3\u30af\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSCC0109 = \u30e1\u30c3\u30bb\u30fc\u30b8\u99c6\u52d5\u578b Bean \u304c\u5b9f\u884c\u6642\u4f8b\u5916 ''{0}'' \u3092\u30b9\u30ed\u30fc\u3057\u307e\u3057\u305f\u3002
JMSCC0109.explanation = \u3053\u308c\u306f\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30ea\u30b9\u30ca\u30fc\u306b\u554f\u984c\u304c\u3042\u308b\u3053\u3068\u3092\u793a\u3057\u3066\u3044\u308b\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002
JMSCC0109.useraction = \u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30ea\u30b9\u30ca\u30fc\u304c\u610f\u56f3\u305b\u305a\u5b9f\u884c\u6642\u4f8b\u5916\u3092\u30b9\u30ed\u30fc\u3057\u305f\u5834\u5408\u306f\u3001\u30ea\u30f3\u30af\u306e\u4f8b\u5916\u3092\u4f7f\u7528\u3057\u3066\u554f\u984c\u306e\u539f\u56e0\u3092\u5224\u65ad\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0109.inserts = XMSC_INSERT_EXCEPTION
JMSCC0109.exception = java.lang.RuntimeException

JMSCC0110 = \u30e1\u30c3\u30bb\u30fc\u30b8\u99c6\u52d5\u578b Bean \u3078\u9001\u9054\u3059\u308b\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u51e6\u7406\u4e2d\u306b\u3001\u4f8b\u5916 ''{0}'' \u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
JMSCC0110.useraction = \u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u8abf\u3079\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0110.inserts = XMSC_INSERT_EXCEPTION
JMSCC0110.exception = java.lang.RuntimeException

JMSCC0111 = IBM MQ classes for JMS \u304c\u65e2\u5b58\u306e\u30af\u30e9\u30a4\u30a2\u30f3\u30c8 ID \u3092\u63a5\u7d9a\u306b\u8a2d\u5b9a\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002
JMSCC0111.explanation = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u3001\u6709\u52b9\u306a\u63a5\u7d9a\u307e\u305f\u306f JMSContext \u306e\u30af\u30e9\u30a4\u30a2\u30f3\u30c8 ID \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u5024 ''{0}'' \u306b\u8a2d\u5b9a\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u3001\u3053\u306e\u5024\u306f\u65e2\u306b\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002\n\
clientId \u306f {1} \u306b\u3088\u3063\u3066\u65e2\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002
JMSCC0111.useraction = \u63a5\u7d9a\u304c\u6709\u52b9\u3067\u3042\u308a\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8 ID \u304c\u56fa\u6709\u3067\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC0111.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_STRING
JMSCC0111.exception = com.ibm.msg.client.jms.DetailedInvalidClientIDException

JMSCC0112 = \u9001\u9054\u306e\u9045\u5ef6\u306f\u3001\u3053\u306e\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u3067\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093
JMSCC0112.explanation = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u9001\u9054\u306e\u9045\u5ef6\u3092\u8a2d\u5b9a\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u3001\u3053\u308c\u306f JMS \u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u3067\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093

JMSCC0113 = \u9001\u9054\u306e\u9045\u5ef6\u306f\u5b58\u7d9a\u6642\u9593\u3088\u308a\u77ed\u304f\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
JMSCC0113.explanation = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u9001\u9054\u306e\u9045\u5ef6\u3092\u8a2d\u5b9a\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u3001\u5b58\u7d9a\u6642\u9593\u306f\u3053\u306e\u9045\u5ef6\u3088\u308a\u9577\u304f\u3042\u308a\u307e\u305b\u3093\u3067\u3057\u305f

JMSCC0114 = \u9001\u9054\u306e\u9045\u5ef6\u306f\u3001\u4fdd\u5b58\u30d1\u30d6\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3067\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093
JMSCC0114.explanation = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u4fdd\u5b58\u30e1\u30c3\u30bb\u30fc\u30b8\u3067\u9001\u9054\u306e\u9045\u5ef6\u3092\u8a2d\u5b9a\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u3001\u3053\u308c\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093

JMSCC0115 = \u9001\u9054\u306e\u9045\u5ef6\u306f\u30b0\u30eb\u30fc\u30d7\u5316\u3067\u306f\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093
JMSCC0115.explanation = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u3001\u30b0\u30eb\u30fc\u30d7 ID \u307e\u305f\u306f\u30b0\u30eb\u30fc\u30d7\u30fb\u30b7\u30fc\u30b1\u30f3\u30b9\u756a\u53f7\u3042\u308b\u3044\u306f\u305d\u306e\u4e21\u65b9\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u30e1\u30c3\u30bb\u30fc\u30b8\u3067\u9001\u9054\u306e\u9045\u5ef6\u3092\u8a2d\u5b9a\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u3001\u3053\u308c\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093

# Message for FFST - additional fields not required
JMSCC1026 = \u30e6\u30fc\u30b6\u30fc\u306e\u4f8b\u5916\u30ea\u30b9\u30ca\u30fc\u306e\u5b9f\u884c\u4e2d\u306b\u4f8b\u5916\u304c\u30b9\u30ed\u30fc\u3055\u308c\u307e\u3057\u305f\u3002

# Message for FFST - additional fields not required
JMSCC1027 = \u4f8b\u5916\u30ea\u30b9\u30ca\u30fc\u304c\u5b9f\u884c\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002

JMSCC1069 = XA \u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u5316\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u64cd\u4f5c\u306f\u7121\u52b9\u3067\u3057\u305f\u3002
JMSCC1069.explanation = \u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u5316\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u80af\u5b9a\u5fdc\u7b54\u30e2\u30fc\u30c9\u306f\u7121\u52b9\u3067\u3057\u305f\u3002 commit()\u3001rollback()\u3001acknowledge()\u3001\u304a\u3088\u3073 recover() \u306f\u3001\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u5316\u30bb\u30c3\u30b7\u30e7\u30f3\u3067\u306f\u7121\u52b9\u306a\u64cd\u4f5c\u3067\u3059\u3002
JMSCC1069.useraction = \u3053\u308c\u3089\u306e\u30e1\u30bd\u30c3\u30c9\u306f XA \u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u306f\u547c\u3073\u51fa\u3055\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002
JMSCC1069.exception = com.ibm.msg.client.jms.DetailedTransactionInProgressException

JMSCC1083 = \u6b63\u3057\u304f\u306a\u3044\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30d0\u30c3\u30c1\u30fb\u30b5\u30a4\u30ba (\u30bc\u30ed\u3088\u308a\u5927\u304d\u304f\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093)\u3002
JMSCC1083.explanation = \u6b63\u3057\u304f\u306a\u3044\u30d0\u30c3\u30c1\u30fb\u30b5\u30a4\u30ba\u30fb\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u304c createConnectionConsumer() \u307e\u305f\u306f createDurableConnectionConsumer() \u306b\u6e21\u3055\u308c\u307e\u3057\u305f\u3002
JMSCC1083.useraction = \u30d0\u30c3\u30c1\u30fb\u30b5\u30a4\u30ba\u3092\u30bc\u30ed\u3088\u308a\u5927\u304d\u304f\u8a2d\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002 JEE \u6e96\u62e0\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u3067\u306f\u3001\u3053\u308c\u306f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u3067\u306e\u30a8\u30e9\u30fc\u3092\u8868\u3059\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002 \u3054\u4f7f\u7528\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u306e\u8cc7\u6599\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSCC1084 = \u30cc\u30eb\u306e\u30b5\u30fc\u30d0\u30fc\u30fb\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30d7\u30fc\u30eb\u304c\u63d0\u4f9b\u3055\u308c\u3066\u3044\u307e\u3059\u3002
JMSCC1084.explanation = createConnectionConsumer() \u307e\u305f\u306f createDurableConnectionConsumer() \u306b\u6307\u5b9a\u3055\u308c\u305f\u30b5\u30fc\u30d0\u30fc\u30fb\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30d7\u30fc\u30eb\u304c\u30cc\u30eb\u3067\u3057\u305f\u3002
JMSCC1084.useraction = \u9069\u5207\u306a ServerSessionPool \u3092\u8a2d\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002 JEE \u6e96\u62e0\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u3067\u306f\u3001\u3053\u308c\u306f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u3067\u306e\u30a8\u30e9\u30fc\u3092\u8868\u3059\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002 \u3054\u4f7f\u7528\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u306e\u8cc7\u6599\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSCC1093 = \u30cc\u30eb\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u304c\u6e21\u3055\u308c\u307e\u3057\u305f\u3002
JMSCC1093.explanation = \u3053\u306e\u30e1\u30bd\u30c3\u30c9\u304c\u5fc5\u8981\u3068\u3059\u308b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306f\u6b63\u3057\u304f\u521d\u671f\u5316\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSCC1093.useraction = \u3053\u306e\u30e1\u30bd\u30c3\u30c9\u306b\u6e21\u3055\u308c\u308b\u3059\u3079\u3066\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u304c\u6b63\u3057\u304f\u521d\u671f\u5316\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSCC1094 = QuantityHint \u306f\u7121\u52b9\u3067\u3059\u3002
JMSCC1094.explanation = \u6b63\u3057\u304f\u306a\u3044\u30c7\u30fc\u30bf\u6570\u91cf\u30d2\u30f3\u30c8\u3067\u63a5\u7d9a\u30d6\u30e9\u30a6\u30b6\u30fc\u306e\u4f5c\u6210\u304c\u8a66\u884c\u3055\u308c\u307e\u3057\u305f\u3002
JMSCC1094.useraction = NO_DATA\u3001HEADER_DATA\u3001\u307e\u305f\u306f FULL_DATA \u306e\u3044\u305a\u308c\u304b\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC1094.exception = java.lang.IllegalArgumentException

JMSCC1096 = \u30e1\u30c3\u30bb\u30fc\u30b8\u53c2\u7167\u304c\u7121\u52b9\u3067\u3059\u3002
JMSCC1096.explanation = \u6b63\u3057\u304f\u306a\u3044\u5f62\u5f0f\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u53c2\u7167\u304c\u3053\u306e\u30e1\u30bd\u30c3\u30c9\u306b\u6e21\u3055\u308c\u307e\u3057\u305f\u3002 \u30e1\u30c3\u30bb\u30fc\u30b8\u53c2\u7167\u306f JmsMessageReference \u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
JMSCC1096.useraction = \u6b63\u3057\u3044\u30e1\u30c3\u30bb\u30fc\u30b8\u53c2\u7167\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSCC1112 = \u30c9\u30e1\u30a4\u30f3\u56fa\u6709\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u5bfe\u3059\u308b\u64cd\u4f5c\u306f\u7121\u52b9\u3067\u3057\u305f\u3002 \u64cd\u4f5c ''{0}'' \u306f\u30bf\u30a4\u30d7 ''{1}'' \u3067\u306f\u7121\u52b9\u3067\u3059\u3002
JMSCC1112.explanation = JMS \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u30c9\u30e1\u30a4\u30f3\u56fa\u6709\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u5bfe\u3059\u308b\u64cd\u4f5c\u3092\u5b9f\u884c\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u3001\u64cd\u4f5c\u306f\u4ed6\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30c9\u30e1\u30a4\u30f3\u3067\u306e\u307f\u6709\u52b9\u3067\u3059\u3002
JMSCC1112.useraction = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u3088\u308a\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b JMS \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304a\u3088\u3073\u64cd\u4f5c\u304c\u3001\u5fc5\u8981\u306a\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30c9\u30e1\u30a4\u30f3\u306b\u9069\u5207\u3067\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u4e21\u65b9\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30c9\u30e1\u30a4\u30f3\u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u306f\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u5168\u4f53\u3067\u30c9\u30e1\u30a4\u30f3\u975e\u4f9d\u5b58\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u4f7f\u7528\u3059\u308b\u3053\u3068\u3092\u8003\u616e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC1112.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_TYPE
JMSCC1112.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC1113 = \u30c9\u30e1\u30a4\u30f3\u56fa\u6709\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u5bfe\u3059\u308b\u64cd\u4f5c\u306f\u7121\u52b9\u3067\u3057\u305f\u3002 \u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u30bf\u30a4\u30d7\u304c ''{2}'' \u306a\u306e\u3067\u3001\u30bf\u30a4\u30d7 ''{1}'' \u306e\u64cd\u4f5c ''{0}'' \u306f\u7121\u52b9\u3067\u3059\u3002
JMSCC1113.explanation = JMS \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u30c9\u30e1\u30a4\u30f3\u56fa\u6709\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u5bfe\u3059\u308b\u64cd\u4f5c\u3092\u5b9f\u884c\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u3001\u64cd\u4f5c\u306f\u4ed6\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30c9\u30e1\u30a4\u30f3\u3067\u306e\u307f\u6709\u52b9\u3067\u3059\u3002
JMSCC1113.useraction = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u3088\u308a\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b JMS \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3001\u64cd\u4f5c\u3001\u304a\u3088\u3073\u63a5\u7d9a\u30d5\u30a1\u30af\u30c8\u30ea\u30fc\u304c\u3001\u5fc5\u8981\u306a\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30c9\u30e1\u30a4\u30f3\u306b\u9069\u5207\u3067\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u4e21\u65b9\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30c9\u30e1\u30a4\u30f3\u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u306f\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u5168\u4f53\u3067\u30c9\u30e1\u30a4\u30f3\u975e\u4f9d\u5b58\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u4f7f\u7528\u3059\u308b\u3053\u3068\u3092\u8003\u616e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC1113.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_TYPE,XMSC_INSERT_SESSION
JMSCC1113.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC3002 = \u4e00\u6642\u30ad\u30e5\u30fc\u5b9b\u5148 ''{0}'' \u306f\u3001\u4f7f\u7528\u4e2d\u3067\u3042\u308b\u305f\u3081\u524a\u9664\u3067\u304d\u307e\u305b\u3093\u3002
JMSCC3002.explanation = \u30b3\u30f3\u30b7\u30e5\u30fc\u30de\u30fc\u307e\u305f\u306f\u30d6\u30e9\u30a6\u30b6\u30fc\u306b\u3088\u308a\u4f7f\u7528\u4e2d\u306b\u3001\u4e00\u6642\u5b9b\u5148\u3092\u524a\u9664\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002
JMSCC3002.useraction = \u5b9b\u5148\u306b\u4f9d\u5b58\u3059\u308b\u3059\u3079\u3066\u306e\u30b3\u30f3\u30b7\u30e5\u30fc\u30de\u30fc\u3068\u30d6\u30e9\u30a6\u30b6\u30fc\u3092\u3001\u5b9b\u5148\u3092\u524a\u9664\u3059\u308b\u524d\u306b\u30af\u30ed\u30fc\u30ba\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC3002.inserts = XMSC_DESTINATION_NAME

JMSCC3003 = \u4e00\u6642\u5b9b\u5148 ''{0}'' \u306e\u4f7f\u7528\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002
JMSCC3003.explanation = \u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30b3\u30f3\u30b7\u30e5\u30fc\u30de\u30fc\u304a\u3088\u3073\u30d6\u30e9\u30a6\u30b6\u30fc\u306e\u4e00\u6642\u5b9b\u5148\u306e\u4f7f\u7528\u306f\u3001\u540c\u3058\u63a5\u7d9a\u3092\u4f7f\u7528\u3057\u3066\u4f5c\u6210\u3055\u308c\u305f\u3082\u306e\u306b\u5236\u9650\u3055\u308c\u3066\u3044\u307e\u3059\u3002
JMSCC3003.useraction = \u540c\u3058\u63a5\u7d9a\u306b\u3088\u308a\u4f5c\u6210\u3055\u308c\u305f\u4e00\u6642\u5b9b\u5148\u3092\u4f7f\u7528\u3059\u308b\u3088\u3046\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u5909\u66f4\u3057\u3066\u3001\u518d\u8a66\u884c\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC3003.inserts = XMSC_DESTINATION_NAME
JMSCC3003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException


JMSCC3019 = \u4e00\u6642\u5b9b\u5148\u306f\u65e2\u306b\u524a\u9664\u3055\u308c\u3066\u3044\u307e\u3059 ''{0}''\u3002
JMSCC3019.explanation = \u4e00\u6642\u5b9b\u5148\u3092\u4f7f\u7528\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u3001\u3053\u308c\u306f\u305d\u306e\u6642\u3059\u3067\u306b\u524a\u9664\u3055\u308c\u3066\u3044\u307e\u3057\u305f\u3002
JMSCC3019.useraction = \u4e00\u6642\u5b9b\u5148\u3092\u30af\u30ed\u30fc\u30ba\u3057\u306a\u3044\u3088\u3046\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u5909\u66f4\u3059\u308b\u304b\u3001\u5225\u306e\u5b9b\u5148\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC3019.inserts = XMSC_DESTINATION_NAME
JMSCC3019.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC3025 = \u4e00\u6642\u30c8\u30d4\u30c3\u30af\u5b9b\u5148 ''{0}'' \u306f\u3001\u4f7f\u7528\u4e2d\u3067\u3042\u308b\u305f\u3081\u524a\u9664\u3067\u304d\u307e\u305b\u3093\u3002
JMSCC3025.explanation = \u30b3\u30f3\u30b7\u30e5\u30fc\u30de\u30fc\u307e\u305f\u306f\u30d6\u30e9\u30a6\u30b6\u30fc\u306b\u3088\u308a\u4f7f\u7528\u4e2d\u306b\u3001\u4e00\u6642\u5b9b\u5148\u3092\u524a\u9664\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002
JMSCC3025.useraction = \u5b9b\u5148\u306b\u4f9d\u5b58\u3059\u308b\u3059\u3079\u3066\u306e\u30b3\u30f3\u30b7\u30e5\u30fc\u30de\u30fc\u3068\u30d6\u30e9\u30a6\u30b6\u30fc\u3092\u3001\u5b9b\u5148\u3092\u524a\u9664\u3059\u308b\u524d\u306b\u30af\u30ed\u30fc\u30ba\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC3025.inserts = XMSC_DESTINATION_NAME

JMSCC3031 = \u30af\u30e9\u30a4\u30a2\u30f3\u30c8 ID \u306f\u63a5\u7d9a\u306e\u4f7f\u7528\u5f8c\u306b\u8a2d\u5b9a\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
JMSCC3031.explanation = \u63a5\u7d9a\u306e\u30af\u30e9\u30a4\u30a2\u30f3\u30c8 ID \u306f\u4e00\u5ea6\u3060\u3051\u3001\u305d\u306e\u63a5\u7d9a\u304c\u4f7f\u7528\u3055\u308c\u308b\u524d\u3060\u3051\u306b\u8a2d\u5b9a\u3067\u304d\u307e\u3059\u3002
JMSCC3031.useraction = \u63a5\u7d9a\u3092\u4f7f\u7528\u3059\u308b\u524d\u306b\u30af\u30e9\u30a4\u30a2\u30f3\u30c8 ID \u3092\u8a2d\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC3031.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC3032 = \u30af\u30e9\u30a4\u30a2\u30f3\u30c8 ID \u306e\u30ea\u30bb\u30c3\u30c8\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSCC3032.explanation = \u63a5\u7d9a\u306e\u30af\u30e9\u30a4\u30a2\u30f3\u30c8 ID \u306f\u4e00\u5ea6\u3060\u3051\u3001\u305d\u306e\u63a5\u7d9a\u304c\u4f7f\u7528\u3055\u308c\u308b\u524d\u3060\u3051\u306b\u8a2d\u5b9a\u3067\u304d\u307e\u3059\u3002
JMSCC3032.useraction = \u63a5\u7d9a\u3092\u4f7f\u7528\u3059\u308b\u524d\u306b\u30af\u30e9\u30a4\u30a2\u30f3\u30c8 ID \u3092\u8a2d\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC3032.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC3033 = \u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30ea\u30b9\u30ca\u30fc\u5185\u306e close() \u547c\u3073\u51fa\u3057\u306f\u30c7\u30c3\u30c9\u30ed\u30c3\u30af\u3057\u3066\u3044\u307e\u3059\u3002
JMSCC3033.explanation = close() \u30e1\u30bd\u30c3\u30c9\u306f\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30ea\u30b9\u30ca\u30fc\u304b\u3089\u547c\u3073\u51fa\u3055\u308c\u307e\u3057\u305f\u3002 close() \u547c\u3073\u51fa\u3057\u306f\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30ea\u30b9\u30ca\u30fc\u306e\u5b9f\u884c\u4e2d\u306b\u623b\u3059\u3053\u3068\u304c\u3067\u304d\u306a\u3044\u305f\u3081\u3001\u30c7\u30c3\u30c9\u30ed\u30c3\u30af\u3057\u307e\u3059\u3002
JMSCC3033.useraction = \u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30ea\u30b9\u30ca\u30fc\u5185\u304b\u3089 close() \u30e1\u30bd\u30c3\u30c9\u3092\u547c\u3073\u51fa\u3055\u306a\u3044\u3088\u3046\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC3033.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

# Log message
JMSCC3034 = \u4f8b\u5916\u30ea\u30b9\u30ca\u30fc\u304c\u767b\u9332\u3055\u308c\u3066\u3044\u306a\u3044\u305f\u3081\u3001\u4f8b\u5916\u306f\u7121\u8996\u3055\u308c\u307e\u3059: ''{0}''\u3002
JMSCC3034.explanation = \u63a5\u7d9a\u306e\u4f8b\u5916\u30ea\u30b9\u30ca\u30fc\u306b\u4f8b\u5916\u3092\u9001\u9054\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u3001\u30ea\u30b9\u30ca\u30fc\u304c\u307e\u3060\u767b\u9332\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSCC3034.useraction = \u4f8b\u5916\u30ea\u30b9\u30ca\u30fc\u306f\u3001\u63a5\u7d9a\u306b\u767b\u9332\u3055\u308c\u3066\u3044\u306a\u3051\u308c\u3070\u3001\u305d\u306e\u4f8b\u5916\u3092\u53d7\u4fe1\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002
JMSCC3034.inserts = XMSC_INSERT_EXCEPTION

# Log message
JMSCC3035 = \u4f8b\u5916\u306e\u30bf\u30a4\u30d7\u304c\u4f8b\u5916\u30ea\u30b9\u30ca\u30fc ''{0}'' \u306b\u5bfe\u3057\u3066\u9078\u629e\u3055\u308c\u305f\u30bf\u30a4\u30d7\u306e\u7bc4\u56f2\u5916\u3067\u3042\u308b\u305f\u3081\u3001\u4f8b\u5916\u306f\u7121\u8996\u3055\u308c\u307e\u3059\u3002
JMSCC3035.explanation = \u4f8b\u5916\u306f\u63a5\u7d9a\u306e\u4f8b\u5916\u30ea\u30b9\u30ca\u30fc\u3078\u306e\u9001\u9054\u7528\u306b\u9078\u629e\u3055\u308c\u305f\u30bf\u30a4\u30d7\u306b\u542b\u307e\u308c\u306a\u3044\u305f\u3081\u3001\u7121\u8996\u3055\u308c\u307e\u3057\u305f\u3002
JMSCC3035.useraction = ASYNC_EXCEPTIONS \u63a5\u7d9a\u8a2d\u5b9a\u3092\u691c\u8a0e\u3057\u3066\u3001\u4f8b\u5916\u30d5\u30a3\u30eb\u30bf\u30fc\u304c\u4e88\u5b9a\u3069\u304a\u308a\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC3035.inserts = XMSC_INSERT_EXCEPTION

# Log message
JMSCC3036 = \u63a5\u7d9a\u306e\u4f8b\u5916\u30ea\u30b9\u30ca\u30fc ''{0}'' \u306b\u4f8b\u5916\u304c\u65e2\u306b\u9001\u9054\u3055\u308c\u307e\u3057\u305f\u3002
JMSCC3036.useraction = \u8a73\u3057\u304f\u306f\u3001\u4f8b\u5916\u306e\u8a73\u7d30\u3092\u691c\u8a0e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC3036.inserts = XMSC_INSERT_EXCEPTION

JMSCC3039 = \u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u540d\u304c\u30cc\u30eb\u3067\u3042\u308b\u304b\u3001\u307e\u305f\u306f\u7a7a\u30b9\u30c8\u30ea\u30f3\u30b0\u3067\u3057\u305f\u3002
JMSCC3039.explanation = \u6c38\u7d9a\u7684\u63a5\u7d9a\u30b3\u30f3\u30b7\u30e5\u30fc\u30de\u30fc\u306f\u3001\u975e\u30cc\u30eb\u3067\u3001\u7a7a\u30b9\u30c8\u30ea\u30f3\u30b0\u3067\u306f\u306a\u3044\u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u540d\u3092\u6301\u305f\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
JMSCC3039.useraction = \u975e\u30cc\u30eb\u3067\u3001\u7a7a\u30b9\u30c8\u30ea\u30f3\u30b0\u3067\u306f\u306a\u3044\u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u540d\u3092\u6e21\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSCC3040 = ConnectionMetadata \u3092\u5909\u66f4\u3059\u308b\u8a66\u307f\u304c\u7121\u8996\u3055\u308c\u307e\u3057\u305f\u3002 
JMSCC3040.explanation = ConnectionMetadata \u306f\u8aad\u307f\u53d6\u308a\u5c02\u7528\u3067\u3001\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306f\u5909\u66f4\u3067\u304d\u307e\u305b\u3093\u3002
JMSCC3040.useraction = ConnectionMetadata \u3092\u5909\u66f4\u305b\u305a\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSCC3041 = \u8907\u6570\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u4e00\u5ea6\u306b\u8a2d\u5b9a\u3059\u308b\u8a66\u307f\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002 \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306f ''{0}'' \u3067\u3059\u3002
JMSCC3041.explanation = 1 \u3064\u4ee5\u4e0a\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u691c\u8a3c\u304c\u5931\u6557\u3057\u305f\u305f\u3081\u3001\u5909\u66f4\u306f\u5b9f\u884c\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002
JMSCC3041.useraction = \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u7d44\u307f\u5408\u308f\u305b\u304c\u6b63\u3057\u3044\u5024\u306b\u306a\u3063\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002 
JMSCC3041.inserts = XMSC_INSERT_PROPERTY

# XA unavailable. An attempt was made to perform and action that requires XA when XA is not supported.
JMSCC4001 = \u5206\u6563\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u304c\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002
JMSCC4001.explanation = \u5206\u6563\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u3092\u3001\u4f7f\u7528\u3067\u304d\u306a\u3044\u74b0\u5883\u3067\u4f7f\u7528\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002


JMSCC5001 = \u30e1\u30c3\u30bb\u30fc\u30b8\u304c StreamMessage \u3067\u3042\u308b\u305f\u3081\u3001\u672c\u6587\u3092\u53d7\u4fe1\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f
JMSCC5001.explanation = \u30e1\u30c3\u30bb\u30fc\u30b8\u306f StreamMessage \u3067\u3042\u308a\u3001JMS \u4ed5\u69d8\u3067\u8a31\u53ef\u3055\u308c\u3066\u3044\u306a\u3044\u305f\u3081\u3001\u672c\u6587\u3092\u53d7\u4fe1\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f
JMSCC5001.useraction = \u9001\u4fe1\u3055\u308c\u305f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30bf\u30a4\u30d7\u307e\u305f\u306f\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30bf\u30a4\u30d7\u306f\u3001\u5909\u66f4\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059
JMSCC5001.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC5002 = \u30bf\u30a4\u30d7 {0} \u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u672c\u6587\u3092 {1} \u306b\u5272\u308a\u5f53\u3066\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093
JMSCC5002.explanation = JMS \u4ed5\u69d8\u306f\u3001\u3053\u306e\u30bf\u30a4\u30d7\u306e\u5272\u308a\u5f53\u3066\u3092\u8a31\u53ef\u3057\u3066\u3044\u307e\u305b\u3093
JMSCC5002.useraction = \u9001\u4fe1\u3055\u308c\u305f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30bf\u30a4\u30d7\u307e\u305f\u306f\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30bf\u30a4\u30d7\u306f\u3001\u5909\u66f4\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059
JMSCC5002.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC5002.inserts = XMSC_INSERT_MESSAGE_TYPE, XMSC_INSERT_BODY_TYPE

JMSCC5003 = \u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u975e\u76f4\u5217\u5316\u6642\u306b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u4f8b\u5916: ''{0}''\u3002
JMSCC5003.explanation = \u4f8b\u5916\u304c\u8868\u793a\u3055\u308c\u305f\u305f\u3081\u306b\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u975e\u76f4\u5217\u5316\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
JMSCC5003.useraction = \u30a8\u30e9\u30fc\u306b\u3064\u3044\u3066\u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u8abf\u3079\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC5003.inserts = XMSC_INSERT_EXCEPTION
JMSCC5003.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC5004 = \u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u672c\u6587\u304c\u3042\u308a\u307e\u305b\u3093
JMSCC5004.explanation = \u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u672c\u6587\u304c\u306a\u3044\u305f\u3081\u3001\u6307\u5b9a\u3055\u308c\u305f\u30bf\u30a4\u30d7\u306b\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u5909\u63db\u3067\u304d\u307e\u305b\u3093
JMSCC5004.useraction = \u9001\u4fe1\u3055\u308c\u305f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30bf\u30a4\u30d7\u307e\u305f\u306f\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30bf\u30a4\u30d7\u306f\u3001\u5909\u66f4\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059
JMSCC5004.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC5005 = \u30e1\u30c3\u30bb\u30fc\u30b8\u672c\u4f53\u306f\u8aad\u307f\u53d6\u308a\u5c02\u7528\u3067\u3042\u308a\u3001JmsProducer.setProperty \u547c\u3073\u51fa\u3057\u304c\u884c\u308f\u308c\u3066\u3044\u308b\u305f\u3081\u3001\u3053\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u9001\u4fe1\u3059\u308b\u3053\u3068\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSCC5005.explanation = \u30e6\u30fc\u30b6\u30fc\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u3001JmsProducer.setProperty \u547c\u3073\u51fa\u3057\u3092\u4ecb\u3057\u3066\u3001\u8aad\u307f\u53d6\u308a\u5c02\u7528\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u672c\u4f53\u3092\u8a2d\u5b9a\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002
JMSCC5005.useraction = \u3053\u306e\u52d5\u4f5c\u3092\u524a\u9664\u3059\u308b\u3088\u3046\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30d7\u30ed\u30b0\u30e9\u30e0\u3092\u5909\u66f4\u3059\u308b\u304b\u3001\u307e\u305f\u306f clearBody() \u30e1\u30bd\u30c3\u30c9\u3092\u307e\u305a\u547c\u3073\u51fa\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC5005.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSCC5006 = \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30fb\u30b5\u30a4\u30c9\u306e\u975e\u540c\u671f\u9001\u4fe1\u30d0\u30c3\u30d5\u30a1\u30fc\u304c\u3044\u3063\u3071\u3044\u3067\u3042\u308b\u305f\u3081\u3001\u3053\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u9001\u4fe1\u3059\u308b\u3053\u3068\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSCC5006.explanation = \u30e6\u30fc\u30b6\u30fc\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u975e\u540c\u671f\u306b JMS \u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u9001\u4fe1\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306b\u975e\u540c\u671f\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u30d0\u30c3\u30af\u30ed\u30b0\u304c\u3059\u3067\u306b\u3042\u308a\u307e\u3059\u3002
JMSCC5006.useraction = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30d7\u30ed\u30b0\u30e9\u30e0\u3092\u5909\u66f4\u3057\u3066\u975e\u540c\u671f\u9001\u4fe1\u30e1\u30bd\u30c3\u30c9\u306e\u547c\u3073\u51fa\u3057\u983b\u5ea6\u3092\u4f4e\u304f\u3059\u308b\u304b\u3001\u3054\u4f7f\u7528\u306e\u69cb\u6210\u30aa\u30d7\u30b7\u30e7\u30f3\u306e\u8cc7\u6599\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSCC5007 = JMS2.0 API ''{0}'' \u306e\u4f7f\u7528\u306f\u3001\u3053\u306e\u63a5\u7d9a\u306e\u3053\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3067\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093
JMSCC5007.explanation = \u6b63\u3057\u3044\u30bf\u30a4\u30d7\u306e\u63a5\u7d9a\u3092\u4f7f\u7528\u3057\u305f\u63a5\u7d9a\u306e\u307f\u304c\u3001JMS2.0 API \u306e\u4f7f\u7528\u3092\u30b5\u30dd\u30fc\u30c8\u3067\u304d\u307e\u3059
JMSCC5007.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC5007.inserts =XMSC_INSERT_METHOD

JMSCC5008 = JMS2.0 \u6a5f\u80fd ''{0}'' \u306e\u4f7f\u7528\u306f\u3001\u3053\u306e\u63a5\u7d9a\u306e\u3053\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3067\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093
JMSCC5008.explanation = \u30e1\u30c3\u30bb\u30fc\u30b8\u3067\u8a00\u53ca\u3055\u308c\u3066\u3044\u308b JMS2.0 \u6a5f\u80fd\u306e\u4f7f\u7528\u306f\u3001IBM MQ \u30e1\u30c3\u30bb\u30fc\u30b8\u30f3\u30b0\u30fb\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc V8 \u30e2\u30fc\u30c9\u3092\u4f7f\u7528\u3057\u3066 IBM MQ V8 \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306b\u63a5\u7d9a\u3057\u3066\u3044\u308b\u3068\u304d\u306b\u306e\u307f\u3001\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u307e\u3059\u3002
JMSCC5008.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC5008.inserts =XMSC_INSERT_METHOD

JMSCC5009 = \u9001\u4fe1\u30b9\u30ec\u30c3\u30c9\u304b\u3089\u306e\u5fdc\u7b54\u304c\u3042\u308a\u307e\u305b\u3093\u3002 \u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u9001\u4fe1\u3055\u308c\u3066\u3044\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059
JMSCC5009.explanation = \u975e\u540c\u671f\u9001\u4fe1\u30b9\u30ec\u30c3\u30c9\u304c\u5fdc\u7b54\u3057\u3066\u3044\u307e\u305b\u3093\u3002 \u30b9\u30ec\u30c3\u30c9\u304c\u4e88\u671f\u305b\u305a\u7d42\u4e86\u3057\u305f\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002

JMSCC5010 = PropertyStore \u304b\u3089 ConnectionFactory \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u6307\u5b9a\u5909\u66f4\u3057\u307e\u3059:\n\
{0}
JMSCC5010.inserts = XMSC_INSERT_PROPERTY_OVERRIDE_LIST

JMSCC5011 = \u6307\u5b9a\u5909\u66f4\u3059\u308b\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc {0}:\n\
\t\u5143\u306e\u5024 = {1}\n\
\t\u65b0\u3057\u3044\u5024      = {2}
JMSCC5011.inserts = XMSC_OVERRIDDEN_PROPERTY, XMSC_ORIGINAL__PROPERTY_VALUE, XMSC_NEW_PROPERTY_VALUE

#CICS related messages. JMSCC6 used to prevent issues when back porting.
#The first two exceptions have the same text but different exception types
JMSCC6001 = CICS \u74b0\u5883\u3067\u5b9f\u884c\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001''{0}'' \u30e1\u30bd\u30c3\u30c9\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u307e\u305b\u3093\u3002
JMSCC6001.explanation = CICS \u74b0\u5883\u3067\u306f\u3001\u6307\u5b9a\u3055\u308c\u305f\u30e1\u30bd\u30c3\u30c9\u3092 MQ \u3078\u306e\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u30fb\u30e2\u30fc\u30c9\u63a5\u7d9a\u3067\u4f7f\u7528\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
JMSCC6001.useraction = \u6307\u5b9a\u3055\u308c\u305f\u30e1\u30bd\u30c3\u30c9\u3092\u547c\u3073\u51fa\u3055\u306a\u3044\u3088\u3046\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC6001.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6001.inserts = XMSC_INSERT_METHOD
 
JMSCC6002 = CICS \u74b0\u5883\u3067\u5b9f\u884c\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001''{0}'' \u30e1\u30bd\u30c3\u30c9\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u307e\u305b\u3093\u3002
JMSCC6002.explanation = CICS \u74b0\u5883\u3067\u306f\u3001\u6307\u5b9a\u3055\u308c\u305f\u30e1\u30bd\u30c3\u30c9\u3092 MQ \u3078\u306e\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u30fb\u30e2\u30fc\u30c9\u63a5\u7d9a\u3067\u4f7f\u7528\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
JMSCC6002.useraction = \u6307\u5b9a\u3055\u308c\u305f\u30e1\u30bd\u30c3\u30c9\u3092\u547c\u3073\u51fa\u3055\u306a\u3044\u3088\u3046\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC6002.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC6002.inserts = XMSC_INSERT_METHOD
 
JMSCC6003 = CICS \u74b0\u5883\u3067\u5b9f\u884c\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u5404\u63a5\u7d9a\u3067\u4e00\u5ea6\u306b\u30a2\u30af\u30c6\u30a3\u30d6\u306b\u3067\u304d\u308b\u306e\u306f 1 \u3064\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u307f\u3067\u3059\u3002
JMSCC6003.explanation = CICS \u74b0\u5883\u3067\u306f\u3001MQ \u3078\u306e\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u30fb\u30e2\u30fc\u30c9\u63a5\u7d9a\u3054\u3068\u306b\u4e00\u5ea6\u306b\u30a2\u30af\u30c6\u30a3\u30d6\u306b\u3067\u304d\u308b\u306e\u306f\u30011 \u3064\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u307f\u3067\u3059\u3002
JMSCC6003.useraction = \u7570\u306a\u308b\u63a5\u7d9a\u304b\u3089\u30bb\u30c3\u30b7\u30e7\u30f3\u3092\u4f5c\u6210\u3059\u308b\u3088\u3046\u306b\u3001\u307e\u305f\u306f\u73fe\u884c\u63a5\u7d9a\u3092\u4f7f\u7528\u3059\u308b\u65e2\u5b58\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u3092\u9589\u3058\u308b\u3088\u3046\u306b\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u5909\u66f4\u3057\u307e\u3059\u3002
JMSCC6003.exception = com.ibm.msg.client.jms.DetailedJMSException
 
JMSCC6004 = CICS \u74b0\u5883\u3067\u5b9f\u884c\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u30e6\u30fc\u30b6\u30fc ID \u307e\u305f\u306f\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u4f7f\u7528\u3057\u305f\u63a5\u7d9a\u307e\u305f\u306f JMS \u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306e\u4f5c\u6210\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u307e\u305b\u3093\u3002
JMSCC6004.explanation = CICS \u74b0\u5883\u3067\u306e\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u30fb\u30e2\u30fc\u30c9\u63a5\u7d9a\u307e\u305f\u306f JMS \u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306e\u4f5c\u6210\u6642\u306b\u6307\u5b9a\u3055\u308c\u305f\u30e6\u30fc\u30b6\u30fc ID \u304a\u3088\u3073\u30d1\u30b9\u30ef\u30fc\u30c9\u306b\u3088\u308b\u8a8d\u8a3c\u307e\u305f\u306f\u8a31\u53ef\u306f\u3001\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002 \u4ee3\u308f\u308a\u306b\u3001CICS \u30a2\u30c9\u30ec\u30b9\u30fb\u30b9\u30da\u30fc\u30b9\u307e\u305f\u306f\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u305f\u30e6\u30fc\u30b6\u30fc ID \u304c\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
JMSCC6004.useraction = \u30e6\u30fc\u30b6\u30fc ID \u307e\u305f\u306f\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u6307\u5b9a\u3057\u306a\u3044\u3088\u3046\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC6004.exception = com.ibm.msg.client.jms.DetailedJMSException

#The first two exceptions have the same text but different exception types
JMSCC6011 = IMS \u74b0\u5883\u3067\u5b9f\u884c\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001''{0}'' \u30e1\u30bd\u30c3\u30c9\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u307e\u305b\u3093\u3002
JMSCC6011.explanation = IMS \u74b0\u5883\u3067\u306f\u3001\u6307\u5b9a\u3055\u308c\u305f\u30e1\u30bd\u30c3\u30c9\u3092 MQ \u3078\u306e\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u30fb\u30e2\u30fc\u30c9\u63a5\u7d9a\u3067\u4f7f\u7528\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
JMSCC6011.useraction = \u6307\u5b9a\u3055\u308c\u305f\u30e1\u30bd\u30c3\u30c9\u3092\u547c\u3073\u51fa\u3055\u306a\u3044\u3088\u3046\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC6011.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6011.inserts = XMSC_INSERT_METHOD
 
JMSCC6012 = IMS \u74b0\u5883\u3067\u5b9f\u884c\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001''{0}'' \u30e1\u30bd\u30c3\u30c9\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u307e\u305b\u3093\u3002
JMSCC6012.explanation = IMS \u74b0\u5883\u3067\u306f\u3001\u6307\u5b9a\u3055\u308c\u305f\u30e1\u30bd\u30c3\u30c9\u3092 MQ \u3078\u306e\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u30fb\u30e2\u30fc\u30c9\u63a5\u7d9a\u3067\u4f7f\u7528\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
JMSCC6012.useraction = \u6307\u5b9a\u3055\u308c\u305f\u30e1\u30bd\u30c3\u30c9\u3092\u547c\u3073\u51fa\u3055\u306a\u3044\u3088\u3046\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC6012.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC6012.inserts = XMSC_INSERT_METHOD
 
JMSCC6013 = IMS \u74b0\u5883\u3067\u5b9f\u884c\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u5404\u63a5\u7d9a\u3067\u4e00\u5ea6\u306b\u30a2\u30af\u30c6\u30a3\u30d6\u306b\u3067\u304d\u308b\u306e\u306f 1 \u3064\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u307f\u3067\u3059\u3002
JMSCC6013.explanation = IMS \u74b0\u5883\u3067\u306f\u3001MQ \u3078\u306e\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u30fb\u30e2\u30fc\u30c9\u63a5\u7d9a\u3054\u3068\u306b\u4e00\u5ea6\u306b\u30a2\u30af\u30c6\u30a3\u30d6\u306b\u3067\u304d\u308b\u306e\u306f\u30011 \u3064\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u307f\u3067\u3059\u3002
JMSCC6013.useraction = \u7570\u306a\u308b\u63a5\u7d9a\u304b\u3089\u30bb\u30c3\u30b7\u30e7\u30f3\u3092\u4f5c\u6210\u3059\u308b\u3088\u3046\u306b\u3001\u307e\u305f\u306f\u73fe\u884c\u63a5\u7d9a\u3092\u4f7f\u7528\u3059\u308b\u65e2\u5b58\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u3092\u9589\u3058\u308b\u3088\u3046\u306b\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u5909\u66f4\u3057\u307e\u3059\u3002
JMSCC6013.exception = com.ibm.msg.client.jms.DetailedJMSException
 
JMSCC6014 = IMS \u74b0\u5883\u3067\u5b9f\u884c\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u30e6\u30fc\u30b6\u30fc ID \u307e\u305f\u306f\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u4f7f\u7528\u3057\u305f\u63a5\u7d9a\u307e\u305f\u306f JMS \u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306e\u4f5c\u6210\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u307e\u305b\u3093\u3002
JMSCC6014.explanation = IMS \u74b0\u5883\u3067\u306e\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u30fb\u30e2\u30fc\u30c9\u63a5\u7d9a\u307e\u305f\u306f JMS \u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306e\u4f5c\u6210\u6642\u306b\u6307\u5b9a\u3055\u308c\u305f\u30e6\u30fc\u30b6\u30fc ID \u304a\u3088\u3073\u30d1\u30b9\u30ef\u30fc\u30c9\u306b\u3088\u308b\u8a8d\u8a3c\u307e\u305f\u306f\u8a31\u53ef\u306f\u3001\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002 \u4ee3\
\u308f\u308a\u306b\u3001IMS \u30a2\u30c9\u30ec\u30b9\u30fb\u30b9\u30da\u30fc\u30b9\u3001\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u3001LTERM \u540d\u307e\u305f\u306f PSBNAME \u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u305f\u30e6\u30fc\u30b6\u30fc ID \u304c\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
JMSCC6014.useraction = \u30e6\u30fc\u30b6\u30fc ID \u307e\u305f\u306f\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u6307\u5b9a\u3057\u306a\u3044\u3088\u3046\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC6014.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSCC6015 = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u3067\u5b9f\u884c\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001''{0}'' \u30e1\u30bd\u30c3\u30c9\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u307e\u305b\u3093
JMSCC6015.explanation = \u6307\u5b9a\u3055\u308c\u305f\u30e1\u30bd\u30c3\u30c9\u306f Java EE EJB \u307e\u305f\u306f Web \u30b3\u30f3\u30c6\u30ca\u30fc\u3067\u4f7f\u7528\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002
JMSCC6015.useraction = \u6307\u5b9a\u3055\u308c\u305f\u30e1\u30bd\u30c3\u30c9\u3092\u547c\u3073\u51fa\u3055\u306a\u3044\u3088\u3046\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCC6015.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6015.inserts = XMSC_INSERT_METHOD

JMSCC6016 = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u306b\u3088\u308b\u30b5\u30fc\u30d0\u30fc\u30fb\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u53d6\u5f97\u3092\u5f85\u6a5f\u3057\u3066\u3044\u308b\u3068\u304d\u306b\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u306b\u306a\u308a\u307e\u3057\u305f\u3002 \u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u306f ''{0}'' \u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059
JMSCC6016.explanation = \u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u5024\u306e\u671f\u9650\u304c\u5207\u308c\u308b\u3068\u3001MQ Resource Adapter \u306f\u30b5\u30fc\u30d0\u30fc\u30fb\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u5f85\u6a5f\u3092\u4e2d\u6b62\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
JMSCC6016.useraction = JMS \u69cb\u6210\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc 'com.ibm.msg.client.wmq.getServerSessionTimeout' \u3067\u3001\u3053\u306e\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u3092\u5897\u3084\u3059\u3053\u3068\u3092\u691c\u8a0e\u3057\u3066\u304f\u3060\u3055\u3044
JMSCC6016.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6016.inserts = XMSC_INSERT_TIMEOUT
 
