# %Z% %W% %I% %E% %U%
#
#   <copyright 
#   notice="oco-source" 
#   pids="5724-H72" 
#   years="2008,2017" 
#   crc="775383328" > 
#   IBM Confidential 
#    
#   OCO Source Materials 
#    
#   5724-H72,5655-R36,5655-L82,5724-L26, 
#    
#   (C) Copyright IBM Corp. 2008, 2017 
#    
#   The source code for the program is not published 
#   or otherwise divested of its trade secrets, 
#   irrespective of what has been deposited with the 
#   U.S. Copyright Office. 
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR

JMSCC0001 = Bels\u0151 hiba t\u00f6rt\u00e9nt. Nem lehetett p\u00e9ld\u00e1nyos\u00edtani egy sz\u00fcks\u00e9ges oszt\u00e1lyt: ''{0}''.
JMSCC0001.useraction = Mentse az el\u0151\u00e1ll\u00edtott kimeneti f\u00e1jlokat, \
majd az MQ term\u00e9kt\u00e1mogat\u00e1si webhely: \
http://www.ibm.com/software/integration/wmq/support/ vagy az IBM \
t\u00e1mogat\u00e1si seg\u00e9dlet (ISA): http://www.ibm.com/software/support/isa/ \
haszn\u00e1lat\u00e1val n\u00e9zze meg, hogy van-e rendelkez\u00e9sre \u00e1ll\u00f3 megold\u00e1s.  Ha nem \
tal\u00e1l ilyet, akkor l\u00e9pjen kapcsolatba az IBM term\u00e9kt\u00e1mogat\u00e1si k\u00f6zponttal.
JMSCC0001.inserts = XMSC_INSERT_EXCEPTION

JMSCC0002 = Az IBM MQ JMS oszt\u00e1lyok \u00e9rv\u00e9nytelen \u00fcgyf\u00e9l-azonos\u00edt\u00f3t pr\u00f3b\u00e1ltak be\u00e1ll\u00edtani egy kapcsolatban.
JMSCC0002.explanation = Egy alkalmaz\u00e1s null\u00e9rt\u00e9kre pr\u00f3b\u00e1lta \u00e1ll\u00edtani egy \u00e9rv\u00e9nyes kapcsolat \u00fcgyf\u00e9l-azonos\u00edt\u00f3 tulajdons\u00e1g\u00e1t, illetve \u00e9rv\u00e9nytelen kapcsolat clientId tulajdons\u00e1g\u00e1t pr\u00f3b\u00e1lta be\u00e1ll\u00edtani.
JMSCC0002.useraction = Egy kapcsolat clientId tulajdons\u00e1ga csak egyszer \u00e1ll\u00edthat\u00f3 be, nem null \u00e9rt\u00e9kre, \u00e9s csak a kapcsolat haszn\u00e1lata el\u0151tt. Gy\u0151z\u0151dj\u00f6n meg r\u00f3la, hogy a kapcsolat \u00e9rv\u00e9nyes \u00e9s az \u00fcgyf\u00e9l-azonos\u00edt\u00f3 nem null.
JMSCC0002.exception = com.ibm.msg.client.jms.DetailedInvalidClientIDException

JMSCC0003 = A megadott \u00e9rt\u00e9k (''{1}'') nem megengedett ehhez: ''{0}''.
JMSCC0003.explanation = Az adott \u00e9rt\u00e9k nem megengedett a megadott tulajdons\u00e1ghoz.
JMSCC0003.useraction = M\u00f3dos\u00edtsa az \u00e9rt\u00e9ket olyanra, ami t\u00e1mogatott a tulajdons\u00e1ghoz.
JMSCC0003.inserts = XMSC_INSERT_NAME, XMSC_INSERT_VALUE
JMSCC0003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0004 = A receive h\u00edv\u00e1sa nem fog \u00fczeneteket visszaadni egy le\u00e1ll\u00edtott kapcsolat eset\u00e9n.
JMSCC0004.explanation = A JMS specifik\u00e1ci\u00f3 szerint a receive() met\u00f3dus h\u00edv\u00e1sa nem adhat vissza \u00fczenetet, ha a kapcsolat le\u00e1llt. A receiveNoWait vagy az id\u0151korl\u00e1ttal rendelkez\u0151 fogad\u00e1s h\u00edv\u00e1sa null\u00e9rt\u00e9ket ad vissza, amikor az id\u0151korl\u00e1t lej\u00e1rt. Az id\u0151korl\u00e1t n\u00e9lk\u00fcli fogad\u00e1s nem ad vissza semmit a kapcsolat ind\u00edt\u00e1s\u00e1ig, illetve bez\u00e1r\u00e1s\u00e1ig, vagy az alkalmaz\u00e1s le\u00e1ll\u00e1s\u00e1ig.
JMSCC0004.useraction = Ind\u00edtsa el a kapcsolatot a javax.jms.Connection.start() megh\u00edv\u00e1s\u00e1val. 

# JMSCC0005 is the same as JMSCC0003 except that JMSCC0003 throws a InvalidDestinationException
# whereas JMSCC0005 throws an JMSException.
JMSCC0005 = A megadott \u00e9rt\u00e9k (''{1}'') nem megengedett ehhez: ''{0}''.
JMSCC0005.explanation = Az adott \u00e9rt\u00e9k nem megengedett a megadott tulajdons\u00e1ghoz.
JMSCC0005.useraction = M\u00f3dos\u00edtsa az \u00e9rt\u00e9ket olyanra, ami t\u00e1mogatott a tulajdons\u00e1ghoz.
JMSCC0005.inserts = XMSC_INSERT_NAME, XMSC_INSERT_VALUE

JMSCC0007 = Kiv\u00e9tel t\u00f6rt\u00e9nt a(z) ''{1}'' met\u00f3dus h\u00edv\u00e1sa k\u00f6zben: ''{0}''.
JMSCC0007.explanation = Egy m\u00e1sik \u00f6sszetev\u0151 kiv\u00e9telt dobott, mik\u00f6zben a megadott met\u00f3dus futott.
JMSCC0007.useraction = Tov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt n\u00e9zze meg a kapcsol\u00f3d\u00f3 kiv\u00e9telt.
JMSCC0007.inserts = XMSC_INSERT_EXCEPTION, XMSC_INSERT_METHOD

JMSCC0008 = A kapcsolat bez\u00e1rva.
JMSCC0008.explanation = Egy alkalmaz\u00e1s olyan met\u00f3dust h\u00edvott, amit nem lehet haszn\u00e1lni a kapcsolat bez\u00e1r\u00e1sa ut\u00e1n.
JMSCC0008.useraction = Gondoskodj\u00e9k r\u00f3la, hogy a kapcsolat ne ker\u00fclj\u00f6n bez\u00e1r\u00e1sra a met\u00f3dus h\u00edv\u00e1sa el\u0151tt.
JMSCC0008.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0011 = A(z) ''{0}'' met\u00f3dus nem megengedett ebben a t\u00e1rol\u00f3ban.
JMSCC0011.explanation = Olyan met\u00f3dus ker\u00fclt megh\u00edv\u00e1sra, ami nem megengedett az aktu\u00e1lis t\u00e1rol\u00f3ban.
JMSCC0011.useraction = T\u00e1vol\u00edtsa el a met\u00f3dus h\u00edv\u00e1s\u00e1t.
JMSCC0011.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0011.inserts = XMSC_INSERT_METHOD

JMSCC0012 = A(z) ''{0}'' met\u00f3dust nem lehet {1} figyel\u0151b\u0151l megh\u00edvni.
JMSCC0012.explanation = Olyan met\u00f3dus ker\u00fclt megh\u00edv\u00e1sra, amely nem enged\u00e9lyezett a jelenlegi kontextusban.
JMSCC0012.useraction = T\u00e1vol\u00edtsa el a met\u00f3dus h\u00edv\u00e1s\u00e1t.
JMSCC0012.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0012.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_NAME

JMSCC0014 = Tranzakci\u00f3kat nem haszn\u00e1l\u00f3 munkamenet eset\u00e9n nem \u00e9rv\u00e9nyes a(z) ''{0}'' met\u00f3dus h\u00edv\u00e1sa.
JMSCC0014.explanation = Az alkalmaz\u00e1s olyan met\u00f3dust h\u00edvott, amit nem lehet tranzakci\u00f3kat nem haszn\u00e1l\u00f3 munkamenetben megh\u00edvni.
JMSCC0014.useraction = M\u00f3dos\u00edtsa az alkalmaz\u00e1sprogramot ezen viselked\u00e9s elt\u00e1vol\u00edt\u00e1sa \u00e9rdek\u00e9ben.
JMSCC0014.inserts = XMSC_INSERT_METHOD
JMSCC0014.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0020 = A munkamenet bez\u00e1rva.
JMSCC0020.explanation = Egy alkalmaz\u00e1s olyan met\u00f3dust h\u00edvott, amit nem lehet haszn\u00e1lni a munkamenet bez\u00e1r\u00e1sa ut\u00e1n.
JMSCC0020.useraction = Gondoskodj\u00e9k r\u00f3la, hogy a munkamenet ne ker\u00fclj\u00f6n bez\u00e1r\u00e1sra a met\u00f3dus h\u00edv\u00e1sa el\u0151tt.
JMSCC0020.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0021 = Tranzakci\u00f3kat haszn\u00e1l\u00f3 munkamenet eset\u00e9n nem \u00e9rv\u00e9nyes a(z) ''{0}'' met\u00f3dus h\u00edv\u00e1sa.
JMSCC0021.explanation = Az alkalmaz\u00e1s olyan met\u00f3dust h\u00edvott, amit nem lehet tranzakci\u00f3kat haszn\u00e1l\u00f3 munkamenetben megh\u00edvni.
JMSCC0021.useraction = M\u00f3dos\u00edtsa az alkalmaz\u00e1sprogramot ezen viselked\u00e9s elt\u00e1vol\u00edt\u00e1sa \u00e9rdek\u00e9ben.
JMSCC0021.inserts = XMSC_INSERT_METHOD
JMSCC0021.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0026 = Az \u00fczenet-el\u0151\u00e1ll\u00edt\u00f3 bez\u00e1rva.
JMSCC0026.explanation = Egy alkalmaz\u00e1s olyan met\u00f3dust h\u00edvott, amit nem lehet haszn\u00e1lni az \u00fczenet-el\u0151\u00e1ll\u00edt\u00f3 bez\u00e1r\u00e1sa ut\u00e1n.
JMSCC0026.useraction = Gondoskodj\u00e9k r\u00f3la, hogy az \u00fczenet-el\u0151\u00e1ll\u00edt\u00f3 ne ker\u00fclj\u00f6n bez\u00e1r\u00e1sra a met\u00f3dus h\u00edv\u00e1sa el\u0151tt.
JMSCC0026.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0029 = Meg kell adni c\u00e9lt, amikor ett\u0151l az el\u0151\u00e1ll\u00edt\u00f3t\u00f3l v\u00e9gez k\u00fcld\u00e9st.
JMSCC0029.explanation = Az el\u0151\u00e1ll\u00edt\u00f3 null c\u00e9llal lett l\u00e9trehozva, \u00e9s nem adott meg c\u00e9lt a send met\u00f3dusban.
JMSCC0029.useraction = M\u00f3dos\u00edtsa az alkalmaz\u00e1st \u00fagy, hogy c\u00e9lt megad\u00f3 send() met\u00f3dust haszn\u00e1ljon, vagy pedig adjon meg c\u00e9lt az el\u0151\u00e1ll\u00edt\u00f3 l\u00e9trehoz\u00e1sakor.
JMSCC0029.exception = java.lang.UnsupportedOperationException

JMSCC0030 = Nem \u00e9rv\u00e9nyes c\u00e9lt megadni, amikor err\u0151l az el\u0151\u00e1ll\u00edt\u00f3r\u00f3l v\u00e9gez k\u00fcld\u00e9st.
JMSCC0030.explanation = Az el\u0151\u00e1ll\u00edt\u00f3 megadott c\u00e9llal lett l\u00e9trehozva; nem \u00e9rv\u00e9nyes \u00fajb\u00f3l megadni egy c\u00e9lt az \u00fczenet k\u00fcld\u00e9sekor.
JMSCC0030.useraction = M\u00f3dos\u00edtsa az alkalmaz\u00e1st \u00fagy, hogy c\u00e9lt nem megad\u00f3 send() met\u00f3dust haszn\u00e1ljon, vagy pedig null c\u00e9lt adjon meg az el\u0151\u00e1ll\u00edt\u00f3 l\u00e9trehoz\u00e1sakor.
JMSCC0030.exception = java.lang.UnsupportedOperationException

JMSCC0031 = Nem \u00e9rv\u00e9nyes null\u00e9rt\u00e9k\u0171 befejez\u00e9sfigyel\u0151t megadni.
JMSCC0031.explanation = A k\u00fcld\u00e9si met\u00f3dus h\u00edv\u00e1sa befejez\u00e9sfigyel\u0151t tartalmazott, de a figyel\u0151 null\u00e9rt\u00e9k\u0171 volt.
JMSCC0031.useraction = M\u00f3dos\u00edtsa \u00fagy az alkalmaz\u00e1st, hogy egy befejez\u00e9sfigyel\u0151t meg nem hat\u00e1roz\u00f3 k\u00fcld\u00e9si met\u00f3dus szerepeljen benne, vagy a send h\u00edv\u00e1s k\u00fcld\u00e9sekor hat\u00e1rozzon meg egy nem null\u00e9rt\u00e9lk\u0171 befejez\u00e9sfigyel\u0151t.
JMSCC0031.exception = java.lang.IllegalArgumentException

JMSCC0032 = Az \u00fczenetfogyaszt\u00f3 bez\u00e1rva.
JMSCC0032.explanation = Egy alkalmaz\u00e1s olyan met\u00f3dust h\u00edvott, amit nem lehet haszn\u00e1lni az \u00fczenetfogyaszt\u00f3 bez\u00e1r\u00e1sa ut\u00e1n.
JMSCC0032.useraction = Gondoskodj\u00e9k r\u00f3la, hogy az \u00fczenetfogyaszt\u00f3 ne ker\u00fclj\u00f6n bez\u00e1r\u00e1sra a met\u00f3dus h\u00edv\u00e1sa el\u0151tt.
JMSCC0032.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0033 = A szinkron met\u00f3dush\u00edv\u00e1sok nem megengedettek, amikor aszinkron m\u00f3don haszn\u00e1l egy munkamenetet: ''{0}''.
JMSCC0033.explanation = A JMS specifik\u00e1ci\u00f3 nem engedi meg a munkamenetek haszn\u00e1lat\u00e1t szinkron met\u00f3dusokhoz, amikor az aszinkron \u00fczenetk\u00e9zbes\u00edt\u00e9s fut.
JMSCC0033.useraction = Hozzon l\u00e9tre egy k\u00fcl\u00f6n munkamenetet, amennyiben szinkron met\u00f3dusokat \u00e9s aszinkron k\u00e9zbes\u00edt\u00e9st is szeretne egyidej\u0171leg haszn\u00e1lni.
JMSCC0033.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0033.inserts = XMSC_INSERT_METHOD

JMSCC0034 = Az aszinkron k\u00e9zbes\u00edt\u00e9si mechanizmus k\u00f6vetkezetlen \u00e1llapotban van a k\u00f6vetkez\u0151 met\u00f3dusban: ''{0}''.
JMSCC0034.explanation = A rendszer nem v\u00e1rt \u00fczenetsorozatot \u00e9szlelt az \u00fczenetek k\u00e9zbes\u00edt\u00e9se sor\u00e1n egy \u00fczenetvez\u00e9relt \u00f6sszetev\u0151nek (MDB). Ezt \u00fcgyf\u00e9lprogramoz\u00e1si alkalmaz\u00e1shib\u00e1k okozhatj\u00e1k.
JMSCC0034.useraction = N\u00e9zze meg az alkalmaz\u00e1skiszolg\u00e1l\u00f3 napl\u00f3f\u00e1jljait, hogy nem tartalmaz-e m\u00e1s probl\u00e9m\u00e1kat az \u00fczenetvez\u00e9relt \u00f6sszetev\u0151vel kapcsolatban. Mentse el az el\u0151\u00e1ll\u00edtott kimeneti f\u00e1jlokat, \u00e9s vagy a WMQ term\u00e9kt\u00e1mogat\u00e1si webhely: http://www.ibm.com/software/integration/wmq/support/, vagy az IBM t\u00e1mogat\u00e1si seg\u00e9dlet (ISA): http://www.ibm.com/software/support/isa/ haszn\u00e1lat\u00e1val j\u00e1rjon ut\u00e1na, hogy van-e m\u00e1r rendelkez\u00e9sre \u00e1ll\u00f3 megold\u00e1s.  Ha nem \
tal\u00e1l ilyet, akkor l\u00e9pjen kapcsolatba az IBM term\u00e9kt\u00e1mogat\u00e1si k\u00f6zponttal.
JMSCC0034.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0034.inserts = XMSC_INSERT_METHOD

JMSCC0037 = A MessageListener.onMessage() met\u00f3dus fut\u00e1si kiv\u00e9telt dobott.
JMSCC0037.explanation = Egy \u00fczenetfigyel\u0151be regisztr\u00e1lt \u00fczenetfogyaszt\u00f3 kiv\u00e9telt kapott az onMessage() met\u00f3dust\u00f3l.
JMSCC0037.useraction = M\u00f3dos\u00edtani kell az onMessage() met\u00f3dust, hogy ne dobjon kiv\u00e9telt.

JMSCC0038 = A felhaszn\u00e1l\u00f3 nem rendelkezik jogosults\u00e1ggal a m\u0171velet v\u00e9grehajt\u00e1s\u00e1hoz. R\u00e9szletek\u00e9rt n\u00e9zze meg a kapcsol\u00f3d\u00f3 kiv\u00e9telt.
JMSCC0038.explanation = A kapcsol\u00f3d\u00f3 kiv\u00e9tel tartalmazza a m\u0171velet v\u00e9grehajt\u00e1s\u00e1hoz sz\u00fcks\u00e9ges jogosults\u00e1g r\u00e9szleteit.
JMSCC0038.useraction = Az adminisztr\u00e1tornak meg kell adnia a sz\u00fcks\u00e9ges jogosults\u00e1got az \u00e9rintett felhaszn\u00e1l\u00f3nak.

JMSCC0039 = A(z) ''{0}'' t\u00edpus haszn\u00e1lata ''{1}'' objektumtulajdons\u00e1gk\u00e9nt nem \u00e9rv\u00e9nyes.
JMSCC0039.explanation = Egy alkalmaz\u00e1s olyan objektumt\u00edpus haszn\u00e1lat\u00e1val pr\u00f3b\u00e1lt be\u00e1ll\u00edtani egy objektumtulajdons\u00e1got, amit a JMS specifik\u00e1ci\u00f3 nem enged meg.
JMSCC0039.useraction = Haszn\u00e1ljon megengedett objektumt\u00edpust. A primit\u00edv ford\u00edt\u00f3 oszt\u00e1lyok \u00e9s a Karaktersorozat objektumok megengedett objektumt\u00edpusok.
JMSCC0039.inserts = XMSC_INSERT_TYPE, XMSC_INSERT_PROPERTY
JMSCC0039.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0040 = Kiv\u00e9tel t\u00f6rt\u00e9nt egy \u00fczenet fogad\u00e1sa k\u00f6zben: ''{0}''.
JMSCC0040.explanation = Egy \u00fczenet fogad\u00e1sa k\u00f6zben kiv\u00e9tel t\u00f6rt\u00e9nt, ami a m\u0171velet meghi\u00fasul\u00e1s\u00e1t okozta.
JMSCC0040.useraction = Tov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt vizsg\u00e1lja meg a megadott kiv\u00e9telt \u00e9s a kapcsol\u00f3d\u00f3 kiv\u00e9tel objektumot.
JMSCC0040.inserts = XMSC_INSERT_EXCEPTION
JMSCC0040.exception = com.ibm.msg.client.jms.internal.JmsQueueBrowserImpl.MessageConversionFailed

JMSCC0041 = A(z) ''{0}'' elem \u00e1talak\u00edt\u00e1sa a(z) ''{1}'' t\u00edpusb\u00f3l a(z) ''{2}'' t\u00edpusba nem megengedett.
JMSCC0041.explanation = A k\u00e9t megadott adatt\u00edpus k\u00f6z\u00f6tti \u00e1talak\u00edt\u00e1st nem engedi meg a JMS specifik\u00e1ci\u00f3.
JMSCC0041.useraction = A megengedett \u00e1talak\u00edt\u00e1sok valamelyik\u00e9nek haszn\u00e1lat\u00e1val olvassa be a megnevezett elemet.
JMSCC0041.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE

JMSCC0042 = A(z) ''{0}'' \u00fczenetmez\u0151 nem lett be\u00e1ll\u00edtva.
JMSCC0042.explanation = Egy alkalmaz\u00e1s egy olyan mez\u0151 \u00e9rt\u00e9k\u00e9t k\u00eds\u00e9relte meg beolvasni, ami nem lett be\u00e1ll\u00edtva.
JMSCC0042.useraction = \u00c1ll\u00edtsa be a mez\u0151 \u00e9rt\u00e9k\u00e9t, miel\u0151tt beolvasn\u00e1 azt.
JMSCC0042.inserts = XMSC_INSERT_FIELD

JMSCC0043 = Null vagy \u00fcres karaktersorozat mez\u0151n\u00e9v nem megengedett.
JMSCC0043.explanation = Egy felhaszn\u00e1l\u00f3i alkalmaz\u00e1s olyan n\u00e9vvel pr\u00f3b\u00e1lt be\u00e1ll\u00edtani egy mez\u0151t, ami nem \u00e9rv\u00e9nyes, p\u00e9ld\u00e1ul null vagy \u00fcres karaktersorozat.
JMSCC0043.useraction = Haszn\u00e1ljon \u00e9rv\u00e9nyes mez\u0151nevet.
JMSCC0043.exception = java.lang.IllegalArgumentException

JMSCC0044 = Nem megengedett a(z) ''{0}'' met\u00f3dus h\u00edv\u00e1sa az \u00fczeneten, mert az \u00fczenett\u00f6rzs csak olvashat\u00f3.
JMSCC0044.explanation = Egy felhaszn\u00e1l\u00f3i alkalmaz\u00e1s megpr\u00f3b\u00e1lt be\u00e1ll\u00edtani egy csak olvashat\u00f3 \u00fczenett\u00f6rzset.
JMSCC0044.useraction = M\u00f3dos\u00edtsa az alkalmaz\u00e1sprogramot ezen viselked\u00e9s elt\u00e1vol\u00edt\u00e1sa \u00e9rdek\u00e9ben, vagy pedig el\u0151bb h\u00edvja meg a clearBody() met\u00f3dust.
JMSCC0044.inserts = XMSC_INSERT_METHOD
JMSCC0044.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSCC0045 = Nem megengedett a(z) ''{0}'' met\u00f3dus h\u00edv\u00e1sa az \u00fczeneten, mert az \u00fczenet tulajdons\u00e1gai csak olvashat\u00f3k.
JMSCC0045.explanation = Egy felhaszn\u00e1l\u00f3i alkalmaz\u00e1s megpr\u00f3b\u00e1lt be\u00e1ll\u00edtani egy csak olvashat\u00f3 \u00fczenettulajdons\u00e1got.
JMSCC0045.useraction = M\u00f3dos\u00edtsa az alkalmaz\u00e1sprogramot ezen viselked\u00e9s elt\u00e1vol\u00edt\u00e1sa \u00e9rdek\u00e9ben, vagy pedig el\u0151bb h\u00edvja meg a clearProperties() met\u00f3dust.
JMSCC0045.inserts = XMSC_INSERT_METHOD
JMSCC0045.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSCC0046 = Nem megengedett a(z) ''{0}'' met\u00f3dus h\u00edv\u00e1sa az \u00fczeneten, mert az \u00fczenett\u00f6rzs csak \u00edrhat\u00f3.
JMSCC0046.explanation = Egy felhaszn\u00e1l\u00f3i alkalmaz\u00e1s megpr\u00f3b\u00e1lt beolvasni egy csak \u00edrhat\u00f3 \u00fczenett\u00f6rzset.
JMSCC0046.useraction = M\u00f3dos\u00edtsa az alkalmaz\u00e1sprogramot ezen viselked\u00e9s elt\u00e1vol\u00edt\u00e1sa \u00e9rdek\u00e9ben, vagy pedig el\u0151bb h\u00edvja meg a reset() met\u00f3dust.
JMSCC0046.inserts = XMSC_INSERT_METHOD
JMSCC0046.exception = com.ibm.msg.client.jms.DetailedMessageNotReadableException

JMSCC0048 = Hiba t\u00f6rt\u00e9nt az \u00fczenet l\u00e9trehoz\u00e1s\u00e1ra tett k\u00eds\u00e9rlet sor\u00e1n. Tov\u00e1bbi r\u00e9szletek\u00e9rt n\u00e9zze meg a kapcsol\u00f3d\u00f3 kiv\u00e9telt.
JMSCC0048.explanation = Hiba miatt nem lehetett l\u00e9trehozni az \u00fczenetet.
JMSCC0048.useraction = A hiba r\u00e9szletei\u00e9rt vizsg\u00e1lja meg a kapcsol\u00f3d\u00f3 kiv\u00e9telt.

JMSCC0049 = A(z) ''{0}'' tulajdons\u00e1gn\u00e9v nem \u00e9rv\u00e9nyes Java(tm) azonos\u00edt\u00f3.
JMSCC0049.explanation = A megadott tulajdons\u00e1gn\u00e9v nem felel meg a JMS specifik\u00e1ci\u00f3ban le\u00edrt megengedett form\u00e1tumnak.
JMSCC0049.useraction = Ellen\u0151rizze a tulajdons\u00e1gn\u00e9vben haszn\u00e1lt karaktereket, \u00e9s v\u00e9gezze el a sz\u00fcks\u00e9ges m\u00f3dos\u00edt\u00e1sokat.
JMSCC0049.inserts = XMSC_INSERT_PROPERTY
JMSCC0049.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0050 = A(z) ''{0}'' tulajdons\u00e1gn\u00e9v fenntartott, \u00e9s nem \u00e1ll\u00edthat\u00f3 be.
JMSCC0050.explanation = A megadott tulajdons\u00e1gn\u00e9v a JMS el\u0151taggal kezd\u0151dik, de nem a t\u00e1mogatott, be\u00e1ll\u00edthat\u00f3 tulajdons\u00e1gok valamelyike.
JMSCC0050.useraction = Ellen\u0151rizze a tulajdons\u00e1gnevet \u00e9s jav\u00edtsa ki a hib\u00e1kat.
JMSCC0050.inserts = XMSC_INSERT_PROPERTY
JMSCC0050.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0051 = A(z) ''{0}'' tulajdons\u00e1got a(z) ''{1}'' t\u00edpus haszn\u00e1lat\u00e1val kell be\u00e1ll\u00edtani, nem a(z) ''{2}'' t\u00edpussal.
JMSCC0051.explanation = A JMS_IBM tulajdons\u00e1gok csak egy specifikus v\u00e1ltoz\u00f3t\u00edpus haszn\u00e1lat\u00e1val \u00e1ll\u00edthat\u00f3k be.
JMSCC0051.useraction = Jav\u00edtsa ki az alkalmaz\u00e1sk\u00f3dot \u00fagy, hogy a sz\u00fcks\u00e9ges v\u00e1ltoz\u00f3t\u00edpust haszn\u00e1lja a JMS_IBM tulajdons\u00e1g be\u00e1ll\u00edt\u00e1sakor.
JMSCC0051.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE
JMSCC0051.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0052 = Kiv\u00e9tel t\u00f6rt\u00e9nt az objektum soros\u00edt\u00e1sa k\u00f6zben: ''{0}''.
JMSCC0052.explanation = A kiv\u00e9tel miatt nem lehetett soros\u00edtani az objektumot.
JMSCC0052.useraction = A hiba r\u00e9szletei\u00e9rt vizsg\u00e1lja meg a kapcsol\u00f3d\u00f3 kiv\u00e9telt.
JMSCC0052.inserts = XMSC_INSERT_EXCEPTION
JMSCC0052.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0053 = Kiv\u00e9tel t\u00f6rt\u00e9nt egy \u00fczenet soros\u00edtott form\u00e1j\u00e1nak visszaalak\u00edt\u00e1sa k\u00f6zben: ''{0}''.
JMSCC0053.explanation = A kiv\u00e9tel miatt nem lehetett visszaalak\u00edtani az \u00fczenet soros\u00edtott form\u00e1j\u00e1t.
JMSCC0053.useraction = A hiba r\u00e9szletei\u00e9rt vizsg\u00e1lja meg a kapcsol\u00f3d\u00f3 kiv\u00e9telt.
JMSCC0053.inserts = XMSC_INSERT_EXCEPTION
JMSCC0053.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0054 = A sorb\u00f6ng\u00e9sz\u0151 nem rendelkezik el\u00e9rhet\u0151 \u00fczenetekkel.
JMSCC0054.explanation = Egy felhaszn\u00e1l\u00f3i alkalmaz\u00e1s olyankor k\u00e9rt \u00fczenetet a sorb\u00f6ng\u00e9sz\u0151t\u0151l, amikor nem volt el\u00e9rhet\u0151 \u00fczenet.
JMSCC0054.useraction = Gondoskodj\u00e9k r\u00f3la, hogy az alkalmaz\u00e1s vagy ne h\u00edvja meg ezt a met\u00f3dust, amikor nincsenek el\u00e9rhet\u0151 \u00fczenetek, vagy pedig kezelje ezt a kiv\u00e9telt.
JMSCC0054.exception = java.util.NoSuchElementException

JMSCC0055 = A sorb\u00f6ng\u00e9sz\u0151 bez\u00e1rva.
JMSCC0055.explanation = Egy alkalmaz\u00e1s olyan met\u00f3dust h\u00edvott, amit nem lehet haszn\u00e1lni a sorb\u00f6ng\u00e9sz\u0151 bez\u00e1r\u00e1sa ut\u00e1n.
JMSCC0055.useraction = Gondoskodj\u00e9k r\u00f3la, hogy a sorb\u00f6ng\u00e9sz\u0151 ne ker\u00fclj\u00f6n bez\u00e1r\u00e1sra a met\u00f3dus h\u00edv\u00e1sa el\u0151tt.
JMSCC0055.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0059 = A beolvas\u00e1si puffer null.
JMSCC0059.explanation = Null hivatkoz\u00e1s ker\u00fclt \u00e1tad\u00e1sra a StreamMessage.readBytes() met\u00f3dusnak, ez\u00e9rt nem siker\u00fclt adatokat visszaadni.
JMSCC0059.useraction = Egy megfelel\u0151 m\u00e9ret\u0171 puffert adjon \u00e1t a readBytes() met\u00f3dusnak.
JMSCC0059.exception = java.lang.NullPointerException

JMSCC0060 = A rendszer el\u00e9rte az \u00fczenet adatfolyam v\u00e9g\u00e9t.
JMSCC0060.explanation = A rendszer el\u00e9rte az \u00fczenettartalom v\u00e9g\u00e9t. Ez norm\u00e1lis, ha a beolvas\u00f3 alkalmaz\u00e1s nem tudja, hogy mennyi adatot v\u00e1rjon.
JMSCC0060.useraction = Nincs sz\u00fcks\u00e9g semmilyen m\u0171veletre.
JMSCC0060.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCC0061 = A StreamMessage byte t\u00f6mb hi\u00e1nyosan lett beolvasva.
JMSCC0061.explanation = K\u00eds\u00e9rlet t\u00f6rt\u00e9nt a k\u00f6vetkez\u0151 mez\u0151 beolvas\u00e1s\u00e1ra az adatfolyamb\u00f3l, amikor egy byte t\u00f6mb r\u00e9szlegesen van beolvasva.
JMSCC0061.useraction = Gondoskodj\u00e9k r\u00f3la, hogy a felhaszn\u00e1l\u00f3i k\u00f3d befejezze a byte t\u00f6mb beolvas\u00e1s\u00e1t, miel\u0151tt megpr\u00f3b\u00e1ln\u00e1 beolvasni a k\u00f6vetkez\u0151 mez\u0151t.
JMSCC0061.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0062 = Nem lehets\u00e9ges a null visszaad\u00e1sa karakterk\u00e9nt.
JMSCC0062.explanation = K\u00eds\u00e9rlet t\u00f6rt\u00e9nt egy null\u00e9rt\u00e9ket tartalmaz\u00f3 StreamMessage mez\u0151 beolvas\u00e1s\u00e1ra a readChar() met\u00f3dussal.
JMSCC0062.useraction = Ker\u00fclje a null\u00e9rt\u00e9kek beolvas\u00e1s\u00e1t a readChar() met\u00f3dussal.
JMSCC0062.exception = java.lang.NullPointerException

JMSCC0063 = A(z) ''{0}'' karaktersorozat k\u00f3dol\u00e1sa nem \u00e9rv\u00e9nyes.
JMSCC0063.explanation = A megadott \u00e9rt\u00e9k ismeretlen k\u00f3dol\u00e1ssal rendelkezik.
JMSCC0063.useraction = Gondoskodj\u00e9k r\u00f3la, hogy az alkalmaz\u00e1s a meghat\u00e1rozott k\u00f3dol\u00e1slist\u00e1b\u00f3l adjon meg \u00e9rt\u00e9ket.
JMSCC0063.inserts = JMS_IBM_Encoding

JMSCC0064 = Bels\u0151 hiba t\u00f6rt\u00e9nt az adatfolyamba \u00edr\u00e1s k\u00f6zben.
JMSCC0064.explanation = Probl\u00e9ma mer\u00fclt fel a lebeg\u0151pontos \u00e9s a dupla pontoss\u00e1g\u00fa \u00e9rt\u00e9kek form\u00e1tum\u00e1talak\u00edt\u00e1s\u00e1hoz haszn\u00e1lt adatfolyamokkal.
JMSCC0064.useraction = Mentse el az el\u0151\u00e1ll\u00edtott kimeneti f\u00e1jlokat, \u00e9s vagy a WMQ term\u00e9kt\u00e1mogat\u00e1si webhely: http://www.ibm.com/software/integration/wmq/support/, vagy az IBM t\u00e1mogat\u00e1si seg\u00e9dlet (ISA): http://www.ibm.com/software/support/isa/ haszn\u00e1lat\u00e1val j\u00e1rjon ut\u00e1na, hogy van-e m\u00e1r rendelkez\u00e9sre \u00e1ll\u00f3 megold\u00e1s.  Ha nem \
tal\u00e1l ilyet, akkor l\u00e9pjen kapcsolatba az IBM term\u00e9kt\u00e1mogat\u00e1si k\u00f6zponttal.

JMSCC0065 = K\u00eds\u00e9rlet t\u00f6rt\u00e9nt az \u00fczenet v\u00e9g\u00e9n t\u00fali olvas\u00e1sra.
JMSCC0065.explanation = K\u00eds\u00e9rlet t\u00f6rt\u00e9nt az \u00fczenet v\u00e9g\u00e9n t\u00fali olvas\u00e1sra. Ez norm\u00e1lis helyzet lehet, amennyiben az alkalmaz\u00e1s v\u00e1ltoz\u00f3 hossz\u00fas\u00e1g\u00fa adatok beolvas\u00e1s\u00e1ra lett k\u00f3dolva a JMS 1.0.2 specifik\u00e1ci\u00f3 haszn\u00e1lat\u00e1val.
JMSCC0065.useraction = Ha sz\u00fcks\u00e9ges, akkor k\u00f3dolja \u00fajra az alkalmaz\u00e1st az \u00faj getBodyLength() met\u00f3dus haszn\u00e1lat\u00e1val.
JMSCC0065.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCC0066 = Az UTF-8 \u00e1talak\u00edt\u00e1s meghi\u00fasult.
JMSCC0066.explanation = Probl\u00e9ma mer\u00fclt fel egy UTF-8 karaktersorozat olvas\u00e1sa vagy \u00edr\u00e1sa sor\u00e1n. A leggyakoribb probl\u00e9ma a 65535 karaktern\u00e9l hosszabb karaktersorozatok \u00edr\u00e1s\u00e1ra tett k\u00eds\u00e9rlet.
JMSCC0066.useraction = Tov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt n\u00e9zze meg a kapcsol\u00f3d\u00f3 kiv\u00e9telt.
JMSCC0066.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0067 = Bels\u0151 hiba t\u00f6rt\u00e9nt. Probl\u00e9ma mer\u00fclt fel az \u00fczenetbe \u00edr\u00e1skor.
JMSCC0067.explanation = Hiba t\u00f6rt\u00e9nt egy elemnek az \u00fczenetbe \u00edr\u00e1s\u00e1ra tett k\u00eds\u00e9rlet sor\u00e1n.
JMSCC0067.useraction = Mentse el az el\u0151\u00e1ll\u00edtott kimeneti f\u00e1jlokat, \u00e9s vagy a WMQ term\u00e9kt\u00e1mogat\u00e1si webhely: http://www.ibm.com/software/integration/wmq/support/, vagy az IBM t\u00e1mogat\u00e1si seg\u00e9dlet (ISA): http://www.ibm.com/software/support/isa/ haszn\u00e1lat\u00e1val j\u00e1rjon ut\u00e1na, hogy van-e m\u00e1r rendelkez\u00e9sre \u00e1ll\u00f3 megold\u00e1s.  Ha nem \
tal\u00e1l ilyet, akkor l\u00e9pjen kapcsolatba az IBM term\u00e9kt\u00e1mogat\u00e1si k\u00f6zponttal.
JMSCC0067.exception = com.ibm.msg.client.jms.DetailedResourceAllocationException

JMSCC0068 = A(z) ''{0}'' tulajdons\u00e1got ''{1}'' t\u00edpus\u00fa vagy erre a t\u00edpusra konvert\u00e1lhat\u00f3 \u00e9rt\u00e9ket haszn\u00e1lva kell be\u00e1ll\u00edtani, a JMS specifik\u00e1ci\u00f3nak megfelel\u0151en. Nem lehet konvert\u00e1lni a megadott ''{2}'' t\u00edpusr\u00f3l. 
JMSCC0068.explanation = A k\u00e9t megadott adatt\u00edpus k\u00f6z\u00f6tti \u00e1talak\u00edt\u00e1st nem engedi meg a JMS specifik\u00e1ci\u00f3.
JMSCC0068.useraction = A megnevezett tulajdons\u00e1got a megengedett \u00e1talak\u00edt\u00e1sok egyik\u00e9nek haszn\u00e1lat\u00e1val \u00e1ll\u00edtsa be.
JMSCC0068.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC0068.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE

JMSCC0069 = A(z) ''{0}'' tulajdons\u00e1got a(z) ''{1}'' t\u00edpus haszn\u00e1lat\u00e1val kell be\u00e1ll\u00edtani. Nem lehet konvert\u00e1lni a megadott ''{2}'' t\u00edpusr\u00f3l a(z) ''{3}'' \u00e9rt\u00e9kkel. 
JMSCC0069.explanation = Hiba t\u00f6rt\u00e9nt egy \u00fczenettulajdons\u00e1g be\u00e1ll\u00edt\u00e1s\u00e1ra tett k\u00eds\u00e9rlet sor\u00e1n.
JMSCC0069.useraction = A megnevezett tulajdons\u00e1got a megengedett \u00e1talak\u00edt\u00e1sok egyik\u00e9t a megfelel\u0151 \u00e9rt\u00e9kkel haszn\u00e1lva \u00e1ll\u00edtsa be.
JMSCC0069.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC0069.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE, XMSC_INSERT_VALUE

JMSCC0070 = Bels\u0151 hiba t\u00f6rt\u00e9nt. Probl\u00e9ma mer\u00fclt fel a(z) ''{0}'' JMS \u00fczenettulajdons\u00e1g be\u00e1ll\u00edt\u00e1sakor; elv\u00e1rt t\u00edpus: ''{1}'', haszn\u00e1lt objektumt\u00edpus: ''{2}''.
JMSCC0070.explanation = Hiba t\u00f6rt\u00e9nt egy \u00fczenettulajdons\u00e1g be\u00e1ll\u00edt\u00e1s\u00e1ra tett k\u00eds\u00e9rlet sor\u00e1n.
JMSCC0070.useraction = Mentse el az el\u0151\u00e1ll\u00edtott kimeneti f\u00e1jlokat, \u00e9s vagy a WMQ term\u00e9kt\u00e1mogat\u00e1si webhely: http://www.ibm.com/software/integration/wmq/support/, vagy az IBM t\u00e1mogat\u00e1si seg\u00e9dlet (ISA): http://www.ibm.com/software/support/isa/ haszn\u00e1lat\u00e1val j\u00e1rjon ut\u00e1na, hogy van-e m\u00e1r rendelkez\u00e9sre \u00e1ll\u00f3 megold\u00e1s.  Ha nem \
tal\u00e1l ilyet, akkor l\u00e9pjen kapcsolatba az IBM term\u00e9kt\u00e1mogat\u00e1si k\u00f6zponttal.
JMSCC0070.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC0070.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE

JMSCC0083 = Helytelen objektumt\u00edpus (''{0}'') lett megadva.
JMSCC0083.explanation = Olyan objektum ker\u00fclt megad\u00e1sra a writeObject() met\u00f3dusnak, ami nem Java(tm) primit\u00edv ford\u00edt\u00f3 t\u00edpus.
JMSCC0083.useraction = Az alkalmaz\u00e1s kijav\u00edt\u00e1s\u00e1val biztos\u00edtsa, hogy csak a megengedett t\u00edpusokba tartoz\u00f3 objektumok ker\u00fcljenek \u00e1tad\u00e1sra param\u00e9terk\u00e9nt a writeObject() met\u00f3dusnak.
JMSCC0083.inserts = XMSC_INSERT_OBJECT
JMSCC0083.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0084 = A ''{0}'' nev\u0171 tulajdons\u00e1g nincs be\u00e1ll\u00edtva.
JMSCC0084.inserts = XMSC_INSERT_PROPERTY

JMSCC0085 = Nem lett megadva c\u00e9l.
JMSCC0085.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0086 = A(z) ''{0}'' parancsf\u00e1jlm\u00e9ret helytelen.
JMSCC0086.inserts = XMSC_INSERT_BATCH_SIZE

JMSCC0087 = Nem lett megadva kiszolg\u00e1l\u00f3 munkamenet-t\u00e1rol\u00f3.

JMSCC0088 = Nem siker\u00fclt munkamenetet beszerezni a megadott kiszolg\u00e1l\u00f3 munkamenet-t\u00e1rol\u00f3b\u00f3l.

JMSCC0089 = A(z) ''{0}'' munkamenet \u00e9rv\u00e9nytelen volt.
JMSCC0089.inserts = XMSC_INSERT_SESSION

JMSCC0091 = A(z) ''{0}'' kapcsolathoz tartoz\u00f3 szolg\u00e1ltat\u00f3gy\u00e1r nem t\u00f6lthet\u0151 be.
JMSCC0091.inserts = XMSC_CONNECTION_TYPE

JMSCC0092 = A rendszer azt v\u00e1rta, hogy a kapcsolatt\u00edpus ''{0}'' lesz, de ehelyett val\u00f3j\u00e1ban ''{1}'' volt.
JMSCC0092.inserts = XMSC_CONNECTION_TYPE_NAME, XMSC_CONNECTION_TYPE
JMSCC0092.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0093 = A c\u00e9l \u00e9rv\u00e9nytelen volt. A tart\u00f3s el\u0151fizet\u00e9s a(z) ''{0}'' t\u00edpus\u00fa \u00e9s ''{1}'' nev\u0171 ideiglenes c\u00e9lon nem hozhat\u00f3 l\u00e9tre.
JMSCC0093.inserts = XMSC_INSERT_TYPE, XMSC_DESTINATION_NAME
JMSCC0093.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0094 = A kapcsolatb\u00f6ng\u00e9sz\u0151 bez\u00e1rva.
JMSCC0094.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0095 = A(z) ''{0}'' c\u00e9ln\u00e9v nem \u00e9rv\u00e9nyes.
JMSCC0095.explanation = A megadott c\u00e9ln\u00e9v nem felel meg a k\u00f6zz\u00e9tett c\u00e9l szintaxisnak.
JMSCC0095.useraction = Jav\u00edtsa ki a megadott c\u00e9lnevet, majd pr\u00f3b\u00e1lkozzon \u00fajra.
JMSCC0095.inserts = XMSC_DESTINATION_NAME
JMSCC0095.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0097 = Rossz nyugt\u00e1z\u00e1si m\u00f3d: ''{0}''. A Connection.createSession() met\u00f3dusnak tranzakci\u00f3kat nem haszn\u00e1l\u00f3 munkamenetet kellene l\u00e9trehoznia (a transacted be\u00e1ll\u00edt\u00e1s false), de a nyugt\u00e1z\u00e1si m\u00f3d nem AUTO_ACKNOWLEDGE, DUPS_OK_ACKNOWLEDGE vagy CLIENT_ACKNOWLEDGE.
JMSCC0097.inserts = XMSC_ACKNOWLEDGE_MODE

JMSCC0098 = Az \u00fczenet nem lehet null.
JMSCC0098.useraction = Nem null \u00fczenetet adjon meg.
JMSCC0098.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0099 = A(z) ''{0}'' c\u00e9l nem a com.ibm.msg.client.jms.JmsDestination p\u00e9ld\u00e1nya.
JMSCC0099.useraction = Egy com.ibm.msg.client.jms.JmsDestination p\u00e9ld\u00e1nyt adjon meg helyette.
JMSCC0099.inserts = XMSC_DESTINATION_NAME
JMSCC0099.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0100 = Az el\u0151fizet\u00e9sn\u00e9v nem lehet null.
JMSCC0100.useraction = Nem null el\u0151fizet\u00e9snevet adjon meg.
JMSCC0100.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0101 = Az \u00fcgyf\u00e9lazonos\u00edt\u00f3 nem lehet null.
JMSCC0101.useraction = Nem null \u00fcgyf\u00e9lazonos\u00edt\u00f3t adjon meg.
JMSCC0101.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0102 = Az \u00fczenetben szerepl\u0151 ''{0}'' tulajdons\u00e1gn\u00e9v nem \u00e9rv\u00e9nyes Java(tm) azonos\u00edt\u00f3.
JMSCC0102.explanation = A megadott tulajdons\u00e1gn\u00e9v nem felel meg a JMS specifik\u00e1ci\u00f3ban le\u00edrt megengedett form\u00e1tumnak.
JMSCC0102.useraction = Ellen\u0151rizze a tulajdons\u00e1gn\u00e9vben haszn\u00e1lt karaktereket, \u00e9s v\u00e9gezze el a sz\u00fcks\u00e9ges m\u00f3dos\u00edt\u00e1sokat.
JMSCC0102.inserts = XMSC_INSERT_PROPERTY
JMSCC0102.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0103 = Null objektum lett megadva.
JMSCC0103.explanation = Olyan objektum ker\u00fclt megad\u00e1sra a writeObject() met\u00f3dusnak, ami null volt.
JMSCC0103.useraction = Az alkalmaz\u00e1s kijav\u00edt\u00e1s\u00e1val biztos\u00edtsa, hogy csak nem null objektumok ker\u00fcljenek \u00e1tad\u00e1sra param\u00e9terk\u00e9nt a writeObject() met\u00f3dusnak.
JMSCC0103.exception = java.lang.NullPointerException

JMSCC0105 = A(z) ''{0}'' elem \u00e1talak\u00edt\u00e1sa a(z) ''{1}'' t\u00edpusb\u00f3l a(z) ''{2}'' t\u00edpusba nem megengedett.
JMSCC0105.explanation = A k\u00e9t megadott adatt\u00edpus k\u00f6z\u00f6tti \u00e1talak\u00edt\u00e1st nem engedi meg a JMS specifik\u00e1ci\u00f3.
JMSCC0105.useraction = A megengedett \u00e1talak\u00edt\u00e1sok valamelyik\u00e9nek haszn\u00e1lat\u00e1val olvassa be a megnevezett elemet.
JMSCC0105.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE
JMSCC0105.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0106 = Nem siker\u00fclt megszerezni egy XA er\u0151forr\u00e1st. ''{0}''.
JMSCC0106.useraction = Tov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt n\u00e9zze meg az okot.
JMSCC0106.inserts = XMSC_INSERT_EXCEPTION
JMSCC0106.exception = java.lang.RuntimeException

JMSCC0107 = Rossz id\u0151korl\u00e1t: ''{0}''.
JMSCC0107.explanation = Az id\u0151korl\u00e1tnak null\u00e1nak vagy pozit\u00edv \u00e9rt\u00e9knek kell lennie, ezredm\u00e1sodpercben m\u00e9rve.
JMSCC0107.useraction = Ne adjon \u00e1t negat\u00edv id\u0151korl\u00e1tot.
JMSCC0107.inserts = XMSC_INSERT_TIMEOUT

# Message changed for APAR IT16300
JMSCC0108 = Az IBM MQ JMS oszt\u00e1lyok egy olyan \u00fczenetet \u00e9szlelt, amely k\u00e9szen \u00e1llt aszinkron sz\u00e1ll\u00edt\u00e1sra egy alkalmaz\u00e1sba. A sz\u00e1ll\u00edt\u00e1s megk\u00eds\u00e9rl\u00e9sekor az \u00fczenet m\u00e1r nem volt el\u00e9rhet\u0151. A lehets\u00e9ges okok \u00e9s tev\u00e9kenys\u00e9gek le\u00edr\u00e1s\u00e1\u00e9rt tekintse meg a "JMSCC0108 \u00fczenetek hibaelh\u00e1r\u00edt\u00e1sa" t\u00e9mak\u00f6rt az IBM Knowledge Center IBM MQ V9.0 szakasz\u00e1ban.
JMSCC0108.explanation = Az IBM MQ JMS oszt\u00e1lyokon bel\u00fcl egy bels\u0151 sz\u00e1l \u00e9szlelt egy \u00fczenetet, \u00e9s a k\u00e9rte, hogy egy m\u00e1sik bels\u0151 sz\u00e1l k\u00e9rdezze le az \u00fczenetet \u00e9s sz\u00e1ll\u00edtsa azt egy alkalmaz\u00e1shoz feldolgoz\u00e1sra. Amikor a sz\u00e1l megpr\u00f3b\u00e1lta lek\u00e9rdezni az \u00fczenetet, az m\u00e1r nem volt el\u00e9rhet\u0151.
JMSCC0108.useraction = Tov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt tekintse meg a "JMSCC0108 \u00fczenetek hibaelh\u00e1r\u00edt\u00e1sa" t\u00e9mak\u00f6rt az IBM Knowledge Center IBM MQ V9.0 szakasz\u00e1ban.

JMSCC0109 = Egy \u00fczenetvez\u00e9relt komponens fut\u00e1si kiv\u00e9telt dobott: ''{0}''.
JMSCC0109.explanation = Ez az \u00fczenetfigyel\u0151 hib\u00e1j\u00e1t jelezheti.
JMSCC0109.useraction = Ha a fut\u00e1si kiv\u00e9telt az \u00fczenetfigyel\u0151 nem sz\u00e1nd\u00e9kosan dobta, akkor a kapcsol\u00f3d\u00f3 kiv\u00e9tel seg\u00edts\u00e9g\u00e9vel hat\u00e1rozza meg a probl\u00e9m\u00e1t.
JMSCC0109.inserts = XMSC_INSERT_EXCEPTION
JMSCC0109.exception = java.lang.RuntimeException

JMSCC0110 = A(z) ''{0}'' kiv\u00e9tel t\u00f6rt\u00e9nt, mik\u00f6zben a rendszer egy \u00fczenet feldolgoz\u00e1s\u00e1t v\u00e9gezte k\u00e9zbes\u00edt\u00e9sre egy \u00fczenetvez\u00e9relt komponensnek.
JMSCC0110.useraction = Tov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt n\u00e9zze meg a kapcsol\u00f3d\u00f3 kiv\u00e9telt.
JMSCC0110.inserts = XMSC_INSERT_EXCEPTION
JMSCC0110.exception = java.lang.RuntimeException

JMSCC0111 = Az IBM MQ JMS oszt\u00e1lyok egy m\u00e1r l\u00e9tez\u0151 \u00fcgyf\u00e9lazonos\u00edt\u00f3t pr\u00f3b\u00e1ltak \
be\u00e1ll\u00edtani egy kapcsolathoz vagy JMSContexthez.
JMSCC0111.explanation = Egy alkalmaz\u00e1s megpr\u00f3b\u00e1lt be\u00e1ll\u00edtani egy \u00e9rv\u00e9nyes kapcsolat \
vagy JMSContext \u00fcgyf\u00e9lazonos\u00edt\u00f3j\u00e1t ''{0}'' \u00e9rt\u00e9kre, de ez az \u00e9rt\u00e9k m\u00e1r haszn\u00e1latban van. \n\
Az \u00fcgyf\u00e9lazonos\u00edt\u00f3t m\u00e1r be\u00e1ll\u00edtotta a k\u00f6vetkez\u0151: {1}.
JMSCC0111.useraction = Gy\u0151z\u0151dj\u00f6n meg r\u00f3la, hogy a kapcsolat \u00e9rv\u00e9nyes \u00e9s az \
\u00fcgyf\u00e9l-azonos\u00edt\u00f3 egyedi.
JMSCC0111.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_STRING
JMSCC0111.exception = com.ibm.msg.client.jms.DetailedInvalidClientIDException

JMSCC0112 = Ez a szolg\u00e1ltat\u00f3 nem t\u00e1mogatja a k\u00e9zbes\u00edt\u00e9s k\u00e9sleltet\u00e9s\u00e9t
JMSCC0112.explanation = Egy alkalmaz\u00e1s megk\u00eds\u00e9relt be\u00e1ll\u00edtani egy k\u00e9zbes\u00edt\u00e9si k\u00e9sleltet\u00e9st, de a JMS szolg\u00e1ltat\u00f3 ezt nem t\u00e1mogatja

JMSCC0113 = A k\u00e9zbes\u00edt\u00e9si k\u00e9sleltet\u00e9snek az \u00e9lettartamn\u00e1l kisebbnek kell lennie
JMSCC0113.explanation = Egy alkalmaz\u00e1s megk\u00eds\u00e9relt be\u00e1ll\u00edtani egy k\u00e9zbes\u00edt\u00e9si k\u00e9sleltet\u00e9st, de az \u00e9lettartam hosszabb volt, mint ez a k\u00e9sleltet\u00e9s

JMSCC0114 = A k\u00e9zbes\u00edt\u00e9si k\u00e9sleltet\u00e9s nem t\u00e1mogatott a visszatartott kiadv\u00e1nyokhoz
JMSCC0114.explanation = Egy alkalmaz\u00e1s megk\u00eds\u00e9relt be\u00e1ll\u00edtani egy k\u00e9zbes\u00edt\u00e9si k\u00e9sleltet\u00e9st egy visszatartott \u00fczeneten, de ez nem t\u00e1mogatott

JMSCC0115 = A k\u00e9zbes\u00edt\u00e9si k\u00e9sleltet\u00e9s nem haszn\u00e1lhat\u00f3 a csoportos\u00edt\u00e1ssal
JMSCC0115.explanation = Az alkalmaz\u00e1sok egyike megk\u00eds\u00e9relte be\u00e1ll\u00edtani a k\u00e9zbes\u00edt\u00e9si k\u00e9sleltet\u00e9st egy be\u00e1ll\u00edtott csoportazonos\u00edt\u00f3val \u00e9s/vagy csoportsorsz\u00e1mmal is rendelkez\u0151 \u00fczeneten, de ez nem t\u00e1mogatott

# Message for FFST - additional fields not required
JMSCC1026 = Kiv\u00e9tel t\u00f6rt\u00e9nt, mik\u00f6zben a felhaszn\u00e1l\u00f3 kiv\u00e9telfigyel\u0151je futott.

# Message for FFST - additional fields not required
JMSCC1027 = A kiv\u00e9telfigyel\u0151 fut\u00e1sa meghi\u00fasult.

JMSCC1069 = Egy XA tranzakci\u00f3kat haszn\u00e1l\u00f3 munkamenet m\u0171k\u00f6d\u00e9se \u00e9rv\u00e9nytelen volt.
JMSCC1069.explanation = Egy tranzakci\u00f3kat haszn\u00e1l\u00f3 munkamenet nyugt\u00e1z\u00e1s m\u00f3dja \u00e9rv\u00e9nytelen volt. A commit(), rollback(), acknowledge() \u00e9s recover() nem \u00e9rv\u00e9nyes m\u0171velet a tranzakci\u00f3kat haszn\u00e1l\u00f3 munkamenetekben.
JMSCC1069.useraction = Ne h\u00edvja ezeket a met\u00f3dusokat XA haszn\u00e1latakor.
JMSCC1069.exception = com.ibm.msg.client.jms.DetailedTransactionInProgressException

JMSCC1083 = Helytelen \u00fczenetk\u00f6teg-m\u00e9ret (legyen nagyobb, mint nulla).
JMSCC1083.explanation = Helytelen k\u00f6tegm\u00e9ret param\u00e9ter ker\u00fclt \u00e1tad\u00e1sra a createConnectionConsumer() vagy a createDurableConnectionConsumer() met\u00f3dusnak.
JMSCC1083.useraction = V\u00e1lasszon null\u00e1n\u00e1l nagyobb k\u00f6tegm\u00e9retet. A JEE szabv\u00e1nynak megfelel\u0151 alkalmaz\u00e1skiszolg\u00e1l\u00f3k eset\u00e9n ez hiba lehet az alkalmaz\u00e1skiszolg\u00e1l\u00f3ban. N\u00e9zze meg az alkalmaz\u00e1skiszolg\u00e1l\u00f3 dokument\u00e1ci\u00f3j\u00e1t.

JMSCC1084 = Null kiszolg\u00e1l\u00f3 munkamenet t\u00e1rol\u00f3 lett megadva.
JMSCC1084.explanation = A createConnectionConsumer() vagy a createDurableConnectionConsumer() met\u00f3dusban megadott kiszolg\u00e1l\u00f3 munkamenet t\u00e1rol\u00f3 null volt.
JMSCC1084.useraction = \u00c1ll\u00edtson be megfelel\u0151 kiszolg\u00e1l\u00f3 munkamenet t\u00e1rol\u00f3t. A JEE szabv\u00e1nynak megfelel\u0151 alkalmaz\u00e1skiszolg\u00e1l\u00f3k eset\u00e9n ez hiba lehet az alkalmaz\u00e1skiszolg\u00e1l\u00f3ban. N\u00e9zze meg az alkalmaz\u00e1skiszolg\u00e1l\u00f3 dokument\u00e1ci\u00f3j\u00e1t.

JMSCC1093 = Null param\u00e9ter lett \u00e1tadva.
JMSCC1093.explanation = A met\u00f3dus \u00e1ltal megk\u00f6vetelt egyik objektum nem lett megfelel\u0151en inicializ\u00e1lva.
JMSCC1093.useraction = Gondoskodj\u00e9k r\u00f3la, hogy a met\u00f3dusnak \u00e1tadott \u00f6sszes param\u00e9ter megfelel\u0151en inicializ\u00e1lva legyen.

JMSCC1094 = A QuantityHint nem \u00e9rv\u00e9nyes.
JMSCC1094.explanation = Helytelen adatmennyis\u00e9g tippel t\u00f6rt\u00e9nt k\u00eds\u00e9rlet egy kapcsolatb\u00f6ng\u00e9sz\u0151 l\u00e9trehoz\u00e1s\u00e1ra.
JMSCC1094.useraction = NO_DATA, HEADER_DATA vagy FULL_DATA \u00e9rt\u00e9ket adjon meg.
JMSCC1094.exception = java.lang.IllegalArgumentException

JMSCC1096 = Az \u00fczenethivatkoz\u00e1s nem \u00e9rv\u00e9nyes.
JMSCC1096.explanation = Rossz form\u00e1tum\u00fa \u00fczenethivatkoz\u00e1s ker\u00fclt \u00e1tad\u00e1sra a met\u00f3dusnak. Az \u00fczenethivatkoz\u00e1snak a JmsMessageReference p\u00e9ld\u00e1ny\u00e1nak kell lennie.
JMSCC1096.useraction = Gondoskodj\u00e9k r\u00f3la, hogy helyes \u00fczenethivatkoz\u00e1sok legyenek.

JMSCC1112 = Egy tartom\u00e1nyra jellemz\u0151 objektumon v\u00e9gzett m\u0171velet \u00e9rv\u00e9nytelen volt. A(z) ''{0}'' m\u0171velet nem \u00e9rv\u00e9nyes a(z) ''{1}'' t\u00edpushoz.
JMSCC1112.explanation = Egy JMS alkalmaz\u00e1s megpr\u00f3b\u00e1lt m\u0171veletet v\u00e9grehajtani egy tartom\u00e1nyra jellemz\u0151 objektumon, de a m\u0171velet csak a m\u00e1sik \u00fczenetkezel\u00e9si tartom\u00e1nyban \u00e9rv\u00e9nyes.
JMSCC1112.useraction = Gy\u0151z\u0151dj\u00f6n meg r\u00f3la, hogy az alkalmaz\u00e1s \u00e1ltal haszn\u00e1lt JMS objektumok \u00e9s m\u0171veletek \u00e9rintettek a sz\u00fcks\u00e9ges \u00fczenetkezel\u00e9si tartom\u00e1ny szempontj\u00e1b\u00f3l. Ha az alkalmaz\u00e1s mindk\u00e9t \u00fczenetkezel\u00e9si tartom\u00e1nyt haszn\u00e1lja, akkor fontolja meg a tartom\u00e1nyf\u00fcggetlen objektumok haszn\u00e1lat\u00e1t az alkalmaz\u00e1sban.
JMSCC1112.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_TYPE
JMSCC1112.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC1113 = Egy tartom\u00e1nyra jellemz\u0151 objektumon v\u00e9gzett m\u0171velet \u00e9rv\u00e9nytelen volt. A(z) ''{0}'' m\u0171velet nem \u00e9rv\u00e9nyes a(z) ''{1}'' t\u00edpushoz, mivel a munkamenet ''{2}'' t\u00edpus\u00fa.
JMSCC1113.explanation = Egy JMS alkalmaz\u00e1s megpr\u00f3b\u00e1lt m\u0171veletet v\u00e9grehajtani egy tartom\u00e1nyra jellemz\u0151 objektumon, de a m\u0171velet csak a m\u00e1sik \u00fczenetkezel\u00e9si tartom\u00e1nyban \u00e9rv\u00e9nyes.
JMSCC1113.useraction = Gy\u0151z\u0151dj\u00f6n meg r\u00f3la, hogy az alkalmaz\u00e1s \u00e1ltal haszn\u00e1lt JMS objektumok, m\u0171veletek \u00e9s kapcsolatgy\u00e1rak \u00e9rintettek a sz\u00fcks\u00e9ges \u00fczenetkezel\u00e9si tartom\u00e1ny szempontj\u00e1b\u00f3l. Ha az alkalmaz\u00e1s mindk\u00e9t \u00fczenetkezel\u00e9si tartom\u00e1nyt haszn\u00e1lja, akkor fontolja meg a tartom\u00e1nyf\u00fcggetlen objektumok haszn\u00e1lat\u00e1t az alkalmaz\u00e1sban.
JMSCC1113.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_TYPE,XMSC_INSERT_SESSION
JMSCC1113.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC3002 = A(z) ''{0}'' ideiglenes sor c\u00e9l nem t\u00f6r\u00f6lhet\u0151, mert m\u00e9g haszn\u00e1latban van.
JMSCC3002.explanation = K\u00eds\u00e9rlet t\u00f6rt\u00e9nt egy ideiglenes c\u00e9l t\u00f6rl\u00e9s\u00e9re, mik\u00f6zben egy fogyaszt\u00f3 vagy b\u00f6ng\u00e9sz\u0151 m\u00e9g haszn\u00e1lja azt.
JMSCC3002.useraction = Z\u00e1rja be a c\u00e9lt\u00f3l f\u00fcgg\u0151 \u00f6sszes fogyaszt\u00f3t \u00e9s b\u00f6ng\u00e9sz\u0151t, miel\u0151tt t\u00f6r\u00f6ln\u00e9 a c\u00e9lt.
JMSCC3002.inserts = XMSC_DESTINATION_NAME

JMSCC3003 = A(z) ''{0}'' ideiglenes c\u00e9l helytelen haszn\u00e1lata.
JMSCC3003.explanation = Az ideiglenes c\u00e9lok \u00fczenetfogyaszt\u00f3k \u00e9s b\u00f6ng\u00e9sz\u0151k \u00e1ltali haszn\u00e1lata azokra korl\u00e1tozott, amelyek ugyanazzal a kapcsolattal lettek l\u00e9trehozva.
JMSCC3003.useraction = M\u00f3dos\u00edtsa az alkalmaz\u00e1st \u00fagy, hogy ugyanazon kapcsolat \u00e1ltal l\u00e9trehozott ideiglenes c\u00e9lt haszn\u00e1ljon, majd pr\u00f3b\u00e1lkozzon \u00fajra.
JMSCC3003.inserts = XMSC_DESTINATION_NAME
JMSCC3003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException


JMSCC3019 = Az ideiglenes c\u00e9l m\u00e1r t\u00f6r\u00f6lve lett: ''{0}''.
JMSCC3019.explanation = Az ideiglenes c\u00e9l m\u00e1r t\u00f6r\u00f6lve lett, mikor k\u00eds\u00e9rlet t\u00f6rt\u00e9nt a haszn\u00e1lat\u00e1ra.
JMSCC3019.useraction = M\u00f3dos\u00edtsa az alkalmaz\u00e1st \u00fagy, hogy ne z\u00e1rja le az ideiglenes c\u00e9lt, vagy pedig haszn\u00e1ljon m\u00e1sik c\u00e9lt.
JMSCC3019.inserts = XMSC_DESTINATION_NAME
JMSCC3019.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC3025 = A(z) ''{0}'' ideiglenes t\u00e9mak\u00f6r c\u00e9l nem t\u00f6r\u00f6lhet\u0151, mert m\u00e9g haszn\u00e1latban van.
JMSCC3025.explanation = K\u00eds\u00e9rlet t\u00f6rt\u00e9nt egy ideiglenes c\u00e9l t\u00f6rl\u00e9s\u00e9re, mik\u00f6zben egy fogyaszt\u00f3 vagy b\u00f6ng\u00e9sz\u0151 m\u00e9g haszn\u00e1lja azt.
JMSCC3025.useraction = Z\u00e1rja be a c\u00e9lt\u00f3l f\u00fcgg\u0151 \u00f6sszes fogyaszt\u00f3t \u00e9s b\u00f6ng\u00e9sz\u0151t, miel\u0151tt t\u00f6r\u00f6ln\u00e9 a c\u00e9lt.
JMSCC3025.inserts = XMSC_DESTINATION_NAME

JMSCC3031 = Az \u00fcgyf\u00e9l-azonos\u00edt\u00f3 nem \u00e1ll\u00edthat\u00f3 be a kapcsolat haszn\u00e1lata ut\u00e1n.
JMSCC3031.explanation = Egy kapcsolathoz tartoz\u00f3 \u00fcgyf\u00e9l-azonos\u00edt\u00f3 csak egyszer \u00e1ll\u00edthat\u00f3 be, a kapcsolat haszn\u00e1lata el\u0151tt.
JMSCC3031.useraction = A kapcsolat haszn\u00e1lata el\u0151tt \u00e1ll\u00edtsa be az \u00fcgyf\u00e9l-azonos\u00edt\u00f3t.
JMSCC3031.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC3032 = Az \u00fcgyf\u00e9l-azonos\u00edt\u00f3 vissza\u00e1ll\u00edt\u00e1sa nem megengedett.
JMSCC3032.explanation = Egy kapcsolathoz tartoz\u00f3 \u00fcgyf\u00e9l-azonos\u00edt\u00f3 csak egyszer \u00e1ll\u00edthat\u00f3 be, a kapcsolat haszn\u00e1lata el\u0151tt.
JMSCC3032.useraction = A kapcsolat haszn\u00e1lata el\u0151tt \u00e1ll\u00edtsa be az \u00fcgyf\u00e9l-azonos\u00edt\u00f3t.
JMSCC3032.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC3033 = Az \u00fczenetfigyel\u0151n bel\u00fcli close() h\u00edv\u00e1s holtpontra jutott.
JMSCC3033.explanation = Megh\u00edv\u00e1sra ker\u00fclt a close() met\u00f3dus egy \u00fczenetfigyel\u0151b\u0151l. A close() h\u00edv\u00e1s nem adhat vissza \u00e9rt\u00e9ket, mik\u00f6zben az \u00fczenetfigyel\u0151 fut, ez\u00e9rt holtpontra jut.
JMSCC3033.useraction = M\u00f3dos\u00edtsa az alkalmaz\u00e1st \u00fagy, hogy ne h\u00edvjon semmilyen close() met\u00f3dust \u00fczenetfigyel\u0151n bel\u00fclr\u0151l.
JMSCC3033.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

# Log message
JMSCC3034 = A kiv\u00e9tel figyelmen k\u00edv\u00fcl marad, mivel nincs regisztr\u00e1lva kiv\u00e9telfigyel\u0151: ''{0}''.
JMSCC3034.explanation = K\u00eds\u00e9rlet t\u00f6rt\u00e9nt egy kiv\u00e9tel k\u00e9zbes\u00edt\u00e9s\u00e9re a kapcsolat kiv\u00e9telfigyel\u0151j\u00e9nek, de nincs regisztr\u00e1lva figyel\u0151.
JMSCC3034.useraction = A kiv\u00e9telek fogad\u00e1s\u00e1hoz regisztr\u00e1lni kell egy kiv\u00e9telfigyel\u0151t a kapcsolathoz.
JMSCC3034.inserts = XMSC_INSERT_EXCEPTION

# Log message
JMSCC3035 = A kiv\u00e9tel figyelmen k\u00edv\u00fcl marad, mivel a t\u00edpusa nem olyan, mint a kiv\u00e9telfigyel\u0151h\u00f6z kiv\u00e1lasztottak: ''{0}''.
JMSCC3035.explanation = A kiv\u00e9tel nem olyan t\u00edpus\u00fa, mint a kapcsolat kiv\u00e9telfigyel\u0151j\u00e9nek k\u00e9zbes\u00edt\u00e9sre kiv\u00e1lasztott t\u00edpusok, \u00edgy figyelmen k\u00edv\u00fcl maradt.
JMSCC3035.useraction = Tekintse \u00e1t az ASYNC_EXCEPTIONS kapcsolati be\u00e1ll\u00edt\u00e1st \u00e9s gy\u0151z\u0151dj\u00f6n meg r\u00f3la, hogy a sz\u00e1nd\u00e9kai szerint van be\u00e1ll\u00edtva a kiv\u00e9telek sz\u0171r\u00e9se.
JMSCC3035.inserts = XMSC_INSERT_EXCEPTION

# Log message
JMSCC3036 = A kapcsolat kiv\u00e9telfigyel\u0151je kiv\u00e9telt kapott: ''{0}''.
JMSCC3036.useraction = Tov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt n\u00e9zze meg a kiv\u00e9tellel kapcsolatos r\u00e9szleteket.
JMSCC3036.inserts = XMSC_INSERT_EXCEPTION

JMSCC3039 = Az el\u0151fizet\u00e9sn\u00e9v null vagy \u00fcres karaktersorozat volt.
JMSCC3039.explanation = A tart\u00f3s kapcsolatfogyaszt\u00f3knak olyan el\u0151fizet\u00e9sn\u00e9vvel kell rendelkezni\u00fck, ami nem null \u00e9s nem \u00fcres karaktersorozat.
JMSCC3039.useraction = Olyan el\u0151fizet\u00e9snevet adjon \u00e1t, ami nem null \u00e9s nem \u00fcres karaktersorozat.

JMSCC3040 = A kapcsolati metaadatok m\u00f3dos\u00edt\u00e1s\u00e1nak megk\u00eds\u00e9rl\u00e9se figyelmen k\u00edv\u00fcl lett hagyva. 
JMSCC3040.explanation = A kapcsolati metaadatok \u00edr\u00e1sv\u00e9dettek, a tulajdons\u00e1gai nem m\u00f3dos\u00edthat\u00f3k.
JMSCC3040.useraction = M\u00f3dos\u00edtsa az alkalmaz\u00e1st, hogy ne k\u00eds\u00e9relje meg a kapcsolati metaadatok megv\u00e1ltoztat\u00e1s\u00e1t.

JMSCC3041 = Meghi\u00fasult t\u00f6bbsz\u00f6r\u00f6s tulajdons\u00e1gok be\u00e1ll\u00edt\u00e1s\u00e1nak megk\u00eds\u00e9rl\u00e9se. A tulajdons\u00e1gok: ''{0}''.
JMSCC3041.explanation = N\u00e9h\u00e1ny tulajdons\u00e1g \u00e9rv\u00e9nyes\u00edt\u00e9se meghi\u00fasult, ez\u00e9rt egy m\u00f3dos\u00edt\u00e1s sem ker\u00fclt v\u00e9grehajt\u00e1sra.
JMSCC3041.useraction = Ellen\u0151rizze az \u00e9rv\u00e9nyes \u00e9rt\u00e9kkel rendelkez\u0151 tulajdons\u00e1gok kombin\u00e1ci\u00f3it. 
JMSCC3041.inserts = XMSC_INSERT_PROPERTY

# XA unavailable. An attempt was made to perform and action that requires XA when XA is not supported.
JMSCC4001 = Az osztott tranzakci\u00f3k nem \u00e9rhet\u0151k el.
JMSCC4001.explanation = Olyan k\u00f6rnyezetben t\u00f6rt\u00e9nt k\u00eds\u00e9rlet osztott tranzakci\u00f3k haszn\u00e1lat\u00e1ra, ahol azok nem \u00e9rhet\u0151k el.


JMSCC5001 = Nem k\u00e9rhet\u0151 le a t\u00f6rzs, mert az \u00fczenet StreamMessage
JMSCC5001.explanation = Nem lehetett lek\u00e9rni a t\u00f6rzset, mert az \u00fczenet StreamMessage, \u00e9s ezt a JMS specifik\u00e1ci\u00f3 nem enged\u00e9lyezi.
JMSCC5001.useraction = Az elk\u00fcld\u00f6tt alkalmaz\u00e1s- vagy \u00fczenett\u00edpust m\u00f3dos\u00edtani kell
JMSCC5001.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC5002 = A(z) {0} t\u00edpus\u00fa \u00fczenet t\u00f6rzs\u00e9t nem lehet hozz\u00e1rendelni a k\u00f6vetkez\u0151h\u00f6z: {1}
JMSCC5002.explanation = A JMS specifik\u00e1ci\u00f3 nem enged\u00e9lyezi az ilyen t\u00edpus\u00fa hozz\u00e1rendel\u00e9st
JMSCC5002.useraction = Az elk\u00fcld\u00f6tt alkalmaz\u00e1s- vagy \u00fczenett\u00edpust m\u00f3dos\u00edtani kell
JMSCC5002.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC5002.inserts = XMSC_INSERT_MESSAGE_TYPE, XMSC_INSERT_BODY_TYPE

JMSCC5003 = Kiv\u00e9tel t\u00f6rt\u00e9nt egy \u00fczenet soros\u00edtott form\u00e1j\u00e1nak visszaalak\u00edt\u00e1sa k\u00f6zben: ''{0}''.
JMSCC5003.explanation = A kiv\u00e9tel miatt nem lehetett visszaalak\u00edtani az \u00fczenet soros\u00edtott form\u00e1j\u00e1t.
JMSCC5003.useraction = A hiba r\u00e9szletei\u00e9rt vizsg\u00e1lja meg a kapcsol\u00f3d\u00f3 kiv\u00e9telt.
JMSCC5003.inserts = XMSC_INSERT_EXCEPTION
JMSCC5003.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC5004 = Az \u00fczenetnek nincs t\u00f6rzse
JMSCC5004.explanation = Az \u00fczenetnek nincs t\u00f6rzset, ez\u00e9rt nem alak\u00edthat\u00f3 \u00e1t a megadott t\u00edpusra
JMSCC5004.useraction = Az elk\u00fcld\u00f6tt alkalmaz\u00e1s- vagy \u00fczenett\u00edpust m\u00f3dos\u00edtani kell
JMSCC5004.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC5005 = Az \u00fczenet k\u00fcld\u00e9se nem enged\u00e9lyezett, mivel az \u00fczenet t\u00f6rzse csak olvashat\u00f3 \u00e9s egy JmsProducer.setProperty h\u00edv\u00e1s \u00e9rkezett
JMSCC5005.explanation = Egy felhaszn\u00e1l\u00f3i alkalmaz\u00e1s egy csak olvashat\u00f3 \u00fczenett\u00f6rzset pr\u00f3b\u00e1lt JmsProducer.setProperty h\u00edv\u00e1son kereszt\u00fcl be\u00e1ll\u00edtani.
JMSCC5005.useraction = M\u00f3dos\u00edtsa az alkalmaz\u00e1sprogramot ezen viselked\u00e9s elt\u00e1vol\u00edt\u00e1sa \u00e9rdek\u00e9ben, vagy pedig el\u0151bb h\u00edvja meg a clearBody() met\u00f3dust.
JMSCC5005.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSCC5006 = Az \u00fczenet k\u00fcld\u00e9se nem enged\u00e9lyezett, mivel az \u00fcgyf\u00e9l oldali aszinkron k\u00fcld\u00e9si puffer megtelt
JMSCC5006.explanation = A felhaszn\u00e1l\u00f3i alkalmaz\u00e1sok egyike k\u00eds\u00e9rletet tett egy JMS \u00fczenet aszinkron k\u00fcld\u00e9s\u00e9re, azonban az \u00fcgyf\u00e9len m\u00e1r lemarad\u00e1s tapasztalhat\u00f3 az aszinkron \u00fczenetek tekintet\u00e9ben.
JMSCC5006.useraction = M\u00f3dos\u00edtsa \u00fagy az alkalmaz\u00e1sprogramot, hogy kev\u00e9sb\u00e9 gyakran h\u00edvjon aszinkron k\u00fcld\u00e9si met\u00f3dusokat, vagy a konfigur\u00e1ci\u00f3s param\u00e9terek\u00e9rt forduljon a dokument\u00e1ci\u00f3hoz.

JMSCC5007 = A(z) ''{0}'' JMS2.0 API haszn\u00e1lata a kapcsolat ezen p\u00e9ld\u00e1ny\u00e1val nem t\u00e1mogatott
JMSCC5007.explanation = Csak a helyes t\u00edpus\u00fa kapcsolattal rendelkez\u0151 csatlakoz\u00e1s biztos\u00edthat t\u00e1mogat\u00e1st a JMS2.0 API seg\u00edts\u00e9g\u00e9vel
JMSCC5007.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC5007.inserts =XMSC_INSERT_METHOD

JMSCC5008 = A(z) ''{0}'' JMS2.0 funkci\u00f3 haszn\u00e1lata a kapcsolat ezen p\u00e9ld\u00e1ny\u00e1val nem t\u00e1mogatott
JMSCC5008.explanation = Az \u00fczenetben eml\u00edtett JMS2.0 funkci\u00f3 csak akkor t\u00e1mogatott, ha an IBM MQ V8 sorkezel\u0151h\u00f6z val\u00f3 csatlakoz\u00e1s az IBM MQ \u00fczenetkezel\u00e9si szolg\u00e1ltat\u00f3 V8 m\u00f3dj\u00e1val t\u00f6rt\u00e9nik.
JMSCC5008.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC5008.inserts =XMSC_INSERT_METHOD

JMSCC5009 = Nem \u00e9rkezett v\u00e1lasz a k\u00fcld\u0151 sz\u00e1lt\u00f3l. El\u0151fordulhat, hogy az \u00fczenet nem ker\u00fclt elk\u00fcld\u00e9sre
JMSCC5009.explanation = Az aszinkron k\u00fcld\u00e9si sz\u00e1l nem v\u00e1laszol. A sz\u00e1l v\u00e1ratlanul befejez\u0151dhetett.

JMSCC5010 = ConnectionFactory param\u00e9terek fel\u00fclb\u00edr\u00e1l\u00e1sa a PropertyStore-b\u00f3l:\n {0}
JMSCC5010.inserts = XMSC_INSERT_PROPERTY_OVERRIDE_LIST

JMSCC5011 = {0} param\u00e9ter fel\u00fclb\u00edr\u00e1l\u00e1sa:\n\
\tEredeti \u00e9rt\u00e9k = {1}\n\
\t\u00daj \u00e9rt\u00e9k      = {2}
JMSCC5011.inserts = XMSC_OVERRIDDEN_PROPERTY, XMSC_ORIGINAL__PROPERTY_VALUE, XMSC_NEW_PROPERTY_VALUE

#CICS related messages. JMSCC6 used to prevent issues when back porting.
#The first two exceptions have the same text but different exception types
JMSCC6001 = A(z) ''{0}'' met\u00f3dus CICS k\u00f6rnyezetben v\u00e9gzett futtat\u00e1skor nem t\u00e1mogatott.
JMSCC6001.explanation = A megadott met\u00f3dus nem haszn\u00e1lhat\u00f3 \u00f6sszerendel\u00e9s m\u00f3d\u00fa kapcsolattal, ha az MQ rendszerhez CICS k\u00f6rnyezetben kapcsol\u00f3dik.
JMSCC6001.useraction = M\u00f3dos\u00edtsa az alkalmaz\u00e1st \u00fagy, hogy nem h\u00edvja meg a megadott met\u00f3dust.
JMSCC6001.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6001.inserts = XMSC_INSERT_METHOD
 
JMSCC6002 = A(z) ''{0}'' met\u00f3dus CICS k\u00f6rnyezetben v\u00e9gzett futtat\u00e1skor nem t\u00e1mogatott.
JMSCC6002.explanation = A megadott met\u00f3dus nem haszn\u00e1lhat\u00f3 \u00f6sszerendel\u00e9s m\u00f3d\u00fa kapcsolattal, ha az MQ rendszerhez CICS k\u00f6rnyezetben kapcsol\u00f3dik.
JMSCC6002.useraction = M\u00f3dos\u00edtsa az alkalmaz\u00e1st \u00fagy, hogy nem h\u00edvja meg a megadott met\u00f3dust.
JMSCC6002.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC6002.inserts = XMSC_INSERT_METHOD
 
JMSCC6003 = CICS k\u00f6rnyezetben v\u00e9gzett futtat\u00e1s eset\u00e9n kapcsolatonk\u00e9nt egyszerre csak egy munkamenet-p\u00e9ld\u00e1ny lehet akt\u00edv.
JMSCC6003.explanation = CICS k\u00f6rnyezetben v\u00e9gzett futtat\u00e1s eset\u00e9n MQ rendszerrel kialak\u00edtott, \u00f6sszerendel\u00e9s m\u00f3d\u00fa kapcsolatonk\u00e9nt egyszerre csak egy munkamenet-p\u00e9ld\u00e1ny lehet akt\u00edv.
JMSCC6003.useraction = M\u00f3dos\u00edtsa az alkalmaz\u00e1st \u00fagy, hogy m\u00e1sik kapcsolatb\u00f3l hozza l\u00e9tre a munkamenetet, vagy z\u00e1rja be az aktu\u00e1lis kapcsolatot haszn\u00e1l\u00f3 megl\u00e9v\u0151 munkamenetet.
JMSCC6003.exception = com.ibm.msg.client.jms.DetailedJMSException
 
JMSCC6004 = Kapcsolat vagy JMS kontextus l\u00e9trehoz\u00e1sa felhaszn\u00e1l\u00f3i azonos\u00edt\u00f3val \u00e9s jelsz\u00f3val CICS k\u00f6rnyezetben v\u00e9gzett futtat\u00e1s eset\u00e9n nem t\u00e1mogatott.
JMSCC6004.explanation = A sorkezel\u0151 nem t\u00e1mogatja a felhaszn\u00e1l\u00f3i azonos\u00edt\u00f3val \u00e9s jelsz\u00f3val v\u00e9gzett hiteles\u00edt\u00e9st, amikor \u00f6sszerendel\u00e9s m\u00f3d\u00fa kapcsolatot vagy JMS kontextust hoz l\u00e9tre CICS k\u00f6rnyezetben. Helyette a CICS c\u00edmt\u00e9rhez vagy a tranzakci\u00f3hoz tartoz\u00f3 felhaszn\u00e1l\u00f3i azonos\u00edt\u00f3 ker\u00fcl felhazsn\u00e1l\u00e1sra.
JMSCC6004.useraction = M\u00f3dos\u00edtsa az alkalmaz\u00e1st \u00fagy, hogy ne adjon meg felhaszn\u00e1l\u00f3i azonos\u00edt\u00f3t \u00e9s jelsz\u00f3t.
JMSCC6004.exception = com.ibm.msg.client.jms.DetailedJMSException

#The first two exceptions have the same text but different exception types
JMSCC6011 = A(z) ''{0}'' met\u00f3dus IMS k\u00f6rnyezetben v\u00e9gzett futtat\u00e1skor nem t\u00e1mogatott.
JMSCC6011.explanation = A megadott met\u00f3dus nem haszn\u00e1lhat\u00f3 \u00f6sszerendel\u00e9s m\u00f3d\u00fa kapcsolattal, ha az MQ rendszerhez IMS k\u00f6rnyezetben kapcsol\u00f3dik.
JMSCC6011.useraction = M\u00f3dos\u00edtsa az alkalmaz\u00e1st \u00fagy, hogy nem h\u00edvja meg a megadott met\u00f3dust.
JMSCC6011.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6011.inserts = XMSC_INSERT_METHOD
 
JMSCC6012 = A(z) ''{0}'' met\u00f3dus IMS k\u00f6rnyezetben v\u00e9gzett futtat\u00e1skor nem t\u00e1mogatott.
JMSCC6012.explanation = A megadott met\u00f3dus nem haszn\u00e1lhat\u00f3 \u00f6sszerendel\u00e9s m\u00f3d\u00fa kapcsolattal, ha az MQ rendszerhez IMS k\u00f6rnyezetben kapcsol\u00f3dik.
JMSCC6012.useraction = M\u00f3dos\u00edtsa az alkalmaz\u00e1st \u00fagy, hogy nem h\u00edvja meg a megadott met\u00f3dust.
JMSCC6012.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC6012.inserts = XMSC_INSERT_METHOD
 
JMSCC6013 = IMS k\u00f6rnyezetben v\u00e9gzett futtat\u00e1s eset\u00e9n kapcsolatonk\u00e9nt egyszerre csak egy munkamenet-p\u00e9ld\u00e1ny lehet akt\u00edv.
JMSCC6013.explanation = IMS k\u00f6rnyezetben v\u00e9gzett futtat\u00e1s eset\u00e9n MQ rendszerrel kialak\u00edtott, \u00f6sszerendel\u00e9s m\u00f3d\u00fa kapcsolatonk\u00e9nt egyszerre csak egy munkamenet-p\u00e9ld\u00e1ny lehet akt\u00edv.
JMSCC6013.useraction = M\u00f3dos\u00edtsa az alkalmaz\u00e1st \u00fagy, hogy m\u00e1sik kapcsolatb\u00f3l hozza l\u00e9tre a munkamenetet, vagy z\u00e1rja be az aktu\u00e1lis kapcsolatot haszn\u00e1l\u00f3 megl\u00e9v\u0151 munkamenetet.
JMSCC6013.exception = com.ibm.msg.client.jms.DetailedJMSException
 
JMSCC6014 = Kapcsolat vagy JMS kontextus l\u00e9trehoz\u00e1sa felhaszn\u00e1l\u00f3i azonos\u00edt\u00f3val \u00e9s jelsz\u00f3val IMS k\u00f6rnyezetben v\u00e9gzett futtat\u00e1s eset\u00e9n nem t\u00e1mogatott.
JMSCC6014.explanation = A sorkezel\u0151 nem t\u00e1mogatja a felhaszn\u00e1l\u00f3i azonos\u00edt\u00f3val \u00e9s jelsz\u00f3val v\u00e9gzett hiteles\u00edt\u00e9st, amikor \u00f6sszerendel\u00e9s m\u00f3d\u00fa kapcsolatot vagy JMS kontextust hoz l\u00e9tre IMS k\u00f6rnyezetben. Ehelyett az IMS c\u00edmt\u00e9rhez, tranzakci\u00f3hoz, LTERM n\u00e9vhez vagy PSBNAME n\u00e9vhez t\u00e1rs\u00edtott felhaszn\u00e1l\u00f3i azonos\u00edt\u00f3 ker\u00fcl felhaszn\u00e1l\u00e1sra.
JMSCC6014.useraction = M\u00f3dos\u00edtsa az alkalmaz\u00e1st \u00fagy, hogy ne adjon meg felhaszn\u00e1l\u00f3i azonos\u00edt\u00f3t \u00e9s jelsz\u00f3t.
JMSCC6014.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSCC6015 = A(z) ''{0}'' met\u00f3dus alkalmaz\u00e1skiszolg\u00e1l\u00f3n v\u00e9gzett futtat\u00e1skor nem t\u00e1mogatott.
JMSCC6015.explanation = A megadott met\u00f3dus nem haszn\u00e1lhat\u00f3 Java EE EJB vagy webes t\u00e1rol\u00f3ban.
JMSCC6015.useraction = M\u00f3dos\u00edtsa az alkalmaz\u00e1st \u00fagy, hogy nem h\u00edvja meg a megadott met\u00f3dust.
JMSCC6015.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6015.inserts = XMSC_INSERT_METHOD

JMSCC6016 = Id\u0151t\u00fall\u00e9p\u00e9s t\u00f6rt\u00e9nt am\u00edg a rendszer arra v\u00e1rt, hogy az alkalmaz\u00e1skiszolg\u00e1l\u00f3 lek\u00e9rdezzen egy kiszolg\u00e1l\u00f3 munkamenetet. Az id\u0151korl\u00e1t ''{0}'' \u00e9rt\u00e9kre van be\u00e1ll\u00edtva
JMSCC6016.explanation = Az id\u0151korl\u00e1t \u00e9rt\u00e9k lej\u00e1r\u00e1sa ut\u00e1n az MQ er\u0151forr\u00e1s-illeszt\u0151nek meg kell szak\u00edtania a v\u00e1rakoz\u00e1st egy kiszolg\u00e1l\u00f3 munkamenetre.
JMSCC6016.useraction = Fontolja meg az id\u0151korl\u00e1t n\u00f6vel\u00e9s\u00e9t a 'com.ibm.msg.client.wmq.getServerSessionTimeout' JMS konfigur\u00e1ci\u00f3s tulajdons\u00e1g be\u00e1ll\u00edt\u00e1s\u00e1val
JMSCC6016.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6016.inserts = XMSC_INSERT_TIMEOUT
 
