# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
#
1=MQJI001: Objekt spr\u00e1vce front m\u00e1 hodnotu null.
2=MQJI002: Nen\u00ed nav\u00e1z\u00e1no p\u0159ipojen\u00ed ke spr\u00e1vci front.
13=MQJI013: Nepodporovan\u00e9 \u010d\u00edslo verze - {0}.
16=MQJI016: Objekt byl uzav\u0159en.
17=MQJI017: Nebyly ur\u010deny \u017e\u00e1dn\u00e9 selektory.
27=MQJI025: Pro operaci na\u010dten\u00ed (get) byl p\u0159ed\u00e1n objekt MQMessage s hodnotou null.
28=MQJI026: Pro operaci na\u010dten\u00ed (get) byl p\u0159ed\u00e1n objekt MQGetMessageOptions s hodnotou null.
29=MQJI027: Fronta byla uzav\u0159ena.
30=MQJI028: Pro operaci vlo\u017een\u00ed (put) byl p\u0159ed\u00e1n objekt MQMessage s hodnotou null.
31=MQJI029: Pro operaci vlo\u017een\u00ed (put) byl p\u0159ed\u00e1n objekt MQPutMessageOptions s hodnotou null.
39=MQJE001: K\u00f3d dokon\u010den\u00ed: {0}, d\u016fvod: {1}.
40=MQJE001: Do\u0161lo k v\u00fdjimce MQException: K\u00f3d dokon\u010den\u00ed {0}, d\u016fvod {1}\n{2}
52=MQJE011: Pokus o p\u0159ipojen\u00ed k soketu byl odm\u00edtnut.
53=MQJE012: Chyba zabezpe\u010den\u00ed - nelze se p\u0159ipojit k hostiteli {0}.
54=MQJE013: P\u0159i p\u0159\u00edstupu k proud\u016fm soketu do\u0161lo k chyb\u011b.
71=MQJE030: V pr\u016fb\u011bhu tok\u016f zabezpe\u010den\u00ed byla zaznamen\u00e1na v\u00fdjimka IOException.
83=MQJE042: Chybn\u00e9 pole Eyecatcher: {0}.
84=MQJE043: Ze spr\u00e1vce front byla p\u0159ijata ne\u00fapln\u00e1 data.
85=MQJE044: Ve struktu\u0159e MQMD do\u0161lo k chyb\u011b kop\u00edrov\u00e1n\u00ed pole.
87=MQJE046: Nepodporovan\u00e1 k\u00f3dov\u00e1 sada: {0}.
97=MQJE055: Spr\u00e1vce front nepodporuje struktury rozhran\u00ed API IBM MQ verze 2.
98=MQJE056: Selh\u00e1n\u00ed po\u010d\u00e1te\u010dn\u00edho procesu jedn\u00e1n\u00ed
105=MQJI039: Neplatn\u00fd objekt ConnectionRequestInfo.
106=MQJI040: Objekt MQManagedConnection ji\u017e byl zlikvidov\u00e1n.
108=MQJI042: Objekt MQManagedConnection nelze pou\u017e\u00edt opakovan\u011b.
113=Operace xa_open se nezda\u0159ila.
114=Operace XA se nezda\u0159ila, zkontrolujte k\u00f3d chyby (errorCode).
115=Prost\u0159edek XA byl uzav\u0159en.
117=MQJE064: Nepodporovan\u00e1 verze struktury MQMD {0}.
118=MQJE065: Byl detekov\u00e1n nekonzistentn\u00ed intern\u00ed stav.
120=MQJE066: Byl zad\u00e1n objekt nepodporovan\u00e9ho typu: {0}.
121=MQJE067: N\u00e1zev partnera {0} neodpov\u00edd\u00e1 po\u017eadovan\u00e9mu n\u00e1zvu {1}.
122=MQJE068: Certifik\u00e1t byl odvol\u00e1n.
123=MQJE069: Nelze nav\u00e1zat kontakt s \u00falo\u017ei\u0161t\u011bm certifik\u00e1t\u016f (CertStore).
125=Pokus o p\u0159ipojen\u00ed k soketu byl odm\u00edtnut v d\u016fsledku omezen\u00ed LOCAL_ADDRESS_PROPERTY.
