# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright>  
#
# Messages produced by the IBM MQ Java interface classes
# (shared by bindings and by client)
# Messages beginning with MQJI are explanations for exceptions
# Messages beginning with MQJE are errors
#
# From class MQDistributionList
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
MQJI001=MQJI001: \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u30fb\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c\u30cc\u30eb\u3067\u3057\u305f\u3002
MQJI002=MQJI002: \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306b\u63a5\u7d9a\u3057\u3066\u3044\u307e\u305b\u3093\u3002
MQJI003=MQJI003: \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30fb\u30ec\u30b3\u30fc\u30c9\u304c\u63d0\u4f9b\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJI006=MQJI006: \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u307e\u305f\u306f\u5fdc\u7b54\u30ec\u30b3\u30fc\u30c9\u304c\u30cc\u30eb\u3067\u3057\u305f\u3002
MQJI008=MQJI008: \u30cc\u30eb\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u66f8\u304d\u8fbc\u307f\u7528\u306b\u6e21\u3055\u308c\u307e\u3057\u305f\u3002
MQJI009=MQJI009: \u30cc\u30eb\u306e\u66f8\u304d\u8fbc\u307f\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30aa\u30d7\u30b7\u30e7\u30f3\u304c\u66f8\u304d\u8fbc\u307f\u7528\u306b\u6e21\u3055\u308c\u307e\u3057\u305f\u3002
MQJI011=MQJI011: \u914d\u5e03\u30ea\u30b9\u30c8\u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f\u3002
#
# From class MQGetMessageOptions
#
MQJI013=MQJI013: \u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u30d0\u30fc\u30b8\u30e7\u30f3\u756a\u53f7 - ''{0}''\u3002
MQJI014=MQJI014: \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304b\u3089\u53d7\u4fe1\u3057\u305f\u30c7\u30fc\u30bf\u304c\u4e0d\u5341\u5206\u3067\u3059\u3002
MQJI015=MQJI015: \u8aa4\u3063\u305f\u76ee\u5370: ''{0}''\u3002
#
# From class MQManagedObject
#
MQJI016=MQJI016: \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f\u3002
MQJI017=MQJI017: \u30bb\u30ec\u30af\u30bf\u30fc\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
#
# From class MQOD
#
MQJI022=MQJI022: \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3068\u5fdc\u7b54\u30ec\u30b3\u30fc\u30c9\u306e\u6570\u304c\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002
#
# From class MQPutMessageOptions
#
MQJI023=MQJI023: \u63d0\u4f9b\u3055\u308c\u305f MQMessageTracker \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c\u30cc\u30eb\u3067\u3057\u305f\u3002
#
# From class MQMessageTracker
#
MQJI024=MQJI024: MQMessageTracker \u3067\u306e\u914d\u5217\u30b3\u30d4\u30fc\u30fb\u30a8\u30e9\u30fc\u3002
#
# From class MQQueue
#
MQJI025=MQJI025: \u30cc\u30eb MQMessage \u304c\u8aad\u307f\u53d6\u308a\u7528\u306b\u6e21\u3055\u308c\u307e\u3057\u305f\u3002
MQJI026=MQJI026: \u30cc\u30eb MQGetMessageOptions \u304c\u8aad\u307f\u53d6\u308a\u7528\u306b\u6e21\u3055\u308c\u307e\u3057\u305f\u3002
MQJI027=MQJI027: \u30ad\u30e5\u30fc\u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f\u3002
MQJI028=MQJI028: \u30cc\u30eb MQMessage \u304c\u66f8\u304d\u8fbc\u307f\u7528\u306b\u6e21\u3055\u308c\u307e\u3057\u305f\u3002
MQJI029=MQJI029: \u30cc\u30eb MQPutMessageOptions \u304c\u66f8\u304d\u8fbc\u307f\u7528\u306b\u6e21\u3055\u308c\u307e\u3057\u305f\u3002
#
# From class MQQueueManager
#
MQJI030=MQJI030: \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u914d\u5e03\u30ea\u30b9\u30c8\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u305b\u3093\u3002
#
# From class MQException
#
MQJE001b=MQJE001: \u5b8c\u4e86\u30b3\u30fc\u30c9 ''{0}''\u3001\u7406\u7531 ''{1}''\u3002
MQJE001=MQJE001: MQException \u304c\u767a\u751f\u3057\u307e\u3057\u305f: \u5b8c\u4e86\u30b3\u30fc\u30c9 ''{0}''\u3001\u7406\u7531 ''{1}''\n''{2}''\u3002
#
# Messages produced by client only classes...
#
MQJI038=MQJI038: \u30b9\u30c8\u30ea\u30f3\u30b0\u7d22\u5f15\u306e\u51e6\u7406\u4e2d\u306b\u4e88\u671f\u3057\u306a\u3044\u5185\u90e8\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
MQJE002=MQJE002: \u30bd\u30b1\u30c3\u30c8\u51fa\u529b\u30b9\u30c8\u30ea\u30fc\u30e0\u304c\u30cc\u30eb\u3067\u3057\u305f\u3002
MQJE003=MQJE003: \u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30d0\u30c3\u30d5\u30a1\u30fc\u4f1d\u9001\u4e2d\u306e\u5165\u51fa\u529b\u30a8\u30e9\u30fc\u3002
MQJE004=MQJE004: \u30bd\u30b1\u30c3\u30c8\u5165\u529b\u30b9\u30c8\u30ea\u30fc\u30e0\u304c\u30cc\u30eb\u3067\u3057\u305f\u3002
MQJE005=MQJE005: TSH \u76ee\u5370\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002  \u76ee\u5370\u306f ''{0}'' \u3067\u3057\u305f\u3002
MQJE006=MQJE006: \u914d\u5217\u306e\u30b3\u30d4\u30fc\u4e2d\u306b\u5185\u90e8\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
MQJE007=MQJE007: \u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30c7\u30fc\u30bf\u306e\u8aad\u307f\u53d6\u308a\u4e2d\u306b IO \u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
MQJE008=MQJE008: \u72b6\u6cc1\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u9001\u4fe1\u4e2d\u306b IOException \u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
MQJE009=MQJE009: API \u30d8\u30c3\u30c0\u30fc\u306e\u4f5c\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJE010=MQJE010: \u4e0d\u660e\u306a\u30db\u30b9\u30c8: ''{0}''\u3002
MQJE011=MQJE011: \u30bd\u30b1\u30c3\u30c8\u63a5\u7d9a\u8981\u6c42\u304c\u62d2\u5426\u3055\u308c\u307e\u3057\u305f\u3002
MQJE012=MQJE012: \u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30a8\u30e9\u30fc - \u30db\u30b9\u30c8 ''{0}'' \u306b\u63a5\u7d9a\u3067\u304d\u307e\u305b\u3093\u3002
MQJE013=MQJE013: \u30bd\u30b1\u30c3\u30c8\u30fb\u30b9\u30c8\u30ea\u30fc\u30e0\u306e\u30a2\u30af\u30bb\u30b9\u30fb\u30a8\u30e9\u30fc\u3002
MQJE016=MQJE016: MQ \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306f\u63a5\u7d9a\u4e2d\u306b\u5373\u6642\u306b\u30c1\u30e3\u30cd\u30eb\u3092\u30af\u30ed\u30fc\u30ba\u3057\u307e\u3057\u305f\u3002\n\u30af\u30ed\u30fc\u30ba\u306e\u7406\u7531 = ''{0}''\u3002
MQJE017=MQJE017: MQ \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u63a5\u7d9a\u4e2d\u306b\u72b6\u6cc1\u30a8\u30e9\u30fc ''{0}'' \u3092\u9001\u4fe1\u3057\u307e\u3057\u305f\u3002
MQJE018=MQJE018: \u30d7\u30ed\u30c8\u30b3\u30eb\u30fb\u30a8\u30e9\u30fc - \u4e88\u671f\u3057\u306a\u3044\u30bb\u30b0\u30e1\u30f3\u30c8\u30fb\u30bf\u30a4\u30d7\u304c\u53d7\u4fe1\u3055\u308c\u307e\u3057\u305f\u3002
MQJE019=MQJE019: \u521d\u671f\u30c7\u30fc\u30bf\u30fb\u30bb\u30b0\u30e1\u30f3\u30c8\u306e\u4f5c\u6210\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
MQJE020=MQJE020: CCSID \u304c\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306b\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJE021=MQJE021: \u30a8\u30f3\u30b3\u30fc\u30c9\u304c\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306b\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJE022=MQJE022: FAP \u30ec\u30d9\u30eb\u304c\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306b\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJE023=MQJE023: \u30d0\u30c3\u30c1\u6bce\u306e\u6700\u5927\u30e1\u30c3\u30bb\u30fc\u30b8\u6570\u3067\u6298\u885d\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJE024=MQJE024: \u30b7\u30fc\u30b1\u30f3\u30b9\u6298\u308a\u8fd4\u3057\u5024\u304c\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJE025=MQJE025: \u30c1\u30e3\u30cd\u30eb\u304c 2 \u3064\u306e\u521d\u671f\u5909\u66f4\u306e\u5f8c\u306b\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f\u3002  \u30af\u30ed\u30fc\u30ba\u306e\u7406\u7531 ''{0}''\u3002
MQJE026=MQJE026: \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u63a5\u7d9a\u4e2d\u306b\u72b6\u6cc1\u30a8\u30e9\u30fc ''{0}'' \u3092\u9001\u4fe1\u3057\u307e\u3057\u305f\u3002
MQJE027=MQJE027: \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u51fa\u53e3\u304c\u30a8\u30e9\u30fc\u30fb\u30b3\u30fc\u30c9 ''{0}'' \u3067\u63a5\u7d9a\u3092\u62d2\u5426\u3057\u307e\u3057\u305f\u3002
MQJE028=MQJE028: \u30c1\u30e3\u30cd\u30eb\u304c\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u4ea4\u63db\u4e2d\u306b\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f\u3002
MQJE029=MQJE029: \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u4e88\u671f\u3057\u306a\u3044\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30bf\u30a4\u30d7\u3092\u9001\u4fe1\u3057\u307e\u3057\u305f\u3002
MQJE030=MQJE030: \u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30d5\u30ed\u30fc\u4e2d\u306b IOException \u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
MQJE031=MQJE031: \u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u51fa\u53e3\u304c\u30c1\u30e3\u30cd\u30eb\u3092\u30af\u30ed\u30fc\u30ba\u3057\u307e\u3057\u305f\u3002
MQJE032=MQJE032: \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u51fa\u53e3\u304c\u7406\u7531\u30b3\u30fc\u30c9 ''{0}'' \u3067\u63a5\u7d9a\u3092\u62d2\u5426\u3057\u307e\u3057\u305f\u3002
MQJE033=MQJE033: \u5fc5\u8981\u306a\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30d5\u30ed\u30fc\u304c\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306b\u3088\u3063\u3066\u9001\u4fe1\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002
MQJE034=MQJE034: \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u4e88\u671f\u3057\u306a\u3044\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30bf\u30a4\u30d7\u3092\u9001\u4fe1\u3057\u307e\u3057\u305f\u3002
MQJE035=MQJE035: \u6298\u885d\u3055\u308c\u305f\u6700\u5927\u4f1d\u9001\u30b5\u30a4\u30ba\u304c\u5c0f\u3055\u3059\u304e\u307e\u3059\u3002
MQJE036=MQJE036: \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u63a5\u7d9a\u3092\u62d2\u5426\u3057\u307e\u3057\u305f\u3002
MQJE037=MQJE037: \u30ea\u30e2\u30fc\u30c8\u30fb\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u63a5\u7d9a\u3092\u30af\u30ed\u30fc\u30ba\u3057\u307e\u3057\u305f\u3002
MQJE038=MQJE038: \u4e88\u671f\u3057\u306a\u3044\u30bb\u30b0\u30e1\u30f3\u30c8\u30fb\u30bf\u30a4\u30d7 ''{0}'' \u3092\u53d7\u3051\u53d6\u308a\u307e\u3057\u305f\u3002
MQJE039=MQJE039: \u30c7\u30fc\u30bf\u30fb\u30b9\u30c8\u30ea\u30fc\u30e0\u306e\u4f5c\u6210\u4e2d\u306b IOException \u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
MQJE040=MQJE040: \u51fa\u53e3\u304c\u30c1\u30e3\u30cd\u30eb\u3092\u30af\u30ed\u30fc\u30ba\u3057\u307e\u3057\u305f\u3002
MQJE041=MQJE041: \u30d0\u30fc\u30b8\u30e7\u30f3\u756a\u53f7 ''{0}'' \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJE042=MQJE042: \u76ee\u5370 ''{0}'' \u306f\u8aa4\u3063\u3066\u3044\u307e\u3059\u3002
MQJE043=MQJE043: \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304b\u3089\u53d7\u4fe1\u3057\u305f\u30c7\u30fc\u30bf\u304c\u4e0d\u5341\u5206\u3067\u3059\u3002
MQJE044=MQJE044: MQMD \u3067\u306e\u914d\u5217\u30b3\u30d4\u30fc\u30fb\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
MQJE046=MQJE046: \u30b3\u30fc\u30c9\u30fb\u30bb\u30c3\u30c8 ''{0}'' \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJE055=MQJE055: \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u30d0\u30fc\u30b8\u30e7\u30f3 2 \u306e IBM MQ API \u69cb\u9020\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u305b\u3093\u3002
MQJE056=MQJE056: \u521d\u671f\u6298\u885d\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MQJE057=MQJE057: \u30c1\u30e3\u30cd\u30eb\u304c\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u4ea4\u63db\u4e2d\u306b\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f\u3002
MQJE058=MQJE058: \u6b63\u3057\u304f\u306a\u3044\u6570\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u307e\u305f\u306f\u5fdc\u7b54\u30ec\u30b3\u30fc\u30c9\u304c\u3042\u308a\u307e\u3057\u305f\u3002
#
# Messages used by MQManagedConnectionJ11, ManagedConnectionFactories
# and MQManagedConnectionMetaData
#
MQJI039=MQJI039: ConnectionRequestInfo \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c\u7121\u52b9\u3067\u3057\u305f\u3002
MQJI040=MQJI040: MQManagedConnection \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306f\u65e2\u306b\u7834\u68c4\u3055\u308c\u3066\u3044\u307e\u3059\u3002
MQJI041=MQJI041: \u30e1\u30bd\u30c3\u30c9 ''{0}'' \u306f IBM MQ \u30af\u30e9\u30b9 (Java(tm) \u7528) \u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJI042=MQJI042: MQManagedConnection \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306f\u518d\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002
#
# Messages from MQManagedConnectionMetaData
#
MID_ProductName=IBM MQ \u30af\u30e9\u30b9 (Java(tm) \u7528)
MID_MngCon_CmdLvl=\u30b3\u30de\u30f3\u30c9\u30fb\u30ec\u30d9\u30eb ''{0}''
#
# Messages from MQXAi
#
MID_SecManError=\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c IBM MQ XA \u30b5\u30dd\u30fc\u30c8\u7528\u306e\u30cd\u30a4\u30c6\u30a3\u30d6\u30fb\u30e1\u30bd\u30c3\u30c9\u30fb\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc\u3078\u306e\u30a2\u30af\u30bb\u30b9\u3092\u8a31\u53ef\u3057\u307e\u305b\u3093\u3067\u3057\u305f\u3002
MID_XANativeError=IBM MQ XA \u30b5\u30dd\u30fc\u30c8\u7528\u306e\u30cd\u30a4\u30c6\u30a3\u30d6\u30fb\u30e1\u30bd\u30c3\u30c9\u30fb\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc\u306e\u30ed\u30fc\u30c9\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
#
# Messages from MQXAResource
#
MID_OpenFailed=xa_open() \u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002
MID_OpFailed=XA \u64cd\u4f5c\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002errorCode \u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MID_ResourceClosed=XAResource \u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f\u3002

#
# Messages produced by com.ibm.mq.MQMsg2
#
MQJE064=MQJE064: MQMD \u69cb\u9020 ''{0}'' \u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQJE065=MQJE065: \u77db\u76fe\u3059\u308b\u5185\u90e8\u72b6\u614b\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002

# message when server doesn't support client XA
MID_Rejected_XA_Client=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u63a5\u7d9a\u306f XA \u5bfe\u5fdc\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002

#
# Messages produced via SSL options on a client connection
#
MQJE066=MQJE066: \u63d0\u4f9b\u3055\u308c\u305f ''{0}'' \u306b\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u306a\u3044\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30fb\u30bf\u30a4\u30d7\u304c\u3042\u308a\u307e\u3059\u3002
MQJE067=MQJE067: \u30d4\u30a2\u540d ''{0}'' \u304c\u8981\u6c42\u3055\u308c\u305f\u540d\u524d ''{1}'' \u3068\u4e00\u81f4\u3057\u307e\u305b\u3093\u3067\u3057\u305f\u3002
MQJE068=MQJE068: \u30b5\u30fc\u30d0\u30fc\u8a3c\u660e\u66f8\u304c\u5931\u52b9\u3057\u3066\u3044\u307e\u3059\u3002
MQJE069=MQJE069: CertStore \u306b\u63a5\u7d9a\u3067\u304d\u307e\u305b\u3093\u3002
#
# Messages for MQJava Firewall support
#
MQJE071=MQJE071: LOCAL_ADDRESS_PROPERTY \u5236\u9650\u306e\u305f\u3081\u3001\u30bd\u30b1\u30c3\u30c8\u63a5\u7d9a\u306e\u8a66\u307f\u304c\u62d2\u5426\u3055\u308c\u307e\u3057\u305f\u3002
#
# Block of messages reserved for Extended Transactional Client - XA Client .
#
MQJE080=MQJE080: \u4e0d\u5341\u5206\u306a\u30e9\u30a4\u30bb\u30f3\u30b9\u30fb\u30e6\u30cb\u30c3\u30c8\u304c\u3042\u308a\u307e\u3059 - setmqcap \u3092\u5b9f\u884c\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MQJE081=MQJE081: \u30e9\u30a4\u30bb\u30f3\u30b9\u30fb\u30e6\u30cb\u30c3\u30c8\u60c5\u5831\u304c\u5165\u3063\u3066\u3044\u308b\u30d5\u30a1\u30a4\u30eb\u304c\u8aa4\u3063\u305f\u5f62\u5f0f\u3067\u3059 - setmqcap \u3092\u5b9f\u884c\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MQJE082=MQJE082: \u30e9\u30a4\u30bb\u30f3\u30b9\u30fb\u30e6\u30cb\u30c3\u30c8\u60c5\u5831\u304c\u5165\u3063\u3066\u3044\u308b\u30d5\u30a1\u30a4\u30eb\u3092\u30ed\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f - setmqcap \u3092\u5b9f\u884c\u3057\u3066\u304f\u3060\u3055\u3044\u3002

#
# Misc exception messages
#
MQCCF_NOT_SUPPURTED=MQJI043: createConnectionFactory \u306f IBM MQ \u30af\u30e9\u30b9 (Java \u7528) \u3067\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MQINVCRF_OBJECT=MQJE083: ConnectionRequestInfo \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c\u7121\u52b9\u3067\u3059\u3002
MQRESOURCE_ERROR=MQJE084: \u30e1\u30bd\u30c3\u30c9 ''{0}'' \u306e\u30ea\u30bd\u30fc\u30b9\u30fb\u30a8\u30e9\u30fc\u3002
MQNULLPOINTER=MQJE085: ''{0}'' \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c\u30cc\u30eb\u3067\u3059\u3002
MQEOFEXCEPTION=MQJE086: \u30d5\u30a1\u30a4\u30eb\u4f8b\u5916\u306e\u7d42\u308f\u308a (''{0}'')\u3002
MQIOEXCEPTION=MQJE087: \u5165\u51fa\u529b\u4f8b\u5916 (''{0}'')\u3002
MQDECODEERROR=MQJE088: \u30c7\u30b3\u30fc\u30c9\u304c\u5931\u6557\u3057\u307e\u3057\u305f (''{0}'')\u3002
MQJE089=MQJE089: IBM MQ classes for Java \u306f\u3001IMS \u74b0\u5883\u3067\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u307e\u305b\u3093\u3002
MQJE090=MQJE090: \u5909\u66f4\u4e0d\u53ef\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc ''{0}'' \u3092\u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002
MQJE091=MQJE091: \u8b66\u544a: \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc ''{0}'' \u306f\u3001\u6b21\u306e\u4f8b\u5916\u304c\u539f\u56e0\u3067\u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f: ''{1}''\u3002 \u5fc5\u8981\u306a\u30bf\u30a4\u30d7\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u5024\u3067\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

MQJIMQPROPERTY_OVERRIDE = PropertyStore \u304b\u3089 MQQueueManager \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u6307\u5b9a\u5909\u66f4\u3057\u307e\u3059:\n {0}
MQJIMQPROPERTY_OVERRIDE.inserts = XMSC_INSERT_PROPERTY_OVERRIDE_LIST
MQJIMQPROPERTY_OVERRIDE.explanation = \u30ea\u30b9\u30c8\u3055\u308c\u3066\u3044\u308b\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306f\u3001MQQueueManager \u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u30fc\u306e\u30cf\u30c3\u30b7\u30e5\u30fb\u30c6\u30fc\u30d6\u30eb\u306b\u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9\u3055\u308c\u307e\u3057\u305f

MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED = \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u5b9a\u6570 {0} \u3092\u691c\u7d22\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f
MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED.inserts = XMSC_INSERT_INDIRECT_PROPERTY_OVERRIDE
MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED.explanation = \u9593\u63a5\u30eb\u30c3\u30af\u30a2\u30c3\u30d7\u540d\u3092\u4f7f\u7528\u3057\u3066\u63a5\u7d9a\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9\u304c\u8a66\u884c\u3055\u308c\u307e\u3057\u305f\u304c\u3001\u540d\u524d\u3092\u6b63\u3057\u304f\u89e3\u6c7a\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED.useraction = \u63a5\u7d9a\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9\u5ba3\u8a00\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044
