# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright>  
#
# Messages produced by the IBM MQ Java interface classes
# (shared by bindings and by client)
# Messages beginning with MQJI are explanations for exceptions
# Messages beginning with MQJE are errors
#
# From class MQDistributionList
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
MQJI001=MQJI001: Das Warteschlangenmanagerobjekt enthielt Nullwerte.
MQJI002=MQJI002: Keine Verbindung mit Warteschlangenmanager.
MQJI003=MQJI003: Es wurden keine Objektdatens\u00e4tze \u00fcbergeben.
MQJI006=MQJI006: Ein Objekt- oder Antwortdatensatz enthielt Nullwerte.
MQJI008=MQJI008: Eine Nachricht mit Nullwerten wurde an PUT \u00fcbergeben.
MQJI009=MQJI009: PUT-Nachrichtenoptionen mit Nullwerten wurden an PUT \u00fcbergeben.
MQJI011=MQJI011: Die Verteilerliste wurde geschlossen.
#
# From class MQGetMessageOptions
#
MQJI013=MQJI013: Versionsnummer wird nicht unterst\u00fctzt - ''{0}''.
MQJI014=MQJI014: Vom Warteschlangenmanager wurden nicht gen\u00fcgend Daten empfangen.
MQJI015=MQJI015: Fehlerhafte Strukturkennung: ''{0}''.
#
# From class MQManagedObject
#
MQJI016=MQJI016: Das Objekt wurde geschlossen.
MQJI017=MQJI017: Es wurden keine Selektoren angegeben.
#
# From class MQOD
#
MQJI022=MQJI022: Die Anzahl an Objekt- und Antwortdatens\u00e4tzen stimmen nicht \u00fcberein.
#
# From class MQPutMessageOptions
#
MQJI023=MQJI023: Es wurde ein MQMessageTracker-Objekt mit Nullwerten \u00fcbergeben.
#
# From class MQMessageTracker
#
MQJI024=MQJI024: Fehler bei Feldgruppenkopie in MQMessageTracker.
#
# From class MQQueue
#
MQJI025=MQJI025: MQMessage wurde mit Nullwerten an GET \u00fcbergeben.
MQJI026=MQJI026: MQGetMessageOptions wurde mit Nullwerten an GET \u00fcbergeben.
MQJI027=MQJI027: Die Warteschlange wurde geschlossen.
MQJI028=MQJI028: MQMessage wurde mit Nullwerten an PUT \u00fcbergeben.
MQJI029=MQJI029: MQPutMessageOptions wurde mit Nullwerten an PUT \u00fcbergeben.
#
# From class MQQueueManager
#
MQJI030=MQJI030: Der Warteschlangenmanager unterst\u00fctzt keine Verteilerlisten.
#
# From class MQException
#
MQJE001b=MQJE001: Beendigungscode ''{0}'', Ursache ''{1}''.
MQJE001=MQJE001: MQException aufgetreten: Beendigungscode ''{0}'', Ursache ''{1}''\n''{2}''.
#
# Messages produced by client only classes...
#
MQJI038=MQJI038: Bei der Verarbeitung des Zeichenfolgeindexes ist ein unerwarteter interner Fehler aufgetreten.
MQJE002=MQJE002: Der Socket-Ausgabedatenstrom enthielt Nullwerte.
MQJE003=MQJE003: Bei der \u00dcbertragung des Nachrichtenpuffers ist ein E/A-Fehler aufgetreten.
MQJE004=MQJE004: Der Socket-Eingabedatenstrom enthielt Nullwerte.
MQJE005=MQJE005: Die TSH-Strukturkennung wurde nicht gefunden.  Die Strukturkennung lautete ''{0}''.
MQJE006=MQJE006: Bei der Feldgruppenkopie ist ein interner Fehler aufgetreten.
MQJE007=MQJE007: Beim Lesen von Nachrichtendaten ist ein E/A-Fehler aufgetreten.
MQJE008=MQJE008: Beim Senden der Statusnachricht ist eine E/A-Ausnahmebedingung (IOException) aufgetreten.
MQJE009=MQJE009: Fehler beim Erstellen des API-Headers.
MQJE010=MQJE010: Unbekannter Host: ''{0}''.
MQJE011=MQJE011: Versuch zum Herstellen der Socketverbindung wurde zur\u00fcckgewiesen.
MQJE012=MQJE012: Sicherheitsfehler - Verbindung zum Host ''{0}'' kann nicht hergestellt werden.
MQJE013=MQJE013: Fehler beim Zugriff auf die Socket-Datenstr\u00f6me.
MQJE016=MQJE016: MQ-Warteschlangenmanager hat Kanal unmittelbar beim Herstellen der Verbindung geschlossen.\nUrsache = ''{0}''.
MQJE017=MQJE017: MQ-Warteschlangenmanager hat beim Herstellen der Verbindung den Statusfehler ''{0}'' gesendet.
MQJE018=MQJE018: Protokollfehler - Es wurde ein unerwarteter Segmenttyp empfangen.
MQJE019=MQJE019: Fehler beim Erstellen des Anfangsdatensegments.
MQJE020=MQJE020: Die CCS-ID wird vom Warteschlangenmanager nicht unterst\u00fctzt.
MQJE021=MQJE021: Die Verschl\u00fcsselung wird vom Warteschlangenmanager nicht unterst\u00fctzt.
MQJE022=MQJE022: Die FAP-Stufe wird vom Warteschlangenmanager nicht unterst\u00fctzt.
MQJE023=MQJE023: Fehler bei der Festlegung der maximalen Anzahl an Nachrichten pro Stapel.
MQJE024=MQJE024: Der Wert f\u00fcr den Folgenummernumbruch wird vom Warteschlangenmanager nicht unterst\u00fctzt.
MQJE025=MQJE025: Der Kanal wurde nach zwei Anfangs\u00e4nderungen geschlossen.  Ursache = ''{0}''.
MQJE026=MQJE026: Der Warteschlangenmanager hat beim Herstellen der Verbindung den Statusfehler ''{0}'' gesendet.
MQJE027=MQJE027: Der Sicherheits-Exit des Warteschlangenmanagers hat die Verbindung mit Fehlercode ''{0}'' zur\u00fcckgewiesen.
MQJE028=MQJE028: Der Kanal wurde beim Austauschen von Sicherheitsdaten geschlossen.
MQJE029=MQJE029: Vom Warteschlangenmanager wurde ein unerwarteter Nachrichtentyp gesendet.
MQJE030=MQJE030: Beim Austauschen von Sicherheitsdaten ist eine E/A-Ausnahmebedingung (IOException) aufgetreten.
MQJE031=MQJE031: Der Sicherheits-Exit hat den Kanal geschlossen.
MQJE032=MQJE032: Der Sicherheits-Exit des Warteschlangenmanagers hat die Verbindung mit Ursachencode ''{0}'' zur\u00fcckgewiesen.
MQJE033=MQJE033: Ein erforderlicher Austausch von Sicherheitsdaten wurde nicht vom Warteschlangenmanager gesendet.
MQJE034=MQJE034: Vom Warteschlangenmanager wurde ein unerwarteter Nachrichtentyp gesendet.
MQJE035=MQJE035: Die ausgehandelte maximale \u00dcbertragungsgr\u00f6\u00dfe ist zu klein.
MQJE036=MQJE036: Der Versuch zum Herstellen der Verbindung wurde vom Warteschlangenmanager zur\u00fcckgewiesen.
MQJE037=MQJE037: Die Verbindung wurde vom fernen Warteschlangenmanager geschlossen.
MQJE038=MQJE038: Es wurde ein unerwarteter Segmenttyp ''{0}'' empfangen.
MQJE039=MQJE039: Beim Erstellen des Datenstroms ist eine E/A-Ausnahmebedingung (IOException) aufgetreten.
MQJE040=MQJE040: Der Kanal wurde von einem Exit geschlossen.
MQJE041=MQJE041: Die Versionsnummer ''{0}'' wird nicht unterst\u00fctzt.
MQJE042=MQJE042: Die Strukturkennung ''{0}'' ist fehlerhaft.
MQJE043=MQJE043: Vom Warteschlangenmanager wurden nicht gen\u00fcgend Daten empfangen.
MQJE044=MQJE044: In der MQMD ist ein Fehler bei der Feldgruppenkopie aufgetreten.
MQJE046=MQJE046: Der codierte Zeichensatz ''{0}'' wird nicht unterst\u00fctzt.
MQJE055=MQJE055: Der Warteschlangenmanager unterst\u00fctzt keine IBM MQ-API-Strukturen der Version 2.
MQJE056=MQJE056: Bei der Anfangsfestlegung ist ein Fehler aufgetreten.
MQJE057=MQJE057: Der Kanal wurde beim Austauschen von Sicherheitsdaten geschlossen.
MQJE058=MQJE058: Falsche Anzahl an Objekt- oder Antwortdatens\u00e4tzen.
#
# Messages used by MQManagedConnectionJ11, ManagedConnectionFactories
# and MQManagedConnectionMetaData
#
MQJI039=MQJI039: Ung\u00fcltiges ConnectionRequestInfo-Objekt.
MQJI040=MQJI040: Das MQManagedConnection-Objekt wurde bereits gel\u00f6scht.
MQJI041=MQJI041: Die Methode ''{0}'' wird von IBM MQ Classes for Java(tm) nicht unterst\u00fctzt.
MQJI042=MQJI042: Das MQManagedConnection-Objekt kann nicht erneut verwendet werden.
#
# Messages from MQManagedConnectionMetaData
#
MID_ProductName=IBM MQ Classes for Java(tm)
MID_MngCon_CmdLvl=Befehlsebene ''{0}''
#
# Messages from MQXAi
#
MID_SecManError=Der Sicherheitsmanager verweigerte den Zugriff auf die Bibliothek mit den nativen Methoden f\u00fcr die IBM MQ-XA-Unterst\u00fctzung.
MID_XANativeError=Die Bibliothek mit den nativen Methoden f\u00fcr die IBM MQ-XA-Unterst\u00fctzung konnte nicht geladen werden.
#
# Messages from MQXAResource
#
MID_OpenFailed=xa_open() ist fehlgeschlagen.
MID_OpFailed=Eine XA-Operation ist fehlgeschlagen, siehe den zugeh\u00f6rigen Fehlercode.
MID_ResourceClosed=XAResource wurde geschlossen.

#
# Messages produced by com.ibm.mq.MQMsg2
#
MQJE064=MQJE064: Die Version der MQMD-Struktur ''{0}'' wird nicht unterst\u00fctzt.
MQJE065=MQJE065: Es wurde ein inkonsistenter interner Status festgestellt.

# message when server doesn't support client XA
MID_Rejected_XA_Client=Die Clientverbindung ist nicht XA-f\u00e4hig.

#
# Messages produced via SSL options on a client connection
#
MQJE066=MQJE066: ''{0}'' weist einen nicht unterst\u00fctzten Objekttyp auf.
MQJE067=MQJE067: Der Peer-Name ''{0}'' stimmte nicht mit dem angeforderten Namen ''{1}'' \u00fcberein.
MQJE068=MQJE068: Das Serverzertifikat wurde widerrufen.
MQJE069=MQJE069: Verbindung zu CertStore kann nicht hergestellt werden.
#
# Messages for MQJava Firewall support
#
MQJE071=MQJE071: Der Versuch, eine Socketverbindung herzustellen, wurde aufgrund von Einschr\u00e4nkungen bei LOCAL_ADDRESS_PROPERTY verweigert.
#
# Block of messages reserved for Extended Transactional Client - XA Client .
#
MQJE080=MQJE080: Nicht gen\u00fcgend Lizenzeinheiten - Befehl setmqcap ausf\u00fchren.
MQJE081=MQJE081: Die Datei mit Informationen zur Lizenzeinheit liegt im falschen Format vor - Befehl setmqcap ausf\u00fchren.
MQJE082=MQJE082: Die Datei mit Informationen zur Lizenzeinheit konnte nicht gefunden werden - Befehl setmqcap ausf\u00fchren.

#
# Misc exception messages
#
MQCCF_NOT_SUPPURTED=MQJI043: createConnectionFactory wird von IBM MQ Classes for Java nicht unterst\u00fctzt.
MQINVCRF_OBJECT=MQJE083: Ung\u00fcltiges ConnectionRequestInfo-Objekt.
MQRESOURCE_ERROR=MQJE084: Ressourcenfehler in Methode ''{0}''.
MQNULLPOINTER=MQJE085: Das Objekt ''{0}'' enth\u00e4lt Nullwerte.
MQEOFEXCEPTION=MQJE086: Ausnahmebedingung durch Dateiende (''{0}'').
MQIOEXCEPTION=MQJE087: E/A-Ausnahmebedingung (''{0}'').
MQDECODEERROR=MQJE088: Decodierung ist fehlgeschlagen (''{0}'').
MQJE089=MQJE089: IBM MQ Classes for Java wird in einer IMS-Umgebung nicht unterst\u00fctzt.
MQJE090=MQJE090: Es wurde versucht, die unver\u00e4nderbare Eigenschaft ''{0}'' zu \u00fcberschreiben.
MQJE091=MQJE091: Warnung: Die Eigenschaft ''{0}'' wurde aufgrund folgender Ausnahmebedingung nicht \u00fcberschrieben: ''{1}''. Pr\u00fcfen Sie, ob der Eigenschaftswert den erwarteten Typ aufweist.

MQJIMQPROPERTY_OVERRIDE = MQQueueManager-Eigenschaften aus PropertyStore werden \u00fcberschreiben:\n {0}
MQJIMQPROPERTY_OVERRIDE.inserts = XMSC_INSERT_PROPERTY_OVERRIDE_LIST
MQJIMQPROPERTY_OVERRIDE.explanation = Die aufgef\u00fchrten Eigenschaften wurden in der Hashtabelle des MQQueueManager-Konstruktors \u00fcberschrieben

MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED = Konstante {0} f\u00fcr Eigenschaften konnte nicht gesucht werden
MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED.inserts = XMSC_INSERT_INDIRECT_PROPERTY_OVERRIDE
MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED.explanation = Es wurde versucht, eine Verbindungseigenschaft mithilfe eines indirekten Suchnamens zu \u00fcberschreiben, aber der Name konnte nicht korrekt aufgel\u00f6st werden.
MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED.useraction = \u00dcberpr\u00fcfen Sie die Deklarationen zum \u00dcberschreiben von Verbindungseigenschaften
