# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright>  
#
# Messages produced by the IBM MQ Java interface classes
# (shared by bindings and by client)
# Messages beginning with MQJI are explanations for exceptions
# Messages beginning with MQJE are errors
#
# From class MQDistributionList
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
MQJI001=MQJI001: Obiekt mened\u017cera kolejek mia\u0142 warto\u015b\u0107 NULL.
MQJI002=MQJI002: brak po\u0142\u0105czenia z mened\u017cerem kolejek.
MQJI003=MQJI003: Nie podano rekord\u00f3w obiektu.
MQJI006=MQJI006: warto\u015b\u0107 obiektu lub rekordu odpowiedzi to zero.
MQJI008=MQJI008: Komunikat o warto\u015bci NULL zosta\u0142 przekazany w celu wykonania operacji umieszczania (put).
MQJI009=MQJI009: Opcje umieszczania komunikatu o warto\u015bci NULL zosta\u0142y przekazane w celu wykonania operacji umieszczania (put).
MQJI011=MQJI011: lista dystrybucyjna zosta\u0142a zamkni\u0119ta.
#
# From class MQGetMessageOptions
#
MQJI013=MQJI013: Nieobs\u0142ugiwany numer wersji - {0}.
MQJI014=MQJI014: z mened\u017cera kolejek pobrano niepe\u0142ne dane.
MQJI015=MQJI015: B\u0142\u0119dny wyr\u00f3\u017cnik: {0}.
#
# From class MQManagedObject
#
MQJI016=MQJI016: Obiekt zosta\u0142 zamkni\u0119ty.
MQJI017=MQJI017: Nie okre\u015blono \u017cadnego selektora.
#
# From class MQOD
#
MQJI022=MQJI022: Liczba rekord\u00f3w obiektu nie jest zgodna z liczb\u0105 rekord\u00f3w odpowiedzi.
#
# From class MQPutMessageOptions
#
MQJI023=MQJI023: Podany obiekt MQMessageTracker mia\u0142 warto\u015b\u0107 NULL.
#
# From class MQMessageTracker
#
MQJI024=MQJI024: B\u0142\u0105d kopii tablicy w obiekcie MQMessageTracker.
#
# From class MQQueue
#
MQJI025=MQJI025: Obiekt MQMessage o warto\u015bci NULL zosta\u0142 przekazany w celu wykonania operacji pobierania (get).
MQJI026=MQJI026: Obiekt MQGetMessageOptions o warto\u015bci NULL zosta\u0142 przekazany w celu wykonania operacji pobierania (get).
MQJI027=MQJI027: Kolejka zosta\u0142a zamkni\u0119ta.
MQJI028=MQJI028: Obiekt MQMessage o warto\u015bci NULL zosta\u0142 przekazany w celu wykonania operacji umieszczania (put).
MQJI029=MQJI029: Obiekt MQPutMessageOptions o warto\u015bci NULL zosta\u0142 przekazany w celu wykonania operacji umieszczania (put).
#
# From class MQQueueManager
#
MQJI030=MQJI030: mened\u017cer kolejek nie obs\u0142uguje list dystrybucyjnych.
#
# From class MQException
#
MQJE001b=MQJE001: Kod zako\u0144czenia: {0}. Przyczyna: {1}.
MQJE001=MQJE001: Wyst\u0105pi\u0142 wyj\u0105tek MQException. Kod zako\u0144czenia: {0}. Przyczyna: {1}\n{2}.
#
# Messages produced by client only classes...
#
MQJI038=MQJI038: Podczas przetwarzania indeksu \u0142a\u0144cucha wyst\u0105pi\u0142 nieoczekiwany b\u0142\u0105d wewn\u0119trzny.
MQJE002=MQJE002: Strumie\u0144 wyj\u015bciowy gniazda mia\u0142 warto\u015b\u0107 NULL.
MQJE003=MQJE003: Podczas przesy\u0142ania buforu komunikat\u00f3w wyst\u0105pi\u0142 b\u0142\u0105d we/wy.
MQJE004=MQJE004: Strumie\u0144 wej\u015bciowy gniazda mia\u0142 warto\u015b\u0107 NULL.
MQJE005=MQJE005: Nie znaleziono wyr\u00f3\u017cnika TSH.  Wyr\u00f3\u017cnik: {0}.
MQJE006=MQJE006: Podczas kopiowania tablicy wyst\u0105pi\u0142 b\u0142\u0105d wewn\u0119trzny.
MQJE007=MQJE007: Podczas odczytywania danych komunikatu wyst\u0105pi\u0142 b\u0142\u0105d we/wy.
MQJE008=MQJE008: Podczas wysy\u0142ania komunikatu o statusie wyst\u0105pi\u0142 wyj\u0105tek IOException.
MQJE009=MQJE009: Nie powiod\u0142o si\u0119 budowanie nag\u0142\u00f3wka interfejsu API.
MQJE010=MQJE010: Nieznany host: {0}.
MQJE011=MQJE011: Pr\u00f3ba po\u0142\u0105czenia przy u\u017cyciu gniazda zosta\u0142a odrzucona.
MQJE012=MQJE012: B\u0142\u0105d zabezpiecze\u0144 - nie mo\u017cna nawi\u0105za\u0107 po\u0142\u0105czenia z hostem {0}.
MQJE013=MQJE013: B\u0142\u0105d podczas uzyskiwania dost\u0119pu do strumieni gniazda.
MQJE016=MQJE016: Kana\u0142 zosta\u0142 natychmiast zamkni\u0119ty przez mened\u017cer kolejek MQ podczas po\u0142\u0105czenia.\nPrzyczyna zamkni\u0119cia = {0}.
MQJE017=MQJE017: Mened\u017cer kolejek MQ wys\u0142a\u0142 b\u0142\u0105d statusu {0} podczas po\u0142\u0105czenia.
MQJE018=MQJE018: B\u0142\u0105d protoko\u0142u - odebrano nieoczekiwany typ segmentu.
MQJE019=MQJE019: Wyst\u0105pi\u0142 b\u0142\u0105d podczas tworzenia segmentu danych pocz\u0105tkowych.
MQJE020=MQJE020: Identyfikator CCSID nie jest obs\u0142ugiwany przez mened\u017cer kolejek.
MQJE021=MQJE021: Kodowanie nie jest obs\u0142ugiwane przez mened\u017cer kolejek.
MQJE022=MQJE022: Poziom FAP nie jest obs\u0142ugiwany przez mened\u017cer kolejek.
MQJE023=MQJE023: Nie powiod\u0142o si\u0119 negocjowanie maksymalnej liczby komunikat\u00f3w na zadanie wsadowe.
MQJE024=MQJE024: Warto\u015b\u0107 resetowania numer\u00f3w kolejnych nie jest obs\u0142ugiwana przez mened\u017cer kolejek.
MQJE025=MQJE025: Kana\u0142 zosta\u0142 zamkni\u0119ty po dw\u00f3ch pocz\u0105tkowych zmianach.  Przyczyna zamkni\u0119cia: {0}.
MQJE026=MQJE026: Mened\u017cer kolejek wys\u0142a\u0142 b\u0142\u0105d statusu {0} podczas po\u0142\u0105czenia.
MQJE027=MQJE027: Po\u0142\u0105czenie zosta\u0142o odrzucone przez wyj\u015bcie zabezpiecze\u0144 mened\u017cera kolejek. Kod b\u0142\u0119du: {0}.
MQJE028=MQJE028: Kana\u0142 zosta\u0142 zamkni\u0119ty podczas operacji wymiany zabezpiecze\u0144.
MQJE029=MQJE029: Mened\u017cer kolejek wys\u0142a\u0142 nieoczekiwany typ komunikatu.
MQJE030=MQJE030: Podczas przep\u0142yw\u00f3w zabezpiecze\u0144 wyst\u0105pi\u0142 wyj\u0105tek IOException.
MQJE031=MQJE031: Kana\u0142 zosta\u0142 zamkni\u0119ty przez wyj\u015bcie zabezpiecze\u0144.
MQJE032=MQJE032: Po\u0142\u0105czenie zosta\u0142o odrzucone przez wyj\u015bcie zabezpiecze\u0144 mened\u017cera kolejek. Kod przyczyny: {0}.
MQJE033=MQJE033: Wymagany przep\u0142yw zabezpiecze\u0144 nie zosta\u0142 wys\u0142any przez mened\u017cer kolejek.
MQJE034=MQJE034: Mened\u017cer kolejek wys\u0142a\u0142 nieoczekiwany typ komunikatu.
MQJE035=MQJE035: Negocjowana maksymalna wielko\u015b\u0107 transmisji jest zbyt ma\u0142a.
MQJE036=MQJE036: Mened\u017cer kolejek odrzuci\u0142 pr\u00f3b\u0119 po\u0142\u0105czenia.
MQJE037=MQJE037: Zdalny mened\u017cer kolejek zamkn\u0105\u0142 po\u0142\u0105czenie.
MQJE038=MQJE038: Odebrano nieoczekiwany typ segmentu: {0}.
MQJE039=MQJE039: Podczas tworzenia strumienia danych wyst\u0105pi\u0142 wyj\u0105tek IOException.
MQJE040=MQJE040: Kana\u0142 zosta\u0142 zamkni\u0119ty przez wyj\u015bcie.
MQJE041=MQJE041: Numer wersji {0} nie jest obs\u0142ugiwany.
MQJE042=MQJE042: Wyr\u00f3\u017cnik {0} jest b\u0142\u0119dny.
MQJE043=MQJE043: Ilo\u015b\u0107 danych odebranych z mened\u017cera kolejek jest niewystarczaj\u0105ca.
MQJE044=MQJE044: W strukturze MQMD wyst\u0105pi\u0142 b\u0142\u0105d tablicy.
MQJE046=MQJE046: Zestaw kodowy {0} nie jest obs\u0142ugiwany.
MQJE055=MQJE055: Mened\u017cer kolejek nie obs\u0142uguje wersji 2 struktur interfejsu API produktu IBM MQ.
MQJE056=MQJE056: Wyst\u0105pi\u0142o niepowodzenie wst\u0119pnej negocjacji.
MQJE057=MQJE057: Kana\u0142 zosta\u0142 zamkni\u0119ty podczas operacji wymiany zabezpiecze\u0144.
MQJE058=MQJE058: Wyst\u0105pi\u0142a niepoprawna liczba rekord\u00f3w obiektu lub odpowiedzi.
#
# Messages used by MQManagedConnectionJ11, ManagedConnectionFactories
# and MQManagedConnectionMetaData
#
MQJI039=MQJI039: Obiekt ConnectionRequestInfo by\u0142 niepoprawny.
MQJI040=MQJI040: Obiekt MQManagedConnection zosta\u0142 ju\u017c zniszczony.
MQJI041=MQJI041: Metoda {0} nie jest obs\u0142ugiwana przez produkt IBM MQ classes for Java(tm).
MQJI042=MQJI042: Obiekt MQManagedConnection nie jest obiektem wielokrotnego u\u017cycia.
#
# Messages from MQManagedConnectionMetaData
#
MID_ProductName=IBM MQ classes for Java(tm)
MID_MngCon_CmdLvl=Poziom komend: {0}
#
# Messages from MQXAi
#
MID_SecManError=Mened\u017cer zabezpiecze\u0144 uniemo\u017cliwi\u0142 dost\u0119p do biblioteki metod rodzimych w celu obs\u0142ugi interfejsu XA produktu IBM MQ.
MID_XANativeError=Nie powiod\u0142o si\u0119 za\u0142adowanie biblioteki metod rodzimych w celu obs\u0142ugi interfejsu XA produktu IBM MQ.
#
# Messages from MQXAResource
#
MID_OpenFailed=Wykonanie funkcji xa_open() nie powiod\u0142o si\u0119.
MID_OpFailed=Wykonanie operacji XA nie powiod\u0142o si\u0119. Zapoznaj si\u0119 z kodem b\u0142\u0119du (errorCode).
MID_ResourceClosed=Obiekt XAResource jest zamkni\u0119ty.

#
# Messages produced by com.ibm.mq.MQMsg2
#
MQJE064=MQJE064: Wersja struktury MQMD {0} nie jest obs\u0142ugiwana.
MQJE065=MQJE065: Wykryto niesp\u00f3jny stan wewn\u0119trzny.

# message when server doesn't support client XA
MID_Rejected_XA_Client=Po\u0142\u0105czenie klienckie nie ma w\u0142\u0105czonej obs\u0142ugi interfejsu XA.

#
# Messages produced via SSL options on a client connection
#
MQJE066=MQJE066: Udost\u0119pniony obiekt {0} ma nieobs\u0142ugiwany typ.
MQJE067=MQJE067: Nazwa w\u0119z\u0142a sieci {0} nie by\u0142a zgodna z \u017c\u0105dan\u0105 nazw\u0105 {1}.
MQJE068=MQJE068: Certyfikat serwera zosta\u0142 uniewa\u017cniony.
MQJE069=MQJE069: Nie mo\u017cna uzyska\u0107 po\u0142\u0105czenia z baz\u0105 certyfikat\u00f3w.
#
# Messages for MQJava Firewall support
#
MQJE071=MQJE071: Pr\u00f3ba po\u0142\u0105czenia przy u\u017cyciu gniazda zosta\u0142a odrzucona z powodu ogranicze\u0144 w\u0142a\u015bciwo\u015bci LOCAL_ADDRESS_PROPERTY.
#
# Block of messages reserved for Extended Transactional Client - XA Client .
#
MQJE080=MQJE080: Liczba jednostek licencyjnych jest niewystarczaj\u0105ca - uruchom komend\u0119 setmqcap.
MQJE081=MQJE081: Plik zawieraj\u0105cy informacje na temat jednostek licencyjnych ma z\u0142y format - uruchom komend\u0119 setmqcap.
MQJE082=MQJE082: Nie mo\u017cna znale\u017a\u0107 pliku zawieraj\u0105cego informacje na temat jednostek licencyjnych - uruchom komend\u0119 setmqcap.

#
# Misc exception messages
#
MQCCF_NOT_SUPPURTED=MQJI043: Obiekt createConnectionFactory nie jest obs\u0142ugiwany przez produkt IBM MQ classes for Java.
MQINVCRF_OBJECT=MQJE083: Niepoprawny obiekt ConnectionRequestInfo.
MQRESOURCE_ERROR=MQJE084: B\u0142\u0105d zasobu w metodzie {0}.
MQNULLPOINTER=MQJE085: Obiekt {0} ma warto\u015b\u0107 NULL.
MQEOFEXCEPTION=MQJE086: Wyj\u0105tek wyst\u0105pienia znaku ko\u0144ca pliku ({0}).
MQIOEXCEPTION=MQJE087: Wyj\u0105tek we/wy ({0}).
MQDECODEERROR=MQJE088: Dekodowanie nie powiod\u0142o si\u0119 ({0}).
MQJE089=MQJE089: Klasy produktu IBM MQ dla j\u0119zyka Java nie s\u0105 obs\u0142ugiwane w \u015brodowisku IMS.
MQJE090=MQJE090: Pr\u00f3ba nadpisania niezmiennej w\u0142a\u015bciwo\u015bci {0}.
MQJE091=MQJE091: Ostrze\u017cenie - w\u0142a\u015bciwo\u015b\u0107 {0} nie zosta\u0142a nadpisana z powodu wyj\u0105tku {1}. Sprawd\u017a, czy warto\u015b\u0107 w\u0142a\u015bciwo\u015bci ma oczekiwany typ.

MQJIMQPROPERTY_OVERRIDE = Nadpisywanie w\u0142a\u015bciwo\u015bci MQQueueManager ze sk\u0142adnicy PropertyStore:\n {0}
MQJIMQPROPERTY_OVERRIDE.inserts = XMSC_INSERT_PROPERTY_OVERRIDE_LIST
MQJIMQPROPERTY_OVERRIDE.explanation = Wymienione w\u0142a\u015bciwo\u015bci zosta\u0142y nadpisane w tabeli mieszaj\u0105cej konstruktora MQQueueManager

MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED = Nie mo\u017cna wyszuka\u0107 sta\u0142ej w\u0142a\u015bciwo\u015bci {0}
MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED.inserts = XMSC_INSERT_INDIRECT_PROPERTY_OVERRIDE
MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED.explanation = Pr\u00f3bowano nadpisa\u0107 w\u0142a\u015bciwo\u015b\u0107 po\u0142\u0105czenia, u\u017cywaj\u0105c nazwy wyszukiwania po\u015bredniego, ale nie mo\u017cna by\u0142o poprawnie rozpozna\u0107 nazwy.
MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED.useraction = Sprawd\u017a deklaracje nadpisania w\u0142a\u015bciwo\u015bci po\u0142\u0105czenia
