# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright>  
#
# Messages produced by the IBM MQ Java interface classes
# (shared by bindings and by client)
# Messages beginning with MQJI are explanations for exceptions
# Messages beginning with MQJE are errors
#
# From class MQDistributionList
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
MQJI001=MQJI001: A sorkezel\u0151 objektum null volt.
MQJI002=MQJI002: Nincs sorkezel\u0151h\u00f6z csatlakozva.
MQJI003=MQJI003: Nem ker\u00fcltek megad\u00e1sra objektumrekordok.
MQJI006=MQJI006: Egy objektum- vagy v\u00e1laszrekord null volt.
MQJI008=MQJI008: Null \u00fczenet ker\u00fclt \u00e1tad\u00e1sra a put m\u0171veletnek.
MQJI009=MQJI009: Null \u00fczenetberak\u00e1si be\u00e1ll\u00edt\u00e1sok ker\u00fcltek \u00e1tad\u00e1sra a put m\u0171veletnek.
MQJI011=MQJI011: A terjeszt\u00e9si lista bez\u00e1r\u00e1sra ker\u00fclt.
#
# From class MQGetMessageOptions
#
MQJI013=MQJI013: Nem t\u00e1mogatott verzi\u00f3sz\u00e1m - ''{0}''.
MQJI014=MQJI014: Nem \u00e9rkezett elegend\u0151 adat a sorkezel\u0151t\u0151l.
MQJI015=MQJI015: Hib\u00e1s figyelemfelkelt\u0151: ''{0}''.
#
# From class MQManagedObject
#
MQJI016=MQJI016: Az objektum bez\u00e1r\u00e1sra ker\u00fclt.
MQJI017=MQJI017: Nem lettek megadva kiv\u00e1laszt\u00f3k.
#
# From class MQOD
#
MQJI022=MQJI022: Az objektum- \u00e9s v\u00e1laszrekordok sz\u00e1ma nem egyezik.
#
# From class MQPutMessageOptions
#
MQJI023=MQJI023: A megadott MQMessageTracker objektum null volt.
#
# From class MQMessageTracker
#
MQJI024=MQJI024: T\u00f6mb p\u00e9ld\u00e1ny hiba itt: MQMessageTracker.
#
# From class MQQueue
#
MQJI025=MQJI025: Null MQMessage ker\u00fclt \u00e1tad\u00e1sra a get m\u0171veletnek.
MQJI026=MQJI026: Null MQGetMessageOptions ker\u00fclt \u00e1tad\u00e1sra a get m\u0171veletnek.
MQJI027=MQJI027: A sor bez\u00e1r\u00e1sra ker\u00fclt.
MQJI028=MQJI028: Null MQMessage ker\u00fclt \u00e1tad\u00e1sra a put m\u0171veletnek.
MQJI029=MQJI029: Null MQPutMessageOptions ker\u00fclt \u00e1tad\u00e1sra a put m\u0171veletnek.
#
# From class MQQueueManager
#
MQJI030=MQJI030: A sorkezel\u0151 nem t\u00e1mogatja a terjeszt\u00e9si list\u00e1kat.
#
# From class MQException
#
MQJE001b=MQJE001: Befejez\u00e9si k\u00f3d: ''{0}'', Ok: ''{1}''.
MQJE001=MQJE001: MQException t\u00f6rt\u00e9nt: Befejez\u00e9si k\u00f3d: ''{0}'', Ok: ''{1}''\n ''{2}''.
#
# Messages produced by client only classes...
#
MQJI038=MQJI038: V\u00e1ratlan bels\u0151 hiba t\u00f6rt\u00e9nt a karaktersorozat index feldolgoz\u00e1sa k\u00f6zben.
MQJE002=MQJE002: A szoftvercsatorna kimeneti adatfolyam null volt.
MQJE003=MQJE003: I/O hiba t\u00f6rt\u00e9nt az \u00fczenetpuffer \u00e1tvitele k\u00f6zben.
MQJE004=MQJE004: A szoftvercsatorna bemeneti adatfolyam null volt.
MQJE005=MQJE005: A TSH figyelemfelkelt\u0151 nem tal\u00e1lhat\u00f3.  A figyelemfelkelt\u0151: ''{0}''.
MQJE006=MQJE006: Bels\u0151 hiba t\u00f6rt\u00e9nt a t\u00f6mbm\u00e1sol\u00e1s k\u00f6zben.
MQJE007=MQJE007: I/O hiba t\u00f6rt\u00e9nt az \u00fczenetadatok beolvas\u00e1sa k\u00f6zben.
MQJE008=MQJE008: IOException kiv\u00e9tel t\u00f6rt\u00e9nt az \u00e1llapot\u00fczenet k\u00fcld\u00e9se k\u00f6zben.
MQJE009=MQJE009: Az API fejl\u00e9c \u00f6ssze\u00e1ll\u00edt\u00e1sa meghi\u00fasult.
MQJE010=MQJE010: Ismeretlen hoszt: ''{0}''.
MQJE011=MQJE011: Szoftvercsatorna csatlakoz\u00e1si k\u00eds\u00e9rlet visszautas\u00edtva.
MQJE012=MQJE012: Biztons\u00e1gi hiba - Nem lehet csatlakozni a hoszthoz: ''{0}''.
MQJE013=MQJE013: Hiba a szoftvercsatorna adatfolyamok el\u00e9r\u00e9se sor\u00e1n.
MQJE016=MQJE016: Az MQ sorkezel\u0151 azonnal bez\u00e1rta a csatorn\u00e1t a csatlakoz\u00e1s sor\u00e1n.\nA bez\u00e1r\u00e1s oka = ''{0}''.
MQJE017=MQJE017: Az MQ sorkezel\u0151 a(z) ''{0}'' \u00e1llapothib\u00e1t k\u00fcldte a csatlakoz\u00e1s sor\u00e1n.
MQJE018=MQJE018: Protokollhiba - v\u00e1ratlan szegmenst\u00edpus \u00e9rkezett.
MQJE019=MQJE019: Hiba t\u00f6rt\u00e9nt a kiindul\u00f3 adatszegmens l\u00e9trehoz\u00e1sakor.
MQJE020=MQJE020: A CCSID nem t\u00e1mogatott a sorkezel\u0151 \u00e1ltal.
MQJE021=MQJE021: A k\u00f3dol\u00e1s nem t\u00e1mogatott a sorkezel\u0151 \u00e1ltal.
MQJE022=MQJE022: Az FAP szint nem t\u00e1mogatott a sorkezel\u0151 \u00e1ltal.
MQJE023=MQJE023: Az egyeztet\u00e9s meghi\u00fasult a k\u00f6tegenk\u00e9nti maxim\u00e1lis sz\u00e1m\u00fa \u00fczeneten.
MQJE024=MQJE024: A szekvenciat\u00f6rdel\u00e9si \u00e9rt\u00e9k nem t\u00e1mogatott a sorkezel\u0151 \u00e1ltal.
MQJE025=MQJE025: A csatorna k\u00e9t kezdeti v\u00e1lt\u00e1s ut\u00e1n bez\u00e1rult.  A bez\u00e1r\u00e1s oka: ''{0}''.
MQJE026=MQJE026: A sorkezel\u0151 a(z) ''{0}'' \u00e1llapothib\u00e1t k\u00fcldte a csatlakoz\u00e1s sor\u00e1n.
MQJE027=MQJE027: A sorkezel\u0151 biztons\u00e1gi kil\u00e9p\u00e9si program a(z) ''{0}'' hibak\u00f3ddal visszautas\u00edtotta a csatlakoz\u00e1st.
MQJE028=MQJE028: A csatorna bez\u00e1rult a biztons\u00e1gi adatcser\u00e9k sor\u00e1n.
MQJE029=MQJE029: A sorkezel\u0151 v\u00e1ratlan \u00fczenett\u00edpust k\u00fcld\u00f6tt.
MQJE030=MQJE030: IOException t\u00f6rt\u00e9nt a biztons\u00e1gi folyamok sor\u00e1n.
MQJE031=MQJE031: A biztons\u00e1gi kil\u00e9p\u00e9si program bez\u00e1rta a csatorn\u00e1t.
MQJE032=MQJE032: A sorkezel\u0151 biztons\u00e1gi kil\u00e9p\u00e9si program a(z) ''{0}'' okk\u00f3ddal visszautas\u00edtotta a csatlakoz\u00e1st.
MQJE033=MQJE033: A sorkezel\u0151 nem k\u00fcld\u00f6tt el egy sz\u00fcks\u00e9ges biztons\u00e1gi folyamot.
MQJE034=MQJE034: A sorkezel\u0151 v\u00e1ratlan \u00fczenett\u00edpust k\u00fcld\u00f6tt.
MQJE035=MQJE035: Az egyeztetett maxim\u00e1lis \u00e1tviteli m\u00e9ret t\u00fal kicsi.
MQJE036=MQJE036: A sorkezel\u0151 visszautas\u00edtotta a csatlakoz\u00e1si k\u00eds\u00e9rletet.
MQJE037=MQJE037: A t\u00e1voli sorkezel\u0151 bez\u00e1rta a kapcsolatot.
MQJE038=MQJE038: A(z) ''{0}'' v\u00e1ratlan szegmenst\u00edpus \u00e9rkezett.
MQJE039=MQJE039: IOException t\u00f6rt\u00e9nt az adatfolyam \u00f6ssze\u00e1ll\u00edt\u00e1sa sor\u00e1n.
MQJE040=MQJE040: A csatorna bez\u00e1r\u00e1sra ker\u00fclt egy kil\u00e9p\u00e9si program \u00e1ltal.
MQJE041=MQJE041: A(z) ''{0}'' verzi\u00f3sz\u00e1m nem t\u00e1mogatott.
MQJE042=MQJE042: A(z) ''{0}'' figyelemfelkelt\u0151 hib\u00e1s.
MQJE043=MQJE043: Nem \u00e9rkezett elegend\u0151 adat a sorkezel\u0151t\u0151l.
MQJE044=MQJE044: T\u00f6mb m\u00e1sol\u00e1si hiba t\u00f6rt\u00e9nt az MQMD-ben.
MQJE046=MQJE046: A(z) ''{0}'' k\u00f3dk\u00e9szlet nem t\u00e1mogatott.
MQJE055=MQJE055: A sorkezel\u0151 nem t\u00e1mogatja a 2-es verzi\u00f3j\u00fa IBM MQ API strukt\u00far\u00e1kat.
MQJE056=MQJE056: Kezdeti egyeztet\u00e9si hiba t\u00f6rt\u00e9nt.
MQJE057=MQJE057: A csatorna bez\u00e1r\u00e1sra ker\u00fclt a biztons\u00e1gi adatcser\u00e9k sor\u00e1n.
MQJE058=MQJE058: Helytelen sz\u00e1m\u00fa objektum vagy v\u00e1laszrekord volt.
#
# Messages used by MQManagedConnectionJ11, ManagedConnectionFactories
# and MQManagedConnectionMetaData
#
MQJI039=MQJI039: A ConnectionRequestInfo objektum \u00e9rv\u00e9nytelen volt.
MQJI040=MQJI040: Az MQManagedConnection objektum m\u00e1r meg van semmis\u00edtve.
MQJI041=MQJI041: A(z) ''{0}'' met\u00f3dust az IBM MQ Java(tm) oszt\u00e1lyok nem t\u00e1mogatj\u00e1k.
MQJI042=MQJI042: Az MQManagedConnection objektum nem haszn\u00e1lhat\u00f3 fel \u00fajra.
#
# Messages from MQManagedConnectionMetaData
#
MID_ProductName=IBM MQ Java(tm) oszt\u00e1lyok
MID_MngCon_CmdLvl=Parancsszint: ''{0}''
#
# Messages from MQXAi
#
MID_SecManError=A biztons\u00e1gkezel\u0151 megakad\u00e1lyozta a be\u00e9p\u00edtett met\u00f3dusk\u00f6nyvt\u00e1r el\u00e9r\u00e9s\u00e9t az IBM MQ XA t\u00e1mogat\u00e1shoz.
MID_XANativeError=Nem siker\u00fclt bet\u00f6lteni a be\u00e9p\u00edtett met\u00f3dusk\u00f6nyvt\u00e1rat az IBM MQ XA t\u00e1mogat\u00e1shoz.
#
# Messages from MQXAResource
#
MID_OpenFailed=Az xa_open() meghi\u00fasult.
MID_OpFailed=Egy XA m\u0171velet meghi\u00fasult, n\u00e9zze meg a hibak\u00f3dot.
MID_ResourceClosed=Az XAResource bez\u00e1rul.

#
# Messages produced by com.ibm.mq.MQMsg2
#
MQJE064=MQJE064: A(z) ''{0}'' MQMD adatszerkezet-v\u00e1ltozat nem t\u00e1mogatott.
MQJE065=MQJE065: A rendszer k\u00f6vetkezetlen bels\u0151 \u00e1llapotot \u00e9szlelt.

# message when server doesn't support client XA
MID_Rejected_XA_Client=Az \u00fcgyf\u00e9lkapcsolat nem rendelkezik XA t\u00e1mogat\u00e1ssal.

#
# Messages produced via SSL options on a client connection
#
MQJE066=MQJE066: A megadott ''{0}'' nem t\u00e1mogatott objektumt\u00edpussal rendelkezik.
MQJE067=MQJE067: A(z) ''{0}'' partnern\u00e9v nem felelt meg a(z) ''{1}'' k\u00e9rt n\u00e9vnek.
MQJE068=MQJE068: A kiszolg\u00e1l\u00f3tan\u00fas\u00edtv\u00e1ny visszavon\u00e1sra ker\u00fclt.
MQJE069=MQJE069: Nem lehet kapcsolatba l\u00e9pni a tan\u00fas\u00edtv\u00e1nyt\u00e1rol\u00f3val.
#
# Messages for MQJava Firewall support
#
MQJE071=MQJE071: Szoftvercsatorna csatlakoz\u00e1si k\u00eds\u00e9rlet LOCAL_ADDRESS_PROPERTY megszor\u00edt\u00e1sok miatt visszautas\u00edtva.
#
# Block of messages reserved for Extended Transactional Client - XA Client .
#
MQJE080=MQJE080: Nincs elegend\u0151 licencegys\u00e9g - futtassa a setmqcap parancsot.
MQJE081=MQJE081: A licencegys\u00e9g-inform\u00e1ci\u00f3kat tartalmaz\u00f3 f\u00e1jl rossz form\u00e1tum\u00fa - futtassa a setmqcap parancsot.
MQJE082=MQJE082: A licencegys\u00e9g-inform\u00e1ci\u00f3kat tartalmaz\u00f3 f\u00e1jl nem tal\u00e1lhat\u00f3 - futtassa a setmqcap parancsot.

#
# Misc exception messages
#
MQCCF_NOT_SUPPURTED=MQJI043: A createConnectionFactory nem t\u00e1mogatott az IBM MQ Java oszt\u00e1lyok \u00e1ltal.
MQINVCRF_OBJECT=MQJE083: \u00c9rv\u00e9nytelen ConnectionRequestInfo objektum.
MQRESOURCE_ERROR=MQJE084: Er\u0151forr\u00e1shiba a(z) ''{0}'' met\u00f3dusban.
MQNULLPOINTER=MQJE085: A(z) ''{0}'' objektum null.
MQEOFEXCEPTION=MQJE086: F\u00e1jl v\u00e9ge kiv\u00e9tel (''{0}'').
MQIOEXCEPTION=MQJE087: I/O kiv\u00e9tel (''{0}'').
MQDECODEERROR=MQJE088: A visszafejt\u00e9s meghi\u00fasult (''{0}'').
MQJE089=MQJE089: Az IBM MQ Java oszt\u00e1lyok nem t\u00e1mogatottak IMS k\u00f6rnyezetben.
MQJE090=MQJE090: A(z) ''{0}'' nem m\u00f3dos\u00edthat\u00f3 tulajdons\u00e1g fel\u00fcl\u00edr\u00e1s\u00e1ra t\u00f6rt\u00e9nt k\u00eds\u00e9rlet.
MQJE091=MQJE091: Figyelem: A(z) ''{0}'' tulajdons\u00e1g a(z) ''{1}'' kiv\u00e9tel k\u00f6vetkezt\u00e9ben nem ker\u00fclt fel\u00fcl\u00edr\u00e1sra. Ellen\u0151rizze, hogy a tulajdons\u00e1g \u00e9rt\u00e9ke a v\u00e1rt t\u00edpus\u00fa-e.

MQJIMQPROPERTY_OVERRIDE = MQQueueManager param\u00e9terek fel\u00fclb\u00edr\u00e1l\u00e1sa a PropertyStore-b\u00f3l:\n {0}
MQJIMQPROPERTY_OVERRIDE.inserts = XMSC_INSERT_PROPERTY_OVERRIDE_LIST
MQJIMQPROPERTY_OVERRIDE.explanation = A felsorolt tulajdons\u00e1gok fel\u00fcl lettek b\u00edr\u00e1lva az MQQueueManager konstruktor kivonatt\u00e1bl\u00e1j\u00e1ban

MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED = Nem siker\u00fclt kikeresni a(z) {0} tulajdons\u00e1gkonstanst
MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED.inserts = XMSC_INSERT_INDIRECT_PROPERTY_OVERRIDE
MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED.explanation = A kapcsolattulajdons\u00e1g fel\u00fclb\u00edr\u00e1lata egy k\u00f6zvetett keres\u00e9sn\u00e9vvel lett megk\u00eds\u00e9relve, de a nevet nem siker\u00fclt megfelel\u0151en feloldani.
MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED.useraction = Ellen\u0151rizze a kapcsolattulajdons\u00e1g fel\u00fclb\u00edr\u00e1lati deklar\u00e1ci\u00f3it
