# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR

JMSCS0001 = Die Eigenschaften aus der Eigenschaftendatei ''{0}'' konnten aufgrund einer E/A-Ausnahmebedingung (IOException) nicht geladen werden.
JMSCS0001.useraction = \u00dcberpr\u00fcfen Sie, ob die Eigenschaftendatei vorhanden ist und die geeigneten Berechtigungen aufweist.
JMSCS0002 = Der Aufruf konnte nicht abgeschlossen werden, da CommonServices nicht initialisiert wurde.
JMSCS0002.explanation = CommonServices ist eine interne Komponente und muss beim Systemstart initialisiert werden. Dies ist jedoch fehlgeschlagen.
JMSCS0002.useraction = \u00dcberpr\u00fcfen Sie, ob die Installation und die Konfiguration des Klassenpfads richtig sind.
JMSCS0003 = Es wurde keine CommonServices-Komponente gefunden.
JMSCS0003.explanation = CommonServices ist eine interne Komponente, konnte jedoch nicht gefunden werden.
JMSCS0003.useraction = \u00dcberpr\u00fcfen Sie, ob die Installation und die Konfiguration des Klassenpfads richtig sind.
JMSCS0004 = Es wurde keine Messaging-Provider-Komponente gefunden.
JMSCS0004.explanation = Es wurde angefordert, einen Messaging-Provider zu verwenden, der in der aktuellen Konfiguration nicht vorhanden ist.
JMSCS0004.useraction = \u00dcberpr\u00fcfen Sie, ob die JAR-Datei, in der der Messaging-Provider enthalten ist, im Klassenpfad vorhanden ist oder registriert wurde.
JMSCS0005 = Eine Komponente konnte nicht vom Komponentenmanager gefunden werden.
JMSCS0005.explanation = Es wurde angefordert, eine Komponente zu verwenden, die in der aktuellen Konfiguration nicht vorhanden ist.
JMSCS0005.useraction = \u00dcberpr\u00fcfen Sie, ob die JAR-Datei, in der die Komponente enthalten ist, im Klassenpfad vorhanden ist oder registriert wurde.
JMSCS0006 = Es ist ein interner Fehler aufgetreten. Die Diagnoseinformationen f\u00fcr den Service wurden in ''{0}'' geschrieben. Beenden Sie die Anwendung, da sich das Produkt in einem inkonsistenten internen Status befindet.
JMSCS0006.useraction = Sichern Sie alle generierten Ausgabedateien. Ob bereits eine L\u00f6sung zur Verf\u00fcgung steht, erfahren Sie entweder \u00fcber die WMQ-Unterst\u00fctzungssite http://www.ibm.com/software/integration/wmq/support/ oder \u00fcber den IBM Support Assistant (ISA) unter http://www.ibm.com/software/support/isa/.  Wenn Sie keine passende L\u00f6sung finden, wenden Sie sich an Ihr IBM Support Center.
JMSCS0007 = ERL\u00c4UTERUNG:
JMSCS0008 = AKTION:

JMSCS0009 = Die Systemeigenschaften konnten aufgrund einer Ausnahmebedingung (AccessControlException) nicht geladen werden.
JMSCS0009.explanation = PropertyStore konnte die Systemeigenschaften nicht abfragen, da die Sicherheitsrichtlinie dies nicht zul\u00e4sst.
JMSCS0009.useraction = \u00c4ndern Sie die Sicherheitsrichtlinie so, dass Systemeigenschaften gelesen werden k\u00f6nnen.

JMSCS0010 = Die allgemeinen Services des IBM Messaging-Clients konnten eine Komponente aufgrund einer Ausnahmebedingung ''{0}'' nicht finden oder initialisieren.
JMSCS0010.inserts = XMSC_INSERT_EXCEPTION

JMSCS0011 = Nachricht
JMSCS0012 = Klasse
JMSCS0013 = Stapel
JMSCS0014 = Verursacht durch [{0}] --> Nachricht
JMSCS0015 = Allgemeines Objekt mit ung\u00fcltigem Status

JMSCS0016 = Befehlsmanageroperation fehlgeschlagen.

JMSC0017 = Konfigurationsdatei ''CommonServices'' wird aus ''{0}'' gelesen
JMSC0017.inserts = XMSC_CONFIG_FILE_LOCATION

JMSCS0018 = Unbekannter Eigenschaftsname bereitgestellt (''{0}'')
JMSCS0018.inserts = XMSC_PROPERTY_NAME

JMSCS0019 = Eigenschaft ''{0}'' wurde bereits von ''{1}'' festgelegt. Sie kann nicht aktualisiert werden.
JMSCS0019.inserts = XMSC_PROPERTY_NAME,XMSC_PROPERTY_SOURCE

JMSCS0020 = Die Klasse wird m\u00f6glicherweise nicht serialisiert oder deserialisiert, da sie nicht in der Whitelist ''{0}'' enthalten war.
JMSCS0020.inserts = XMSC_WHITELIST

JMSCS0021 = Die Whitelist-Datei ''{0}'' kann nicht ge\u00f6ffnet werden
JMSCS0021.inserts = XMSC_WHITELIST

JMSCS0022 = Die Whitelist-Datei ''{0}'' ist bereits vorhanden und darf nicht \u00fcberschrieben werden
JMSCS0022.inserts = XMSC_WHITELIST

JMSCS0023 = Die Whitelist ''{0}'' enth\u00e4lt einen ung\u00fcltigen Eintrag
JMSCS0023.inserts = XMSC_WHITELIST

JMSCS0024 = Die Whitelist-Datei konnte nicht geschrieben werden

JMSCS0025 = Whitelist-Durchsetzung (ENFORCEMENT) aktiviert - mit der Whitelist-Datei ''{0}'' werden Operationen f\u00fcr die ObjectMessage-Serialisierung und -Deserialisierung gepr\u00fcft - die Whitelist-Baumstruktur ist ''{1}''
JMSCS0025.inserts = XMSC_WHITELIST,XMSC_WHITELIST_CONTENTS

JMSCS0026 = Whitelist-Erkennung (DISCOVERY) aktiviert - mit der Whitelist-Datei ''{0}'' werden Operationen f\u00fcr die ObjectMessage-Serialisierung und -Deserialisierung aufgezeichnet
JMSCS0026.inserts = XMSC_WHITELIST

JMSCS0027 = Whitelist-Durchsetzung (ENFORCEMENT) aktiviert - mit der Whitelist ''{0}'' werden Operationen f\u00fcr die ObjectMessage-Serialisierung und -Deserialisierung gepr\u00fcft
JMSCS0027.inserts = XMSC_WHITELIST

JMSCS0028 = Whitelist-Erkennung (DISCOVERY) angefordert, aber der Whitelist-Dateiname ''{0}'' ist kein Datei-URI
JMSCS0028.inserts = XMSC_WHITELIST

JMSCS0029 = Keine Whitelist-Funktionalit\u00e4t aktiviert - entweder wurden die Eigenschaften nicht festgelegt oder die Sicherheitsberechtigung verhindert, dass sie gelesen werden k\u00f6nnen
