# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR

JMSCS0001 = As propriedades no arquivo de propriedades ''{0}'' n\u00e3o puderam ser carregadas devido a uma IOException.
JMSCS0001.useraction = Verifique se o arquivo de propriedades existe e possui as permiss\u00f5es apropriadas.
JMSCS0002 = N\u00e3o foi poss\u00edvel concluir a chamada por que CommonServices n\u00e3o foi inicializado.
JMSCS0002.explanation = CommonServices \u00e9 um componente interno e precisa ser inicializado na inicializa\u00e7\u00e3o, mas falhou.
JMSCS0002.useraction = Verifique se a configura\u00e7\u00e3o de instala\u00e7\u00e3o e do caminho de classe est\u00e1 correta.
JMSCS0003 = Um componente CommonServices n\u00e3o foi localizado.
JMSCS0003.explanation = CommonServices \u00e9 um componente interno e n\u00e3o foi localizado.
JMSCS0003.useraction = Verifique se a configura\u00e7\u00e3o de instala\u00e7\u00e3o e do caminho de classe est\u00e1 correta.
JMSCS0004 = Um componente Messaging Provider n\u00e3o foi localizado.
JMSCS0004.explanation = Um pedido foi feito para utilizar um Messaging Provider que n\u00e3o est\u00e1 presente na configura\u00e7\u00e3o atual.
JMSCS0004.useraction = Verifique se o arquivo JAR que cont\u00e9m o Messaging Provider est\u00e1 presente no caminho de classe ou foi registrado.
JMSCS0005 = Um componente n\u00e3o p\u00f4de ser localizado pelo Component Manager.
JMSCS0005.explanation = Um pedido foi feito para utilizar um Componente que n\u00e3o est\u00e1 presente na configura\u00e7\u00e3o atual.
JMSCS0005.useraction = Verifique se o arquivo JAR que cont\u00e9m o Componente est\u00e1 presente no caminho de classe ou foi registrado.
JMSCS0006 = Ocorreu um problema interno. As informa\u00e7\u00f5es de diagn\u00f3stico para o servi\u00e7o foram gravadas em  ''{0}''. Finalize o aplicativo, visto que o produto est\u00e1 em um estado interno inconsistente.
JMSCS0006.useraction = Salve qualquer arquivo de sa\u00edda gerado e utilize o site de Suporte do WMQ: http://www.ibm.com/software/integration/wmq/support/, ou o ISA (IBM Support Assistant): http://www.ibm.com/software/support/isa/, para consultar se uma solu\u00e7\u00e3o j\u00e1 est\u00e1 dispon\u00edvel.  Se n\u00e3o for poss\u00edvel localizar uma correspond\u00eancia, entre em contato com o centro de suporte da IBM.
JMSCS0007 = EXPLICA\u00c7\u00c3O:
JMSCS0008 = A\u00c7\u00c3O:

JMSCS0009 = N\u00e3o foi poss\u00edvel carregar as propriedades do sistema, devido a uma AccessControlException.
JMSCS0009.explanation = O PropertyStore n\u00e3o p\u00f4de consultar as propriedades do sistema, por que a pol\u00edtica de seguran\u00e7a n\u00e3o o permite.
JMSCS0009.useraction = Modifique a pol\u00edtica de seguran\u00e7a para permitir que as propriedades do sistema sejam lidas.

JMSCS0010 = O IBM Messaging Client Common Services n\u00e3o p\u00f4de localizar ou inicializar um componente devido \u00e0 exce\u00e7\u00e3o ''{0}''.
JMSCS0010.inserts = XMSC_INSERT_EXCEPTION

JMSCS0011 = Mensagem
JMSCS0012 = Par\u00e2metro class
JMSCS0013 = Pilha
JMSCS0014 = Causado por [{0}] --> Mensagem
JMSCS0015 = Objeto comum em estado inv\u00e1lido

JMSCS0016 = Falha na opera\u00e7\u00e3o do Command Manager.

JMSC0017 = Arquivo de configura\u00e7\u00e3o do CommonServices lido a partir de ''{0}''
JMSC0017.inserts = XMSC_CONFIG_FILE_LOCATION

JMSCS0018 = Nome da propriedade desconhecido fornecido ''{0}''
JMSCS0018.inserts = XMSC_PROPERTY_NAME

JMSCS0019 = A propriedade ''{0}'' j\u00e1 foi configurada por ''{1}''. Ela n\u00e3o pode ser atualizada.
JMSCS0019.inserts = XMSC_PROPERTY_NAME,XMSC_PROPERTY_SOURCE

JMSCS0020 = A classe pode n\u00e3o ser serializada ou desserializada, pois n\u00e3o foi inclu\u00edda na lista de desbloqueio ''{0}''.
JMSCS0020.inserts = XMSC_WHITELIST

JMSCS0021 = O arquivo de lista de desbloqueio ''{0}'' n\u00e3o pode ser aberto
JMSCS0021.inserts = XMSC_WHITELIST

JMSCS0022 = O arquivo de lista de desbloqueio ''{0}'' j\u00e1 existe e n\u00e3o pode ser sobrescrito
JMSCS0022.inserts = XMSC_WHITELIST

JMSCS0023 = A lista de desbloqueio ''{0}'' tem uma entrada inv\u00e1lida
JMSCS0023.inserts = XMSC_WHITELIST

JMSCS0024 = O arquivo de lista de desbloqueio n\u00e3o p\u00f4de ser gravado

JMSCS0025 = EXECU\u00c7\u00c3O de lista de desbloqueio ativada - o arquivo de lista de desbloqueio ''{0}'' est\u00e1 sendo usado para validar as opera\u00e7\u00f5es de serializa\u00e7\u00e3o de desserializa\u00e7\u00e3o do ObjectMessage - a \u00e1rvore de lista de desbloqueio \u00e9 ''{1}''
JMSCS0025.inserts = XMSC_WHITELIST,XMSC_WHITELIST_CONTENTS

JMSCS0026 = DESCOBERTA de lista de desbloqueio ativada - O arquivo de lista de desbloqueio ''{0}'' est\u00e1 sendo usado para registrar as opera\u00e7\u00f5es de serializa\u00e7\u00e3o e desserializa\u00e7\u00e3o do ObjectMessage
JMSCS0026.inserts = XMSC_WHITELIST

JMSCS0027 = EXECU\u00c7\u00c3O de lista de desbloqueio ativada - a lista de desbloqueio ''{0}'' est\u00e1 sendo usada para validar opera\u00e7\u00f5es de serializa\u00e7\u00e3o e desserializa\u00e7\u00e3o do ObjectMessage
JMSCS0027.inserts = XMSC_WHITELIST

JMSCS0028 = DESCOBERTA de lista de desbloqueio solicitada, mas o nome do arquivo de lista de desbloqueio ''{0}'' n\u00e3o \u00e9 um URI de arquivo
JMSCS0028.inserts = XMSC_WHITELIST

JMSCS0029 = Nenhuma funcionalidade de lista de desbloqueio ativada - as propriedades n\u00e3o foram configuradas ou as permiss\u00f5es de seguran\u00e7a evitam que ela seja lida
