# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR

JMSCS0001 = W\u0142a\u015bciwo\u015bci z pliku w\u0142a\u015bciwo\u015bci {0} nie mog\u0142y zosta\u0107 za\u0142adowane z powodu wyst\u0105pienia wyj\u0105tku IOException.
JMSCS0001.useraction = Sprawd\u017a, czy plik w\u0142a\u015bciwo\u015bci istnieje i ma odpowiednie uprawnienia.
JMSCS0002 = Nie mo\u017cna zako\u0144czy\u0107 wywo\u0142ania, poniewa\u017c nie zosta\u0142y zainicjowane us\u0142ugi CommonServices.
JMSCS0002.explanation = Us\u0142ugi CommonServices stanowi\u0105 komponent wewn\u0119trzny i nale\u017cy je zainicjowa\u0107 podczas uruchamiania. Ta czynno\u015b\u0107 si\u0119 jednak nie powiod\u0142a.
JMSCS0002.useraction = Sprawd\u017a, czy konfiguracja \u015bcie\u017cki klasy i instalacji jest poprawna.
JMSCS0003 = Nie znaleziono komponentu us\u0142ug CommonServices.
JMSCS0003.explanation = Us\u0142ugi CommonServices stanowi\u0105 komponent wewn\u0119trzny i nie zosta\u0142y odnalezione.
JMSCS0003.useraction = Sprawd\u017a, czy konfiguracja \u015bcie\u017cki klasy i instalacji jest poprawna.
JMSCS0004 = Nie znaleziono komponentu dostawcy przesy\u0142ania komunikat\u00f3w.
JMSCS0004.explanation = Zg\u0142oszono \u017c\u0105danie u\u017cycia dostawcy przesy\u0142ania komunikat\u00f3w, kt\u00f3ry nie wyst\u0119puje w bie\u017c\u0105cej konfiguracji.
JMSCS0004.useraction = Sprawd\u017a, czy plik JAR zawieraj\u0105cy dostawc\u0119 przesy\u0142ania komunikat\u00f3w wyst\u0119puje w \u015bcie\u017cce klasy lub zosta\u0142 zarejestrowany.
JMSCS0005 = Mened\u017cer komponent\u00f3w nie m\u00f3g\u0142 znale\u017a\u0107 komponentu.
JMSCS0005.explanation = Zg\u0142oszono \u017c\u0105danie u\u017cycia komponentu, kt\u00f3ry nie wyst\u0119puje w bie\u017c\u0105cej konfiguracji.
JMSCS0005.useraction = Sprawd\u017a, czy plik JAR zawieraj\u0105cy komponent wyst\u0119puje w \u015bcie\u017cce klasy lub zosta\u0142 zarejestrowany.
JMSCS0006 = Wyst\u0105pi\u0142 problem wewn\u0119trzny. Informacje diagnostyczne dotycz\u0105ce us\u0142ugi zosta\u0142y zapisane w pliku {0}. Zako\u0144cz dzia\u0142anie aplikacji, poniewa\u017c produkt ma niesp\u00f3jny stan wewn\u0119trzny.
JMSCS0006.useraction = Zapisz wszystkie wygenerowane pliki wyj\u015bciowe i skorzystaj z serwisu dzia\u0142u wsparcia dla produktu WMQ (http://www.ibm.com/software/integration/wmq/support/) lub programu IBM Support Assistant (ISA) (http://www.ibm.com/software/support/isa/) w celu sprawdzenia, czy rozwi\u0105zanie jest ju\u017c dost\u0119pne.  Je\u015bli znalezienie zgodnego przypadku nie jest mo\u017cliwe, skontaktuj si\u0119 z dzia\u0142em wsparcia IBM.
JMSCS0007 = WYJA\u015aNIENIE:
JMSCS0008 = DZIA\u0141ANIE:

JMSCS0009 = W\u0142a\u015bciwo\u015bci systemowe nie zosta\u0142y za\u0142adowane z powodu wyj\u0105tku AccessControlException.
JMSCS0009.explanation = Obiekt PropertyStore nie m\u00f3g\u0142 wykona\u0107 zapytania o w\u0142a\u015bciwo\u015bci systemowe, poniewa\u017c nie jest to dozwolone przez strategi\u0119 bezpiecze\u0144stwa.
JMSCS0009.useraction = Zmodyfikuj strategi\u0119 bezpiecze\u0144stwa, aby umo\u017cliwi\u0107 odczyt w\u0142a\u015bciwo\u015bci systemowych.

JMSCS0010 = Us\u0142ugi wsp\u00f3lne klienta przesy\u0142ania komunikat\u00f3w IBM nie mog\u0105 znale\u017a\u0107 lub zainicjowa\u0107 komponentu z powodu wyst\u0105pienia nast\u0119puj\u0105cego wyj\u0105tku: {0}.
JMSCS0010.inserts = XMSC_INSERT_EXCEPTION

JMSCS0011 = Komunikat
JMSCS0012 = Klasa
JMSCS0013 = Stos
JMSCS0014 = Spowodowany przez [{0}] --> Komunikat
JMSCS0015 = Obiekt wsp\u00f3lny znajduje si\u0119 w niepoprawnym stanie

JMSCS0016 = Operacja mened\u017cera komend nie powiod\u0142a si\u0119.

JMSC0017 = Wczytano plik konfiguracyjny us\u0142ug CommonServices z {0}
JMSC0017.inserts = XMSC_CONFIG_FILE_LOCATION

JMSCS0018 = Podano nieznan\u0105 nazw\u0119 w\u0142a\u015bciwo\u015bci {0}
JMSCS0018.inserts = XMSC_PROPERTY_NAME

JMSCS0019 = W\u0142a\u015bciwo\u015b\u0107 {0} zosta\u0142a ju\u017c ustawiona przez {1}. Nie mo\u017cna jej aktualizowa\u0107.
JMSCS0019.inserts = XMSC_PROPERTY_NAME,XMSC_PROPERTY_SOURCE

JMSCS0020 = Nie mo\u017cna przekszta\u0142ci\u0107 klasy do postaci szeregowej ani z postaci szeregowej, poniewa\u017c nie zosta\u0142a ona umieszczona na bia\u0142ej li\u015bcie {0}.
JMSCS0020.inserts = XMSC_WHITELIST

JMSCS0021 = Nie mo\u017cna otworzy\u0107 pliku bia\u0142ej listy {0}
JMSCS0021.inserts = XMSC_WHITELIST

JMSCS0022 = Plik bia\u0142ej listy {0} ju\u017c istnieje i nie mo\u017cna go nadpisa\u0107
JMSCS0022.inserts = XMSC_WHITELIST

JMSCS0023 = Bia\u0142a lista {0} zawiera niepoprawny wpis
JMSCS0023.inserts = XMSC_WHITELIST

JMSCS0024 = Nie mo\u017cna zapisa\u0107 pliku bia\u0142ej listy

JMSCS0025 = W\u0142\u0105czono w\u0142a\u015bciwo\u015b\u0107 wymuszenia (ENFORCEMENT) bia\u0142ej listy - plik bia\u0142ej listy {0} jest u\u017cywany do sprawdzania poprawno\u015bci operacji przekszta\u0142cania do i z postaci szeregowej obiektu ObjectMessage - drzewo bia\u0142ej listy to {1}
JMSCS0025.inserts = XMSC_WHITELIST,XMSC_WHITELIST_CONTENTS

JMSCS0026 = W\u0142\u0105czono w\u0142a\u015bciwo\u015b\u0107 wykrywania (DISCOVERY) bia\u0142ej listy - plik bia\u0142ej listy {0} jest u\u017cywany do rejestrowania operacji przekszta\u0142cania do i z postaci szeregowej obiektu ObjectMessage
JMSCS0026.inserts = XMSC_WHITELIST

JMSCS0027 = W\u0142\u0105czono w\u0142a\u015bciwo\u015b\u0107 wymuszenia (ENFORCEMENT) bia\u0142ej listy - bia\u0142a lista {0} jest u\u017cywana do sprawdzania poprawno\u015bci operacji przekszta\u0142cania do i z postaci szeregowej obiektu ObjectMessage
JMSCS0027.inserts = XMSC_WHITELIST

JMSCS0028 = Za\u017c\u0105dano w\u0142a\u015bciwo\u015bci wykrywania (DISCOVERY) bia\u0142ej listy, ale nazwa pliku bia\u0142ej listy {0} nie jest identyfikatorem URI
JMSCS0028.inserts = XMSC_WHITELIST

JMSCS0029 = Nie w\u0142\u0105czono funkcjonalno\u015bci bia\u0142ej listy - nie ustawiono w\u0142a\u015bciwo\u015bci lub uprawnienia zabezpiecze\u0144 uniemo\u017cliwiaj\u0105 ich odczytanie
