# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
#

JMSFMQ0001 = La modalidad de conexi\u00f3n ''{0}'' no est\u00e1 soportada para conexiones XA.
JMSFMQ0001.explanation = No todas las modalidades de conexi\u00f3n est\u00e1n soportadas por cada tipo de conexi\u00f3n. XA requiere una conexi\u00f3n en modalidad de cliente.
JMSFMQ0001.useraction = Modifique la modalidad de conexi\u00f3n para que tenga un valor soportado.
JMSFMQ0001.inserts = XMSC_WMQ_CONNECTION_MODE

JMSFMQ0003 = El nivel de mandato del gestor de colas ''{0}'' no coincid\u00eda con la Versi\u00f3n de proveedor ''{1}'' solicitada.
JMSFMQ0003.explanation = La versi\u00f3n del gestor de colas especificada en la f\u00e1brica de conexiones no coincide con el gestor de colas solicitado. Una Versi\u00f3n de proveedor "no especificada" intentar\u00e1 realizar una conexi\u00f3n en Modalidad normal. 
JMSFMQ0003.useraction = Seleccione un gestor de colas coincidente o modifique el nivel de mandatos solicitado.
JMSFMQ0003.inserts = XMSC_INSERT_COMMAND_LEVEL, XMSC_WMQ_PROVIDER_VERSION

JMSFMQ0004 = El valor del canal de compartici\u00f3n de conversaciones ''{0}'' no est\u00e1 soportado para la versi\u00f3n de proveedor solicitada ''{1}''.
JMSFMQ0004.explanation = El valor especificado para la propiedad de canal de compartici\u00f3n de conversaciones no est\u00e1 soportado por la Versi\u00f3n de proveedor de gestor de colas solicitada. Una Versi\u00f3n de proveedor "no especificada" intentar\u00e1 realizar una conexi\u00f3n en Modalidad normal.
JMSFMQ0004.useraction = Seleccione una Versi\u00f3n de proveedor que pueda dar soporte al valor solicitado o cambie el valor de compartici\u00f3n de conversaciones a un valor soportado.
JMSFMQ0004.inserts = XMSC_INSERT_VALUE, XMSC_WMQ_PROVIDER_VERSION

JMSFMQ0005 = El uso de una conexi\u00f3n de cliente no est\u00e1 soportado dentro del entorno actual.
JMSFMQ0005.explanation = La modalidad de conexi\u00f3n de cliente no est\u00e1 soportada en todos los entornos.
JMSFMQ0005.useraction = Modifique la modalidad de conexi\u00f3n para especificar una conexi\u00f3n de enlaces con un gestor de colas local.

JMSFMQ0007 = Se ha establecido una propiedad ''{0}'' desconocida con el valor ''{1}'' en el contexto de propiedad de la fabrica de conexiones.
JMSFMQ0007.explanation = La propiedad ''{0}'' no se ha reconocido; podr\u00eda ser una propiedad personalizada.
JMSFMQ0007.useraction = Aseg\u00farese de que su finalidad es ser una propiedad personalizada.
JMSFMQ0007.inserts = XMSC_INSERT_KEY, XMSC_INSERT_VALUE

JMSFMQ0010 = El valor ''{0}'' no es v\u00e1lido para la propiedad de configuraci\u00f3n de cliente ''{1}'', se hace caso omiso del valor.
JMSFMQ0010.explanation = Se ha intentado establecer una propiedad de configuraci\u00f3n de cliente fuera de su rango v\u00e1lido.
JMSFMQ0010.useraction = Debe modificarse el valor para que contenga un valor v\u00e1lido. Consulte la documentaci\u00f3n para obtener m\u00e1s informaci\u00f3n.
JMSFMQ0010.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_NAME

JMSFMQ1006 = El valor ''{0}'' para la propiedad ''{1}'' no es v\u00e1lido.
JMSFMQ1006.explanation = El valor especificado para la propiedad no est\u00e1 soportado.
JMSFMQ1006.useraction = Modifique el valor para que est\u00e9 dentro del rango de valores aceptados.
JMSFMQ1006.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_NAME

JMSFMQ1007 = Mensaje de anotaci\u00f3n de Real Time Transport ''{0}''.
JMSFMQ1007.explanation = Real Time Transport ha anotado un error.
JMSFMQ1007.inserts = XMSC_REAL_TIME_LOG_MSG

JMSFMQ1056 = El tipo de datos ''{0}'' de la propiedad o del elemento no est\u00e1 soportado.
JMSFMQ1056.explanation = El tipo de datos del objeto especificado no se acepta para el campo especificado.  
JMSFMQ1056.useraction = Modifique el objeto para que sea de un tipo aceptado.
JMSFMQ1056.inserts = XMSC_INSERT_NAME

JMSFMQ1105 = No se puede especificar un puerto local ''{0}'' para una conexi\u00f3n directa a un intermediario que utilice multidifusi\u00f3n.
JMSFMQ1105.explanation = Se ha especificado un n\u00famero de puerto. Esto no es v\u00e1lido para multidifusi\u00f3n.
JMSFMQ1105.useraction = Elimine la referencia de puerto del valor de direcci\u00f3n local de multidifusi\u00f3n.
JMSFMQ1105.inserts = XMSC_WMQ_LOCAL_ADDRESS

JMSFMQ3032 = No est\u00e1 permitido restablecer el clientID.
JMSFMQ3032.explanation = El ID de cliente de una conexi\u00f3n s\u00f3lo se puede establecer una vez y s\u00f3lo antes de que se utilice la conexi\u00f3n.
JMSFMQ3032.useraction = Establezca el ID de cliente antes de utilizar la conexi\u00f3n.

JMSFMQ3036 = La selecci\u00f3n de mensajes del lado del intermediario s\u00f3lo es v\u00e1lida cuando se utiliza IBM Integration Bus.
JMSFMQ3036.explanation = La versi\u00f3n de intermediario y la selecci\u00f3n de mensajes no concuerdan.
JMSFMQ3036.useraction = Aseg\u00farese de que la versi\u00f3n de intermediario (JMSC.MQJMS_BROKER_V2) se ha establecido en la f\u00e1brica de conexiones.

JMSFMQ3037 = Versi\u00f3n de intermediario y versi\u00f3n de proveedor establecidas simult\u00e1neamente - la versi\u00f3n de proveedor ''{0}'' prevalece sobre la versi\u00f3n de intermediario ''{1}''.
JMSFMQ3037.explanation = La versi\u00f3n de intermediario y la versi\u00f3n de proveedor no deben establecerse simult\u00e1neamente.
JMSFMQ3037.useraction = Aseg\u00farese de que la versi\u00f3n de intermediario o la versi\u00f3n de proveedor se ha establecido en la f\u00e1brica de conexiones, pero no ambas.
JMSFMQ3037.inserts = XMSC_WMQ_PROVIDER_VERSION, XMSC_WMQ_BROKER_VERSION

JMSFMQ6115 = Se ha producido una excepci\u00f3n al crear la TopicConnection
JMSFMQ6115.useraction = Consulte la excepci\u00f3n enlazada para obtener m\u00e1s informaci\u00f3n.

JMSFMQ6311 = El tipo de transporte 'DIRECT' dentro de una transacci\u00f3n no est\u00e1 soportado.
JMSFMQ6311.explanation = La aplicaci\u00f3n ha intentado utilizar un m\u00e9todo transaccional. Esto no est\u00e1 soportado con un tipo de transporte DirectIP.
JMSFMQ6311.useraction = La aplicaci\u00f3n deber\u00eda modificarse para impedir el uso de transacciones.

JMSFMQ6312 = Se ha producido una excepci\u00f3n en la MQI de Java(tm).
JMSFMQ6312.explanation = La MQI de Java(tm) ha emitido una excepci\u00f3n que describe el problema. 
JMSFMQ6312.useraction = Consulte la excepci\u00f3n enlazada para obtener m\u00e1s informaci\u00f3n.

JMSFMQ6313 = Se ha realizado una conexi\u00f3n WMQ del tipo ''{0}''.
JMSFMQ6313.inserts = XMSC_INSERT_VALUE
JMSFMQ6313.explanation = Una conexi\u00f3n puede ser en Modalidad normal o en Modalidad de migraci\u00f3n.
JMSFMQ6313.useraction = Si \u00e9ste no es el tipo de conexi\u00f3n esperada, busque m\u00e1s informaci\u00f3n en el tema jm41140_ del Centro de informaci\u00f3n.

JMSFMQ6314 = La F\u00e1brica de conexiones suministr\u00f3 la versi\u00f3n de proveedor ''{0}'' y ha sido sustituida por ''{1}''.
JMSFMQ6314.inserts = XMSC_WMQ_PROVIDER_VERSION,XMSC_INSERT_NAME
JMSFMQ6314.explanation = La propiedad de configuraci\u00f3n del cliente puede sustituir la versi\u00f3n de proveedor de la f\u00e1brica de conexiones.
JMSFMQ6314.useraction = Ninguna; se trata de un mensaje informativo que indica que se ha sustituido una propiedad.

JMSFMQ6315 = La versi\u00f3n de proveedor se ha sustituido por 6.0.0.0 porque la versi\u00f3n del intermediario se ha establecido en V2 y el gestor de colas del intermediario est\u00e1 presente en la f\u00e1brica de conexiones.
JMSFMQ6315.explanation = La versi\u00f3n de proveedor de la f\u00e1brica de conexiones se ha cambiado bas\u00e1ndose en otras propiedades de la f\u00e1brica de conexiones.
JMSFMQ6315.useraction = Ninguna; se trata de un mensaje informativo que indica que se ha sustituido una propiedad.

JMSFMQ6316 = La modalidad de publicaci\u00f3n/suscripci\u00f3n del gestor de colas es ''{0}'', por lo que es necesario ''{1}'' para la funci\u00f3n de publicaci\u00f3n/suscripci\u00f3n.
JMSFMQ6316.inserts = XMSC_INSERT_TYPE,XMSC_INSERT_OTHER_TYPE
JMSFMQ6316.explanation = Bas\u00e1ndose en la modalidad de publicaci\u00f3n/suscripci\u00f3n del gestor de colas, se ha tomado una decisi\u00f3n para elegir entre la modalidad Normal y la de Migraci\u00f3n.
JMSFMQ6316.useraction = Ninguna; se trata de un mensaje informativo. Si \u00e9ste no es el tipo de conexi\u00f3n esperada, busque m\u00e1s informaci\u00f3n en el tema jm41140_ del Centro de informaci\u00f3n.

JMSFMQ6317 = No se ha podido abrir BrokerControlQ en modalidad ''{0}'', por lo que es necesaria la modalidad Normal para la funci\u00f3n de publicaci\u00f3n/suscripci\u00f3n.
JMSFMQ6317.inserts = XMSC_INSERT_TYPE
JMSFMQ6317.explanation = Bas\u00e1ndose en la modalidad de publicaci\u00f3n/suscripci\u00f3n del gestor de colas, se ha tomado una decisi\u00f3n para elegir entre la modalidad Normal y la de Migraci\u00f3n.
JMSFMQ6317.useraction = Ninguna; se trata de un mensaje informativo. Si desea informaci\u00f3n adicional, busque el tema jm41140_  en el Centro de informaci\u00f3n.

JMSFMQ6318 = No se puede integrar con el Control de rastreo del servidor de WMQ ''{0}'' .
JMSFMQ6318.inserts = Excepci\u00f3n
JMSFMQ6318.explanation = No se ha podido conectar al rastreo del servidor de WMQ.
JMSFMQ6318.useraction = Compruebe que com.ibm.mq.commonservices.jar est\u00e9 presente en la v\u00eda de acceso de clases.
