# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
#

JMSFMQ0001 = Der Verbindungsmodus ''{0}'' wird f\u00fcr XA-Verbindungen nicht unterst\u00fctzt.
JMSFMQ0001.explanation = Es werden nicht alle Verbindungsmodi von allen Verbindungstypen unterst\u00fctzt. XA erfordert eine Verbindung im Clientmodus.
JMSFMQ0001.useraction = Geben Sie f\u00fcr den Verbindungsmodus einen Wert an, der unterst\u00fctzt wird.
JMSFMQ0001.inserts = XMSC_WMQ_CONNECTION_MODE

JMSFMQ0003 = Die Befehlsebene ''{0}'' des Warteschlangenmanagers stimmte nicht mit der angeforderten Providerversion ''{1}'' \u00fcberein.
JMSFMQ0003.explanation = Die in der Verbindungsfactory angegebene Warteschlangenmanagerversion entspricht nicht dem angeforderten Warteschlangenmanager. Eine 'nicht angegebene' Providerversion versucht, eine Verbindung im Normalmodus herzustellen. 
JMSFMQ0003.useraction = W\u00e4hlen Sie einen passenden Warteschlangenmanager aus oder \u00e4ndern Sie die angeforderte Befehlsebene.
JMSFMQ0003.inserts = XMSC_INSERT_COMMAND_LEVEL, XMSC_WMQ_PROVIDER_VERSION

JMSFMQ0004 = Der Kanalwert ''{0}'' f\u00fcr den gemeinsamen Datenaustausch wird f\u00fcr die angeforderte Providerversion ''{1}'' nicht unterst\u00fctzt.
JMSFMQ0004.explanation = Der als Kanaleigenschaft f\u00fcr den gemeinsamen Datenaustausch angegebene Wert wird nicht von der angeforderten Provider-Version des Warteschlangenmanagers unterst\u00fctzt. Eine 'nicht angegebene' Providerversion versucht, eine Verbindung im Normalmodus herzustellen.
JMSFMQ0004.useraction = W\u00e4hlen Sie entweder eine Provider-Version aus, welche die angeforderte Einstellung unterst\u00fctzt oder \u00e4ndern Sie die Einstellung des gemeinsamen Datenaustauschs in einen unterst\u00fctzten Wert.
JMSFMQ0004.inserts = XMSC_INSERT_VALUE, XMSC_WMQ_PROVIDER_VERSION

JMSFMQ0005 = In der aktuellen Umgebung wird die Verwendung einer Clientverbindung nicht unterst\u00fctzt.
JMSFMQ0005.explanation = Der Client-Verbindungsmodus wird nicht in allen Umgebungen unterst\u00fctzt.
JMSFMQ0005.useraction = \u00c4ndern Sie den Verbindungsmodus, und geben Sie eine Bindings-Verbindung zu einem lokalen Warteschlangenmanager an.

JMSFMQ0007 = Eine unbekannte Eigenschaft ''{0}'' mit dem Wert ''{1}'' wurde auf der Eigenschaft einer Verbindungsfactory gesetzt.
JMSFMQ0007.explanation = Die Eigenschaft ''{0}'' wurde nicht erkennt - unter Umst\u00e4nden handelt es sich um eine benutzerdefinierte Eigenschaft.
JMSFMQ0007.useraction = Stellen Sie sicher, dass die Verwendung einer benutzerdefinierten Eigenschaft beabsichtigt ist.
JMSFMQ0007.inserts = XMSC_INSERT_KEY, XMSC_INSERT_VALUE

JMSFMQ0010 = Der Wert ''{0}'' ist f\u00fcr die Clientkonfigurationseigenschaft ''{1}'' nicht g\u00fcltig, der Wert wurde ignoriert.
JMSFMQ0010.explanation = Es wurde versucht, eine Clientkonfigurationseigenschaft au\u00dferhalb ihres g\u00fcltigen Bereichs zu definieren.
JMSFMQ0010.useraction = Die Einstellung muss so ge\u00e4ndert werden, dass sie einen g\u00fcltigen Wert enth\u00e4lt. Weitere Informationen finden Sie in der Dokumentation.
JMSFMQ0010.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_NAME

JMSFMQ1006 = Der Wert ''{0}'' f\u00fcr die Eigenschaft ''{1}'' ist nicht g\u00fcltig.
JMSFMQ1006.explanation = Der f\u00fcr die Eigenschaft angegebene Wert wird nicht unterst\u00fctzt.
JMSFMQ1006.useraction = Geben Sie einen Wert an, der innerhalb des Bereichs der g\u00fcltigen Werte liegt.
JMSFMQ1006.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_NAME

JMSFMQ1007 = Protokollnachricht der Echtzeit\u00fcbertragung ''{0}''.
JMSFMQ1007.explanation = W\u00e4hrend der Echtzeit\u00fcbertragung wurde ein Fehler protokolliert.
JMSFMQ1007.inserts = XMSC_REAL_TIME_LOG_MSG

JMSFMQ1056 = Der Datentyp ''{0}'' f\u00fcr die Eigenschaft oder das Element wird nicht unterst\u00fctzt.
JMSFMQ1056.explanation = Der Datentyp dieses Objekts ist f\u00fcr das angegebene Feld nicht g\u00fcltig.  
JMSFMQ1056.useraction = Geben Sie f\u00fcr das Objekt einen g\u00fcltigen Typ an.
JMSFMQ1056.inserts = XMSC_INSERT_NAME

JMSFMQ1105 = F\u00fcr eine direkte Verbindung zu einem Broker \u00fcber Multicasting kann kein lokaler Port ''{0}'' angegeben werden.
JMSFMQ1105.explanation = Es wurde eine Portnummer angegeben. Dies ist f\u00fcr Multicasting nicht zul\u00e4ssig.
JMSFMQ1105.useraction = L\u00f6schen Sie den Verweis auf den Port aus der lokalen Adresseinstellung f\u00fcr das Multicasting.
JMSFMQ1105.inserts = XMSC_WMQ_LOCAL_ADDRESS

JMSFMQ3032 = Zur\u00fccksetzen von 'clientID' ist nicht zul\u00e4ssig.
JMSFMQ3032.explanation = Die Client-ID einer Verbindung kann nur einmal und nur vor Verwendung der Verbindung festgelegt werden.
JMSFMQ3032.useraction = Legen Sie vor Verwendung der Verbindung die Client-ID fest.

JMSFMQ3036 = Die Nachrichtenauswahl auf Brokerseite ist nur bei Verwendung von IBM Integration Bus zul\u00e4ssig.
JMSFMQ3036.explanation = Brokerversion und Nachrichtenauswahl sind nicht konsistent.
JMSFMQ3036.useraction = Stellen Sie sicher, dass die Brokerversion (JMSC.MQJMS_BROKER_V2) in der Verbindungsfactory festgelegt wurde.

JMSFMQ3037 = Brokerversion und Providerversion wurden gleichzeitig festgelegt - die Providerversion ''{0}'' \u00fcberschreibt die Brokerversion ''{1}''.
JMSFMQ3037.explanation = Brokerversion und Providerversion d\u00fcrfen nicht gleichzeitig festgelegt werden.
JMSFMQ3037.useraction = Stellen Sie sicher, dass entweder die Brokerversion oder die Providerversion in der Verbindungsfactory festgelegt wurden (nicht beide).
JMSFMQ3037.inserts = XMSC_WMQ_PROVIDER_VERSION, XMSC_WMQ_BROKER_VERSION

JMSFMQ6115 = Beim Erstellen von TopicConnection ist eine Ausnahmebedingung aufgetreten.
JMSFMQ6115.useraction = Weitere Informationen finden Sie in der verkn\u00fcpften Ausnahmebedingung.

JMSFMQ6311 = Der Transporttyp 'DIRECT' wird innerhalb einer Transaktion nicht unterst\u00fctzt.
JMSFMQ6311.explanation = Die Anwendung versuchte, eine transaktionsorientierte Methode zu verwenden. Dies wird beim Transporttyp 'DirectIP' nicht unterst\u00fctzt.
JMSFMQ6311.useraction = Die Anwendung muss so ge\u00e4ndert werden, dass die Verwendung von Transaktionen verhindert wird.

JMSFMQ6312 = In der Java(tm) MQI ist eine Ausnahmebedingung aufgetreten.
JMSFMQ6312.explanation = Die Java(tm) MQI hat eine Ausnahmebedingung ausgegeben, in der der Fehler erl\u00e4utert wird. 
JMSFMQ6312.useraction = Weitere Informationen finden Sie in der verkn\u00fcpften Ausnahmebedingung.

JMSFMQ6313 = Aus dem Typ ''{0}'' wurde eine WMQ-Verbindung erstellt.
JMSFMQ6313.inserts = XMSC_INSERT_VALUE
JMSFMQ6313.explanation = Eine Verbindung kann entweder im normalen Modus oder im Migrationsmodus erfolgen.
JMSFMQ6313.useraction = Wenn es sich hierbei nicht um den erwarteten Verbindungstyp handelt, durchsuchen Sie das Information Center nach dem Stichwort 'jm41140_', um weitere Informationen zu erhalten.

JMSFMQ6314 = Die von der Verbindungsfactory bereitgestellte Providerversion ''{0}'' wurde mit ''{1}'' \u00fcberschrieben.
JMSFMQ6314.inserts = XMSC_WMQ_PROVIDER_VERSION,XMSC_INSERT_NAME
JMSFMQ6314.explanation = Die Providerversion der Verbindungsfactory kann von der Clientkonfigurationseigenschaft \u00fcberschrieben werden.
JMSFMQ6314.useraction = Keine; dies ist eine Informationsnachricht, um anzuzeigen, dass eine Eigenschaft \u00fcberschrieben wurde.

JMSFMQ6315 = Providerversion \u00fcberschrieben auf 6.0.0.0, da Brokerversion auf V2 gesetzt wurde und BrokerQmgr in Verbindungsfactory vorhanden ist.
JMSFMQ6315.explanation = Die Providerversion der Verbindungsfactory wurde basierend auf anderen Eigenschaften in der Verbindungsfactory ge\u00e4ndert.
JMSFMQ6315.useraction = Keine; dies ist eine Informationsnachricht, um anzuzeigen, dass eine Eigenschaft \u00fcberschrieben wurde.

JMSFMQ6316 = Der Publish/Subscribe-Modus des Warteschlangenmanagers ist Modus ''{0}'', ''{1}'' ist daher f\u00fcr die Publish/Subscribe-Funktion erforderlich.
JMSFMQ6316.inserts = XMSC_INSERT_TYPE,XMSC_INSERT_OTHER_TYPE
JMSFMQ6316.explanation = Basierend auf dem Publish/Subscribe-Modus des Warteschlangenmanagers wurde eine Entscheidung zur Verwendung des Modus Normal oder Migration getroffen.
JMSFMQ6316.useraction = Keine; es handelt sich um eine Informationsnachricht. Durchsuchen Sie das Information Center nach dem Stichwort 'jm41140_', um weitere Informationen zu erhalten.

JMSFMQ6317 = Der Modus BrokerControlQ ''{0}'' kann nicht ge\u00f6ffnet werden, daher ist der Normalmodus f\u00fcr die Publish/Subscribe-Funktion erforderlich.
JMSFMQ6317.inserts = XMSC_INSERT_TYPE
JMSFMQ6317.explanation = Basierend auf dem Publish/Subscribe-Modus des Warteschlangenmanagers wurde eine Entscheidung zur Verwendung des Modus Normal oder Migration getroffen.
JMSFMQ6317.useraction = Keine; es handelt sich um eine Informationsnachricht. Durchsuchen Sie das Information Center nach dem Stichwort 'jm41140_', um weitere Informationen zu erhalten.

JMSFMQ6318 = Fehler bei der Integration mit der WMQ-Server-Trace-Steuerung ''{0}''.
JMSFMQ6318.inserts = Ausnahmebedingung
JMSFMQ6318.explanation = Eine Verbindung zum WMQ Server-Trace war nicht m\u00f6glich.
JMSFMQ6318.useraction = \u00dcberpr\u00fcfen Sie den Klassenpfad, um sicherzustellen, dass 'com.ibm.mq.commonservices.jar' vorhanden ist.
