# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
#

JMSFMQ0001 = \u63a5\u7d9a\u30e2\u30fc\u30c9 ''{0}'' \u306f XA \u63a5\u7d9a\u3067\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSFMQ0001.explanation = \u3059\u3079\u3066\u306e\u63a5\u7d9a\u30e2\u30fc\u30c9\u304c\u63a5\u7d9a\u306e\u5404\u30bf\u30a4\u30d7\u306b\u3088\u308a\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u308b\u308f\u3051\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002 XA \u306b\u306f\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30fb\u30e2\u30fc\u30c9\u63a5\u7d9a\u304c\u5fc5\u8981\u3067\u3059\u3002
JMSFMQ0001.useraction = \u63a5\u7d9a\u30e2\u30fc\u30c9\u3092\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u5024\u306b\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSFMQ0001.inserts = XMSC_WMQ_CONNECTION_MODE

JMSFMQ0003 = \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u30fb\u30b3\u30de\u30f3\u30c9\u30fb\u30ec\u30d9\u30eb ''{0}'' \u304c\u3001\u8981\u6c42\u3055\u308c\u305f\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306e\u30d0\u30fc\u30b8\u30e7\u30f3 ''{1}'' \u3068\u4e00\u81f4\u3057\u307e\u305b\u3093\u3067\u3057\u305f\u3002
JMSFMQ0003.explanation = \u63a5\u7d9a\u30d5\u30a1\u30af\u30c8\u30ea\u30fc\u306b\u6307\u5b9a\u3055\u308c\u305f\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u304c\u3001\u8981\u6c42\u3055\u308c\u305f\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u3068\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002 \u300c\u672a\u6307\u5b9a\u306e\u300d\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u30fb\u30d0\u30fc\u30b8\u30e7\u30f3\u304c\u3001\u901a\u5e38\u30e2\u30fc\u30c9\u3067\u306e\u63a5\u7d9a\u3092\u8a66\u884c\u3057\u307e\u3059\u3002 
JMSFMQ0003.useraction = \u4e00\u81f4\u3059\u308b\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u3092\u9078\u629e\u3059\u308b\u304b\u3001\u307e\u305f\u306f\u8981\u6c42\u3057\u305f\u30b3\u30de\u30f3\u30c9\u30fb\u30ec\u30d9\u30eb\u3092\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSFMQ0003.inserts = XMSC_INSERT_COMMAND_LEVEL, XMSC_WMQ_PROVIDER_VERSION

JMSFMQ0004 = \u5171\u6709\u4f1a\u8a71\u30c1\u30e3\u30cd\u30eb\u5024 ''{0}'' \u306f\u3001\u8981\u6c42\u3055\u308c\u305f\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306e\u30d0\u30fc\u30b8\u30e7\u30f3 ''{1}'' \u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSFMQ0004.explanation = \u5171\u6709\u4f1a\u8a71\u30c1\u30e3\u30cd\u30eb\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306b\u6307\u5b9a\u3055\u308c\u305f\u5024\u304c\u3001\u8981\u6c42\u3055\u308c\u305f\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306e\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u30fb\u30d0\u30fc\u30b8\u30e7\u30f3\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002 \u300c\u672a\u6307\u5b9a\u306e\u300d\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u30fb\u30d0\u30fc\u30b8\u30e7\u30f3\u304c\u3001\u901a\u5e38\u30e2\u30fc\u30c9\u3067\u306e\u63a5\u7d9a\u3092\u8a66\u884c\u3057\u307e\u3059\u3002
JMSFMQ0004.useraction = \u8981\u6c42\u3055\u308c\u305f\u8a2d\u5b9a\u3092\u30b5\u30dd\u30fc\u30c8\u3067\u304d\u308b\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u30fb\u30d0\u30fc\u30b8\u30e7\u30f3\u3092\u9078\u629e\u3059\u308b\u304b\u3001\u307e\u305f\u306f\u5171\u6709\u4f1a\u8a71\u8a2d\u5b9a\u3092\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u5024\u306b\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSFMQ0004.inserts = XMSC_INSERT_VALUE, XMSC_WMQ_PROVIDER_VERSION

JMSFMQ0005 = \u73fe\u5728\u306e\u74b0\u5883\u3067\u306f\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u63a5\u7d9a\u306e\u4f7f\u7528\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSFMQ0005.explanation = \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u63a5\u7d9a\u30e2\u30fc\u30c9\u306f\u3001\u3059\u3079\u3066\u306e\u74b0\u5883\u3067\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSFMQ0005.useraction = \u63a5\u7d9a\u30e2\u30fc\u30c9\u3092\u5909\u66f4\u3057\u3001\u30ed\u30fc\u30ab\u30eb\u30fb\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u3078\u306e\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u63a5\u7d9a\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSFMQ0007 = \u5024\u304c ''{1}'' \u306e\u4e0d\u660e\u306a\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc ''{0}'' \u304c\u63a5\u7d9a\u30d5\u30a1\u30af\u30c8\u30ea\u30fc\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u30fb\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306b\u8a2d\u5b9a\u3055\u308c\u307e\u3057\u305f\u3002
JMSFMQ0007.explanation = \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc ''{0}'' \u306f\u8a8d\u8b58\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u3053\u308c\u306f\u30ab\u30b9\u30bf\u30e0\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3067\u3042\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
JMSFMQ0007.useraction = \u3053\u308c\u304c\u30ab\u30b9\u30bf\u30e0\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u7528\u3067\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSFMQ0007.inserts = XMSC_INSERT_KEY, XMSC_INSERT_VALUE

JMSFMQ0010 = \u5024 ''{0}'' \u306f\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u69cb\u6210\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc ''{1}'' \u306b\u306f\u7121\u52b9\u3067\u3057\u305f\u3002\u5024\u306f\u7121\u8996\u3055\u308c\u307e\u3057\u305f\u3002
JMSFMQ0010.explanation = \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u69cb\u6210\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u6709\u52b9\u7bc4\u56f2\u5916\u306b\u8a2d\u5b9a\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002
JMSFMQ0010.useraction = \u8a2d\u5b9a\u3092\u5909\u66f4\u3057\u3066\u6709\u52b9\u306a\u5024\u3092\u542b\u3080\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u8a73\u3057\u304f\u306f\u3001\u8cc7\u6599\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSFMQ0010.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_NAME

JMSFMQ1006 = \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc ''{1}'' \u306e\u5024 ''{0}'' \u304c\u7121\u52b9\u3067\u3059\u3002
JMSFMQ1006.explanation = \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306b\u6307\u5b9a\u3055\u308c\u305f\u5024\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSFMQ1006.useraction = \u53d7\u3051\u5165\u308c\u3089\u308c\u308b\u7bc4\u56f2\u5185\u306e\u5024\u306b\u3001\u5024\u3092\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSFMQ1006.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_NAME

JMSFMQ1007 = \u30ea\u30a2\u30eb\u30bf\u30a4\u30e0\u30fb\u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8 ''{0}'' \u304b\u3089\u306e\u30ed\u30b0\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u3002
JMSFMQ1007.explanation = \u30ea\u30a2\u30eb\u30bf\u30a4\u30e0\u30fb\u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u304c\u30a8\u30e9\u30fc\u3092\u8a18\u9332\u3057\u307e\u3057\u305f\u3002
JMSFMQ1007.inserts = XMSC_REAL_TIME_LOG_MSG

JMSFMQ1056 = \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u307e\u305f\u306f\u30a8\u30ec\u30e1\u30f3\u30c8\u306e\u30c7\u30fc\u30bf\u30fb\u30bf\u30a4\u30d7 ''{0}'' \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSFMQ1056.explanation = \u3053\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u30c7\u30fc\u30bf\u30fb\u30bf\u30a4\u30d7\u306f\u3001\u3053\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u3067\u306f\u53d7\u3051\u5165\u308c\u3089\u308c\u307e\u305b\u3093\u3002  
JMSFMQ1056.useraction = \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u5909\u66f4\u3057\u3066\u3001\u53d7\u3051\u5165\u308c\u3089\u308c\u308b\u30bf\u30a4\u30d7\u306b\u306a\u308b\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSFMQ1056.inserts = XMSC_INSERT_NAME

JMSFMQ1105 = \u30ed\u30fc\u30ab\u30eb\u30fb\u30dd\u30fc\u30c8 ''{0}'' \u306f\u3001\u30de\u30eb\u30c1\u30ad\u30e3\u30b9\u30c8\u3092\u4f7f\u7528\u3059\u308b\u30d6\u30ed\u30fc\u30ab\u30fc\u3078\u306e\u76f4\u63a5\u63a5\u7d9a\u306b\u306f\u6307\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002
JMSFMQ1105.explanation = \u30dd\u30fc\u30c8\u756a\u53f7\u304c\u6307\u5b9a\u3055\u308c\u307e\u3057\u305f\u3002 \u3053\u308c\u306f\u30de\u30eb\u30c1\u30ad\u30e3\u30b9\u30c8\u306b\u306f\u7121\u52b9\u3067\u3059\u3002
JMSFMQ1105.useraction = \u30de\u30eb\u30c1\u30ad\u30e3\u30b9\u30c8\u306e\u30ed\u30fc\u30ab\u30eb\u30fb\u30a2\u30c9\u30ec\u30b9\u8a2d\u5b9a\u304b\u3089\u30dd\u30fc\u30c8\u53c2\u7167\u3092\u524a\u9664\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSFMQ1105.inserts = XMSC_WMQ_LOCAL_ADDRESS

JMSFMQ3032 = clientID \u306e\u30ea\u30bb\u30c3\u30c8\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSFMQ3032.explanation = \u63a5\u7d9a\u306e\u30af\u30e9\u30a4\u30a2\u30f3\u30c8 ID \u306f\u4e00\u5ea6\u3060\u3051\u3001\u305d\u306e\u63a5\u7d9a\u304c\u4f7f\u7528\u3055\u308c\u308b\u524d\u3060\u3051\u306b\u8a2d\u5b9a\u3067\u304d\u307e\u3059\u3002
JMSFMQ3032.useraction = \u63a5\u7d9a\u3092\u4f7f\u7528\u3059\u308b\u524d\u306b\u30af\u30e9\u30a4\u30a2\u30f3\u30c8 ID \u3092\u8a2d\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSFMQ3036 = \u30d6\u30ed\u30fc\u30ab\u30fc\u5074\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u9078\u629e\u306f IBM Integration Bus \u30d6\u30ed\u30fc\u30ab\u30fc\u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u306b\u306e\u307f\u6709\u52b9\u3067\u3059\u3002
JMSFMQ3036.explanation = \u30d6\u30ed\u30fc\u30ab\u30fc\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u3068\u30e1\u30c3\u30bb\u30fc\u30b8\u9078\u629e\u306f\u6574\u5408\u3057\u3066\u3044\u307e\u305b\u3093\u3002
JMSFMQ3036.useraction = ConnectionFactory \u3067\u30d6\u30ed\u30fc\u30ab\u30fc\u306e\u30d0\u30fc\u30b8\u30e7\u30f3 (JMSC.MQJMS_BROKER_V2) \u3092\u8a2d\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSFMQ3037 = \u30d6\u30ed\u30fc\u30ab\u30fc\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u3068\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u304c\u540c\u6642\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059 - \u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306e\u30d0\u30fc\u30b8\u30e7\u30f3 ''{0}'' \u306f\u30d6\u30ed\u30fc\u30ab\u30fc\u306e\u30d0\u30fc\u30b8\u30e7\u30f3 ''{1}'' \u3092\u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9\u3057\u307e\u3059\u3002
JMSFMQ3037.explanation = \u30d6\u30ed\u30fc\u30ab\u30fc\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u3068\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u3092\u540c\u6642\u306b\u8a2d\u5b9a\u3057\u3066\u306f\u306a\u308a\u307e\u305b\u3093\u3002
JMSFMQ3037.useraction = \u30d6\u30ed\u30fc\u30ab\u30fc\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u3068\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u306e\u4e21\u65b9\u3067\u306f\u306a\u304f\u3001\u3069\u3061\u3089\u304b\u304c ConnectionFactory \u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSFMQ3037.inserts = XMSC_WMQ_PROVIDER_VERSION, XMSC_WMQ_BROKER_VERSION

JMSFMQ6115 = TopicConnection \u306e\u4f5c\u6210\u4e2d\u306b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
JMSFMQ6115.useraction = \u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSFMQ6311 = \u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u5185\u306e\u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u30fb\u30bf\u30a4\u30d7 'DIRECT' \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSFMQ6311.explanation = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u30fb\u30e1\u30bd\u30c3\u30c9\u3092\u4f7f\u7528\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002 \u3053\u308c\u306f DirectIP \u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u30fb\u30bf\u30a4\u30d7\u3067\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSFMQ6311.useraction = \u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u3092\u4f7f\u7528\u3057\u306a\u3044\u3088\u3046\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSFMQ6312 = Java(tm) MQI \u3067\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
JMSFMQ6312.explanation = Java(tm) MQI \u306f\u554f\u984c\u3092\u8a18\u8ff0\u3059\u308b\u4f8b\u5916\u3092\u30b9\u30ed\u30fc\u3057\u307e\u3057\u305f\u3002 
JMSFMQ6312.useraction = \u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSFMQ6313 = \u30bf\u30a4\u30d7\u304c ''{0}'' \u306e WMQ \u63a5\u7d9a\u304c\u78ba\u7acb\u3055\u308c\u307e\u3057\u305f\u3002
JMSFMQ6313.inserts = XMSC_INSERT_VALUE
JMSFMQ6313.explanation = \u901a\u5e38\u30e2\u30fc\u30c9\u307e\u305f\u306f\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u30fb\u30e2\u30fc\u30c9\u306e\u63a5\u7d9a\u304c\u53ef\u80fd\u3067\u3059\u3002
JMSFMQ6313.useraction = \u3053\u308c\u304c\u4e88\u671f\u3057\u3066\u3044\u305f\u63a5\u7d9a\u30bf\u30a4\u30d7\u3067\u306f\u306a\u3044\u5834\u5408\u3001\u30a4\u30f3\u30d5\u30a9\u30e1\u30fc\u30b7\u30e7\u30f3\u30fb\u30bb\u30f3\u30bf\u30fc\u306e\u30c8\u30d4\u30c3\u30af jm41140_ \u304b\u3089\u8ffd\u52a0\u60c5\u5831\u3092\u691c\u7d22\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSFMQ6314 = \u63a5\u7d9a\u30d5\u30a1\u30af\u30c8\u30ea\u30fc\u63d0\u4f9b\u306e\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u30fb\u30d0\u30fc\u30b8\u30e7\u30f3 ''{0}'' \u304c\u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9\u3055\u308c\u3066 ''{1}'' \u306b\u306a\u308a\u307e\u3057\u305f\u3002
JMSFMQ6314.inserts = XMSC_WMQ_PROVIDER_VERSION,XMSC_INSERT_NAME
JMSFMQ6314.explanation = \u63a5\u7d9a\u30d5\u30a1\u30af\u30c8\u30ea\u30fc\u306e\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u30fb\u30d0\u30fc\u30b8\u30e7\u30f3\u306f\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u69cb\u6210\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306b\u3088\u3063\u3066\u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9\u53ef\u80fd\u3067\u3059\u3002
JMSFMQ6314.useraction = \u306a\u3057\u3002\u3053\u308c\u306f\u3001\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9\u3055\u308c\u305f\u3053\u3068\u3092\u793a\u3059\u60c5\u5831\u30e1\u30c3\u30bb\u30fc\u30b8\u3067\u3059\u3002

JMSFMQ6315 = \u30d6\u30ed\u30fc\u30ab\u30fc\u30fb\u30d0\u30fc\u30b8\u30e7\u30f3\u304c V2 \u306b\u8a2d\u5b9a\u3055\u308c\u3001\u63a5\u7d9a\u30d5\u30a1\u30af\u30c8\u30ea\u30fc\u4e2d\u306b BrokerQmgr \u304c\u5b58\u5728\u3059\u308b\u305f\u3081\u3001\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u30fb\u30d0\u30fc\u30b8\u30e7\u30f3\u304c\u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9\u3055\u308c\u3066 6.0.0.0 \u306b\u306a\u308a\u307e\u3057\u305f\u3002
JMSFMQ6315.explanation = \u63a5\u7d9a\u30d5\u30a1\u30af\u30c8\u30ea\u30fc\u306e\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u30fb\u30d0\u30fc\u30b8\u30e7\u30f3\u304c\u3001\u63a5\u7d9a\u30d5\u30a1\u30af\u30c8\u30ea\u30fc\u4e2d\u306e\u4ed6\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306b\u57fa\u3065\u3044\u3066\u5909\u66f4\u3055\u308c\u307e\u3057\u305f\u3002
JMSFMQ6315.useraction = \u306a\u3057\u3002\u3053\u308c\u306f\u3001\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9\u3055\u308c\u305f\u3053\u3068\u3092\u793a\u3059\u60c5\u5831\u30e1\u30c3\u30bb\u30fc\u30b8\u3067\u3059\u3002

JMSFMQ6316 = \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306e\u30d1\u30d6\u30ea\u30c3\u30b7\u30e5\u30fb\u30b5\u30d6\u30b9\u30af\u30e9\u30a4\u30d6\u30fb\u30e2\u30fc\u30c9\u306f ''{0}'' \u30e2\u30fc\u30c9\u3067\u3042\u308b\u305f\u3081\u3001\u30d1\u30d6\u30ea\u30c3\u30b7\u30e5\u30fb\u30b5\u30d6\u30b9\u30af\u30e9\u30a4\u30d6\u6a5f\u80fd\u306e\u305f\u3081\u306b ''{1}'' \u304c\u5fc5\u8981\u3067\u3059\u3002
JMSFMQ6316.inserts = XMSC_INSERT_TYPE,XMSC_INSERT_OTHER_TYPE
JMSFMQ6316.explanation = \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306e\u30d1\u30d6\u30ea\u30c3\u30b7\u30e5\u30fb\u30b5\u30d6\u30b9\u30af\u30e9\u30a4\u30d6\u30fb\u30e2\u30fc\u30c9\u306b\u57fa\u3065\u3044\u3066\u3001\u901a\u5e38\u30e2\u30fc\u30c9\u307e\u305f\u306f\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u30fb\u30e2\u30fc\u30c9\u306e\u3044\u305a\u308c\u304b\u306e\u4f7f\u7528\u306b\u95a2\u3059\u308b\u6c7a\u5b9a\u304c\u306a\u3055\u308c\u307e\u3057\u305f\u3002
JMSFMQ6316.useraction = \u306a\u3057\u3002\u3053\u308c\u306f\u60c5\u5831\u30e1\u30c3\u30bb\u30fc\u30b8\u3067\u3059\u3002 \u30a4\u30f3\u30d5\u30a9\u30e1\u30fc\u30b7\u30e7\u30f3\u30fb\u30bb\u30f3\u30bf\u30fc\u306e\u30c8\u30d4\u30c3\u30af jm41140_ \u304b\u3089\u8ffd\u52a0\u60c5\u5831\u3092\u691c\u7d22\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSFMQ6317 = BrokerControlQ ''{0}'' \u30e2\u30fc\u30c9\u3092\u958b\u304f\u3053\u3068\u304c\u3067\u304d\u306a\u3044\u305f\u3081\u3001\u30d1\u30d6\u30ea\u30c3\u30b7\u30e5\u30fb\u30b5\u30d6\u30b9\u30af\u30e9\u30a4\u30d6\u6a5f\u80fd\u306e\u305f\u3081\u306b\u901a\u5e38\u30e2\u30fc\u30c9\u304c\u5fc5\u8981\u3067\u3059\u3002
JMSFMQ6317.inserts = XMSC_INSERT_TYPE
JMSFMQ6317.explanation = \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306e\u30d1\u30d6\u30ea\u30c3\u30b7\u30e5\u30fb\u30b5\u30d6\u30b9\u30af\u30e9\u30a4\u30d6\u30fb\u30e2\u30fc\u30c9\u306b\u57fa\u3065\u3044\u3066\u3001\u901a\u5e38\u30e2\u30fc\u30c9\u307e\u305f\u306f\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u30fb\u30e2\u30fc\u30c9\u306e\u3044\u305a\u308c\u304b\u306e\u4f7f\u7528\u306b\u95a2\u3059\u308b\u6c7a\u5b9a\u304c\u306a\u3055\u308c\u307e\u3057\u305f\u3002
JMSFMQ6317.useraction = \u306a\u3057\u3002\u3053\u308c\u306f\u60c5\u5831\u30e1\u30c3\u30bb\u30fc\u30b8\u3067\u3059\u3002 \u30a4\u30f3\u30d5\u30a9\u30e1\u30fc\u30b7\u30e7\u30f3\u30fb\u30bb\u30f3\u30bf\u30fc\u306e\u30c8\u30d4\u30c3\u30af jm41140_ \u304b\u3089\u8ffd\u52a0\u60c5\u5831\u3092\u691c\u7d22\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSFMQ6318 = WMQ \u30b5\u30fc\u30d0\u30fc\u30fb\u30c8\u30ec\u30fc\u30b9\u30fb\u30b3\u30f3\u30c8\u30ed\u30fc\u30eb ''{0}'' \u3068\u7d71\u5408\u3067\u304d\u307e\u305b\u3093\u3002
JMSFMQ6318.inserts = \u4f8b\u5916
JMSFMQ6318.explanation = WMQ \u30b5\u30fc\u30d0\u30fc\u30fb\u30c8\u30ec\u30fc\u30b9\u306b\u63a5\u7d9a\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
JMSFMQ6318.useraction = \u30af\u30e9\u30b9\u30d1\u30b9\u3092\u8abf\u3079\u3066\u3001com.ibm.mq.commonservices.jar \u304c\u5b58\u5728\u3059\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
