# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
#

# JMSWMQ0002 is a WMQException message so no .inserts needed
JMSWMQ0002 = Diagn\u00f3sticos adicionales proporcionados por MQSTAT: c\u00f3digo de terminaci\u00f3n ''{0}'' c\u00f3digo de raz\u00f3n ''{1}'' nombre de objeto ''{2}'' nombre de objeto resuelto ''{3}'' tipo de objeto ''{4}'' nombre de gestor de colas ''{5}'' nombre de gestor de colas resuelto ''{6}'' n\u00famero de errores de transferencia ''{7}'' n\u00famero correcto de transferencias ''{8}'' n\u00famero de avisos de transferencia ''{9}''.

JMSWMQ0003 = El nivel de mandato del gestor de colas ''{0}'' no coincid\u00eda con la versi\u00f3n de proveedor solicitada ''{1}''.
JMSWMQ0003.inserts = XMSC_INSERT_COMMAND_LEVEL, XMSC_WMQ_PROVIDER_VERSION

JMSWMQ0006 = IBM MQ classes for JMS intenta utilizar un tipo de datos no soportado por un mensaje o intenta leer datos del tipo incorrecto.
JMSWMQ0006.explanation = Se han utilizado tipos de datos incorrectos para leer tipos de propiedades de mensaje.
JMSWMQ0006.useraction = Compruebe que el mensaje recibido y las propiedades que se han de leer son del tipo esperado.
JMSWMQ0006.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSWMQ0007 = IBM MQ classes for JMS intenta utilizar un tipo de datos no soportado por un mensaje o intenta leer datos del tipo incorrecto.
JMSWMQ0007.explanation = Se han utilizado tipos de datos incorrectos para leer tipos de propiedades de mensaje.
JMSWMQ0007.useraction = Compruebe que el mensaje recibido y las propiedades que se han de leer son del tipo esperado.
JMSWMQ0007.exception = com.ibm.msg.client.jms.DetailedMessageNotReadableException

JMSWMQ0008 = IBM MQ classes for JMS intenta utilizar un tipo de datos no soportado por un mensaje o intenta grabar datos del tipo incorrecto.
JMSWMQ0008.explanation = Se han utilizado tipos de datos incorrectos para escribir tipos de propiedades de mensaje.
JMSWMQ0008.useraction = Compruebe que el mensaje recibido y las propiedades que se han de escribir son del tipo esperado.
JMSWMQ0008.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSWMQ0009 = IBM MQ classes for JMS no puede asignar los recursos necesarios para un m\u00e9todo.
JMSWMQ0009.explanation = Los recursos de la m\u00e1quina pueden estar sobrecargados; la excepci\u00f3n enlazada puede proporcionar m\u00e1s informaci\u00f3n.
JMSWMQ0009.useraction = Compruebe los recursos y la carga del sistema.
JMSWMQ0009.exception = com.ibm.msg.client.jms.DetailedResourceAllocationException

JMSWMQ0010 = No se ha podido obtener el nivel de mandato del gestor de colas ''{0}''.
JMSWMQ0010.useraction = Consulte la excepci\u00f3n enlazada para obtener m\u00e1s informaci\u00f3n.
JMSWMQ0010.inserts = XMSC_INSERT_QUEUE_MANAGER

JMSWMQ0011 = No se ha podido inicializar la interfaz Java(tm) para la MQI ''{0}''.
JMSWMQ0011.useraction = Consulte la excepci\u00f3n enlazada para obtener m\u00e1s informaci\u00f3n.
JMSWMQ0011.inserts = XMSC_INSERT_EXCEPTION

JMSWMQ0013 = No se ha podido poner en cola el trabajo.
JMSWMQ0013.useraction = Consulte la excepci\u00f3n enlazada para obtener m\u00e1s informaci\u00f3n.

JMSWMQ0014 = No se puede convertir un valor nulo a un valor de tipo byte, int, short o long.
JMSWMQ0014.exception = java.lang.NumberFormatException

JMSWMQ0015 = No se puede convertir un valor nulo a un valor de tipo character, double o float.
JMSWMQ0015.exception = java.lang.NullPointerException

JMSWMQ0016 = La serializaci\u00f3n del objeto ha fallado.
JMSWMQ0016.useraction = Consulte la causa del error para obtener m\u00e1s informaci\u00f3n.
JMSWMQ0016.exception = java.lang.IOException

JMSWMQ0017 = Fin de secuencia.
JMSWMQ0017.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSWMQ0018 = No se ha podido conectar con el gestor de colas ''{0}'' con modalidad de conexi\u00f3n ''{1}'' y nombre de host ''{2}''.
JMSWMQ0018.useraction = Compruebe que el gestor de colas est\u00e9 iniciado y, si se est\u00e1 ejecutando en modalidad de cliente, compruebe que haya un escucha en ejecuci\u00f3n. Consulte la excepci\u00f3n enlazada para obtener m\u00e1s informaci\u00f3n.
JMSWMQ0018.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_HOST_NAME

JMSWMQ0019 = No se ha podido desconectar del gestor de colas ''{0}'' utilizando modalidad de conexi\u00f3n ''{1}'' y nombre de host ''{2}''.
JMSWMQ0019.useraction = Consulte la excepci\u00f3n enlazada para obtener m\u00e1s informaci\u00f3n.
JMSWMQ0019.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_HOST_NAME

JMSWMQ0020 = No se ha podido registrar la devoluci\u00f3n de llamada utilizando MQCB para el destino ''{0}''.
JMSWMQ0020.useraction = Consulte la excepci\u00f3n enlazada para obtener m\u00e1s informaci\u00f3n.
JMSWMQ0020.inserts = XMSC_DESTINATION_NAME

JMSWMQ0021 = No se ha podido anular el registro de la devoluci\u00f3n de llamada utilizando MQCB para el destino ''{0}''.
JMSWMQ0021.useraction = Consulte la excepci\u00f3n enlazada para obtener m\u00e1s informaci\u00f3n.
JMSWMQ0021.inserts = XMSC_DESTINATION_NAME

JMSWMQ0022 = No se ha podido iniciar el consumo de mensajes utilizando MQCTL para el destino ''{0}''.
JMSWMQ0022.useraction = Consulte la excepci\u00f3n enlazada para obtener m\u00e1s informaci\u00f3n.
JMSWMQ0022.inserts = XMSC_DESTINATION_NAME

JMSWMQ0023 = No se ha podido suspender el consumo de mensajes utilizando MQCTL para el destino ''{0}''.
JMSWMQ0023.useraction = Consulte la excepci\u00f3n enlazada para obtener m\u00e1s informaci\u00f3n.
JMSWMQ0023.inserts = XMSC_DESTINATION_NAME

JMSWMQ0024 = No se ha podido reanudar el consumo de mensajes utilizando MQCTL para el destino ''{0}''.
JMSWMQ0024.useraction = Consulte la excepci\u00f3n enlazada para obtener m\u00e1s informaci\u00f3n.
JMSWMQ0024.inserts = XMSC_DESTINATION_NAME

JMSWMQ0025 = No se ha podido anular la suscripci\u00f3n del tema ''{0}'' utilizando MQCLOSE.
JMSWMQ0025.explanation = Puede que haya habido un problema al eliminar la suscripci\u00f3n porque est\u00e1 siendo utilizada por un consumidor de mensajes.
JMSWMQ0025.useraction = Aseg\u00farese de que todos los consumidores de mensajes que utilicen esta suscripci\u00f3n est\u00e9n cerrados antes de anular la suscripci\u00f3n. Consulte la excepci\u00f3n enlazada para obtener m\u00e1s informaci\u00f3n.
JMSWMQ0025.inserts = XMSC_DESTINATION_NAME

JMSWMQ0026 = No se ha podido suscribir al tema ''{0}'' con el selector ''{1}'' utilizando MQSUB.
JMSWMQ0026.explanation = Puede que haya habido un problema al crear la suscripci\u00f3n debido a que otro consumidor de mensajes la est\u00e9 utilizando.
JMSWMQ0026.useraction = Aseg\u00farese de que todos los consumidores de mensajes que utilicen esta suscripci\u00f3n est\u00e9n cerrados antes de intentar crear una nueva suscripci\u00f3n con el mismo nombre. Consulte la excepci\u00f3n enlazada para obtener m\u00e1s informaci\u00f3n.
JMSWMQ0026.inserts = XMSC_DESTINATION_NAME, XMSC_SELECTOR_STRING

# The insert for this message is CommonConstants.WMQ_ENCODING = "encoding".
# If WMQ_ENCODING is changed then this value here must also be changed.
JMSWMQ0027 = El mensaje contiene una codificaci\u00f3n incorrecta ''{0}''.
JMSWMQ0027.explanation = Se ha recibido un mensaje con una cabecera mal formada. La codificaci\u00f3n debe ser normal o inversa.
JMSWMQ0027.useraction = Aseg\u00farese de que las aplicaciones no JMS que construyan mensajes creen cabeceras bien formadas.
JMSWMQ0027.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSWMQ0027.inserts = encoding

JMSWMQ0028 = Al menos un mensaje de transferencia as\u00edncrona ha fallado o ha emitido un aviso.
JMSWMQ0028.explanation = Cuando un mensaje se transfiere de forma as\u00edncrona, no se informa de ning\u00fan problema como excepciones emitidas desde el m\u00e9todo send(). En su lugar, se pasan al escucha de excepciones, si hay uno definido. El escucha de excepciones se dirige al punto de sincronismo para sesiones con transacciones, o a cada transferencia as\u00edncrona SEND_CHECK_COUNT para sesiones sin transacciones.
JMSWMQ0028.useraction = Consulte la excepci\u00f3n enlazada para obtener m\u00e1s informaci\u00f3n sobre las anomal\u00edas y/o los avisos.

JMSWMQ0029 = No se ha podido enviar un mensaje de informe a la cola replyTo ''{0}''. 
JMSWMQ0029.useraction = Consulte la excepci\u00f3n enlazada para obtener m\u00e1s informaci\u00f3n sobre las anomal\u00edas y/o los avisos.
JMSWMQ0029.inserts = XMSC_DESTINATION_NAME

JMSWMQ0030 = ''{0}'' ha fallado para el destino ''{1}'' al manejar un mensaje da\u00f1ado. 
JMSWMQ0030.explanation = Al volver a poner en cola un mensaje da\u00f1ado, ''{0}'' ha fallado cuando se ha invocado para el destino ''{1}''.  
JMSWMQ0030.useraction = Consulte la excepci\u00f3n enlazada para obtener m\u00e1s informaci\u00f3n sobre las anomal\u00edas y/o los avisos.
JMSWMQ0030.inserts = XMSC_INSERT_METHOD, XMSC_DESTINATION_NAME

JMSWMQ0031 = ''{0}'' ha fallado para el gestor de colas al manejar un mensaje da\u00f1ado. 
JMSWMQ0031.explanation = Al volver a poner en cola un mensaje da\u00f1ado, ''{0}'' ha fallado al intentar obtener informaci\u00f3n sobre el gestor de colas.  
JMSWMQ0031.useraction = Consulte la excepci\u00f3n enlazada para obtener m\u00e1s informaci\u00f3n sobre las anomal\u00edas y/o los avisos.
JMSWMQ0031.inserts = XMSC_INSERT_METHOD

JMSWMQ0032 = No hay ninguna cola de mensajes no entregados definida.
JMSWMQ0032.explanation = IBM MQ classes for JMS ha intentado transferir un mensaje da\u00f1ado a la cola de mensajes no entregados porque no se pudo direccionar a la cola de reintentos de restituci\u00f3n. Este intento ha fallado porque no hab\u00eda ninguna cola de mensajes no entregados definida para el gestor de colas. 
JMSWMQ0032.useraction = Defina una cola de mensajes no entregados.

JMSWMQ0033 = El nombre de reposici\u00f3n en cola para restituci\u00f3n para el destino ''{0}'' no se puede convertir del ID de juego de caracteres codificado ''{1}'' del gestor de colas.
JMSWMQ0033.useraction = Compruebe el nombre de reposici\u00f3n en cola para restituci\u00f3n y el ID de juego de caracteres codificado del gestor de colas. 
JMSWMQ0033.inserts = XMSC_DESTINATION_NAME, CCSID

JMSWMQ0034 = El nombre de cola de mensajes no entregados no se puede convertir del ID de juego de caracteres codificado ''{0}'' del gestor de colas.
JMSWMQ0034.useraction = Compruebe el nombre de cola de mensajes no entregados y el ID de juego de caracteres codificado del gestor de colas.
JMSWMQ0034.inserts = CCSID

JMSWMQ0035 = No se ha podido grabar en la cola de mensajes no entregados debido a la excepci\u00f3n ''{0}''.
JMSWMQ0035.explanation = IBM MQ classes for JMS no ha podido volver a poner en cola un mensaje en la cola de mensajes no entregados.
JMSWMQ0035.inserts = XMSC_INSERT_EXCEPTION

JMSWMQ0036 = Los Recursos del servidor de aplicaciones han capturado la excepci\u00f3n ''{0}''.
JMSWMQ0036.explanation = El examinador de conexiones de IBM MQ classes for JMS ha capturado una excepci\u00f3n.
JMSWMQ0036.inserts = XMSC_INSERT_EXCEPTION

JMSWMQ0037 = Un mensaje da\u00f1ado no se ha podido manejar debido a la excepci\u00f3n ''{0}''.
JMSWMQ0037.explanation = El escucha de mensajes de IBM MQ classes for JMS ha capturado una excepci\u00f3n.
JMSWMQ0037.inserts = XMSC_INSERT_EXCEPTION

JMSWMQ1006 = El valor para ''{0}'':''{1}'' no es v\u00e1lido.
JMSWMQ1006.explanation = El valor ''{1}'' para la propiedad ''{0}'' no es correcto.
JMSWMQ1006.useraction = Consulte el c\u00f3digo de raz\u00f3n y el c\u00f3digo de terminaci\u00f3n de la excepci\u00f3n enlazada de IBM MQ.
JMSWMQ1006.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_VALUE

JMSWMQ1017 = cola MQ no local ''{0}'' no v\u00e1lida para recibir o examinar.
JMSWMQ1017.explanation = La cola MQ no puede abrirse puesto que no es local respecto al gestor de colas conectado. 
JMSWMQ1017.useraction = Con\u00e9ctese al gestor de colas en la que esta cola MQ reside localmente.
JMSWMQ1017.inserts = XMSC_DESTINATION_NAME

JMSWMQ1029 = El nombre de propiedad es nulo.
JMSWMQ1029.explanation = El m\u00e9todo itemExists() del mensaje de correlaci\u00f3n se ha invocado con un nombre de elemento nulo, o se ha utilizado una serie de nombre nula como argumento para un m\u00e9todo que recupera valores de propiedad por nombre de un mensaje JMS.
JMSWMQ1029.useraction = Aseg\u00farese de que las series de nombre indicadas no tengan valores nulos.

JMSWMQ1044 = La serie no es un n\u00famero hexadecimal v\u00e1lido - ''{0}''.
JMSWMQ1044.inserts = XMSC_INSERT_HEX_STRING
JMSWMQ1044.explanation = Se ha intentado especificar un ID de grupo o un ID de correlaci\u00f3n que empieza con el ID de prefijo pero no va seguido de un valor hexadecimal bien formado, o se ha intentado recibir un mensaje que contiene una propiedad MQRFH2 de tipo bin.hex que no tiene un valor hexadecimal bien formado.
JMSWMQ1044.useraction = Aseg\u00farese de que un valor hexadecimal siempre va seguido del ID de prefijo al establecer los valores de ID de grupo o ID de correlaci\u00f3n. Aseg\u00farese de que las cabeceras MQRFH2 generadas por aplicaciones no JMS est\u00e9n bien formadas.

JMSWMQ1046 = El juego de caracteres ''{0}'' no est\u00e1 soportado.
JMSWMQ1046.inserts = CCSID
JMSWMQ1046.explanation = Se ha intentado enviar o recibir un mensaje de correlaci\u00f3n, un mensaje de corriente de datos o un mensaje de texto cuyo cuerpo est\u00e1 codificado con un juego de caracteres no soportado por la JVM. En el caso de los mensajes de texto, esta excepci\u00f3n puede emitirse cuando el cuerpo del mensaje se consulta por primera vez, en vez de durante la recepci\u00f3n.
JMSWMQ1046.useraction = Cuando codifique un mensaje, utilice solamente un juego de caracteres que sepa que est\u00e1 disponible para la aplicaci\u00f3n receptora.
JMSWMQ1046.exception = com.ibm.msg.client.jms.DetailedMessageFormatException


JMSWMQ1051 = Detalles del mensaje

JMSWMQ1055 = La propiedad o elemento en el mensaje tiene un tipo de datos ''{0}'' incompatible con el m\u00e9todo utilizado para acceder a ella.
JMSWMQ1055.inserts = XMSC_INSERT_TYPE
JMSWMQ1055.explanation = El m\u00e9todo accesor utilizado para recuperar una propiedad de un mensaje JMS es incompatible con el tipo de propiedad que se recupera. Por ejemplo, intentar recuperar una propiedad de entero utilizando el m\u00e9todo getBooleanProperty().
JMSWMQ1055.useraction = Utilice un m\u00e9todo accesor que la especificaci\u00f3n de JMS defina como capaz de recuperar valores de propiedad del tipo requerido.
JMSWMQ1055.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSWMQ1059 = Error muy grave - UTF-8 no est\u00e1 soportada.
JMSWMQ1059.explanation = El entorno de ejecuci\u00f3n Java(tm) que est\u00e1 utilizando no da soporte a la codificaci\u00f3n de caracteres UTF-8. JMS requiere soporte para esta codificaci\u00f3n para realizar algunas operaciones.
JMSWMQ1059.useraction = Consulte la documentaci\u00f3n y/o el proveedor de su entorno de ejecuci\u00f3n Java(tm) para determinar c\u00f3mo obtener soporte para la codificaci\u00f3n de caracteres UTF-8.
JMSWMQ1059.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSWMQ1067 = El tiempo de espera ''{0}'' no es v\u00e1lido para IBM MQ classes for JMS.
JMSWMQ1067.explanation = Se ha intentado invocar el m\u00e9todo receive en un m\u00e9todo de QueueReceiver o TopicSubscriber, especificando un valor de tiempo de espera largo que no es v\u00e1lido.
JMSWMQ1067.useraction = Aseg\u00farese de que el valor de tiempo de espera no sea negativo y no sea superior al valor de Integer.MAX_VALUE.
JMSWMQ1067.inserts = XMSC_INSERT_TIMEOUT

JMSWMQ1068 = No se ha podido obtener el recurso XA.
JMSWMQ1068.explanation = IBM MQ classes for JMS no ha podido crear un recurso XA debido a un error.
JMSWMQ1068.useraction = Consulte la excepci\u00f3n XAException enlazada para obtener m\u00e1s informaci\u00f3n.

JMSWMQ1079 = No se ha podido grabar un mensaje en la cola de mensajes no entregados.
JMSWMQ1079.explanation = IBM MQ classes for JMS no ha podido volver a poner en cola un mensaje en la cola de mensajes no entregados.
JMSWMQ1079.useraction = Utilice la excepci\u00f3n enlazada para determinar la causa de este error. Si no hay ninguna excepci\u00f3n enlazada, compruebe que el gestor de colas tiene una cola de mensajes no entregados definida. Una vez que IBM MQ classes for JMS ha enviado un mensaje a la cola de mensajes no entregados, se puede utilizar el c\u00f3digo de raz\u00f3n almacenado en la MQDLH del mensaje para determinar por qu\u00e9 el mensaje se ha enviado all\u00ed.

JMSWMQ1080 = No se ha definido ninguna cola de reposici\u00f3n en cola para restituci\u00f3n.

JMSWMQ1096 = Una referencia de mensaje estaba formada incorrectamente.

JMSWMQ1107 = Ha surgido un problema con esta conexi\u00f3n.
JMSWMQ1107.explanation = Se ha producido un error con la conexi\u00f3n JMS de IBM MQ.
JMSWMQ1107.useraction = Utilice la excepci\u00f3n enlazada para determinar la causa de este error.

JMSWMQ1116 = El mensaje ''{0}'', que estaba en la cola ''{1}'' se ha trasladado a la cola de mensajes no entregados en el gestor de colas ''{2}''
JMSWMQ1116.explanation = Al ejecutar en la modalidad normal del proveedor de mensajer\u00eda de IBM MQ, se detect\u00f3 un mensaje que no se ha podido procesar. Puesto que el campo Informe en el MQMD para este mensaje inclu\u00eda la opci\u00f3n MQRO_DEAD_LETTER_Q, el mensaje se movi\u00f3 a la cola de mensajes no entregados. 
JMSWMQ1116.useraction = Consulte la cabecera de los mensajes no entregados en el mensaje en la cola de mensajes no entregados para determinar por qu\u00e9 no se ha podido procesar el mensaje. 
JMSWMQ1116.inserts = XMSC_INSERT_MESSAGE_ID, XMSC_INSERT_DESTINATION_NAME, XMSC_INSERT_QUEUE_MANAGER_NAME 

JMSWMQ1117 = El mensaje ''{0}'', que estaba en la cola ''{1}'' en el gestor de colas ''{2}'', no se puede procesar y se ha descartado.
JMSWMQ1117.explanation = Al ejecutar en la modalidad normal del proveedor de mensajer\u00eda de IBM MQ, se detect\u00f3 un mensaje que no se ha podido procesar. Puesto que el campo Informe en MQMD para este mensaje inclu\u00eda la opci\u00f3n MQRO_DISCARD_MSG, el mensaje se descart\u00f3. 
JMSWMQ1117.useraction = Modifique las aplicaciones que colocan mensajes en la cola especificada, de forma que el campo Informe en el MQMD para el mensaje contenga la opci\u00f3n MQRO_DEAD_LETTER_Q. As\u00ed se garantizar\u00e1 que cualquier mensaje posterior que no se puede procesar se trasladar\u00e1 a la cola de mensajes no entregados, en lugar se descartarse. Los mensajes de la cola de mensajes no entregados tendr\u00e1n una cabecera de mensajes no entregados, que contiene informaci\u00f3n sobre por qu\u00e9 no se ha podido procesar el mensaje.
JMSWMQ1117.inserts = XMSC_INSERT_MESSAGE_ID, XMSC_INSERT_DESTINATION_NAME, XMSC_INSERT_QUEUE_MANAGER_NAME 

JMSWMQ1118 = La cola ''{0}'' inhibida anteriormente para get se ha rehabilitado para get ya que el gestor de colas de IBM MQ ha respondido con el c\u00f3digo de raz\u00f3n ''2494'' (''MQRC_GET_ENABLED'')
JMSWMQ1118.explanation = Una cola a la que est\u00e1 conectado un consumidor est\u00e1 ahora disponible para obtener un mensaje.
JMSWMQ1118.useraction = Ninguna. Este mensaje es meramente informativo.
JMSWMQ1118.inserts = XMSC_INSERT_DESTINATION_NAME

JMSWMQ1119 = La cola ''{0}'' est\u00e1 inhibida actualmente para solicitudes get ya que el gestor de colas de IBM MQ ha respondido con un c\u00f3digo de raz\u00f3n ''2016'' (''MQRC_GET_INHIBITED'').
JMSWMQ1119.explanation = Una cola a la que est\u00e1 conectado un consumidor est\u00e1 ahora inhibida de solicitudes MQGET.
JMSWMQ1119.useraction = Espere hasta que el administrador de IBM MQ haya rehabilitado la cola para solicitudes MQGET. 
JMSWMQ1119.inserts = XMSC_INSERT_DESTINATION_NAME

# Same as JMSWMQ2003: queue variant.
JMSWMQ2000 = No se ha podido cerrar la cola ''{0}''.
JMSWMQ2000.explanation = JMS ha intentado cerrar un destino IBM MQ pero ha encontrado un error. El destino puede estar ya cerrado, u otra hebra puede estar realizando una MQGET mientras se llama a close().
JMSWMQ2000.useraction = Utilice la excepci\u00f3n enlazada para determinar la causa de este error. Tal vez pueda ejecutar el m\u00e9todo close() m\u00e1s adelante.
JMSWMQ2000.inserts = XMSC_DESTINATION_NAME

JMSWMQ2001 = No se ha podido cerrar el destino ''{0}'' utilizando una pol\u00edtica de cierre de lectura anticipada.
JMSWMQ2001.explanation = IBM MQ classes for JMS ha intentado cerrar un destino IBM MQ pero ha encontrado un error. La llamada de cierre ha excedido el tiempo de espera al intentar entregar todos los mensajes en la cola de lectura anticipada.
JMSWMQ2001.useraction = Compruebe que el escucha de mensajes no se est\u00e9 repitiendo en bucle. Tal vez pueda ejecutar el m\u00e9todo close() m\u00e1s adelante.
JMSWMQ2001.inserts = XMSC_DESTINATION_NAME

JMSWMQ2002 = No se ha podido obtener un mensaje del destino ''{0}''.
JMSWMQ2002.explanation = IBM MQ classes for JMS ha intentado realizar una operaci\u00f3n MQGET, pero IBM MQ ha informado de un error.
JMSWMQ2002.useraction = Utilice la excepci\u00f3n enlazada para determinar la causa de este error.
JMSWMQ2002.inserts = XMSC_DESTINATION_NAME

# Same as JMSWMQ2000: topic variant.
JMSWMQ2003 = No se ha podido cerrar el tema ''{0}''.
JMSWMQ2003.explanation = JMS ha intentado cerrar un destino IBM MQ pero ha encontrado un error. El destino puede estar ya cerrado, u otra hebra puede estar realizando una MQGET mientras se llama a close().
JMSWMQ2003.useraction = Utilice la excepci\u00f3n enlazada para determinar la causa de este error. Tal vez pueda ejecutar el m\u00e9todo close() m\u00e1s adelante.
JMSWMQ2003.inserts = XMSC_DESTINATION_NAME

# Same as JMSWMQ2008: topic variant.
JMSWMQ2006 = No se ha podido abrir el tema MQ ''{0}''.
JMSWMQ2006.explanation = JMS ha intentado realizar una operaci\u00f3n MQOPEN pero IBM MQ ha informado de un error.
JMSWMQ2006.useraction = Utilice la excepci\u00f3n enlazada para determinar la causa de este error. Compruebe que el tema especificado y el gestor de colas est\u00e1n definidos correctamente.
JMSWMQ2006.inserts = XMSC_DESTINATION_NAME

JMSWMQ2007 = No se ha podido enviar un mensaje al destino ''{0}''.
JMSWMQ2007.explanation = JMS ha intentado realizar una operaci\u00f3n MQPUT o MQPUT1, pero IBM MQ ha informado de un error.
JMSWMQ2007.useraction = Utilice la excepci\u00f3n enlazada para determinar la causa de este error.
JMSWMQ2007.inserts = XMSC_DESTINATION_NAME

# Same as JMSWMQ2006: queue variant.
JMSWMQ2008 = No se ha podido abrir la cola MQ ''{0}''.
JMSWMQ2008.explanation = JMS ha intentado realizar una operaci\u00f3n MQOPEN pero IBM MQ ha informado de un error.
JMSWMQ2008.useraction = Utilice la excepci\u00f3n enlazada para determinar la causa de este error. Compruebe que la cola especificada y el gestor de colas est\u00e1n definidos correctamente.
JMSWMQ2008.inserts = XMSC_DESTINATION_NAME

JMSWMQ2010 = El destino para la mensajer\u00eda persistente NPMCLASS HIGH ''{0}'' no era v\u00e1lido.
JMSWMQ2010.explanation = El destino especificado no da soporte a la mensajer\u00eda persistente NPMCLASS HIGH.
JMSWMQ2010.useraction = Utilice la herramienta de administraci\u00f3n JMS para habilitar la mensajer\u00eda persistente NPMCLASS HIGH para este destino.
JMSWMQ2010.inserts = XMSC_DESTINATION_NAME
JMSWMQ2010.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSWMQ2011 = No se ha podido abrir la suscripci\u00f3n duradera ''{0}'' para el destino ''{1}''.
JMSWMQ2011.explanation = JMS ha intentado crear una suscripci\u00f3n duradera pero el nombre de suscripci\u00f3n elegido ya se estaba utilizando dentro de la JVM.
JMSWMQ2011.useraction = Utilice un nombre de suscripci\u00f3n diferente para este suscriptor duradero o ejecute este suscriptor en otra JVM.
JMSWMQ2011.inserts = XMSC_INSERT_OBJECT, XMSC_DESTINATION_NAME
JMSWMQ2011.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSWMQ2012 = XACLOSE ha fallado.
JMSWMQ2012.explanation = Ha fallado el cierre del recurso XA al cerrar la sesi\u00f3n XA.
JMSWMQ2012.useraction = Consulte la excepci\u00f3n XAException enlazada para obtener informaci\u00f3n m\u00e1s detallada.

JMSWMQ2013 = La autenticaci\u00f3n de seguridad que se suministr\u00f3 para QueueManager ''{0}'' con modalidad de conexi\u00f3n ''{1}'' y nombre de host ''{2}'' no era v\u00e1lida.
JMSWMQ2013.useraction = Compruebe que el nombre de usuario y contrase\u00f1a suministrados son correctos en el Gestor de colas al que se est\u00e1 conectando.
JMSWMQ2013.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_HOST_NAME

JMSWMQ2014 = MQ envi\u00f3 un suceso as\u00edncrono con c\u00f3digo de terminaci\u00f3n ''{0}'' y raz\u00f3n ''{1}''.

JMSWMQ2016 = No se ha podido registrar ExceptionListener para Connection.
JMSWMQ2016.explanation = La llamada MQCB para registrar este ExceptionListener ha fallado.
JMSWMQ2016.useraction = Utilice la excepci\u00f3n enlazada para determinar la causa de este error.

JMSWMQ2017 = No se ha podido anular el registro de ExceptionListener para Connection.
JMSWMQ2017.explanation = La llamada MQCB para anular el registro de este ExceptionListener ha fallado.
JMSWMQ2017.useraction = Utilice la excepci\u00f3n enlazada para determinar la causa de este error.

# Log message
JMSWMQ2018 = Se ha hecho caso omiso de la excepci\u00f3n ya que no hay ning\u00fan escucha de excepciones registrado: ''{0}''.
JMSWMQ2018.explanation = Se ha intentado enviar una excepci\u00f3n al escucha de excepciones de la conexi\u00f3n pero no se hab\u00eda registrado un escucha.
JMSWMQ2018.useraction = Debe registrarse un escucha de excepciones con la conexi\u00f3n para recibir sus excepciones.
JMSWMQ2018.inserts = XMSC_INSERT_EXCEPTION

#Log message
JMSWMQ2019 = C\u00f3digo de terminaci\u00f3n inesperado ''{0}'', c\u00f3digo de raz\u00f3n ''{1}'' devueltos desde el m\u00e9todo ''{2}''.
JMSWMQ2019.explanation = No se esperaba el c\u00f3digo de raz\u00f3n, pero no se ha devuelto a la aplicaci\u00f3n.
JMSWMQ2019.useraction = Si la aplicaci\u00f3n experimenta errores, debe consultarse el c\u00f3digo de raz\u00f3n registrado para obtener m\u00e1s informaci\u00f3n sobre los errores.
JMSWMQ2019.inserts = XMSC_INSERT_COMP_CODE, XMSC_INSERT_REASON, XMSC_INSERT_METHOD

JMSWMQ2020 = No se ha podido conectar con el gestor de colas ''{0}'' con la modalidad de conexi\u00f3n ''{1}'' y el URL de CCDT suministrado ''{2}''; consulte la excepci\u00f3n enlazada para ver m\u00e1s informaci\u00f3n.
JMSWMQ2020.useraction = Compruebe que el gestor de colas est\u00e9 iniciado y, si se est\u00e1 ejecutando en modalidad de cliente, compruebe que haya un escucha en ejecuci\u00f3n. Consulte la excepci\u00f3n enlazada para obtener m\u00e1s informaci\u00f3n.
JMSWMQ2020.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_CCDTURL

JMSWMQ2021 = La autenticaci\u00f3n de seguridad que se suministr\u00f3 para el gestor de colas ''{0}'' con la modalidad de conexi\u00f3n ''{1}'' y el URL de CCDT suministrado ''{2}''; consulte la excepci\u00f3n enlazada para ver m\u00e1s informaci\u00f3n.
JMSWMQ2021.useraction = Compruebe que el nombre de usuario y contrase\u00f1a suministrados son correctos en el Gestor de colas al que se est\u00e1 conectando.
JMSWMQ2021.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_CCDTURL


JMSWMQ2022 = No se puede crear un Productor de mensajes o un Consumidor de mensajes con una cola modelo ''{0}'' como destino.
JMSWMQ2022.explanation = El Productor de mensajes o el Consumidor de mensajes no ha podido abrir el destino puesto que se trataba de una Cola modelo.
JMSWMQ2022.useraction = Cambie el Productor de mensajes o el Consumidor de mensajes de manera que utilice otro nombre de Cola de destino, que no sea una Cola modelo.
JMSWMQ2022.inserts = XMSC_DESTINATION_NAME

JMSWMQ2023 = Error al procesar el mensaje ''{0}'' con la excepci\u00f3n ''{1}'' con '' MQMD {2}''.
JMSWMQ2023.inserts = XMSC_MSG_DATA,XMSC_INSERT_EXCEPTION,XMSC_DATA

JMSWMQ2024 = No se ha podido enviar un mensaje al destino ''{0}''.
JMSWMQ2024.explanation = JMS ha intentado realizar una operaci\u00f3n MQPUT o MQPUT1, pero IBM MQ ha informado de un error.\n\
Puesto que se ha definido un retardo de entrega, el problema puede relacionarse con la cola que ha especificado la aplicaci\u00f3n \n\
o con la cola de transferencia de retardos de entregas 'SYSTEM.DDELAY.LOCAL.QUEUE'.
JMSWMQ2024.useraction = Utilice la excepci\u00f3n enlazada para determinar la causa de este error.
JMSWMQ2024.inserts = XMSC_DESTINATION_NAME

JMSWMQ2025 = No se ha podido suscribir al tema ''{0}'' con el nombre de suscripci\u00f3n ''{1}''.
JMSWMQ2025.explanation = Se intent\u00f3 abrir una suscripci\u00f3n compartida de una forma no compartida, o abrir una suscripci\u00f3n no compartida de una forma compartida.
JMSWMQ2025.useraction = Aseg\u00farese de que no existen suscripciones de un tipo compartido distinto antes de intentar crear una nueva suscripci\u00f3n bajo el mismo nombre.
JMSWMQ2025.inserts = XMSC_DESTINATION_NAME,XMSC_SUBSCRIPTION_NAME
