# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
#

# JMSWMQ0002 is a WMQException message so no .inserts needed
JMSWMQ0002 = \u7279\u5225\u306a\u8a3a\u65ad\u304c MQSTAT \u306b\u3088\u308a\u63d0\u4f9b\u3055\u308c\u3066\u3044\u307e\u3059: \u5b8c\u4e86\u30b3\u30fc\u30c9 ''{0}'' \u7406\u7531 ''{1}'' \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u540d ''{2}'' \u89e3\u6c7a\u6e08\u307f\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u540d ''{3}'' \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30fb\u30bf\u30a4\u30d7 ''{4}'' \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u540d ''{5}'' \u89e3\u6c7a\u6e08\u307f\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u540d ''{6}'' \u66f8\u304d\u8fbc\u307f\u5931\u6557\u6570 ''{7}'' \u66f8\u304d\u8fbc\u307f\u6210\u529f\u6570 ''{8}'' \u66f8\u304d\u8fbc\u307f\u8b66\u544a\u6570 ''{9}''\u3002

JMSWMQ0003 = \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u30fb\u30b3\u30de\u30f3\u30c9\u30fb\u30ec\u30d9\u30eb ''{0}'' \u304c\u3001\u8981\u6c42\u3055\u308c\u305f\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306e\u30d0\u30fc\u30b8\u30e7\u30f3 ''{1}'' \u3068\u4e00\u81f4\u3057\u307e\u305b\u3093\u3067\u3057\u305f\u3002
JMSWMQ0003.inserts = XMSC_INSERT_COMMAND_LEVEL, XMSC_WMQ_PROVIDER_VERSION

JMSWMQ0006 = IBM MQ \u30af\u30e9\u30b9 (JMS \u7528) \u304c\u30e1\u30c3\u30bb\u30fc\u30b8\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u30c7\u30fc\u30bf\u30fb\u30bf\u30a4\u30d7\u3092\u4f7f\u7528\u3057\u3088\u3046\u3068\u3057\u305f\u304b\u3001\u307e\u305f\u306f\u9593\u9055\u3063\u305f\u30bf\u30a4\u30d7\u306e\u30c7\u30fc\u30bf\u3092\u8aad\u307f\u53d6\u308d\u3046\u3068\u3057\u307e\u3057\u305f\u3002
JMSWMQ0006.explanation = \u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u30fb\u30bf\u30a4\u30d7\u306e\u8aad\u307f\u53d6\u308a\u306b\u4f7f\u7528\u3055\u308c\u305f\u30c7\u30fc\u30bf\u30fb\u30bf\u30a4\u30d7\u304c\u9593\u9055\u3063\u3066\u3044\u307e\u3059\u3002
JMSWMQ0006.useraction = \u53d7\u3051\u53d6\u308b\u30e1\u30c3\u30bb\u30fc\u30b8\u304a\u3088\u3073\u8aad\u307f\u53d6\u308b\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u30bf\u30a4\u30d7\u304c\u9069\u5207\u3067\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ0006.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSWMQ0007 = IBM MQ \u30af\u30e9\u30b9 (JMS \u7528) \u304c\u30e1\u30c3\u30bb\u30fc\u30b8\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u30c7\u30fc\u30bf\u30fb\u30bf\u30a4\u30d7\u3092\u4f7f\u7528\u3057\u3088\u3046\u3068\u3057\u305f\u304b\u3001\u307e\u305f\u306f\u9593\u9055\u3063\u305f\u30bf\u30a4\u30d7\u306e\u30c7\u30fc\u30bf\u3092\u8aad\u307f\u53d6\u308d\u3046\u3068\u3057\u307e\u3057\u305f\u3002
JMSWMQ0007.explanation = \u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u30fb\u30bf\u30a4\u30d7\u306e\u8aad\u307f\u53d6\u308a\u306b\u4f7f\u7528\u3055\u308c\u305f\u30c7\u30fc\u30bf\u30fb\u30bf\u30a4\u30d7\u304c\u9593\u9055\u3063\u3066\u3044\u307e\u3059\u3002
JMSWMQ0007.useraction = \u53d7\u3051\u53d6\u308b\u30e1\u30c3\u30bb\u30fc\u30b8\u304a\u3088\u3073\u8aad\u307f\u53d6\u308b\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u30bf\u30a4\u30d7\u304c\u9069\u5207\u3067\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ0007.exception = com.ibm.msg.client.jms.DetailedMessageNotReadableException

JMSWMQ0008 = IBM MQ \u30af\u30e9\u30b9 (JMS \u7528) \u304c\u30e1\u30c3\u30bb\u30fc\u30b8\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u30c7\u30fc\u30bf\u30fb\u30bf\u30a4\u30d7\u3092\u4f7f\u7528\u3057\u3088\u3046\u3068\u3057\u305f\u304b\u3001\u307e\u305f\u306f\u9593\u9055\u3063\u305f\u30bf\u30a4\u30d7\u306e\u30c7\u30fc\u30bf\u3092\u66f8\u304d\u8fbc\u3082\u3046\u3068\u3057\u307e\u3057\u305f\u3002
JMSWMQ0008.explanation = \u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u30fb\u30bf\u30a4\u30d7\u306e\u66f8\u304d\u8fbc\u307f\u306b\u4f7f\u7528\u3055\u308c\u305f\u30c7\u30fc\u30bf\u30fb\u30bf\u30a4\u30d7\u304c\u9593\u9055\u3063\u3066\u3044\u307e\u3059\u3002
JMSWMQ0008.useraction = \u53d7\u3051\u53d6\u308b\u30e1\u30c3\u30bb\u30fc\u30b8\u304a\u3088\u3073\u66f8\u304d\u8fbc\u3080\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u30bf\u30a4\u30d7\u304c\u9069\u5207\u3067\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ0008.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSWMQ0009 = IBM MQ \u30af\u30e9\u30b9 (JMS \u7528) \u304c\u30e1\u30bd\u30c3\u30c9\u306b\u5fc5\u8981\u306a\u30ea\u30bd\u30fc\u30b9\u3092\u5272\u308a\u632f\u308c\u307e\u305b\u3093\u3002
JMSWMQ0009.explanation = \u30de\u30b7\u30f3\u30fb\u30ea\u30bd\u30fc\u30b9\u304c\u904e\u8ca0\u8377\u3068\u306a\u3063\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u30ea\u30f3\u30af\u3055\u308c\u305f\u4f8b\u5916\u306b\u8a73\u3057\u3044\u60c5\u5831\u304c\u793a\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u304c\u3042\u308a\u307e\u3059\u3002
JMSWMQ0009.useraction = \u30b7\u30b9\u30c6\u30e0\u30fb\u30ea\u30bd\u30fc\u30b9\u304a\u3088\u3073\u8ca0\u8377\u3092\u8abf\u3079\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ0009.exception = com.ibm.msg.client.jms.DetailedResourceAllocationException

JMSWMQ0010 = \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc ''{0}'' \u306e\u30b3\u30de\u30f3\u30c9\u30fb\u30ec\u30d9\u30eb\u306e\u53d6\u5f97\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ0010.useraction = \u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ0010.inserts = XMSC_INSERT_QUEUE_MANAGER

JMSWMQ0011 = MQI ''{0}'' \u3078\u306e Java(tm) \u30a4\u30f3\u30bf\u30fc\u30d5\u30a7\u30fc\u30b9\u306e\u521d\u671f\u5316\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ0011.useraction = \u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ0011.inserts = XMSC_INSERT_EXCEPTION

JMSWMQ0013 = \u30b8\u30e7\u30d6\u306e\u30a8\u30f3\u30ad\u30e5\u30fc\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ0013.useraction = \u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSWMQ0014 = \u30cc\u30eb\u5024\u3092\u30d0\u30a4\u30c8\u3001int\u3001short\u3001\u307e\u305f\u306f long \u306b\u5909\u63db\u3067\u304d\u307e\u305b\u3093\u3002
JMSWMQ0014.exception = java.lang.NumberFormatException

JMSWMQ0015 = \u30cc\u30eb\u5024\u3092\u6587\u5b57\u3001double\u3001\u307e\u305f\u306f float \u306b\u5909\u63db\u3067\u304d\u307e\u305b\u3093\u3002
JMSWMQ0015.exception = java.lang.NullPointerException

JMSWMQ0016 = \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u76f4\u5217\u5316\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ0016.useraction = \u8a73\u3057\u304f\u306f\u3001\u539f\u56e0\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ0016.exception = java.lang.IOException

JMSWMQ0017 = \u30b9\u30c8\u30ea\u30fc\u30e0\u306e\u7d42\u4e86\u3002
JMSWMQ0017.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSWMQ0018 = \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc ''{0}'' \u306b\u63a5\u7d9a\u30e2\u30fc\u30c9 ''{1}'' \u304a\u3088\u3073\u30db\u30b9\u30c8\u540d ''{2}'' \u3067\u63a5\u7d9a\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
JMSWMQ0018.useraction = \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u958b\u59cb\u3057\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30fb\u30e2\u30fc\u30c9\u3067\u5b9f\u884c\u3057\u3066\u3044\u308b\u5834\u5408\u306b\u306f\u3001\u5b9f\u884c\u4e2d\u306e\u30ea\u30b9\u30ca\u30fc\u304c\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ0018.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_HOST_NAME

JMSWMQ0019 = \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc ''{0}'' \u3092\u63a5\u7d9a\u30e2\u30fc\u30c9 ''{1}'' \u304a\u3088\u3073\u30db\u30b9\u30c8\u540d ''{2}'' \u3092\u4f7f\u7528\u3057\u3066\u5207\u65ad\u3059\u308b\u3053\u3068\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ0019.useraction = \u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ0019.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_HOST_NAME

JMSWMQ0020 = \u5b9b\u5148 ''{0}'' \u306b\u5bfe\u3057\u3066 MQCB \u3092\u4f7f\u7528\u3057\u305f\u30b3\u30fc\u30eb\u30d0\u30c3\u30af\u306e\u767b\u9332\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ0020.useraction = \u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ0020.inserts = XMSC_DESTINATION_NAME

JMSWMQ0021 = \u5b9b\u5148 ''{0}'' \u306b\u5bfe\u3057\u3066 MQCB \u3092\u4f7f\u7528\u3057\u305f\u30b3\u30fc\u30eb\u30d0\u30c3\u30af\u306e\u767b\u9332\u89e3\u9664\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ0021.useraction = \u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ0021.inserts = XMSC_DESTINATION_NAME

JMSWMQ0022 = \u5b9b\u5148 ''{0}'' \u306b\u5bfe\u3057\u3066 MQCTL \u3092\u4f7f\u7528\u3057\u305f\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u30b3\u30f3\u30b7\u30e5\u30fc\u30e0\u306e\u958b\u59cb\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ0022.useraction = \u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ0022.inserts = XMSC_DESTINATION_NAME

JMSWMQ0023 = \u5b9b\u5148 ''{0}'' \u306b\u5bfe\u3057\u3066 MQCTL \u3092\u4f7f\u7528\u3057\u305f\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u30b3\u30f3\u30b7\u30e5\u30fc\u30e0\u306e\u4e2d\u65ad\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ0023.useraction = \u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ0023.inserts = XMSC_DESTINATION_NAME

JMSWMQ0024 = \u5b9b\u5148 ''{0}'' \u306b\u5bfe\u3057\u3066 MQCTL \u3092\u4f7f\u7528\u3057\u305f\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u30b3\u30f3\u30b7\u30e5\u30fc\u30e0\u306e\u518d\u958b\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ0024.useraction = \u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ0024.inserts = XMSC_DESTINATION_NAME

JMSWMQ0025 = MQCLOSE \u3092\u4f7f\u7528\u3057\u305f\u30c8\u30d4\u30c3\u30af ''{0}'' \u304b\u3089\u306e\u30a2\u30f3\u30b5\u30d6\u30b9\u30af\u30e9\u30a4\u30d6\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ0025.explanation = \u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u304c\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30b3\u30f3\u30b7\u30e5\u30fc\u30de\u30fc\u306b\u3088\u3063\u3066\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u305f\u3081\u306b\u3001\u305d\u308c\u3092\u9664\u53bb\u3059\u308b\u969b\u306b\u554f\u984c\u304c\u751f\u3058\u305f\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
JMSWMQ0025.useraction = \u30a2\u30f3\u30b5\u30d6\u30b9\u30af\u30e9\u30a4\u30d6\u3059\u308b\u524d\u306b\u3001\u3053\u306e\u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u3059\u3079\u3066\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30b3\u30f3\u30b7\u30e5\u30fc\u30de\u30fc\u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u308b\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ0025.inserts = XMSC_DESTINATION_NAME

JMSWMQ0026 = MQSUB \u3092\u4f7f\u7528\u3057\u3066\u3001\u30bb\u30ec\u30af\u30bf\u30fc ''{1}'' \u3092\u6307\u5b9a\u3057\u305f\u30c8\u30d4\u30c3\u30af ''{0}'' \u306e\u30b5\u30d6\u30b9\u30af\u30e9\u30a4\u30d6\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ0026.explanation = \u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u304c\u5225\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30b3\u30f3\u30b7\u30e5\u30fc\u30de\u30fc\u306b\u3088\u3063\u3066\u4f7f\u7528\u3055\u308c\u3066\u3044\u305f\u305f\u3081\u306b\u3001\u305d\u308c\u3092\u4f5c\u6210\u3059\u308b\u969b\u306b\u554f\u984c\u304c\u751f\u3058\u305f\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
JMSWMQ0026.useraction = \u540c\u3058\u540d\u524d\u306e\u65b0\u3057\u3044\u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u306e\u4f5c\u6210\u3092\u8a66\u307f\u308b\u524d\u306b\u3001\u3053\u306e\u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u3059\u3079\u3066\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30b3\u30f3\u30b7\u30e5\u30fc\u30de\u30fc\u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u308b\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ0026.inserts = XMSC_DESTINATION_NAME, XMSC_SELECTOR_STRING

# The insert for this message is CommonConstants.WMQ_ENCODING = "encoding".
# If WMQ_ENCODING is changed then this value here must also be changed.
JMSWMQ0027 = \u30e1\u30c3\u30bb\u30fc\u30b8\u306b\u306f\u6b63\u3057\u304f\u306a\u3044\u30a8\u30f3\u30b3\u30fc\u30c9 ''{0}'' \u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
JMSWMQ0027.explanation = \u6b63\u3057\u304f\u306a\u3044\u5f62\u5f0f\u306e\u30d8\u30c3\u30c0\u30fc\u3092\u6301\u3064\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u53d7\u3051\u53d6\u308a\u307e\u3057\u305f\u3002 \u30a8\u30f3\u30b3\u30fc\u30c9\u306f\u901a\u5e38\u307e\u305f\u306f\u9006\u65b9\u5411\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
JMSWMQ0027.useraction = \u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u4f5c\u6210\u3059\u308b\u3059\u3079\u3066\u306e\u975e JMS \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u6b63\u3057\u3044\u5f62\u5f0f\u306e\u30d8\u30c3\u30c0\u30fc\u3092\u4f5c\u6210\u3059\u308b\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ0027.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSWMQ0027.inserts = \u30a8\u30f3\u30b3\u30fc\u30c9

JMSWMQ0028 = \u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e\u975e\u540c\u671f\u66f8\u304d\u8fbc\u307f\u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u5931\u6557\u3057\u305f\u304b\u3001\u307e\u305f\u306f\u8b66\u544a\u3092\u51fa\u3057\u307e\u3057\u305f\u3002
JMSWMQ0028.explanation = \u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u975e\u540c\u671f\u3067\u66f8\u304d\u8fbc\u307e\u308c\u308b\u3068\u304d\u306b\u306f\u3001send() \u30e1\u30bd\u30c3\u30c9\u304b\u3089\u30b9\u30ed\u30fc\u3055\u308c\u308b\u4f8b\u5916\u3068\u3057\u3066\u554f\u984c\u304c\u5831\u544a\u3055\u308c\u308b\u3053\u3068\u306f\u3042\u308a\u307e\u305b\u3093\u3002 \u4ee3\u308f\u308a\u306b\u3001\u4f8b\u5916\u30ea\u30b9\u30ca\u30fc\u304c\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308c\u3070\u305d\u308c\u306b\u6e21\u3055\u308c\u307e\u3059\u3002 \u4f8b\u5916\u30ea\u30b9\u30ca\u30fc\u306f\u3001\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u5316\u3055\u308c\u305f\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u540c\u671f\u70b9\u3001\u307e\u305f\u306f\u975e\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u5316\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u3059\u3079\u3066\u306e SEND_CHECK_COUNT \u975e\u540c\u671f\u66f8\u304d\u8fbc\u307f\u3067\u5b9f\u884c\u3055\u308c\u307e\u3059\u3002
JMSWMQ0028.useraction = \u5931\u6557\u304a\u3088\u3073\u8b66\u544a\u3001\u307e\u305f\u306f\u305d\u306e\u3044\u305a\u308c\u304b\u306b\u3064\u3044\u3066\u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSWMQ0029 = replyTo \u30ad\u30e5\u30fc ''{0}'' \u3078\u306e\u30ec\u30dd\u30fc\u30c8\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u9001\u4fe1\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002 
JMSWMQ0029.useraction = \u5931\u6557\u304a\u3088\u3073\u8b66\u544a\u3001\u307e\u305f\u306f\u305d\u306e\u3044\u305a\u308c\u304b\u306b\u3064\u3044\u3066\u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ0029.inserts = XMSC_DESTINATION_NAME

JMSWMQ0030 = ''{0}'' \u306f\u6709\u5bb3\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u51e6\u7406\u6642\u306b\u5b9b\u5148 ''{1}'' \u3067\u5931\u6557\u3057\u307e\u3057\u305f\u3002 
JMSWMQ0030.explanation = \u6709\u5bb3\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u30ea\u30ad\u30e5\u30fc\u6642\u306b\u3001''{0}'' \u306f\u5b9b\u5148 ''{1}'' \u306e\u547c\u3073\u51fa\u3057\u3067\u5931\u6557\u3057\u307e\u3057\u305f\u3002  
JMSWMQ0030.useraction = \u5931\u6557\u304a\u3088\u3073\u8b66\u544a\u3001\u307e\u305f\u306f\u305d\u306e\u3044\u305a\u308c\u304b\u306b\u3064\u3044\u3066\u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ0030.inserts = XMSC_INSERT_METHOD, XMSC_DESTINATION_NAME

JMSWMQ0031 = ''{0}'' \u306f\u6709\u5bb3\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u51e6\u7406\u6642\u306b\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u3067\u5931\u6557\u3057\u307e\u3057\u305f\u3002 
JMSWMQ0031.explanation = \u6709\u5bb3\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u30ea\u30ad\u30e5\u30fc\u6642\u306b\u3001''{0}'' \u306f\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306b\u3064\u3044\u3066\u306e\u554f\u3044\u5408\u308f\u305b\u3092\u8a66\u884c\u3059\u308b\u3068\u304d\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002  
JMSWMQ0031.useraction = \u5931\u6557\u304a\u3088\u3073\u8b66\u544a\u3001\u307e\u305f\u306f\u305d\u306e\u3044\u305a\u308c\u304b\u306b\u3064\u3044\u3066\u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ0031.inserts = XMSC_INSERT_METHOD

JMSWMQ0032 = \u9001\u9054\u4e0d\u80fd\u30ad\u30e5\u30fc\u306f\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSWMQ0032.explanation = IBM MQ \u30af\u30e9\u30b9 (JMS \u7528) \u306f\u3001\u30d0\u30c3\u30af\u30a2\u30a6\u30c8\u518d\u8a66\u884c\u30ad\u30e5\u30fc\u306b\u7d4c\u8def\u6307\u5b9a\u3067\u304d\u306a\u304b\u3063\u305f\u305f\u3081\u306b\u3001\u6709\u5bb3\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u9001\u9054\u4e0d\u80fd\u30ad\u30e5\u30fc\u3078\u306e\u66f8\u304d\u8fbc\u307f\u3092\u8a66\u884c\u3057\u307e\u3057\u305f\u3002 \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306b\u5b9a\u7fa9\u3055\u308c\u305f\u9001\u9054\u4e0d\u80fd\u30ad\u30e5\u30fc\u304c\u5b58\u5728\u3057\u306a\u3044\u305f\u3081\u306b\u3001\u3053\u308c\u306f\u5931\u6557\u3057\u307e\u3057\u305f\u3002 
JMSWMQ0032.useraction = \u9001\u9054\u4e0d\u80fd\u30ad\u30e5\u30fc\u3092\u5b9a\u7fa9\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSWMQ0033 = \u5b9b\u5148 ''{0}'' \u306e\u30d0\u30c3\u30af\u30a2\u30a6\u30c8\u30fb\u30ea\u30ad\u30e5\u30fc\u540d\u306f\u3001\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306e\u30b3\u30fc\u30c9\u5316\u6587\u5b57\u30bb\u30c3\u30c8 ID ''{1}'' \u304b\u3089\u5909\u63db\u3067\u304d\u307e\u305b\u3093\u3002
JMSWMQ0033.useraction = \u30d0\u30c3\u30af\u30a2\u30a6\u30c8\u30fb\u30ea\u30ad\u30e5\u30fc\u540d\u304a\u3088\u3073\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306e\u30b3\u30fc\u30c9\u5316\u6587\u5b57\u30bb\u30c3\u30c8 ID \u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002 
JMSWMQ0033.inserts = XMSC_DESTINATION_NAME, CCSID

JMSWMQ0034 = \u9001\u9054\u4e0d\u80fd\u30ad\u30e5\u30fc\u540d\u306f\u3001\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306e\u30b3\u30fc\u30c9\u5316\u6587\u5b57\u30bb\u30c3\u30c8 ID ''{0}'' \u304b\u3089\u5909\u63db\u3067\u304d\u307e\u305b\u3093\u3002
JMSWMQ0034.useraction = \u9001\u9054\u4e0d\u80fd\u30ad\u30e5\u30fc\u540d\u304a\u3088\u3073\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306e\u30b3\u30fc\u30c9\u5316\u6587\u5b57\u30bb\u30c3\u30c8 ID \u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ0034.inserts = CCSID

JMSWMQ0035 = \u9001\u9054\u4e0d\u80fd\u30ad\u30e5\u30fc\u306f\u4f8b\u5916 ''{0}'' \u304c\u539f\u56e0\u3067\u66f8\u304d\u8fbc\u3080\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
JMSWMQ0035.explanation = IBM MQ \u30af\u30e9\u30b9 (JMS \u7528) \u306f\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u9001\u9054\u4e0d\u80fd\u30ad\u30e5\u30fc\u3078\u306e\u30ea\u30ad\u30e5\u30fc\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ0035.inserts = XMSC_INSERT_EXCEPTION

JMSWMQ0036 = Application Server Facilities \u306f\u4f8b\u5916 ''{0}'' \u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
JMSWMQ0036.explanation = IBM MQ \u30af\u30e9\u30b9 (JMS \u7528) \u306e\u63a5\u7d9a\u30d6\u30e9\u30a6\u30b6\u30fc\u304c\u4f8b\u5916\u3092\u691c\u51fa\u3057\u307e\u3057\u305f\u3002
JMSWMQ0036.inserts = XMSC_INSERT_EXCEPTION

JMSWMQ0037 = \u6709\u5bb3\u30e1\u30c3\u30bb\u30fc\u30b8\u306f\u4f8b\u5916 ''{0}'' \u304c\u539f\u56e0\u3067\u51e6\u7406\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
JMSWMQ0037.explanation = IBM MQ \u30af\u30e9\u30b9 (JMS \u7528) \u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30ea\u30b9\u30ca\u30fc\u304c\u4f8b\u5916\u3092\u691c\u51fa\u3057\u307e\u3057\u305f\u3002
JMSWMQ0037.inserts = XMSC_INSERT_EXCEPTION

JMSWMQ1006 = ''{0}'':''{1}'' \u306e\u5024\u304c\u7121\u52b9\u3067\u3059\u3002
JMSWMQ1006.explanation = \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc ''{0}'' \u306e\u5024 ''{1}'' \u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002
JMSWMQ1006.useraction = \u30ea\u30f3\u30af\u3055\u308c\u305f IBM MQ \u4f8b\u5916\u306e\u7406\u7531\u304a\u3088\u3073\u5b8c\u4e86\u30b3\u30fc\u30c9\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ1006.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_VALUE

JMSWMQ1017 = \u975e\u30ed\u30fc\u30ab\u30eb MQ \u30ad\u30e5\u30fc ''{0}'' \u306f\u53d7\u4fe1\u307e\u305f\u306f\u53c2\u7167\u3067\u306f\u7121\u52b9\u3067\u3059\u3002
JMSWMQ1017.explanation = MQ \u30ad\u30e5\u30fc\u306f\u63a5\u7d9a\u5148\u306e\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306b\u5bfe\u3057\u3066\u30ed\u30fc\u30ab\u30eb\u3067\u306f\u306a\u3044\u306e\u3067\u3001\u30aa\u30fc\u30d7\u30f3\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002 
JMSWMQ1017.useraction = \u3053\u306e MQ \u30ad\u30e5\u30fc\u304c\u30ed\u30fc\u30ab\u30eb\u306b\u5b58\u5728\u3059\u308b\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306b\u63a5\u7d9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ1017.inserts = XMSC_DESTINATION_NAME

JMSWMQ1029 = \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u540d\u304c\u30cc\u30eb\u3067\u3059\u3002
JMSWMQ1029.explanation = \u30de\u30c3\u30d7\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u306e itemExists() \u30e1\u30bd\u30c3\u30c9\u304c\u30cc\u30eb\u306e\u9805\u76ee\u540d\u3067\u547c\u3073\u51fa\u3055\u308c\u305f\u304b\u3001\u307e\u305f\u306f JMS \u30e1\u30c3\u30bb\u30fc\u30b8\u304b\u3089\u540d\u524d\u3067\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u5024\u3092\u53d6\u5f97\u3059\u308b\u30e1\u30bd\u30c3\u30c9\u3078\u306e\u5f15\u6570\u3068\u3057\u3066\u3001\u30cc\u30eb\u306e\u540d\u524d\u30b9\u30c8\u30ea\u30f3\u30b0\u304c\u4f7f\u7528\u3055\u308c\u307e\u3057\u305f\u3002
JMSWMQ1029.useraction = \u6307\u5b9a\u3055\u308c\u305f\u540d\u524d\u30b9\u30c8\u30ea\u30f3\u30b0\u306b\u30cc\u30eb\u5024\u304c\u306a\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSWMQ1044 = \u30b9\u30c8\u30ea\u30f3\u30b0\u306f\u6709\u52b9\u306a 16 \u9032\u6570\u3067\u306f\u3042\u308a\u307e\u305b\u3093 - ''{0}''\u3002
JMSWMQ1044.inserts = XMSC_INSERT_HEX_STRING
JMSWMQ1044.explanation = \u6307\u5b9a\u3057\u3088\u3046\u3068\u3057\u305f\u30b0\u30eb\u30fc\u30d7 ID \u307e\u305f\u306f\u76f8\u95a2 ID \u304c\u3001\u5148\u982d\u306f\u63a5\u982d\u90e8 ID \u3067\u3042\u308b\u306e\u306b\u3001\u305d\u306e\u5f8c\u306b\u6b63\u3057\u3044\u5f62\u5f0f\u306e 16 \u9032\u5024\u304c\u7d9a\u3044\u3066\u3044\u306a\u3044\u304b\u3001\u53d7\u3051\u53d6\u308d\u3046\u3068\u3057\u305f\u30e1\u30c3\u30bb\u30fc\u30b8\u306b\u542b\u307e\u308c\u3066\u3044\u308b\u30bf\u30a4\u30d7 bin.hex \u306e MQRFH2 \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u5024\u304c\u3001\u6b63\u3057\u3044\u5f62\u5f0f\u306e 16 \u9032\u6570\u3067\u306f\u306a\u3044\u304b\u306e\u3044\u305a\u308c\u304b\u3067\u3059\u3002
JMSWMQ1044.useraction = \u30b0\u30eb\u30fc\u30d7 ID \u307e\u305f\u306f\u76f8\u95a2 ID \u306e\u5024\u3092\u8a2d\u5b9a\u3059\u308b\u3068\u304d\u306b\u3001\u5fc5\u305a\u6709\u52b9\u306a 16 \u9032\u5024\u304c ID \u63a5\u982d\u90e8\u306e\u5f8c\u306b\u7d9a\u304f\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u975e JMS \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u3088\u308a\u751f\u6210\u3055\u308c\u305f\u3059\u3079\u3066\u306e MQRFH2 \u30d8\u30c3\u30c0\u30fc\u304c\u6b63\u3057\u3044\u5f62\u5f0f\u306b\u306a\u308b\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSWMQ1046 = \u6587\u5b57\u30bb\u30c3\u30c8 ''{0}'' \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSWMQ1046.inserts = CCSID
JMSWMQ1046.explanation = JVM \u306b\u3088\u3063\u3066\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u306a\u3044\u6587\u5b57\u30bb\u30c3\u30c8\u3092\u4f7f\u7528\u3057\u3066\u672c\u6587\u304c\u30a8\u30f3\u30b3\u30fc\u30c9\u3055\u308c\u3066\u3044\u308b\u30de\u30c3\u30d7\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u3001\u30b9\u30c8\u30ea\u30fc\u30e0\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u3001\u307e\u305f\u306f\u30c6\u30ad\u30b9\u30c8\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u9001\u4fe1\u307e\u305f\u306f\u53d7\u4fe1\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002 \u30c6\u30ad\u30b9\u30c8\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u5834\u5408\u3001\u3053\u306e\u4f8b\u5916\u306f\u53d7\u4fe1\u6642\u3067\u306f\u306a\u304f\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u672c\u6587\u304c\u6700\u521d\u306b\u7167\u4f1a\u3055\u308c\u305f\u3068\u304d\u306b\u30b9\u30ed\u30fc\u3055\u308c\u308b\u3053\u3068\u304c\u3042\u308a\u307e\u3059\u3002
JMSWMQ1046.useraction = \u53d7\u4fe1\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3067\u4f7f\u7528\u53ef\u80fd\u3067\u3042\u308b\u3053\u3068\u304c\u5206\u304b\u3063\u3066\u3044\u308b\u6587\u5b57\u30bb\u30c3\u30c8\u3060\u3051\u3092\u4f7f\u7528\u3057\u3066\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u30a8\u30f3\u30b3\u30fc\u30c9\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ1046.exception = com.ibm.msg.client.jms.DetailedMessageFormatException


JMSWMQ1051 = \u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u8a73\u7d30

JMSWMQ1055 = \u30e1\u30c3\u30bb\u30fc\u30b8\u5185\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u307e\u305f\u306f\u30a8\u30ec\u30e1\u30f3\u30c8\u306b\u3001\u305d\u308c\u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u30e1\u30bd\u30c3\u30c9\u3068\u975e\u4e92\u63db\u306e\u30c7\u30fc\u30bf\u30fb\u30bf\u30a4\u30d7 ''{0}'' \u304c\u3042\u308a\u307e\u3059\u3002
JMSWMQ1055.inserts = XMSC_INSERT_TYPE
JMSWMQ1055.explanation = JMS \u30e1\u30c3\u30bb\u30fc\u30b8\u304b\u3089\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u53d6\u5f97\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b accessor \u30e1\u30bd\u30c3\u30c9\u306f\u3001\u53d6\u5f97\u3055\u308c\u308b\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u30bf\u30a4\u30d7\u3068\u306f\u975e\u4e92\u63db\u3067\u3059\u3002 \u4f8b\u3048\u3070\u3001getBooleanProperty() \u30e1\u30bd\u30c3\u30c9\u3092\u4f7f\u7528\u3057\u3066\u6574\u6570\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u53d6\u308a\u51fa\u305d\u3046\u3068\u3057\u3066\u3044\u307e\u3059\u3002
JMSWMQ1055.useraction = \u5fc5\u9808\u30bf\u30a4\u30d7\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u5024\u3092\u53d6\u5f97\u3067\u304d\u308b\u3082\u306e\u3068\u3057\u3066 JMS \u306e\u4ed5\u69d8\u3067\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b accessor \u30e1\u30bd\u30c3\u30c9\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ1055.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSWMQ1059 = \u81f4\u547d\u7684\u30a8\u30e9\u30fc - UTF-8 \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSWMQ1059.explanation = \u4f7f\u7528\u3057\u3066\u3044\u308b Java(tm) \u30e9\u30f3\u30bf\u30a4\u30e0\u74b0\u5883\u304c UTF-8 \u6587\u5b57\u30a8\u30f3\u30b3\u30fc\u30c9\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u305b\u3093\u3002 JMS \u306f\u3001\u4e00\u90e8\u306e\u64cd\u4f5c\u3092\u5b9f\u884c\u3059\u308b\u305f\u3081\u306b\u3053\u306e\u30a8\u30f3\u30b3\u30fc\u30c9\u306e\u30b5\u30dd\u30fc\u30c8\u3092\u5fc5\u8981\u3068\u3057\u307e\u3059\u3002
JMSWMQ1059.useraction = \u3054\u4f7f\u7528\u306e Java(tm) \u30e9\u30f3\u30bf\u30a4\u30e0\u74b0\u5883\u306e\u8cc7\u6599\u3092\u53c2\u7167\u3059\u308b\u304b\u307e\u305f\u306f\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306b\u554f\u3044\u5408\u308f\u305b\u3066\u3001UTF-8 \u6587\u5b57\u30a8\u30f3\u30b3\u30fc\u30c9\u306e\u30b5\u30dd\u30fc\u30c8\u3092\u5165\u624b\u3059\u308b\u65b9\u6cd5\u3092\u5224\u5225\u3057\u307e\u3059\u3002
JMSWMQ1059.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSWMQ1067 = \u30bf\u30a4\u30e0\u30a2\u30a6\u30c8 ''{0}'' \u306f IBM MQ \u30af\u30e9\u30b9 (JMS \u7528) \u306b\u306f\u7121\u52b9\u3067\u3059\u3002
JMSWMQ1067.explanation = \u7121\u52b9\u306a\u9577\u3044\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u5024\u3092\u6307\u5b9a\u3057\u3066\u3001\u30ad\u30e5\u30fc\u53d7\u4fe1\u5074\u307e\u305f\u306f\u30c8\u30d4\u30c3\u30af\u30fb\u30b5\u30d6\u30b9\u30af\u30e9\u30a4\u30d0\u30fc\u30fb\u30e1\u30bd\u30c3\u30c9\u306e\u3044\u305a\u308c\u304b\u3067\u53d7\u4fe1\u30e1\u30bd\u30c3\u30c9\u3092\u547c\u3073\u51fa\u305d\u3046\u3068\u3057\u307e\u3057\u305f\u3002
JMSWMQ1067.useraction = \u6307\u5b9a\u3055\u308c\u305f\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u5024\u304c\u8ca0\u3067\u306f\u306a\u304f\u3001Integer.MAX_VALUE \u306e\u5024\u3088\u308a\u3082\u5927\u304d\u304f\u306a\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ1067.inserts = XMSC_INSERT_TIMEOUT

JMSWMQ1068 = XA \u30ea\u30bd\u30fc\u30b9\u306e\u53d6\u5f97\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ1068.explanation = IBM MQ \u30af\u30e9\u30b9 (JMS \u7528) \u306f\u3001\u30a8\u30e9\u30fc\u304c\u539f\u56e0\u3067 XA \u30ea\u30bd\u30fc\u30b9\u306e\u4f5c\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ1068.useraction = \u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b XAException \u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSWMQ1079 = \u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u9001\u9054\u4e0d\u80fd\u30ad\u30e5\u30fc\u306b\u66f8\u304d\u8fbc\u3081\u307e\u305b\u3093\u3002
JMSWMQ1079.explanation = IBM MQ \u30af\u30e9\u30b9 (JMS \u7528) \u306f\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u9001\u9054\u4e0d\u80fd\u30ad\u30e5\u30fc\u3078\u306e\u30ea\u30ad\u30e5\u30fc\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ1079.useraction = \u30ea\u30f3\u30af\u3055\u308c\u305f\u4f8b\u5916\u3092\u4f7f\u7528\u3057\u3066\u3001\u3053\u306e\u30a8\u30e9\u30fc\u306e\u539f\u56e0\u3092\u5224\u5225\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u30ea\u30f3\u30af\u3055\u308c\u305f\u4f8b\u5916\u304c\u306a\u3044\u5834\u5408\u3001\u5b9a\u7fa9\u6e08\u307f\u306e\u9001\u9054\u4e0d\u80fd\u30ad\u30e5\u30fc\u304c\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306b\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002 IBM MQ \u30af\u30e9\u30b9 (JMS \u7528) \u306b\u3088\u3063\u3066\u9001\u9054\u4e0d\u80fd\u30ad\u30e5\u30fc\u306b\u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u9001\u4fe1\u3055\u308c\u305f\u5f8c\u3067\u3042\u308c\u3070\u3001\u305d\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u306e MQDLH \u306b\u4fdd\u7ba1\u3055\u308c\u3066\u3044\u308b\u7406\u7531\u30b3\u30fc\u30c9\u3092\u5229\u7528\u3057\u3066\u9001\u4fe1\u7406\u7531\u3092\u5224\u5225\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002

JMSWMQ1080 = \u300c\u30d0\u30c3\u30af\u30a2\u30a6\u30c8-\u518d\u30ad\u30e5\u30fc\u300d\u30ad\u30e5\u30fc\u304c\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002

JMSWMQ1096 = \u30e1\u30c3\u30bb\u30fc\u30b8\u53c2\u7167\u306e\u5f62\u5f0f\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002

JMSWMQ1107 = \u3053\u306e\u63a5\u7d9a\u306b\u95a2\u9023\u3057\u305f\u554f\u984c\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
JMSWMQ1107.explanation = IBM MQ JMS \u63a5\u7d9a\u3067\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
JMSWMQ1107.useraction = \u30ea\u30f3\u30af\u3055\u308c\u305f\u4f8b\u5916\u3092\u4f7f\u7528\u3057\u3066\u3001\u3053\u306e\u30a8\u30e9\u30fc\u306e\u539f\u56e0\u3092\u5224\u5225\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSWMQ1116 = \u30ad\u30e5\u30fc ''{1}'' \u306b\u3042\u3063\u305f\u30e1\u30c3\u30bb\u30fc\u30b8 ''{0}'' \u306f\u3001\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc ''{2}'' \u306e\u9001\u9054\u4e0d\u80fd\u30ad\u30e5\u30fc\u306b\u79fb\u3055\u308c\u307e\u3057\u305f\u3002
JMSWMQ1116.explanation = IBM MQ \u30e1\u30c3\u30bb\u30fc\u30b8\u30f3\u30b0\u30fb\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306e\u901a\u5e38\u30e2\u30fc\u30c9\u3067\u5b9f\u884c\u4e2d\u306b\u3001\u51e6\u7406\u4e0d\u80fd\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002 \u3053\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u306b\u3064\u3044\u3066\u306e MQMD \u306e\u300c\u30ec\u30dd\u30fc\u30c8\u300d\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u306f\u30aa\u30d7\u30b7\u30e7\u30f3 MQRO_DEAD_LETTER_Q \u304c\u542b\u307e\u308c\u308b\u305f\u3081\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u306f\u9001\u9054\u4e0d\u80fd\u30ad\u30e5\u30fc\u306b\u79fb\u3055\u308c\u307e\u3057\u305f\u3002 
JMSWMQ1116.useraction = \u9001\u9054\u4e0d\u80fd\u30ad\u30e5\u30fc\u306b\u3042\u308b\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u9001\u9054\u4e0d\u80fd\u30d8\u30c3\u30c0\u30fc\u3092\u8abf\u3079\u3066\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u51e6\u7406\u3067\u304d\u306a\u304b\u3063\u305f\u7406\u7531\u3092\u5224\u5225\u3057\u3066\u304f\u3060\u3055\u3044\u3002 
JMSWMQ1116.inserts = XMSC_INSERT_MESSAGE_ID\u3001XMSC_INSERT_DESTINATION_NAME\u3001XMSC_INSERT_QUEUE_MANAGER_NAME 

JMSWMQ1117 = \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc ''{2}'' \u306e\u30ad\u30e5\u30fc ''{1}'' \u306b\u3042\u3063\u305f\u30e1\u30c3\u30bb\u30fc\u30b8 ''{0}'' \u3092\u51e6\u7406\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u305a\u3001\u5ec3\u68c4\u3055\u308c\u307e\u3057\u305f\u3002
JMSWMQ1117.explanation = IBM MQ \u30e1\u30c3\u30bb\u30fc\u30b8\u30f3\u30b0\u30fb\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306e\u901a\u5e38\u30e2\u30fc\u30c9\u3067\u5b9f\u884c\u4e2d\u306b\u3001\u51e6\u7406\u4e0d\u80fd\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002 \u3053\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u306b\u3064\u3044\u3066\u306e MQMD \u306e\u300c\u30ec\u30dd\u30fc\u30c8\u300d\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u306f\u30aa\u30d7\u30b7\u30e7\u30f3 MQRO_DISCARD_MSG \u304c\u542b\u307e\u308c\u308b\u305f\u3081\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u306f\u5ec3\u68c4\u3055\u308c\u307e\u3057\u305f\u3002 
JMSWMQ1117.useraction = \u6307\u5b9a\u3055\u308c\u305f\u30ad\u30e5\u30fc\u306b\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u66f8\u304d\u8fbc\u3080\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u5909\u66f4\u3057\u3066\u3001\u3053\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u306b\u95a2\u3059\u308b MQMD \u306e\u300c\u30ec\u30dd\u30fc\u30c8\u300d\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u30aa\u30d7\u30b7\u30e7\u30f3 MQRO_DEAD_LETTER_Q \u304c\u542b\u307e\u308c\u308b\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u3053\u308c\u306b\u3088\u308a\u3001\u3053\u308c\u4ee5\u964d\u306e\u3059\u3079\u3066\u306e\u51e6\u7406\u4e0d\u80fd\u306a\u30e1\u30c3\u30bb\u30fc\u30b8\u306f\u3001\u5ec3\u68c4\u3055\u308c\u308b\u4ee3\u308f\u308a\u306b\u3001\u9001\u9054\u4e0d\u80fd\u30ad\u30e5\u30fc\u306b\u79fb\u52d5\u3055\u308c\u308b\u3088\u3046\u306b\u306a\u308a\u307e\u3059\u3002 \u9001\u9054\u4e0d\u80fd\u30ad\u30e5\u30fc\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u306b\u306f\u9001\u9054\u4e0d\u80fd\u30d8\u30c3\u30c0\u30fc\u304c\u4ed8\u304d\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u51e6\u7406\u3067\u304d\u306a\u304b\u3063\u305f\u7406\u7531\u306b\u3064\u3044\u3066\u306e\u60c5\u5831\u304c\u542b\u3081\u3089\u308c\u307e\u3059\u3002
JMSWMQ1117.inserts = XMSC_INSERT_MESSAGE_ID\u3001XMSC_INSERT_DESTINATION_NAME\u3001XMSC_INSERT_QUEUE_MANAGER_NAME 

JMSWMQ1118 = IBM MQ \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u7406\u7531\u30b3\u30fc\u30c9 ''2494'' (''MQRC_GET_ENABLED'') \u3067\u5fdc\u7b54\u3057\u305f\u305f\u3081\u3001\u4eca\u307e\u3067 GET \u3067\u306f\u4f7f\u7528\u7981\u6b62\u3067\u3042\u3063\u305f\u30ad\u30e5\u30fc ''{0}'' \u306f GET \u3067\u518d\u5ea6\u4f7f\u7528\u53ef\u80fd\u306b\u306a\u308a\u307e\u3057\u305f\u3002
JMSWMQ1118.explanation = \u30b3\u30f3\u30b7\u30e5\u30fc\u30de\u30fc\u306e\u63a5\u7d9a\u5148\u306e\u30ad\u30e5\u30fc\u304b\u3089\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u53d6\u5f97\u3067\u304d\u308b\u3088\u3046\u306b\u306a\u308a\u307e\u3057\u305f\u3002
JMSWMQ1118.useraction = \u3042\u308a\u307e\u305b\u3093\u3002 \u3053\u308c\u306f\u901a\u77e5\u30e1\u30c3\u30bb\u30fc\u30b8\u3067\u3059\u3002
JMSWMQ1118.inserts = XMSC_INSERT_DESTINATION_NAME

JMSWMQ1119 = IBM MQ \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u7406\u7531\u30b3\u30fc\u30c9 ''2016'' (''MQRC_GET_INHIBITED'') \u3067\u5fdc\u7b54\u3057\u305f\u305f\u3081\u3001\u73fe\u5728\u3001GET \u8981\u6c42\u3067\u306f\u30ad\u30e5\u30fc ''{0}'' \u306f\u4f7f\u7528\u7981\u6b62\u3067\u3059\u3002
JMSWMQ1119.explanation = \u30b3\u30f3\u30b7\u30e5\u30fc\u30de\u30fc\u306e\u63a5\u7d9a\u5148\u306e\u30ad\u30e5\u30fc\u306f\u3001\u3069\u306e MQGET \u8981\u6c42\u306b\u304a\u3044\u3066\u3082\u4f7f\u7528\u7981\u6b62\u306b\u306a\u3063\u3066\u3044\u307e\u3059\u3002
JMSWMQ1119.useraction = IBM MQ \u7ba1\u7406\u8005\u304c MQGET \u8981\u6c42\u306b\u5bfe\u3057\u3066\u30ad\u30e5\u30fc\u3092\u518d\u5ea6\u4f7f\u7528\u53ef\u80fd\u306b\u3059\u308b\u307e\u3067\u5f85\u6a5f\u3057\u3066\u304f\u3060\u3055\u3044\u3002 
JMSWMQ1119.inserts = XMSC_INSERT_DESTINATION_NAME

# Same as JMSWMQ2003: queue variant.
JMSWMQ2000 = \u30ad\u30e5\u30fc ''{0}'' \u306e\u30af\u30ed\u30fc\u30ba\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ2000.explanation = JMS \u306f IBM MQ \u306e\u5b9b\u5148\u3092\u30af\u30ed\u30fc\u30ba\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u3001\u30a8\u30e9\u30fc\u3092\u691c\u51fa\u3057\u307e\u3057\u305f\u3002 \u5b9b\u5148\u304c\u65e2\u306b\u30af\u30ed\u30fc\u30ba\u3057\u3066\u3044\u308b\u304b\u3001\u307e\u305f\u306f close() \u306e\u547c\u3073\u51fa\u3057\u4e2d\u306b\u5225\u306e\u30b9\u30ec\u30c3\u30c9\u304c MQGET \u3092\u5b9f\u884c\u3057\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
JMSWMQ2000.useraction = \u30ea\u30f3\u30af\u3055\u308c\u305f\u4f8b\u5916\u3092\u4f7f\u7528\u3057\u3066\u3001\u3053\u306e\u30a8\u30e9\u30fc\u306e\u539f\u56e0\u3092\u5224\u5225\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u5f8c\u306b close() \u3092\u5b9f\u884c\u53ef\u80fd\u306b\u306a\u308b\u3053\u3068\u304c\u3042\u308a\u307e\u3059\u3002
JMSWMQ2000.inserts = XMSC_DESTINATION_NAME

JMSWMQ2001 = \u5148\u8aad\u307f\u30af\u30ed\u30fc\u30ba\u30fb\u30dd\u30ea\u30b7\u30fc\u3092\u4f7f\u7528\u3057\u3066\u3001\u5b9b\u5148 ''{0}'' \u306e\u30af\u30ed\u30fc\u30ba\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ2001.explanation = IBM MQ \u30af\u30e9\u30b9 (JMS \u7528) \u306f IBM MQ \u306e\u5b9b\u5148\u3092\u30af\u30ed\u30fc\u30ba\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u3001\u30a8\u30e9\u30fc\u3092\u691c\u51fa\u3057\u307e\u3057\u305f\u3002 \u30af\u30ed\u30fc\u30ba\u547c\u3073\u51fa\u3057\u306f\u3001\u5148\u8aad\u307f\u30ad\u30e5\u30fc\u306e\u3059\u3079\u3066\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u9001\u4fe1\u3057\u3088\u3046\u3068\u3057\u3066\u3001\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u306b\u306a\u308a\u307e\u3057\u305f\u3002
JMSWMQ2001.useraction = \u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30ea\u30b9\u30ca\u30fc\u304c\u30eb\u30fc\u30d7\u3057\u3066\u3044\u306a\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u5f8c\u306b close() \u3092\u5b9f\u884c\u53ef\u80fd\u306b\u306a\u308b\u3053\u3068\u304c\u3042\u308a\u307e\u3059\u3002
JMSWMQ2001.inserts = XMSC_DESTINATION_NAME

JMSWMQ2002 = \u5b9b\u5148 ''{0}'' \u304b\u3089\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u53d6\u5f97\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ2002.explanation = IBM MQ \u30af\u30e9\u30b9 (JMS \u7528) \u306f MQGET \u3092\u5b9f\u884c\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u3001IBM MQ \u304c\u30a8\u30e9\u30fc\u3092\u5831\u544a\u3057\u307e\u3057\u305f\u3002
JMSWMQ2002.useraction = \u30ea\u30f3\u30af\u3055\u308c\u305f\u4f8b\u5916\u3092\u4f7f\u7528\u3057\u3066\u3001\u3053\u306e\u30a8\u30e9\u30fc\u306e\u539f\u56e0\u3092\u5224\u5225\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ2002.inserts = XMSC_DESTINATION_NAME

# Same as JMSWMQ2000: topic variant.
JMSWMQ2003 = \u30c8\u30d4\u30c3\u30af ''{0}'' \u306e\u30af\u30ed\u30fc\u30ba\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ2003.explanation = JMS \u306f IBM MQ \u306e\u5b9b\u5148\u3092\u30af\u30ed\u30fc\u30ba\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u3001\u30a8\u30e9\u30fc\u3092\u691c\u51fa\u3057\u307e\u3057\u305f\u3002 \u5b9b\u5148\u304c\u65e2\u306b\u30af\u30ed\u30fc\u30ba\u3057\u3066\u3044\u308b\u304b\u3001\u307e\u305f\u306f close() \u306e\u547c\u3073\u51fa\u3057\u4e2d\u306b\u5225\u306e\u30b9\u30ec\u30c3\u30c9\u304c MQGET \u3092\u5b9f\u884c\u3057\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
JMSWMQ2003.useraction = \u30ea\u30f3\u30af\u3055\u308c\u305f\u4f8b\u5916\u3092\u4f7f\u7528\u3057\u3066\u3001\u3053\u306e\u30a8\u30e9\u30fc\u306e\u539f\u56e0\u3092\u5224\u5225\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u5f8c\u306b close() \u3092\u5b9f\u884c\u53ef\u80fd\u306b\u306a\u308b\u3053\u3068\u304c\u3042\u308a\u307e\u3059\u3002
JMSWMQ2003.inserts = XMSC_DESTINATION_NAME

# Same as JMSWMQ2008: topic variant.
JMSWMQ2006 = MQ \u30c8\u30d4\u30c3\u30af ''{0}'' \u306e\u30aa\u30fc\u30d7\u30f3\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ2006.explanation = JMS \u306f MQOPEN \u3092\u5b9f\u884c\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u3001IBM MQ \u304c\u30a8\u30e9\u30fc\u3092\u5831\u544a\u3057\u307e\u3057\u305f\u3002
JMSWMQ2006.useraction = \u30ea\u30f3\u30af\u3055\u308c\u305f\u4f8b\u5916\u3092\u4f7f\u7528\u3057\u3066\u3001\u3053\u306e\u30a8\u30e9\u30fc\u306e\u539f\u56e0\u3092\u5224\u5225\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u6307\u5b9a\u3055\u308c\u305f\u30c8\u30d4\u30c3\u30af\u304a\u3088\u3073\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u6b63\u3057\u304f\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ2006.inserts = XMSC_DESTINATION_NAME

JMSWMQ2007 = \u5b9b\u5148 ''{0}'' \u3078\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u9001\u4fe1\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ2007.explanation = JMS \u306f MQPUT \u307e\u305f\u306f MQPUT1 \u3092\u5b9f\u884c\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u3001IBM MQ \u304c\u30a8\u30e9\u30fc\u3092\u5831\u544a\u3057\u307e\u3057\u305f\u3002
JMSWMQ2007.useraction = \u30ea\u30f3\u30af\u3055\u308c\u305f\u4f8b\u5916\u3092\u4f7f\u7528\u3057\u3066\u3001\u3053\u306e\u30a8\u30e9\u30fc\u306e\u539f\u56e0\u3092\u5224\u5225\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ2007.inserts = XMSC_DESTINATION_NAME

# Same as JMSWMQ2006: queue variant.
JMSWMQ2008 = MQ \u30ad\u30e5\u30fc ''{0}'' \u306e\u30aa\u30fc\u30d7\u30f3\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ2008.explanation = JMS \u306f MQOPEN \u3092\u5b9f\u884c\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u3001IBM MQ \u304c\u30a8\u30e9\u30fc\u3092\u5831\u544a\u3057\u307e\u3057\u305f\u3002
JMSWMQ2008.useraction = \u30ea\u30f3\u30af\u3055\u308c\u305f\u4f8b\u5916\u3092\u4f7f\u7528\u3057\u3066\u3001\u3053\u306e\u30a8\u30e9\u30fc\u306e\u539f\u56e0\u3092\u5224\u5225\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u6307\u5b9a\u3055\u308c\u305f\u30ad\u30e5\u30fc\u304a\u3088\u3073\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u6b63\u3057\u304f\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ2008.inserts = XMSC_DESTINATION_NAME

JMSWMQ2010 = NPMCLASS HIGH \u6c38\u7d9a\u30e1\u30c3\u30bb\u30fc\u30b8\u30f3\u30b0 ''{0}'' \u306e\u5b9b\u5148\u306f\u7121\u52b9\u3067\u3057\u305f\u3002
JMSWMQ2010.explanation = \u6307\u5b9a\u3055\u308c\u305f\u5b9b\u5148\u306f\u3001NPMCLASS HIGH \u6c38\u7d9a\u30e1\u30c3\u30bb\u30fc\u30b8\u30f3\u30b0\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u305b\u3093\u3002
JMSWMQ2010.useraction = JMS \u7ba1\u7406\u30c4\u30fc\u30eb\u3092\u4f7f\u7528\u3057\u3066\u3001\u3053\u306e\u5b9b\u5148\u306e NPMCLASS HIGH \u6c38\u7d9a\u30e1\u30c3\u30bb\u30fc\u30b8\u30f3\u30b0\u3092\u6709\u52b9\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ2010.inserts = XMSC_DESTINATION_NAME
JMSWMQ2010.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSWMQ2011 = \u5b9b\u5148 ''{1}'' \u306b\u5bfe\u3057\u3066\u6c38\u7d9a\u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3 ''{0}'' \u306e\u30aa\u30fc\u30d7\u30f3\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ2011.explanation = JMS \u306f\u6c38\u7d9a\u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u3092\u4f5c\u6210\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u3001\u9078\u629e\u3057\u305f\u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u540d\u306f\u65e2\u306b JVM \u5185\u3067\u4f7f\u7528\u4e2d\u3067\u3057\u305f\u3002
JMSWMQ2011.useraction = \u3053\u306e\u6c38\u7d9a\u30b5\u30d6\u30b9\u30af\u30e9\u30a4\u30d0\u30fc\u306b\u5bfe\u3057\u3066\u5225\u306e\u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u540d\u3092\u4f7f\u7528\u3059\u308b\u304b\u3001\u307e\u305f\u306f\u3053\u306e\u30b5\u30d6\u30b9\u30af\u30e9\u30a4\u30d0\u30fc\u3092\u5225\u306e JVM \u4e0a\u3067\u5b9f\u884c\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ2011.inserts = XMSC_INSERT_OBJECT, XMSC_DESTINATION_NAME
JMSWMQ2011.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSWMQ2012 = XACLOSE \u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ2012.explanation = XA \u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u30af\u30ed\u30fc\u30ba\u4e2d\u306b\u3001XA \u30ea\u30bd\u30fc\u30b9\u306e\u30af\u30ed\u30fc\u30ba\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ2012.useraction = \u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u305f XAException \u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSWMQ2013 = \u63a5\u7d9a\u30e2\u30fc\u30c9 ''{1}'' \u304a\u3088\u3073\u30db\u30b9\u30c8\u540d ''{2}'' \u306e QueueManager ''{0}'' \u306b\u6307\u5b9a\u3055\u308c\u305f\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u8a8d\u8a3c\u306f\u7121\u52b9\u3067\u3057\u305f\u3002
JMSWMQ2013.useraction = \u6307\u5b9a\u3057\u305f\u30e6\u30fc\u30b6\u30fc\u540d\u304a\u3088\u3073\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u63a5\u7d9a\u5148\u306e QueueManager \u4e0a\u3067\u6b63\u3057\u3044\u304b\u3069\u3046\u304b\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ2013.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_HOST_NAME

JMSWMQ2014 = MQ \u306f\u5b8c\u4e86\u30b3\u30fc\u30c9 ''{0}''\u3001\u304a\u3088\u3073\u7406\u7531 ''{1}'' \u3067\u975e\u540c\u671f\u30a4\u30d9\u30f3\u30c8\u3092\u9001\u9054\u3057\u307e\u3057\u305f\u3002

JMSWMQ2016 = \u63a5\u7d9a\u306b\u5bfe\u3057\u3066 ExceptionListener \u3092\u767b\u9332\u3059\u308b\u3053\u3068\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ2016.explanation = \u3053\u306e ExceptionListener \u3092\u767b\u9332\u3059\u308b\u305f\u3081\u306e MQCB \u547c\u3073\u51fa\u3057\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ2016.useraction = \u30ea\u30f3\u30af\u3055\u308c\u305f\u4f8b\u5916\u3092\u4f7f\u7528\u3057\u3066\u3001\u3053\u306e\u30a8\u30e9\u30fc\u306e\u539f\u56e0\u3092\u5224\u5225\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSWMQ2017 = \u63a5\u7d9a\u306b\u5bfe\u3057\u3066 ExceptionListener \u3092\u767b\u9332\u89e3\u9664\u3059\u308b\u3053\u3068\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ2017.explanation = \u3053\u306e ExceptionListener \u3092\u767b\u9332\u89e3\u9664\u3059\u308b\u305f\u3081\u306e MQCB \u547c\u3073\u51fa\u3057\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ2017.useraction = \u30ea\u30f3\u30af\u3055\u308c\u305f\u4f8b\u5916\u3092\u4f7f\u7528\u3057\u3066\u3001\u3053\u306e\u30a8\u30e9\u30fc\u306e\u539f\u56e0\u3092\u5224\u5225\u3057\u3066\u304f\u3060\u3055\u3044\u3002

# Log message
JMSWMQ2018 = \u4f8b\u5916\u30ea\u30b9\u30ca\u30fc\u304c\u767b\u9332\u3055\u308c\u3066\u3044\u306a\u3044\u306e\u3067\u3001\u4f8b\u5916\u306f\u7121\u8996\u3055\u308c\u307e\u3059: ''{0}''\u3002
JMSWMQ2018.explanation = \u63a5\u7d9a\u306e\u4f8b\u5916\u30ea\u30b9\u30ca\u30fc\u306b\u4f8b\u5916\u3092\u9001\u9054\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u3001\u30ea\u30b9\u30ca\u30fc\u304c\u307e\u3060\u767b\u9332\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSWMQ2018.useraction = \u4f8b\u5916\u30ea\u30b9\u30ca\u30fc\u306f\u3001\u63a5\u7d9a\u306b\u767b\u9332\u3055\u308c\u3066\u3044\u306a\u3051\u308c\u3070\u3001\u305d\u306e\u4f8b\u5916\u3092\u53d7\u4fe1\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002
JMSWMQ2018.inserts = XMSC_INSERT_EXCEPTION

#Log message
JMSWMQ2019 = \u4e88\u671f\u3057\u306a\u3044\u5b8c\u4e86\u30b3\u30fc\u30c9 ''{0}''\u3001\u7406\u7531\u30b3\u30fc\u30c9 ''{1}'' \u304c\u30e1\u30bd\u30c3\u30c9 ''{2}'' \u304b\u3089\u623b\u3055\u308c\u307e\u3057\u305f\u3002
JMSWMQ2019.explanation = \u7406\u7531\u30b3\u30fc\u30c9\u306f\u4e88\u671f\u3055\u308c\u3066\u3044\u306a\u3044\u3082\u306e\u3067\u3057\u305f\u304c\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u623b\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSWMQ2019.useraction = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u969c\u5bb3\u304c\u751f\u3058\u3066\u3044\u308b\u5834\u5408\u3001\u305d\u306e\u969c\u5bb3\u306b\u95a2\u3059\u308b\u8a73\u7d30\u3092\u77e5\u308b\u305f\u3081\u306b\u3001\u30ed\u30b0\u306b\u8a18\u9332\u3055\u308c\u305f\u7406\u7531\u30b3\u30fc\u30c9\u3092\u691c\u8a0e\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
JMSWMQ2019.inserts = XMSC_INSERT_COMP_CODE, XMSC_INSERT_REASON, XMSC_INSERT_METHOD

JMSWMQ2020 = \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc ''{0}'' \u306b\u63a5\u7d9a\u30e2\u30fc\u30c9 ''{1}'' \u304a\u3088\u3073\u63d0\u4f9b\u3055\u308c\u305f CCDT URL ''{2}'' \u3067\u63a5\u7d9a\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u306e\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ2020.useraction = \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u958b\u59cb\u3057\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30fb\u30e2\u30fc\u30c9\u3067\u5b9f\u884c\u3057\u3066\u3044\u308b\u5834\u5408\u306b\u306f\u3001\u5b9f\u884c\u4e2d\u306e\u30ea\u30b9\u30ca\u30fc\u304c\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ2020.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_CCDTURL

JMSWMQ2021 = \u63a5\u7d9a\u30e2\u30fc\u30c9\u304c ''{1}''\u3001\u63d0\u4f9b\u3055\u308c\u305f CCDT URL \u304c ''{2}'' \u306e QueueManager ''{0}'' \u306b\u5bfe\u3057\u3066\u6307\u5b9a\u3055\u308c\u305f\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u8a8d\u8a3c\u306f\u3001\u7121\u52b9\u3067\u3057\u305f\u3002\u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u306e\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ2021.useraction = \u6307\u5b9a\u3057\u305f\u30e6\u30fc\u30b6\u30fc\u540d\u304a\u3088\u3073\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u63a5\u7d9a\u5148\u306e QueueManager \u4e0a\u3067\u6b63\u3057\u3044\u304b\u3069\u3046\u304b\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ2021.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_CCDTURL


JMSWMQ2022 = \u30e2\u30c7\u30eb\u30fb\u30ad\u30e5\u30fc ''{0}'' \u3092\u5b9b\u5148\u3068\u3057\u3066\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30d7\u30ed\u30c7\u30e5\u30fc\u30b5\u30fc\u307e\u305f\u306f\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30b3\u30f3\u30b7\u30e5\u30fc\u30de\u30fc\u3092\u4f5c\u6210\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002
JMSWMQ2022.explanation = \u5b9b\u5148\u304c\u30e2\u30c7\u30eb\u30fb\u30ad\u30e5\u30fc\u3060\u3063\u305f\u305f\u3081\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30d7\u30ed\u30c7\u30e5\u30fc\u30b5\u30fc\u307e\u305f\u306f\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30b3\u30f3\u30b7\u30e5\u30fc\u30de\u30fc\u304c\u5b9b\u5148\u3092\u958b\u3051\u307e\u305b\u3093\u3067\u3057\u305f\u3002
JMSWMQ2022.useraction = \u30e2\u30c7\u30eb\u30fb\u30ad\u30e5\u30fc\u3067\u306f\u306a\u3044\u5225\u306e\u5b9b\u5148\u30ad\u30e5\u30fc\u540d\u3092\u4f7f\u7528\u3059\u308b\u3088\u3046\u306b\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30d7\u30ed\u30c7\u30e5\u30fc\u30b5\u30fc\u307e\u305f\u306f\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30b3\u30f3\u30b7\u30e5\u30fc\u30de\u30fc\u306b\u5909\u66f4\u3092\u52a0\u3048\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ2022.inserts = XMSC_DESTINATION_NAME

JMSWMQ2023 = \u30e1\u30c3\u30bb\u30fc\u30b8 ''{0}'' \u306e\u51e6\u7406\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f (\u4f8b\u5916 ''{1}''\u3001MQMD ''{2}'')
JMSWMQ2023.inserts = XMSC_MSG_DATA\u3001XMSC_INSERT_EXCEPTION\u3001XMSC_DATA

JMSWMQ2024 = \u5b9b\u5148 ''{0}'' \u3078\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u9001\u4fe1\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ2024.explanation = JMS \u306f MQPUT \u307e\u305f\u306f MQPUT1 \u3092\u5b9f\u884c\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u3001IBM MQ \u304c\u30a8\u30e9\u30fc\u3092\u5831\u544a\u3057\u307e\u3057\u305f\u3002\n\
\u9001\u9054\u306e\u9045\u5ef6\u304c\u8a2d\u5b9a\u3055\u308c\u307e\u3057\u305f\u306e\u3067\u3001\u554f\u984c\u306f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u6307\u5b9a\u3057\u305f\u30ad\u30e5\u30fc\u3001\u307e\u305f\u306f\n\
\u9001\u9054\u306e\u9045\u5ef6\u30b9\u30c6\u30fc\u30b8\u30f3\u30b0\u30fb\u30ad\u30e5\u30fc 'SYSTEM.DDELAY.LOCAL.QUEUE' \u3068\u95a2\u9023\u304c\u3042\u308b\u304b\u3082\u3057\u308c\u307e\u305b\u3093\u3002
JMSWMQ2024.useraction = \u30ea\u30f3\u30af\u3055\u308c\u305f\u4f8b\u5916\u3092\u4f7f\u7528\u3057\u3066\u3001\u3053\u306e\u30a8\u30e9\u30fc\u306e\u539f\u56e0\u3092\u5224\u5225\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ2024.inserts = XMSC_DESTINATION_NAME

JMSWMQ2025 = \u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u540d ''{1}'' \u3092\u6307\u5b9a\u3057\u305f\u30c8\u30d4\u30c3\u30af ''{0}'' \u306e\u30b5\u30d6\u30b9\u30af\u30e9\u30a4\u30d6\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSWMQ2025.explanation = \u975e\u5171\u6709\u3067\u5171\u6709\u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u3092\u958b\u3053\u3046\u3068\u3057\u305f\u304b\u3001\u5171\u6709\u3067\u975e\u5171\u6709\u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u3092\u958b\u3053\u3046\u3068\u3057\u307e\u3057\u305f\u3002
JMSWMQ2025.useraction = \u540c\u3058\u540d\u524d\u306e\u65b0\u898f\u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u3092\u4f5c\u6210\u3057\u3088\u3046\u3068\u3059\u308b\u5834\u5408\u3001\u305d\u306e\u524d\u306b\u7570\u306a\u308b\u5171\u6709\u30bf\u30a4\u30d7\u306e\u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u304c\u5b58\u5728\u3057\u3066\u3044\u306a\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSWMQ2025.inserts = XMSC_DESTINATION_NAME,XMSC_SUBSCRIPTION_NAME
