# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
#

JMSFMQ0001 = Tryb po\u0142\u0105czenia {0} nie jest obs\u0142ugiwany w przypadku po\u0142\u0105cze\u0144 XA.
JMSFMQ0001.explanation = Nie wszystkie tryby po\u0142\u0105czenia s\u0105 obs\u0142ugiwane przez ka\u017cdy typ po\u0142\u0105czenia. W przypadku interfejsu XA wymagane jest po\u0142\u0105czenie w trybie klienta.
JMSFMQ0001.useraction = Zmodyfikuj tryb po\u0142\u0105czenia, aby przyj\u0105\u0142 obs\u0142ugiwan\u0105 warto\u015b\u0107.
JMSFMQ0001.inserts = XMSC_WMQ_CONNECTION_MODE

JMSFMQ0003 = Poziom komend {0} mened\u017cera kolejek nie by\u0142 zgodny z \u017c\u0105dan\u0105 wersj\u0105 dostawcy {1}.
JMSFMQ0003.explanation = Wersja mened\u017cera kolejek okre\u015blona w fabryce po\u0142\u0105cze\u0144 nie jest zgodna z \u017c\u0105danym mened\u017cerem kolejek. Nieokre\u015blona wersja dostawcy podejmie pr\u00f3b\u0119 nawi\u0105zania po\u0142\u0105czenia w trybie normalnym. 
JMSFMQ0003.useraction = Wybierz zgodny mened\u017cer kolejek lub zmodyfikuj \u017c\u0105dany poziom komend.
JMSFMQ0003.inserts = XMSC_INSERT_COMMAND_LEVEL, XMSC_WMQ_PROVIDER_VERSION

JMSFMQ0004 = Warto\u015b\u0107 kana\u0142u wsp\u00f3\u0142u\u017cytkowania konwersacji ({0}) nie jest obs\u0142ugiwana w przypadku \u017c\u0105danej wersji dostawcy ({1}).
JMSFMQ0004.explanation = Warto\u015b\u0107 okre\u015blona dla w\u0142a\u015bciwo\u015bci kana\u0142u wsp\u00f3\u0142u\u017cytkowania konwersacji nie jest obs\u0142ugiwana przez \u017c\u0105dan\u0105 wersj\u0119 dostawcy mened\u017cera kolejek. Nieokre\u015blona wersja dostawcy podejmie pr\u00f3b\u0119 nawi\u0105zania po\u0142\u0105czenia w trybie normalnym.
JMSFMQ0004.useraction = Wybierz wersj\u0119 dostawcy, kt\u00f3ra mo\u017ce obs\u0142ugiwa\u0107 \u017c\u0105dane ustawienie, lub zmie\u0144 ustawienie wsp\u00f3\u0142u\u017cytkowania konwersacji na obs\u0142ugiwan\u0105 warto\u015b\u0107.
JMSFMQ0004.inserts = XMSC_INSERT_VALUE, XMSC_WMQ_PROVIDER_VERSION

JMSFMQ0005 = Po\u0142\u0105czenie klienckie nie jest obs\u0142ugiwane w bie\u017c\u0105cym \u015brodowisku.
JMSFMQ0005.explanation = Tryb po\u0142\u0105czenia klienckiego nie jest obs\u0142ugiwany we wszystkich \u015brodowiskach.
JMSFMQ0005.useraction = Zmodyfikuj tryb po\u0142\u0105czenia, aby okre\u015bli\u0107 po\u0142\u0105czenie powi\u0105za\u0144 z lokalnym mened\u017cerem kolejek.

JMSFMQ0007 = W kontek\u015bcie w\u0142a\u015bciwo\u015bci fabryki po\u0142\u0105cze\u0144 zosta\u0142a ustawiona nieznana w\u0142a\u015bciwo\u015b\u0107 {0} o warto\u015bci {1}.
JMSFMQ0007.explanation = W\u0142a\u015bciwo\u015b\u0107 ''{0}'' nie zosta\u0142a rozpoznana - mo\u017ce to by\u0107 w\u0142a\u015bciwo\u015b\u0107 niestandardowa.
JMSFMQ0007.useraction = Sprawd\u017a, czy ma to by\u0107 w\u0142a\u015bciwo\u015b\u0107 niestandardowa.
JMSFMQ0007.inserts = XMSC_INSERT_KEY, XMSC_INSERT_VALUE

JMSFMQ0010 = Warto\u015b\u0107 {0} nie jest poprawna dla w\u0142a\u015bciwo\u015bci konfiguracji klienta {1}. Zostanie ona zignorowana.
JMSFMQ0010.explanation = Podj\u0119to pr\u00f3b\u0119 ustawienia warto\u015bci w\u0142a\u015bciwo\u015bci konfiguracji klienta spoza poprawnego zakresu.
JMSFMQ0010.useraction = Nale\u017cy zmodyfikowa\u0107 to ustawienie w taki spos\u00f3b, aby zawiera\u0142o poprawn\u0105 warto\u015b\u0107. Wi\u0119cej informacji mo\u017cna znale\u017a\u0107 w dokumentacji.
JMSFMQ0010.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_NAME

JMSFMQ1006 = Warto\u015b\u0107 {0} dla w\u0142a\u015bciwo\u015bci {1} jest niepoprawna.
JMSFMQ1006.explanation = Warto\u015b\u0107 okre\u015blona dla w\u0142a\u015bciwo\u015bci nie jest obs\u0142ugiwana.
JMSFMQ1006.useraction = Zmodyfikuj warto\u015b\u0107 tak, aby zawiera\u0142a si\u0119 w zakresie akceptowanych warto\u015bci.
JMSFMQ1006.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_NAME

JMSFMQ1007 = Komunikat w dzienniku dotycz\u0105cy transportu w czasie rzeczywistym: {0}
JMSFMQ1007.explanation = Funkcja transportu w czasie rzeczywistym zarejestrowa\u0142a b\u0142\u0105d.
JMSFMQ1007.inserts = XMSC_REAL_TIME_LOG_MSG

JMSFMQ1056 = Typ danych {0} w\u0142a\u015bciwo\u015bci lub elementu nie jest obs\u0142ugiwany.
JMSFMQ1056.explanation = Typ danych danego obiektu nie jest akceptowany w przypadku danego pola.  
JMSFMQ1056.useraction = Zmodyfikuj obiekt w taki spos\u00f3b, aby jego typ by\u0142 akceptowanym typem.
JMSFMQ1056.inserts = XMSC_INSERT_NAME

JMSFMQ1105 = Nie mo\u017cna okre\u015bli\u0107 portu lokalnego {0} dla po\u0142\u0105czenia bezpo\u015bredniego z brokerem u\u017cywaj\u0105cym rozsy\u0142ania grupowego.
JMSFMQ1105.explanation = Numer portu zosta\u0142 okre\u015blony. Nie jest poprawny w przypadku rozsy\u0142ania grupowego.
JMSFMQ1105.useraction = Usu\u0144 odwo\u0142anie do portu z ustawienia adresu lokalnego dla rozsy\u0142ania grupowego.
JMSFMQ1105.inserts = XMSC_WMQ_LOCAL_ADDRESS

JMSFMQ3032 = Resetowanie identyfikatora klienta nie jest dozwolone.
JMSFMQ3032.explanation = Identyfikator klienta po\u0142\u0105czenia mo\u017cna ustawi\u0107 tylko raz i tylko przed u\u017cyciem po\u0142\u0105czenia.
JMSFMQ3032.useraction = Ustaw identyfikator klienta przed u\u017cyciem po\u0142\u0105czenia.

JMSFMQ3036 = Wybieranie komunikat\u00f3w po stronie brokera jest poprawne tylko wtedy, gdy u\u017cywany jest produkt IBM Integration Bus.
JMSFMQ3036.explanation = Wersja brokera nie jest sp\u00f3jna z wyborem komunikat\u00f3w.
JMSFMQ3036.useraction = Sprawd\u017a, czy wersja brokera (JMSC.MQJMS_BROKER_V2) zosta\u0142a ustawiona w obiekcie ConnectionFactory.

JMSFMQ3037 = Wersja brokera i wersja dostawcy ustawione jednocze\u015bnie - wersja dostawcy ({0}) nadpisuje wersj\u0119 brokera ({1}).
JMSFMQ3037.explanation = Wersja brokera i wersja dostawcy nie mog\u0105 by\u0107 ustawiane jednocze\u015bnie.
JMSFMQ3037.useraction = Sprawd\u017a, czy w obiekcie ConnectionFactory jest ustawiona wersja brokera lub wersja dostawcy, ale nie obie te wersje naraz.
JMSFMQ3037.inserts = XMSC_WMQ_PROVIDER_VERSION, XMSC_WMQ_BROKER_VERSION

JMSFMQ6115 = Wyst\u0105pi\u0142 wyj\u0105tek podczas tworzenia obiektu TopicConnection.
JMSFMQ6115.useraction = Wi\u0119cej informacji na ten temat zawiera do\u0142\u0105czony wyj\u0105tek.

JMSFMQ6311 = Typ transportu bezpo\u015bredniego (DIRECT) w obr\u0119bie transakcji nie jest obs\u0142ugiwany.
JMSFMQ6311.explanation = Aplikacja podj\u0119\u0142a pr\u00f3b\u0119 u\u017cycia metody transakcyjnej. Nie jest ona obs\u0142ugiwana przez typ transportu DirectIP.
JMSFMQ6311.useraction = Nale\u017cy zmodyfikowa\u0107 aplikacj\u0119 w taki spos\u00f3b, aby u\u017cycie transakcji nie by\u0142o mo\u017cliwe.

JMSFMQ6312 = Wyst\u0105pi\u0142 wyj\u0105tek w interfejsie MQI Java(tm).
JMSFMQ6312.explanation = Interfejs MQI Java(tm) zg\u0142osi\u0142 wyj\u0105tek opisuj\u0105cy problem. 
JMSFMQ6312.useraction = Wi\u0119cej informacji na ten temat zawiera do\u0142\u0105czony wyj\u0105tek.

JMSFMQ6313 = Utworzono po\u0142\u0105czenie produktu WMQ typu {0}.
JMSFMQ6313.inserts = XMSC_INSERT_VALUE
JMSFMQ6313.explanation = Po\u0142\u0105czenie mo\u017ce by\u0107 utworzone w trybie normalnym lub trybie migracji.
JMSFMQ6313.useraction = Je\u015bli to nie jest po\u0142\u0105czenie oczekiwanego typu, dodatkowe informacje mo\u017cna znale\u017a\u0107 w temacie jm41140_ w Centrum informacyjnym.

JMSFMQ6314 = Wersja dostawcy {0} okre\u015blona przez fabryk\u0119 po\u0142\u0105cze\u0144 zosta\u0142a nadpisana przez {1}.
JMSFMQ6314.inserts = XMSC_WMQ_PROVIDER_VERSION,XMSC_INSERT_NAME
JMSFMQ6314.explanation = Wersja dostawcy fabryki po\u0142\u0105cze\u0144 mo\u017ce zosta\u0107 napisana przez w\u0142a\u015bciwo\u015b\u0107 konfiguracji klienta.
JMSFMQ6314.useraction = Brak. To jest komunikat informacyjny wskazuj\u0105cy, \u017ce w\u0142a\u015bciwo\u015b\u0107 zosta\u0142a nadpisana.

JMSFMQ6315 = Wersja dostawcy zosta\u0142a nadpisana przez warto\u015b\u0107 6.0.0.0, poniewa\u017c wersja brokera zosta\u0142a ustawiona na warto\u015b\u0107 V2 i w fabryce po\u0142\u0105cze\u0144 znajduje si\u0119 mened\u017cer kolejek brokera.
JMSFMQ6315.explanation = Wersja dostawcy fabryki po\u0142\u0105cze\u0144 zosta\u0142a zmieniona na podstawie innych w\u0142a\u015bciwo\u015bci w fabryce po\u0142\u0105cze\u0144.
JMSFMQ6315.useraction = Brak. To jest komunikat informacyjny wskazuj\u0105cy, \u017ce w\u0142a\u015bciwo\u015b\u0107 zosta\u0142a nadpisana.

JMSFMQ6316 = Tryb publikowania/subskrypcji mened\u017cera kolejek to tryb {0}. Dlatego tryb {1} jest wymagany dla funkcji publikowania/subskrypcji.
JMSFMQ6316.inserts = XMSC_INSERT_TYPE,XMSC_INSERT_OTHER_TYPE
JMSFMQ6316.explanation = Na podstawie trybu publikowania/subskrypcji mened\u017cera kolejek podj\u0119to decyzj\u0119 o u\u017cyciu trybu normalnego lub trybu migracji.
JMSFMQ6316.useraction = Brak. To jest komunikat informacyjny. Dodatkowe informacje mo\u017cna znale\u017a\u0107 w temacie jm41140_ w Centrum informacyjnym.

JMSFMQ6317 = Nie mo\u017cna otworzy\u0107 trybu {0} kolejki kontrolnej brokera, dlatego tryb normalny jest wymagany dla funkcji publikowania/subskrypcji.
JMSFMQ6317.inserts = XMSC_INSERT_TYPE
JMSFMQ6317.explanation = Na podstawie trybu publikowania/subskrypcji mened\u017cera kolejek podj\u0119to decyzj\u0119 o u\u017cyciu trybu normalnego lub trybu migracji.
JMSFMQ6317.useraction = Brak. To jest komunikat informacyjny. Dodatkowe informacje mo\u017cna znale\u017a\u0107 w temacie jm41140_ w Centrum informacyjnym.

JMSFMQ6318 = Brak mo\u017cliwo\u015bci integracji z funkcj\u0105 sterowania \u015bledzeniem serwera WMQ {0}.
JMSFMQ6318.inserts = Wyj\u0105tek
JMSFMQ6318.explanation = Nawi\u0105zanie po\u0142\u0105czenie z funkcj\u0105 \u015bledzenia serwera WMQ nie by\u0142o mo\u017cliwe.
JMSFMQ6318.useraction = Upewnij si\u0119, \u017ce w \u015bcie\u017cce klasy znajduje si\u0119 plik com.ibm.mq.commonservices.jar.
