# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
#

JMSFMQ0001 = A(z) ''{0}'' csatlakoz\u00e1si m\u00f3d XA kapcsolatok eset\u00e9n nem t\u00e1mogatott.
JMSFMQ0001.explanation = Az egyes kapcsolatt\u00edpusok nem minden csatlakoz\u00e1si m\u00f3dot t\u00e1mogatnak. Az XA \u00fcgyf\u00e9l m\u00f3d\u00fa csatlakoz\u00e1st ig\u00e9nyel.
JMSFMQ0001.useraction = M\u00f3dos\u00edtsa a csatlakoz\u00e1si m\u00f3dot t\u00e1mogatott \u00e9rt\u00e9kre.
JMSFMQ0001.inserts = XMSC_WMQ_CONNECTION_MODE

JMSFMQ0003 = A sorkezel\u0151 parancsszintje (''{0}'') nem felelt meg a k\u00e9rt szolg\u00e1ltat\u00f3 v\u00e1ltozatnak (''{1}'').
JMSFMQ0003.explanation = A kapcsolatgy\u00e1rban megadott sorkezel\u0151 v\u00e1ltozat nem felel meg a k\u00e9rt sorkezel\u0151nek. Egy "nem meghat\u00e1rozott" szolg\u00e1ltat\u00f3 v\u00e1ltozat Norm\u00e1l m\u00f3d\u00fa kapcsolattal fog pr\u00f3b\u00e1lkozni. 
JMSFMQ0003.useraction = V\u00e1lasszon megfelel\u0151 sorkezel\u0151t, vagy m\u00f3dos\u00edtsa a k\u00e9rt parancsszintet.
JMSFMQ0003.inserts = XMSC_INSERT_COMMAND_LEVEL, XMSC_WMQ_PROVIDER_VERSION

JMSFMQ0004 = A(z) ''{0}'' p\u00e1rbesz\u00e9dmegoszt\u00e1si csatorna\u00e9rt\u00e9k nem t\u00e1mogatott a(z) ''{1}'' k\u00e9rt szolg\u00e1ltat\u00f3 v\u00e1ltozathoz.
JMSFMQ0004.explanation = A p\u00e1rbesz\u00e9dmegoszt\u00e1s csatornatulajdons\u00e1gnak megadott \u00e9rt\u00e9k nem t\u00e1mogatott a k\u00e9rt sorkezel\u0151 szolg\u00e1ltat\u00f3 v\u00e1ltozat \u00e1ltal. Egy "nem meghat\u00e1rozott" szolg\u00e1ltat\u00f3 v\u00e1ltozat Norm\u00e1l m\u00f3d\u00fa kapcsolattal fog pr\u00f3b\u00e1lkozni.
JMSFMQ0004.useraction = Vagy v\u00e1lasszon olyan szolg\u00e1ltat\u00f3 v\u00e1ltozatot, ami t\u00e1mogatja a k\u00e9rt be\u00e1ll\u00edt\u00e1st, vagy m\u00f3dos\u00edtsa a p\u00e1rbesz\u00e9dmegoszt\u00e1si be\u00e1ll\u00edt\u00e1st egy t\u00e1mogatott \u00e9rt\u00e9kre.
JMSFMQ0004.inserts = XMSC_INSERT_VALUE, XMSC_WMQ_PROVIDER_VERSION

JMSFMQ0005 = Az \u00fcgyf\u00e9l kapcsolat haszn\u00e1lata nem t\u00e1mogatott a jelenlegi k\u00f6rnyezetben.
JMSFMQ0005.explanation = Az \u00fcgyf\u00e9l kapcsolat m\u00f3d nem minden k\u00f6rnyezetben t\u00e1mogatott.
JMSFMQ0005.useraction = M\u00f3dos\u00edtsa a kapcsolat m\u00f3dot \u00fagy, hogy egy helyi sorkezel\u0151vel l\u00e9tes\u00edtett k\u00f6t\u00e9si kapcsolatot ad meg

JMSFMQ0007 = A(z) ''{1}'' \u00e9rt\u00e9k\u0171 ''{0}'' ismeretlen tulajdons\u00e1g van be\u00e1ll\u00edtva a kapcsolatgy\u00e1r tulajdons\u00e1gkontextus\u00e1ban.
JMSFMQ0007.explanation = A(z) ''{0}'' tulajdons\u00e1g nem ismerhet\u0151 fel - lehet, hogy egy\u00e9ni tulajdons\u00e1g.
JMSFMQ0007.useraction = Gy\u0151z\u0151dj\u00f6n meg r\u00f3la, hogy val\u00f3ban egy\u00e9ni tulajdons\u00e1gr\u00f3l van sz\u00f3.
JMSFMQ0007.inserts = XMSC_INSERT_KEY, XMSC_INSERT_VALUE

JMSFMQ0010 = A(z) ''{0}'' \u00e9rt\u00e9k nem \u00e9rv\u00e9nyes a(z) ''{1}'' \u00fcgyf\u00e9l be\u00e1ll\u00edt\u00e1si tulajdons\u00e1ghoz, ez\u00e9rt az \u00e9rt\u00e9k figyelmen k\u00edv\u00fcl lett hagyva.
JMSFMQ0010.explanation = Az \u00e9rv\u00e9nyes tartom\u00e1nyon k\u00edv\u00fcli k\u00eds\u00e9rlet t\u00f6rt\u00e9nt az \u00fcgyf\u00e9l be\u00e1ll\u00edt\u00e1si tulajdons\u00e1g be\u00e1ll\u00edt\u00e1s\u00e1ra.
JMSFMQ0010.useraction = A be\u00e1ll\u00edt\u00e1st meg kell v\u00e1ltoztatni, hogy \u00e9rv\u00e9nyes \u00e9rt\u00e9ket tartalmazzon. Tov\u00e1bbi inform\u00e1ci\u00f3\u00e9rt tekintse meg a dokument\u00e1ci\u00f3t.
JMSFMQ0010.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_NAME

JMSFMQ1006 = A(z) ''{0}'' \u00e9rt\u00e9k a(z) ''{1}'' tulajdons\u00e1gnak nem \u00e9rv\u00e9nyes.
JMSFMQ1006.explanation = A tulajdons\u00e1gnak megadott \u00e9rt\u00e9k nem t\u00e1mogatott.
JMSFMQ1006.useraction = M\u00f3dos\u00edtsa az \u00e9rt\u00e9ket \u00fagy, hogy az elfogadott \u00e9rt\u00e9kek tartom\u00e1ny\u00e1ba essen.
JMSFMQ1006.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_NAME

JMSFMQ1007 = Val\u00f3s idej\u0171 sz\u00e1ll\u00edt\u00e1s napl\u00f3\u00fczenet: ''{0}''.
JMSFMQ1007.explanation = A val\u00f3s idej\u0171 sz\u00e1ll\u00edt\u00e1s hib\u00e1t napl\u00f3zott.
JMSFMQ1007.inserts = XMSC_REAL_TIME_LOG_MSG

JMSFMQ1056 = A(z) ''{0}'' tulajdons\u00e1g vagy elem adatt\u00edpus nem t\u00e1mogatott.
JMSFMQ1056.explanation = Az adott objektum adatt\u00edpusa nem elfogadott az adott mez\u0151h\u00f6z.  
JMSFMQ1056.useraction = M\u00f3dos\u00edtsa az objektumot \u00fagy, hogy elfogadott t\u00edpus\u00fa legyen.
JMSFMQ1056.inserts = XMSC_INSERT_NAME

JMSFMQ1105 = Nem adhat\u00f3 meg a(z) ''{0}'' helyi port egy multicast c\u00edmeket haszn\u00e1l\u00f3 k\u00f6zvet\u00edt\u0151vel l\u00e9tes\u00edtett k\u00f6zvetlen kapcsolathoz.
JMSFMQ1105.explanation = Megadott egy portsz\u00e1mot. Ez multicast eset\u00e9n nem \u00e9rv\u00e9nyes.
JMSFMQ1105.useraction = T\u00e1vol\u00edtsa el a porthivatkoz\u00e1st a multicast helyi c\u00edm be\u00e1ll\u00edt\u00e1sb\u00f3l.
JMSFMQ1105.inserts = XMSC_WMQ_LOCAL_ADDRESS

JMSFMQ3032 = Az \u00fcgyf\u00e9l-azonos\u00edt\u00f3 vissza\u00e1ll\u00edt\u00e1sa nem megengedett.
JMSFMQ3032.explanation = Egy kapcsolathoz tartoz\u00f3 \u00fcgyf\u00e9l-azonos\u00edt\u00f3 csak egyszer \u00e1ll\u00edthat\u00f3 be, a kapcsolat haszn\u00e1lata el\u0151tt.
JMSFMQ3032.useraction = A kapcsolat haszn\u00e1lata el\u0151tt \u00e1ll\u00edtsa be az \u00fcgyf\u00e9l-azonos\u00edt\u00f3t.

JMSFMQ3036 = A k\u00f6zvet\u00edt\u0151 oldali \u00fczenetv\u00e1laszt\u00e1s csak IBM Integration Bus haszn\u00e1latakor \u00e9rv\u00e9nyes.
JMSFMQ3036.explanation = A k\u00f6zvet\u00edt\u0151v\u00e1ltozat \u00e9s az \u00fczenetv\u00e1laszt\u00e1s nem konzisztens.
JMSFMQ3036.useraction = Gy\u0151z\u0151dj\u00f6n meg r\u00f3la, hogy a k\u00f6zvet\u00edt\u0151v\u00e1ltozat (JMSC.MQJMS_BROKER_V2) be lett \u00e1ll\u00edtva a ConnectionFactory elemben.

JMSFMQ3037 = A k\u00f6zvet\u00edt\u0151v\u00e1ltozat \u00e9s a szolg\u00e1ltat\u00f3v\u00e1ltozat is be van \u00e1ll\u00edtva - a(z) ''{0}'' szolg\u00e1ltat\u00f3v\u00e1ltozat fel\u00fclb\u00edr\u00e1lja a(z) ''{1}'' k\u00f6zvet\u00edt\u0151v\u00e1ltozatot.
JMSFMQ3037.explanation = A k\u00f6zvet\u00edt\u0151v\u00e1ltozatot \u00e9s a szolg\u00e1ltat\u00f3v\u00e1ltozatot nem szabad egyszerre be\u00e1ll\u00edtani.
JMSFMQ3037.useraction = Gondoskodj\u00e9k r\u00f3la, hogy vagy a k\u00f6zvet\u00edt\u0151v\u00e1ltozat, vagy a szolg\u00e1ltat\u00f3v\u00e1ltozat legyen be\u00e1ll\u00edtva a ConnectionFactory elemben, ne mindkett\u0151.
JMSFMQ3037.inserts = XMSC_WMQ_PROVIDER_VERSION, XMSC_WMQ_BROKER_VERSION

JMSFMQ6115 = Kiv\u00e9tel t\u00f6rt\u00e9nt a TopicConnection l\u00e9trehoz\u00e1sa sor\u00e1n.
JMSFMQ6115.useraction = Tov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt n\u00e9zze meg a kapcsol\u00f3d\u00f3 kiv\u00e9telt.

JMSFMQ6311 = A 'DIRECT' sz\u00e1ll\u00edt\u00e1si t\u00edpus tranzakci\u00f3n bel\u00fcl nem t\u00e1mogatott.
JMSFMQ6311.explanation = Az alkalmaz\u00e1s megpr\u00f3b\u00e1lt haszn\u00e1lni egy tranzakci\u00f3s met\u00f3dust. Ez DirectIP sz\u00e1ll\u00edt\u00e1si t\u00edpussal nem t\u00e1mogatott.
JMSFMQ6311.useraction = M\u00f3dos\u00edtsa az alkalmaz\u00e1st, hogy ne haszn\u00e1ljon tranzakci\u00f3kat.

JMSFMQ6312 = Kiv\u00e9tel t\u00f6rt\u00e9nt a Java(tm) MQI fel\u00fcleten.
JMSFMQ6312.explanation = A Java(tm) MQI kiv\u00e9telt dobott, ami le\u00edrja a probl\u00e9m\u00e1t. 
JMSFMQ6312.useraction = Tov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt n\u00e9zze meg a kapcsol\u00f3d\u00f3 kiv\u00e9telt.

JMSFMQ6313 = Egy {0} t\u00edpus\u00fa WMQ Kapcsolat j\u00f6tt l\u00e9tre.
JMSFMQ6313.inserts = XMSC_INSERT_VALUE
JMSFMQ6313.explanation = A kapcsolatok Norm\u00e1l vagy \u00c1t\u00e1ll\u00edt\u00e1s \u00fczemm\u00f3d\u00faak lehetnek.
JMSFMQ6313.useraction = Amennyiben ez nem a v\u00e1rt kapcsolatt\u00edpus, akkor tov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt keresse meg az inform\u00e1ci\u00f3s k\u00f6zpont jm41140_ t\u00e9mak\u00f6r\u00e9t.

JMSFMQ6314 = A kapcsolatgy\u00e1r \u00e1ltal megadott {0} szolg\u00e1ltat\u00f3v\u00e1ltozatot {1} \u00e9rt\u00e9kkel b\u00edr\u00e1lta fel\u00fcl a rendszer.
JMSFMQ6314.inserts = XMSC_WMQ_PROVIDER_VERSION,XMSC_INSERT_NAME
JMSFMQ6314.explanation = A kapcsolatgy\u00e1r szolg\u00e1ltat\u00f3v\u00e1ltozat \u00e9rt\u00e9k\u00e9t az \u00fcgyf\u00e9l konfigur\u00e1ci\u00f3s tulajdons\u00e1ga fel\u00fclb\u00edr\u00e1lhatja.
JMSFMQ6314.useraction = Nincs; ez csak egy inform\u00e1ci\u00f3s \u00fczenet, amely a tulajdons\u00e1g fel\u00fclb\u00edr\u00e1l\u00e1s\u00e1t jelzi.

JMSFMQ6315 = A szolg\u00e1ltat\u00f3v\u00e1ltozat 6.0.0.0 \u00e9rt\u00e9kkel fel\u00fclb\u00edr\u00e1l\u00e1sra ker\u00fclt, mivel a k\u00f6zvet\u00edt\u0151 v\u00e1ltozata V2 \u00e9s BrokerQmgr tal\u00e1lhat\u00f3 a kapcsolatgy\u00e1rban.
JMSFMQ6315.explanation = A kapcsolatgy\u00e1r szolg\u00e1ltat\u00f3v\u00e1ltozata megv\u00e1ltozott annak egy\u00e9b tulajdons\u00e1gai miatt.
JMSFMQ6315.useraction = Nincs; ez csak egy inform\u00e1ci\u00f3s \u00fczenet, amely a tulajdons\u00e1g fel\u00fclb\u00edr\u00e1l\u00e1s\u00e1t jelzi.

JMSFMQ6316 = A sorkezel\u0151 k\u00f6zz\u00e9t\u00e9tel/el\u0151fizet\u00e9s \u00fczemm\u00f3dja {0}, ez\u00e9rt a K\u00f6zz\u00e9t\u00e9tel/el\u0151fizet\u00e9s f\u00fcggv\u00e9ny eset\u00e9n {1} sz\u00fcks\u00e9ges.
JMSFMQ6316.inserts = XMSC_INSERT_TYPE,XMSC_INSERT_OTHER_TYPE
JMSFMQ6316.explanation = A sorkezel\u0151 k\u00f6zz\u00e9t\u00e9tel/el\u0151fizet\u00e9s \u00fczemm\u00f3dj\u00e1n\u00e1l d\u00f6nt\u00e9s t\u00f6rt\u00e9nt a Norm\u00e1l \u00e9s az \u00c1t\u00e1ll\u00edt\u00e1s \u00fczemm\u00f3dok k\u00f6z\u00f6tt.
JMSFMQ6316.useraction = Nincs; ez csak egy inform\u00e1ci\u00f3s \u00fczenet. Tov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt keresse meg az inform\u00e1ci\u00f3s k\u00f6zpont jm41140_ t\u00e9mak\u00f6r\u00e9t.

JMSFMQ6317 = A BrokerControlQ {0} \u00fczemm\u00f3dja nem nyithat\u00f3 meg, ez\u00e9rt a k\u00f6zz\u00e9t\u00e9tel/el\u0151fizet\u00e9s f\u00fcggv\u00e9ny sz\u00e1m\u00e1ra Norm\u00e1l \u00fczemm\u00f3d sz\u00fcks\u00e9ges.
JMSFMQ6317.inserts = XMSC_INSERT_TYPE
JMSFMQ6317.explanation = A sorkezel\u0151 k\u00f6zz\u00e9t\u00e9tel/el\u0151fizet\u00e9s \u00fczemm\u00f3dj\u00e1n\u00e1l d\u00f6nt\u00e9s t\u00f6rt\u00e9nt a Norm\u00e1l \u00e9s az \u00c1t\u00e1ll\u00edt\u00e1s \u00fczemm\u00f3dok k\u00f6z\u00f6tt.
JMSFMQ6317.useraction = Nincs; ez csak egy inform\u00e1ci\u00f3s \u00fczenet. Tov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt keresse meg az inform\u00e1ci\u00f3s k\u00f6zpont jm41140_ t\u00e9mak\u00f6r\u00e9t.

JMSFMQ6318 = A(z) ''{0}'' WMQ Server Trace Control integr\u00e1ci\u00f3 nem lehets\u00e9ges.
JMSFMQ6318.inserts = Kiv\u00e9tel
JMSFMQ6318.explanation = Nem lehetett csatlakozni a WMQ kiszolg\u00e1l\u00f3 nyomk\u00f6vet\u00e9shez.
JMSFMQ6318.useraction = Ellen\u0151rizze az oszt\u00e1ly\u00fatvonalat, hogy a com.ibm.mq.commonservices.jar szerepel-e benne.
