# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
#

JMSFMQ0001 = La modalit\u00e0 di connessione ''{0}'' non \u00e8 supportata per le connessioni XA.
JMSFMQ0001.explanation = Non tutte le modalit\u00e0 di connessione sono supportate da ogni tipo di connessione. XA richiede una modalit\u00e0 di connessione client.
JMSFMQ0001.useraction = Sostituire la modalit\u00e0 di connessione con un valore supportato.
JMSFMQ0001.inserts = XMSC_WMQ_CONNECTION_MODE

JMSFMQ0003 = Il livello di comando del gestore code ''{0}'' non corrispondeva alla versione di provider richiesta ''{1}''.
JMSFMQ0003.explanation = La versione del gestore code nella factory di connessione non corrisponde al gestore code richiesto. Una versione del provider 'non specificata' tenter\u00e0 una connessione in Modalit\u00e0 normale. 
JMSFMQ0003.useraction = Selezionare un gestore code corrispondente o modificare il livello di comando richiesto.
JMSFMQ0003.inserts = XMSC_INSERT_COMMAND_LEVEL, XMSC_WMQ_PROVIDER_VERSION

JMSFMQ0004 = Il valore ''{0}'' del canale delle conversazioni di condivisione non \u00e8 supportato per la versione ''{1}'' di provider richiesta.
JMSFMQ0004.explanation = Il valore specificato per la propriet\u00e0 del canale delle conversazioni di condivisione non \u00e8 supportato dalla versione richiesta del Provider del  gestore code. Una versione del provider 'non specificata' tenter\u00e0 una connessione in Modalit\u00e0 normale.
JMSFMQ0004.useraction = Selezionare una versione del Provider che possa supportare l'impostazione richiesta oppure modificare l'impostazione delle conversazioni di condivisione su un valore supportato.
JMSFMQ0004.inserts = XMSC_INSERT_VALUE, XMSC_WMQ_PROVIDER_VERSION

JMSFMQ0005 = L'utilizzo di una connessione client non \u00e8 supportato all'interno dell'ambiente corrente.
JMSFMQ0005.explanation = La modalit\u00e0 di connessione client non \u00e8 supportata in tutti gli ambienti.
JMSFMQ0005.useraction = Modificare la modalit\u00e0 di connessione in modo da specificare una connessione di bind a un gestore code locale.

JMSFMQ0007 = Una propriet\u00e0 sconosciuta ''{0}'' con valore ''{1}'' era stata impostata sul contesto della propriet\u00e0 factory di connessione.
JMSFMQ0007.explanation = La propriet\u00e0 ''{0}'' non \u00e8 stata riconosciuta - potrebbe essere una propriet\u00e0 personalizzata.
JMSFMQ0007.useraction = Assicurarsi che sia una a tutti gli effetti propriet\u00e0 personalizzata.
JMSFMQ0007.inserts = XMSC_INSERT_KEY, XMSC_INSERT_VALUE

JMSFMQ0010 = Il valore ''{0}'' non \u00e8 valido per la propriet\u00e0 configurazione client ''{1}'', il valore \u00e8 stato ignorato.
JMSFMQ0010.explanation = E' stato effettuato un tentativo di impostare una propriet\u00e0 configurazione client fuori dall'intervallo valido.
JMSFMQ0010.useraction = L'impostazione deve essere modificata per contenere un valore valido. Consultare la documentazione per ulteriori informazioni.
JMSFMQ0010.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_NAME

JMSFMQ1006 = Il valore ''{0}'' per la propriet\u00e0 ''{1}'' non \u00e8 valido.
JMSFMQ1006.explanation = Il valore specificato per la propriet\u00e0 non \u00e8 supportato.
JMSFMQ1006.useraction = Modificare il valore affinch\u00e9 sia all'interno dell'intervallo dei valori consentiti.
JMSFMQ1006.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_NAME

JMSFMQ1007 = Un messaggio di log da RTT (Real Time Transport) ''{0}''.
JMSFMQ1007.explanation = RTT (Real Time Transport) ha registrato un errore nel log.
JMSFMQ1007.inserts = XMSC_REAL_TIME_LOG_MSG

JMSFMQ1056 = Il tipo di dati ''{0}'' della propriet\u00e0 o dell''elemento non \u00e8 supportato.
JMSFMQ1056.explanation = Il tipo di dati dell'oggetto fornito non \u00e8 consentito per il campo fornito.  
JMSFMQ1056.useraction = Modificare l'oggetto affinch\u00e9 sia di un tipo consentito.
JMSFMQ1056.inserts = XMSC_INSERT_NAME

JMSFMQ1105 = Non \u00e8 possibile specificare la porta locale ''{0}'' per una connessione diretta a un broker che utilizza multicast.
JMSFMQ1105.explanation = \u00c8 stato specificato il numero porta. Non \u00e8 valido per il multicast.
JMSFMQ1105.useraction = Rimuovere il riferimento della porta dall'impostazione dell'indirizzo locale del multicast.
JMSFMQ1105.inserts = XMSC_WMQ_LOCAL_ADDRESS

JMSFMQ3032 = La reimpostazione di clientID non \u00e8 consentita.
JMSFMQ3032.explanation = L'ID client di una connessione pu\u00f2 essere impostato solo una volta e solo prima di utilizzare la connessione
JMSFMQ3032.useraction = Impostare l'ID client prima di utilizzare la connessione.

JMSFMQ3036 = La selezione del messaggio lato broker \u00e8 valida solo quando si utilizza IBM Integration Bus.
JMSFMQ3036.explanation = La versione del broker e la selezione del messaggio non sono coerenti.
JMSFMQ3036.useraction = Assicurarsi che la versione del broker (JMSC.MQJMS_BROKER_V2) sia stata impostata nel ConnectionFactory.

JMSFMQ3037 = La versione del broker e la versione del provider impostate contemporaneamente: la versione del provider ''{0}'' sovrascrive la versione ''{1}'' del broker.
JMSFMQ3037.explanation = La versione del broker e la versione del fornitore non devono essere impostate contemporaneamente.
JMSFMQ3037.useraction = Assicurarsi che sia stata impostata nel ConnectionFactory o la versione del broker oppure la versione del provider, non entrambe.
JMSFMQ3037.inserts = XMSC_WMQ_PROVIDER_VERSION, XMSC_WMQ_BROKER_VERSION

JMSFMQ6115 = Si \u00e8 verificata un'eccezione durante la creazione di TopicConnection.
JMSFMQ6115.useraction = Per ulteriori informazioni vedere l'eccezione collegata.

JMSFMQ6311 = Il tipo di trasporto 'DIRECT' all'interno di una transazione non \u00e8 supportato.
JMSFMQ6311.explanation = L'applicazione ha tentato di utilizzare un metodo transazionale. Questo non \u00e8 supportato con un tipo di trasporto DirectIP.
JMSFMQ6311.useraction = Si dovrebbe modificare l'applicazione per evitare l'uso di transazioni.

JMSFMQ6312 = Si \u00e8 verificata un'eccezione nel Java(tm) MQI.
JMSFMQ6312.explanation = Il Java(tm) MQI ha emesso un'eccezione che descrive il problema. 
JMSFMQ6312.useraction = Per ulteriori informazioni vedere l'eccezione collegata.

JMSFMQ6313 = \u00c8 stata creata una connessione WMQ di tipo ''{0}''.
JMSFMQ6313.inserts = XMSC_INSERT_VALUE
JMSFMQ6313.explanation = Una connessione pu\u00f2 essere effettuata in Modalit\u00e0 normale o in Modalit\u00e0 di migrazione.
JMSFMQ6313.useraction = Se questo non \u00e8 il tipo di connessione previsto ricercare nel Centro informazioni l'argomento jm41140_  per ulteriori informazioni.

JMSFMQ6314 = La versione del provider ''{0}'' fornita dalla factory di connessione \u00e8 stata sostituita con ''{1}''.
JMSFMQ6314.inserts = XMSC_WMQ_PROVIDER_VERSION,XMSC_INSERT_NAME
JMSFMQ6314.explanation = La versione del provider della factory di connessione pu\u00f2 essere sostituita dalla propriet\u00e0 di configurazione client.
JMSFMQ6314.useraction = Nessuna; questo \u00e8 un messaggio informativo che indica che \u00e8 stata sostituita una propriet\u00e0.

JMSFMQ6315 = La versione del provider \u00e8 stata sostituita con la 6.0.0.0, poich\u00e9 la versione del broker \u00e8 impostata su V2 e il BrokerQmgr \u00e8 presente in ConnectionFactory.
JMSFMQ6315.explanation = La versione del provider della factory di connessione \u00e8 stata modificata in base ad altre propriet\u00e0 della factory di connessione.
JMSFMQ6315.useraction = Nessuna; questo \u00e8 un messaggio informativo che indica che \u00e8 stata sostituita una propriet\u00e0.

JMSFMQ6316 = La modalit\u00e0 di sottoscrizione di pubblicazione del gestore code \u00e8 la modalit\u00e0 ''{0}'', ''{1}'' \u00e8 pertanto necessaria per la funzione di sottoscrizione di pubblicazione.
JMSFMQ6316.inserts = XMSC_INSERT_TYPE,XMSC_INSERT_OTHER_TYPE
JMSFMQ6316.explanation = In base alla modalit\u00e0 di sottoscrizione pubblicata del gestore code, \u00e8 stata adottata una decisione sull'utilizzo della modalit\u00e0 normale o della modalit\u00e0 di migrazione.
JMSFMQ6316.useraction = Nessuna; questo \u00e8 un messaggio informativo. Per ulteriori informazioni, ricercare nel Centro informazioni l'argomento jm41140_.

JMSFMQ6317 = Impossibile aprire la modalit\u00e0 ''{0}'' del BrokerControlQ, la modalit\u00e0 normale \u00e8 pertanto richiesta per la funzione di sottoscrizione di pubblicazione.
JMSFMQ6317.inserts = XMSC_INSERT_TYPE
JMSFMQ6317.explanation = In base alla modalit\u00e0 di sottoscrizione pubblicata del gestore code, \u00e8 stata adottata una decisione sull'utilizzo della modalit\u00e0 normale o della modalit\u00e0 di migrazione.
JMSFMQ6317.useraction = Nessuna; questo \u00e8 un messaggio informativo. Per ulteriori informazioni, ricercare nel Centro informazioni l'argomento jm41140_.

JMSFMQ6318 = Impossibile effettuare l''integrazione con il WMQ Server Trace Control ''{0}''.
JMSFMQ6318.inserts = Eccezione
JMSFMQ6318.explanation = Impossibile connettersi al WMQ Server Trace.
JMSFMQ6318.useraction = Controllare il percorso di classe per accertarsi che sia presente com.ibm.mq.commonservices.jar.
