#
#  <copyright
#   notice="lm-source-program"
#   pids="5724-H72"
#   years="2008,2017"
#   crc="2248028677" >
#   Licensed Materials - Property of IBM
#                                          
#   5724-H72                           
#                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.
#                                                      
#   US Government Users Restricted Rights - Use, duplication or
#   disclosure restricted by GSA ADP Schedule Contract with
#   IBM Corp.                                           
#   </copyright>   
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
SEVERITY=10
PROGNOTE=5724-H72 (C) Copyright IBM Corp. 1994 V\u0161echna pr\u00e1va vyhrazena.
MSG=Nezda\u0159ilo se na\u010d\u00edst nativn\u00ed knihovnu JNI produktu &MQ_long: \'&3\'.
XPL=Nativn\u00ed knihovna JNI \'&3\' nemohla b\u00fdt na\u010dtena, jeliko\u017e nebyla nalezena. \
&p &p Prost\u0159ed\u00ed JVM se pokusilo o na\u010dten\u00ed nativn\u00ed knihovny platformy \'&3\',&p kter\u00e1 byla namapov\u00e1na na souboru s n\u00e1zvem: \'&2\'.&p &p P\u0159i pokusu o na\u010dten\u00ed t\u00e9to knihovny prost\u0159ed\u00ed JVM ohl\u00e1silo chybovou&p zpr\u00e1vu:&p &1&p &p Bitov\u00e1 velikost JVM je: \'&4\'&p &p K vyhled\u00e1n\u00ed t\u00e9to knihovny byla pou\u017eita tato cesta ke knihovn\u011b:&p &5&p &p Zkontrolujte, zda tato bitov\u00e1 velikost prost\u0159ed\u00ed JVM odpov\u00edd\u00e1 bitov\u00e9 velikosti prvn\u00edho&p souboru nativn\u00ed knihovny, kter\u00fd se nach\u00e1z\u00ed v tomto seznamu adres\u00e1\u0159\u016f&p java.library.path.&p &p Nativn\u00ed knihovnu \'&3\' pou\u017e\u00edvaj\u00ed t\u0159\u00eddy &MQ_long pro jazyk &p Java a t\u0159\u00eddy &MQ_long pro JMS pro vytvo\u0159en\u00ed p\u0159ipojen\u00ed ke &p spr\u00e1vci front s pou\u017eit\u00edm p\u0159ipojen\u00ed v re\u017eimu 'vazeb'. \
P\u0159ipojen\u00ed v re\u017eimu &p vazeb je p\u0159ipojen\u00ed, kter\u00e9 se spr\u00e1vcem front komunikuje &p prost\u0159ednictv\u00edm pam\u011bti syst\u00e9mu, na rozd\u00edl od p\u0159ipojen\u00ed v re\u017eimu&p 'klienta', kter\u00e9 k tomu pou\u017e\u00edv\u00e1 soket TCP/IP.&p &p  Aby bylo mo\u017en\u00e9 se spr\u00e1vcem front komunikovat s pou\u017eit\u00edm p\u0159ipojen\u00ed &p v re\u017eimu klienta, mus\u00ed se tento spr\u00e1vce front nach\u00e1zet ve stejn\u00e9m &p syst\u00e9mu jako t\u0159\u00eddy &MQ_long pro jazyk Java/JMS. \
Pokud tomu tak ve&p va\u0161em prost\u0159ed\u00ed nen\u00ed, zva\u017ete zm\u011bnu konfigurace aplikace a vyu\u017eit\u00ed&p p\u0159ipojen\u00ed v re\u017eimu klienta.&p 
URESP=Ujist\u011bte se, \u017ee cesta ke knihovn\u011b java odkazuje na um\u00edst\u011bn\u00ed knihovny JNI.
# THIS FILE MUST BE MAINTAINED CONSISTENTLY WITH THE EQUIVALENT '.MSG' FILE IN THE mqdist_nls COMPONENT
