#
#  <copyright
#   notice="lm-source-program"
#   pids="5724-H72"
#   years="2008,2017"
#   crc="2248028677" >
#   Licensed Materials - Property of IBM
#                                          
#   5724-H72                           
#                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.
#                                                      
#   US Government Users Restricted Rights - Use, duplication or
#   disclosure restricted by GSA ADP Schedule Contract with
#   IBM Corp.                                           
#   </copyright>   
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
SEVERITY=30
PROGNOTE=rrcE_SSLTC_LOAD_LIBRARY 63H9336 (C) Copyright IBM Corp. 2001 All rights reserved
MSG=La biblioth\u00e8que \'&3\' est introuvable.
XPL=Le chargement dynamique de la biblioth\u00e8que \'&3\' a \u00e9chou\u00e9 car la biblioth\u00e8que est introuvable. S'il s'agit d'une biblioth\u00e8que &MQ_long, elle n'est disponible que sur des installations de serveurs &MQ_long et est requise lorsque la commande de transfert des certificats (amqtcert) est utilis\u00e9e pour effectuer une op\u00e9ration du gestionnaire de files d'attente. S'il s'agit d'une biblioth\u00e8que GSKit, elle aurait d\u00fb \u00eatre install\u00e9e au cours de l'installation &MQ_long.
URESP=N'utilisez pas la commande pour effectuer une op\u00e9ration de gestionnaire de files d'attente sur une installation &MQ_long client uniquement. Si la commande a \u00e9t\u00e9 lanc\u00e9e sur une installation de serveur &MQ_long, ou si une biblioth\u00e8que GSKit manque, notez l'identificateur du probl\u00e8me, enregistrez les fichiers de sortie g\u00e9n\u00e9r\u00e9s et utilisez le site de support de &MQ_short (http://www.ibm.com/software/integration/wmq/support) ou IBM Support Assistant (ISA) (http://www.ibm.com/software/support/isa/) pour v\u00e9rifier si une solution est d\u00e9j\u00e0 disponible. Si vous n'en trouvez pas, adressez-vous \u00e0 votre service d'assistance IBM. Ne supprimez pas ces fichiers tant que le probl\u00e8me n'a pas \u00e9t\u00e9 r\u00e9solu.
# THIS FILE MUST BE MAINTAINED CONSISTENTLY WITH THE EQUIVALENT '.MSG' FILE IN THE mqdist_nls COMPONENT
