#
#  <copyright
#   notice="lm-source-program"
#   pids="5724-H72"
#   years="2008,2017"
#   crc="2248028677" >
#   Licensed Materials - Property of IBM
#                                          
#   5724-H72                           
#                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.
#                                                      
#   US Government Users Restricted Rights - Use, duplication or
#   disclosure restricted by GSA ADP Schedule Contract with
#   IBM Corp.                                           
#   </copyright>   
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
SEVERITY=30
PROGNOTE=63H9336 (C) Copyright IBM Corp. 1993,1998 V\u0161echna pr\u00e1va vyhrazena
MSG=Nezda\u0159ilo se vyjedn\u00e1v\u00e1n\u00ed parametr\u016f kan\u00e1lu.
XPL=Kan\u00e1l \'&3\' mezi t\u00edmto po\u010d\u00edta\u010dem a vzd\u00e1len\u00fdm po\u010d\u00edta\u010dem \'&4\' se nezda\u0159ilo vytvo\u0159it v d\u016fsledku selh\u00e1n\u00ed jedn\u00e1n\u00ed. V n\u011bkter\u00fdch p\u0159\u00edpadech nelze n\u00e1zev kan\u00e1lu zjistit, tak\u017ee se n\u00e1zev zobraz\u00ed jako \'????\'. &P Posledn\u00ed p\u0159ijat\u00e1 \u0159\u00eddic\u00ed data byla typu &1 s p\u0159idru\u017een\u00fdm k\u00f3dem chyby &2.
URESP=Informujte o probl\u00e9mu administr\u00e1tora syst\u00e9mu, kter\u00fd by se m\u011bl pokusit zjistit p\u0159\u00ed\u010dinu selh\u00e1n\u00ed kan\u00e1lu s pou\u017eit\u00edm standardn\u00edch technik ur\u010dov\u00e1n\u00ed probl\u00e9m\u016f. K nim pat\u0159\u00ed nap\u0159\u00edklad vyhled\u00e1n\u00ed soubor\u016f FFST a prostudov\u00e1n\u00ed z\u00e1znam\u016f o chyb\u00e1ch v lok\u00e1ln\u00edm i vzd\u00e1len\u00e9m syst\u00e9mu, kter\u00e9 mohou obsahovat zpr\u00e1vy objas\u0148uj\u00edc\u00ed p\u0159\u00ed\u010dinu selh\u00e1n\u00ed. Dal\u0161\u00ed informace lze z\u00edskat zopakov\u00e1n\u00edm operace s povolen\u00fdm trasov\u00e1n\u00edm.
# THIS FILE MUST BE MAINTAINED CONSISTENTLY WITH THE EQUIVALENT '.MSG' FILE IN THE mqdist_nls COMPONENT
