# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
#

# JMSWMQ0002 is a WMQException message so no .inserts needed
JMSWMQ0002 = Zus\u00e4tzliche Diagnoseinformationen von MQSTAT: Beendigungscode ''{0}'' Ursache ''{1}'' Objektname ''{2}'' Aufgel\u00f6ster Objektname ''{3}'' Objekttyp ''{4}'' Name des Warteschlangenmanagers ''{5}'' Aufgel\u00f6ster Name des Warteschlangenmanagers ''{6}'' Anzahl an Fehlern beim Einreihen ''{7}'' Anzahl an erfolgreichem Einreihen ''{8}'' Anzahl an Warnungen beim Einreihen ''{9}''

JMSWMQ0003 = Die Befehlsebene ''{0}'' des Warteschlangenmanagers stimmte nicht mit der angeforderten Providerversion ''{1}'' \u00fcberein.
JMSWMQ0003.inserts = XMSC_INSERT_COMMAND_LEVEL, XMSC_WMQ_PROVIDER_VERSION

JMSWMQ0006 = IBM MQ Classes for JMS verwendet einen Datentyp, der von einer Nachricht nicht unterst\u00fctzt wird, oder liest Daten mit einem falschen Typ.
JMSWMQ0006.explanation = Zum Lesen von Nachrichteneigenschaftentypen werden falsche Datentypen verwendet.
JMSWMQ0006.useraction = Vergewissern Sie sich, dass die empfangene Nachricht und die zu lesenden Eigenschaften den erwarteten Typ aufweisen.
JMSWMQ0006.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSWMQ0007 = IBM MQ Classes for JMS verwendet einen Datentyp, der von einer Nachricht nicht unterst\u00fctzt wird, oder liest Daten mit einem falschen Typ.
JMSWMQ0007.explanation = Falsche Datentypen beim Lesen von Nachrichteneigenschaftstypen verwendet.
JMSWMQ0007.useraction = Pr\u00fcfen Sie, ob die erhaltene Nachricht und die zu lesenden Eigenschaften den erwarteten Typ aufweisen.
JMSWMQ0007.exception = com.ibm.msg.client.jms.DetailedMessageNotReadableException

JMSWMQ0008 = PRODUCT_NAME Classes for JMS verwendet einen Datentyp, der von einer Nachricht nicht unterst\u00fctzt wird, oder schreibt Daten mit einem falschen Typ.
JMSWMQ0008.explanation = Zum Schreiben von Nachrichteneigenschaftentypen werden falsche Datentypen verwendet.
JMSWMQ0008.useraction = Vergewissern Sie sich, dass die empfangene Nachricht und die zu schreibenden Eigenschaften den erwarteten Typ aufweisen.
JMSWMQ0008.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSWMQ0009 = PRODUCT_NAME Classes for JMS kann die f\u00fcr eine Methode erforderlichen Ressourcen nicht zuordnen.
JMSWMQ0009.explanation = M\u00f6glicherweise sind die Maschinenressourcen \u00fcberlastet; die verlinkte Ausnahmebedingung enth\u00e4lt eventuell weitere Informationen hierzu.
JMSWMQ0009.useraction = \u00dcberpr\u00fcfen Sie die Systemressourcen und f\u00fchren Sie einen Ladevorgang aus.
JMSWMQ0009.exception = com.ibm.msg.client.jms.DetailedResourceAllocationException

JMSWMQ0010 = Die Befehlsebene von Warteschlangenmanager ''{0}'' konnte nicht abgerufen werden.
JMSWMQ0010.useraction = Weitere Informationen finden Sie in der verlinkten Ausnahmebedingung.
JMSWMQ0010.inserts = XMSC_INSERT_QUEUE_MANAGER

JMSWMQ0011 = Die Java(tm)-Schnittstelle zur MQI ''{0}'' konnte nicht initialisiert werden.
JMSWMQ0011.useraction = Weitere Informationen finden Sie in der verlinkten Ausnahmebedingung.
JMSWMQ0011.inserts = XMSC_INSERT_EXCEPTION

JMSWMQ0013 = Job konnte nicht in Warteschlange gestellt werden.
JMSWMQ0013.useraction = Weitere Informationen finden Sie in der verlinkten Ausnahmebedingung.

JMSWMQ0014 = Konvertierung eines Nullwerts in einen byte-, int-, short- oder long-Wert nicht m\u00f6glich.
JMSWMQ0014.exception = java.lang.NumberFormatException

JMSWMQ0015 = Konvertierung eines Nullwerts in einen Zeichen-, double- oder float-Wert nicht m\u00f6glich.
JMSWMQ0015.exception = java.lang.NullPointerException

JMSWMQ0016 = Die Serialisation des Objekts ist fehlgeschlagen.
JMSWMQ0016.useraction = \u00dcberpr\u00fcfen Sie die Fehlerursache, um weitere Informationen zu erhalten.
JMSWMQ0016.exception = java.lang.IOException

JMSWMQ0017 = Ende des Datenstroms.
JMSWMQ0017.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSWMQ0018 = Die Verbindung zum Warteschlangenmanager ''{0}'' mit dem Verbindungsmodus ''{1}'' und dem Hostnamen ''{2}'' konnte nicht hergestellt werden.
JMSWMQ0018.useraction = Vergewissern Sie sich, dass der Warteschlangenmanager gestartet wurde, und falls er im Clientmodus ausgef\u00fchrt wird, pr\u00fcfen Sie, ob ein Empfangsprogramm aktiv ist. Weitere Informationen finden Sie in der verlinkten Ausnahmebedingung.
JMSWMQ0018.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_HOST_NAME

JMSWMQ0019 = Die Verbindung zum Warteschlangenmanager ''{0}'' konnte mit dem Verbindungsmodus ''{1}'' und dem Hostnamen ''{2}'' nicht getrennt werden.
JMSWMQ0019.useraction = Weitere Informationen finden Sie in der verlinkten Ausnahmebedingung.
JMSWMQ0019.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_HOST_NAME

JMSWMQ0020 = Die Registrierung des Callbacks mit MQCB f\u00fcr die Zieladresse ''{0}'' ist fehlgeschlagen.
JMSWMQ0020.useraction = Weitere Informationen finden Sie in der verlinkten Ausnahmebedingung.
JMSWMQ0020.inserts = XMSC_DESTINATION_NAME

JMSWMQ0021 = Die Registrierung des Callbacks mit MQCB f\u00fcr die Zieladresse ''{0}'' konnte nicht zur\u00fcckgenommen werden.
JMSWMQ0021.useraction = Weitere Informationen finden Sie in der verlinkten Ausnahmebedingung.
JMSWMQ0021.inserts = XMSC_DESTINATION_NAME

JMSWMQ0022 = Das Aufrufen von Benutzernachrichten mit MQCTL f\u00fcr die Zieladresse ''{0}'' ist fehlgeschlagen.
JMSWMQ0022.useraction = Weitere Informationen finden Sie in der verlinkten Ausnahmebedingung.
JMSWMQ0022.inserts = XMSC_DESTINATION_NAME

JMSWMQ0023 = Das Aussetzen von Benutzernachrichten mit MQCTL f\u00fcr die Zieladresse ''{0}'' ist fehlgeschlagen.
JMSWMQ0023.useraction = Weitere Informationen finden Sie in der verlinkten Ausnahmebedingung.
JMSWMQ0023.inserts = XMSC_DESTINATION_NAME

JMSWMQ0024 = Das Wiederaufnehmen von Benutzernachrichten mit MQCTL f\u00fcr die Zieladresse ''{0}'' ist fehlgeschlagen.
JMSWMQ0024.useraction = Weitere Informationen finden Sie in der verlinkten Ausnahmebedingung.
JMSWMQ0024.inserts = XMSC_DESTINATION_NAME

JMSWMQ0025 = Das Aufheben der Subskription von Thema ''{0}'' mit MQCLOSE ist fehlgeschlagen.
JMSWMQ0025.explanation = M\u00f6glicherweise trat beim Entfernen der Subskription ein Problem auf, da sie gerade von einem Nachrichtenkonsumenten verwendet wird.
JMSWMQ0025.useraction = \u00dcberpr\u00fcfen Sie vor der Aufhebung einer Subskription, ob alle Nachrichtenkonsumenten, die diese Subskription nutzen, geschlossen sind. Weitere Informationen finden Sie in der verlinkten Ausnahmebedingung.
JMSWMQ0025.inserts = XMSC_DESTINATION_NAME

JMSWMQ0026 = Die Subskription f\u00fcr Thema ''{0}'' mit dem Selektor ''{1}'' mithilfe von MQSUB ist fehlgeschlagen.
JMSWMQ0026.explanation = Bei der Erstellung der Subskription lag m\u00f6glicherweise ein Problem vor, da sie gerade von einem anderen Nachrichtenkonsumenten genutzt wurde.
JMSWMQ0026.useraction = \u00dcberpr\u00fcfen Sie vor der Aufhebung einer Subskription, ob alle Nachrichtenkonsumenten, die diese Subskription nutzen, geschlossen sind, bevor Sie eine neue Subskription unter diesem Namen erstellen. Weitere Informationen finden Sie in der verlinkten Ausnahmebedingung.
JMSWMQ0026.inserts = XMSC_DESTINATION_NAME, XMSC_SELECTOR_STRING

# The insert for this message is CommonConstants.WMQ_ENCODING = "encoding".
# If WMQ_ENCODING is changed then this value here must also be changed.
JMSWMQ0027 = Die Nachricht enth\u00e4lt eine fehlerhafte Codierung (''{0}'').
JMSWMQ0027.explanation = Es wurde eine Nachricht mit einem falsch formatierten Header empfangen. Die Codierung muss entweder normal oder umgekehrt sein.
JMSWMQ0027.useraction = Stellen Sie sicher, dass alle Nicht-JMS-Anwendungen, die Nachrichten erstellen, richtig formatierte Header erstellen.
JMSWMQ0027.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSWMQ0027.inserts = Codierung

JMSWMQ0028 = Mindestens eine asynchrone Einreihungsnachricht ist fehlgeschlagen oder hat eine Warnung ausgegeben.
JMSWMQ0028.explanation = Wenn eine Nachricht asynchron eingereiht wird, werden eventuell bestehende Probleme nicht als \u00fcber die Methode send() ausgegebene Ausnahmebedingungen gemeldet. Stattdessen werden sie an das Empfangsprogramm f\u00fcr Ausnahmebedingungen \u00fcbergeben, falls dieses definiert ist. Das Empfangsprogramm f\u00fcr Ausnahmebedingungen wird am Synchronisationspunkt f\u00fcr abgewickelte Sitzungen oder alle asynchronen SEND_CHECK_COUNT-Einreihungen bei nicht abgewickelten Sitzungen gesteuert.
JMSWMQ0028.useraction = Weitere Informationen zu den Fehlern und/oder Warnungen finden Sie in der verlinkten Ausnahmebedingung.

JMSWMQ0029 = Fehler beim Senden einer Berichtsnachricht an die replyTo-Warteschlange ''{0}''. 
JMSWMQ0029.useraction = Weitere Informationen zu den Fehlern und/oder Warnungen finden Sie in der verlinkten Ausnahmebedingung.
JMSWMQ0029.inserts = XMSC_DESTINATION_NAME

JMSWMQ0030 = ''{0}'' ist f\u00fcr die Zieladresse ''{1}'' beim Verarbeiten einer Poison-Nachricht. 
JMSWMQ0030.explanation = Beim erneuten Einreihen einer Poison-Nachricht ist ''{0}'' nach einem Aufruf f\u00fcr die Zieladresse ''{1}'' fehlgeschlagen.  
JMSWMQ0030.useraction = Weitere Informationen zu den Fehlern und/oder Warnungen finden Sie in der verlinkten Ausnahmebedingung.
JMSWMQ0030.inserts = XMSC_INSERT_METHOD, XMSC_DESTINATION_NAME

JMSWMQ0031 = ''{0}'' ist f\u00fcr den Warteschlangenmanager beim Verarbeiten einer Poison-Nachricht fehlgeschlagen. 
JMSWMQ0031.explanation = Beim erneuten Einreihen einer Poison-Nachricht ist ''{0}'' beim Versuch, Daten zum Warteschlangenmanager abzufragen, fehlgeschlagen.  
JMSWMQ0031.useraction = Weitere Informationen zu den Fehlern und/oder Warnungen finden Sie in der verlinkten Ausnahmebedingung.
JMSWMQ0031.inserts = XMSC_INSERT_METHOD

JMSWMQ0032 = Es ist keine Warteschlange f\u00fcr nicht zustellbare Nachrichten definiert.
JMSWMQ0032.explanation = PRODUCT_NAME Classes for JMS versuchte, eine Poison-Nachricht in eine Warteschlange f\u00fcr nicht zustellbare Nachrichten einzureihen, da diese nicht an die Zur\u00fcckstellungswarteschlange weitergeleitet werden konnte. Dieser Versuch schlug fehl, da im Warteschlangenmanager keine Warteschlange f\u00fcr nicht zustellbare Nachrichten definiert war. 
JMSWMQ0032.useraction = Definieren Sie eine Warteschlange f\u00fcr nicht zustellbare Nachrichten.

JMSWMQ0033 = Der Name der Zur\u00fcckstellungswarteschlange f\u00fcr die Zieladresse ''{0}'' kann nicht \u00fcber die ID des codierten Zeichensatzes (''{1}'') f\u00fcr den Warteschlangenmanager konvertiert werden.
JMSWMQ0033.useraction = \u00dcberpr\u00fcfen Sie den Namen der Zur\u00fcckstellungswarteschlange und die codierte Zeichensatz-ID des Warteschlangenmanagers. 
JMSWMQ0033.inserts = XMSC_DESTINATION_NAME, CCSID

JMSWMQ0034 = Der Name der Warteschlange f\u00fcr nicht zustellbare Nachrichten kann nicht \u00fcber die ID des codierten Zeichensatzes (''{0}'') f\u00fcr den Warteschlangenmanager konvertiert werden.
JMSWMQ0034.useraction = \u00dcberpr\u00fcfen Sie den Namen der Warteschlange f\u00fcr nicht zustellbare Nachrichten und die codierte Zeichensatz-ID des Warteschlangenmanagers.
JMSWMQ0034.inserts = CCSID

JMSWMQ0035 = In die Warteschlange f\u00fcr nicht zustellbare Nachrichten konnten aufgrund der Ausnahmebedingung ''{0}'' keine Daten geschrieben werden.
JMSWMQ0035.explanation = PRODUCT_NAME Classes for JMS konnte eine Nachricht nicht erneut in die Warteschlange f\u00fcr nicht zustellbare Nachrichten einreihen.
JMSWMQ0035.inserts = XMSC_INSERT_EXCEPTION

JMSWMQ0036 = Application Server Facilities ermittelte die Ausnahmebedingung ''{0}''.
JMSWMQ0036.explanation = Der Verbindungs-Browser f\u00fcr PRODUCT_NAME Classes for JMS ermittelte eine Ausnahmebedingung.
JMSWMQ0036.inserts = XMSC_INSERT_EXCEPTION

JMSWMQ0037 = Eine Poison-Nachricht konnte aufgrund der Ausnahmebedingung ''{0}'' nicht bearbeitet werden.
JMSWMQ0037.explanation = Das Nachrichtenempfangsprogramm f\u00fcr PRODUCT_NAME Classes for JMS ermittelte eine Ausnahmebedingung.
JMSWMQ0037.inserts = XMSC_INSERT_EXCEPTION

JMSWMQ1006 = Der Wert f\u00fcr ''{0}'':''{1}'' ist nicht g\u00fcltig.
JMSWMQ1006.explanation = Der Wert ''{1}'' f\u00fcr die Eigenschaft ''{0}'' ist falsch.
JMSWMQ1006.useraction = Weitere Informationen hierzu finden Sie in den Ursachen der damit verbundenen IBM MQ-Ausnahmebedingung und dem Beendigungscode.
JMSWMQ1006.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_VALUE

JMSWMQ1017 = Nicht lokale MQ-Warteschlange ''{0}'' ist zum Empfangen oder Durchsuchen ung\u00fcltig.
JMSWMQ1017.explanation = Die MQ-Warteschlange kann nicht ge\u00f6ffnet werden, da sie f\u00fcr den verbundenen Warteschlangenmanager keine lokale Warteschlange darstellt. 
JMSWMQ1017.useraction = Stellen Sie eine Verbindung zu dem Warteschlangenmanager her, f\u00fcr den diese MQ-Warteschlange lokal ist.
JMSWMQ1017.inserts = XMSC_DESTINATION_NAME

JMSWMQ1029 = Eigenschaftsname ist Null.
JMSWMQ1029.explanation = Die Methode 'itemExists()' der Zuordnungsnachricht wurde mit einem Elementnamen aufgerufen, der Nullwerte enthielt, oder eine Nullnamenzeichenfolge wurde als Argument f\u00fcr eine Methode verwendet, \u00fcber die Eigenschaftswerte nach Namen aus einer JMS-Nachricht abgerufen werden.
JMSWMQ1029.useraction = Achten Sie darauf, dass die angegebenen Namenszeichenfolgen keine Nullwerte aufweisen.

JMSWMQ1044 = Zeichenfolge ist keine g\u00fcltige Hexadezimalzahl - ''{0}''.
JMSWMQ1044.inserts = XMSC_INSERT_HEX_STRING
JMSWMQ1044.explanation = Entweder wurde versucht, eine Gruppen-ID oder Korrelations-ID festzulegen, die mit der Pr\u00e4fix-ID beginnt, jedoch nicht durch einen korrekt formatierten Hexadezimalwert gefolgt ist, oder es wurde versucht, eine Nachricht zu empfangen, die eine MQRFH2-Eigenschaft des Typs 'bin.hex' enth\u00e4lt, die keinen korrekt formatierten Hexadezimalwert aufweist.
JMSWMQ1044.useraction = Stellen Sie sicher, dass ein g\u00fcltiger Hexadezimalwert immer dem ID-Pr\u00e4fix folgt, wenn Sie Werte f\u00fcr eine Gruppen-ID oder Korrelations-ID festlegen. Stellen Sie au\u00dferdem sicher, dass alle von Nicht-JMS-Anwendungen generierten MQRFH2-Header richtig formatiert sind.

JMSWMQ1046 = Der Zeichensatz ''{0}'' wird nicht unterst\u00fctzt.
JMSWMQ1046.inserts = CCSID
JMSWMQ1046.explanation = Es wurde versucht, eine Zuordnungsnachricht, Datenstromnachricht oder Textnachricht zu senden oder zu empfangen, deren Hauptteil mit einem Zeichensatz codiert ist, der nicht von der JVM unterst\u00fctzt wird. Bei Textnachrichten wird diese Ausnahmebedingung m\u00f6glicherweise ausgegeben, wenn zuerst der Hauptteil der Nachricht abgefragt wird, nicht zum Zeitpunkt des Empfangs.
JMSWMQ1046.useraction = Codieren Sie eine Nachricht nur mit einem Zeichensatz, welcher der empfangenden Anwendung nachweislich zur Verf\u00fcgung steht.
JMSWMQ1046.exception = com.ibm.msg.client.jms.DetailedMessageFormatException


JMSWMQ1051 = Nachrichtendetails

JMSWMQ1055 = Die Eigenschaft oder das Element in der Nachricht hat den Datentyp ''{0}'', der nicht mit der Methode kompatibel ist, die f\u00fcr den Zugriff auf die Eigenschaft oder das Element verwendet wurde.
JMSWMQ1055.inserts = XMSC_INSERT_TYPE
JMSWMQ1055.explanation = Die Zugriffsmethode, die zum Abrufen einer Eigenschaft aus einer JMS-Nachricht verwendet wurde, ist nicht mit dem Eigenschaftstyp kompatibel, der abgerufen wurde. Ein Beispiel hierf\u00fcr ist der Abruf einer Integer-Eigenschaft mit der Methode getBooleanProperty().
JMSWMQ1055.useraction = Verwenden Sie eine Zugriffsmethode, die in der JMS-Spezifikation f\u00fcr das Abrufen von Eigenschaftswerten mit dem erforderlichen Typ definiert ist.
JMSWMQ1055.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSWMQ1059 = Schwerwiegender Fehler - UTF-8 wird nicht unterst\u00fctzt.
JMSWMQ1059.explanation = Die Java(tm) Runtime Environment, mit der Sie arbeiten, unterst\u00fctzt keine UTF-8-Zeichencodierung. Diese Codierung muss f\u00fcr JMS jedoch unterst\u00fctzt werden, damit einige Operationen ausgef\u00fchrt werden k\u00f6nnen.
JMSWMQ1059.useraction = Lesen Sie die Informationen in der Dokumentation, und/oder wenden Sie sich an den Provider der Java(tm) Runtime Environment, um zu ermitteln, wie die Unterst\u00fctzung f\u00fcr die UTF-8-Zeichencodierung gew\u00e4hrleistet werden kann.
JMSWMQ1059.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSWMQ1067 = Der Zeitlimitwert ''{0}'' ist f\u00fcr IBM MQ Classes for JMS nicht g\u00fcltig.
JMSWMQ1067.explanation = Es wurde versucht, die Empfangsmethode bei einer Methode des Warteschlangenempf\u00e4ngers oder Themensubskribenten aufzurufen. Dabei war jedoch ein hoher Zeitlimitwert angegeben, der nicht g\u00fcltig ist.
JMSWMQ1067.useraction = Vergewissern Sie sich, dass der angegebene Zeitlimitwert nicht negativ und nicht gr\u00f6\u00dfer als der Wert von Integer.MAX_VALUE ist.
JMSWMQ1067.inserts = XMSC_INSERT_TIMEOUT

JMSWMQ1068 = Die XA-Ressource konnte nicht erhalten werden.
JMSWMQ1068.explanation = PRODUCT_NAME Classes for JMS konnte eine XA-Ressource aufgrund eines Fehlers nicht erstellen.
JMSWMQ1068.useraction = Weitere Informationen finden Sie in der verlinkten XA-Ausnahmebedingung.

JMSWMQ1079 = Es kann keine Nachricht in die Warteschlange f\u00fcr nicht zustellbare Nachrichten geschrieben werden.
JMSWMQ1079.explanation = PRODUCT_NAME Classes for JMS konnte eine Nachricht nicht erneut in die Warteschlange f\u00fcr nicht zustellbare Nachrichten einreihen.
JMSWMQ1079.useraction = Analysieren Sie die verlinkte Ausnahmebedingung, um den Fehler zu ermitteln. Falls keine verlinkte Ausnahmebedingung vorhanden ist, pr\u00fcfen Sie, ob der Warteschlangenmanager eine Warteschlange f\u00fcr nicht zustellbare Nachrichten definiert hat. Sobald PRODUCT_NAME Classes for JMS eine Nachricht an die Warteschlange f\u00fcr nicht zustellbare Nachrichten gesendet hat, kann mithilfe der im MQDLH der Nachricht gespeicherte Ursachencode bestimmt werden, aus welchem Grund die Nachricht gesendet wurde.

JMSWMQ1080 = Keine Zur\u00fcckstellungswarteschlange definiert.

JMSWMQ1096 = Die Nachrichtenreferenz wurde falsch formatiert.

JMSWMQ1107 = Es ist ein Problem im Zusammenhang mit dieser Verbindung aufgetreten.
JMSWMQ1107.explanation = Bei der JMS-Verbindung von IBM MQ ist ein Fehler aufgetreten.
JMSWMQ1107.useraction = Analysieren Sie die verlinkte Ausnahmebedingung, um den Fehler zu ermitteln.

JMSWMQ1116 = Nachricht ''{0}'' in Warteschlange ''{1}'' wurde in die Warteschlange f\u00fcr nicht zustellbare Nachrichten von Warteschlangenmanager ''{2}'' verschoben.
JMSWMQ1116.explanation = Im Normalmodus von PRODUCT_NAME Messaging Provider wurde eine Nachricht erkannt, die nicht verarbeitet werden konnte. Da das Berichtsfeld im MQMD f\u00fcr diese Nachricht die Option MQRO_DEAD_LETTER_Q enthielt, wurde die Nachricht in die Warteschlange f\u00fcr nicht zustellbare Nachrichten verschoben. 
JMSWMQ1116.useraction = Pr\u00fcfen Sie den Header der nicht zustellbaren Nachricht in der Warteschlange f\u00fcr nicht zustellbare Nachrichten, um festzustellen, weshalb die Nachricht nicht verarbeitet werden konnte. 
JMSWMQ1116.inserts = XMSC_INSERT_MESSAGE_ID, XMSC_INSERT_DESTINATION_NAME, XMSC_INSERT_QUEUE_MANAGER_NAME 

JMSWMQ1117 = Nachricht ''{0}'' in Warteschlange ''{1}'' von Warteschlangenmanager ''{2}'' kann nicht verarbeitet werden und wurde gel\u00f6scht.
JMSWMQ1117.explanation = Im Normalmodus von PRODUCT_NAME Messaging Provider wurde eine Nachricht erkannt, die nicht verarbeitet werden konnte. Da das Berichtsfeld im MQMD f\u00fcr diese Nachricht die Option MQRO_DISCARD_MSG enthielt, wurde die Nachricht gel\u00f6scht. 
JMSWMQ1117.useraction = \u00c4ndern Sie die Anwendungen, die Nachrichten in die angegebene Warteschlange einreihen, so, dass das Berichtsfeld im MQMD f\u00fcr die Nachricht die Option MQRO_DEAD_LETTER_Q enth\u00e4lt. Dadurch wird sichergestellt, dass nachfolgende Nachrichten, die nicht verarbeitet werden k\u00f6nnen, nicht gel\u00f6scht werden, sondern in die Warteschlange f\u00fcr nicht zustellbare Nachrichten verschoben werden. Der Header der nicht zustellbaren Nachrichten in der Warteschlange f\u00fcr nicht zustellbare Nachrichten enth\u00e4lt Informationen dazu, weshalb die Nachricht nicht verarbeitet werden konnte.
JMSWMQ1117.inserts = XMSC_INSERT_MESSAGE_ID, XMSC_INSERT_DESTINATION_NAME, XMSC_INSERT_QUEUE_MANAGER_NAME 

JMSWMQ1118 = Die Warteschlange ''{0}'', die zuvor f\u00fcr den Abruf gesperrt war, wurde erneut f\u00fcr den Abruf aktiviert, da der IBM MQ-Warteschlangenmanager mit Ursachencode ''2494'' (''MQRC_GET_ENABLED'') antwortete.
JMSWMQ1118.explanation = Eine Warteschlange, mit der ein Nutzer verbunden ist, wurde nun zum Abrufen einer Nachricht verf\u00fcgbar gemacht.
JMSWMQ1118.useraction = Nicht erforderlich. Diese Nachricht dient nur zu Informationszwecken.
JMSWMQ1118.inserts = XMSC_INSERT_DESTINATION_NAME

JMSWMQ1119 = Die Warteschlange ''{0}'' ist aktuell f\u00fcr GET-Anforderungen gesperrt, da der IBM MQ-Warteschlangenmanager mit Ursachencode ''2016'' (''MQRC_GET_INHIBITED'') antwortete.
JMSWMQ1119.explanation = MQGET-Anforderungen an eine Warteschlange, mit der ein Nutzer verbunden ist, werden nun unterdr\u00fcckt.
JMSWMQ1119.useraction = Warten Sie, bis der IBM MQ-Administrator die Warteschlange erneut f\u00fcr MQGET-Anforderungen aktiviert hat. 
JMSWMQ1119.inserts = XMSC_INSERT_DESTINATION_NAME

# Same as JMSWMQ2003: queue variant.
JMSWMQ2000 = Fehler beim Schlie\u00dfen von Warteschlange ''{0}''.
JMSWMQ2000.explanation = JMS versuchte, eine IBM MQ-Zieladresse zu schlie\u00dfen, es ist jedoch ein Fehler aufgetreten. Die Zieladresse wurde m\u00f6glicherweise bereits geschlossen oder ein anderer Thread f\u00fchrt einen MQGET-Aufruf aus, w\u00e4hrend close() aufgerufen wird.
JMSWMQ2000.useraction = Analysieren Sie die verlinkte Ausnahmebedingung, um den Fehler zu ermitteln. Sie k\u00f6nnen den Schlie\u00dfvorgang (close()) m\u00f6glicherweise zu einem sp\u00e4teren Zeitpunkt ausf\u00fchren.
JMSWMQ2000.inserts = XMSC_DESTINATION_NAME

JMSWMQ2001 = Fehler beim Schlie\u00dfen der Zieladresse ''{0}'' bei Verwendung einer Vorausleserichtlinie ''close''.
JMSWMQ2001.explanation = IBM MQ Classes for JMS versuchte, eine IBM MQ-Zieladresse zu schlie\u00dfen, es ist jedoch ein Fehler aufgetreten. Beim Schlie\u00dfaufruf wurde das zul\u00e4ssige Zeitlimit \u00fcberschritten, als versucht wurde, alle Nachrichten in der Vorauslesewarteschlange bereitzustellen.
JMSWMQ2001.useraction = Vergewissern Sie sich, dass Ihr Nachrichtenempfangsprogramm nicht in einer Schleife h\u00e4ngt. Sie k\u00f6nnen den Schlie\u00dfvorgang (close()) m\u00f6glicherweise zu einem sp\u00e4teren Zeitpunkt ausf\u00fchren.
JMSWMQ2001.inserts = XMSC_DESTINATION_NAME

JMSWMQ2002 = Fehler beim Abrufen einer Nachricht von der Zieladresse ''{0}''.
JMSWMQ2002.explanation = IBM MQ Classes for JMS versuchte, MQGET durchzuf\u00fchren; IBM MQ gab jedoch einen Fehler zur\u00fcck.
JMSWMQ2002.useraction = Analysieren Sie die verlinkte Ausnahmebedingung, um den Fehler zu ermitteln.
JMSWMQ2002.inserts = XMSC_DESTINATION_NAME

# Same as JMSWMQ2000: topic variant.
JMSWMQ2003 = Fehler beim Schlie\u00dfen von Thema ''{0}''.
JMSWMQ2003.explanation = JMS versuchte, eine IBM MQ-Zieladresse zu schlie\u00dfen, es ist jedoch ein Fehler aufgetreten. Die Zieladresse wurde m\u00f6glicherweise bereits geschlossen oder ein anderer Thread f\u00fchrt einen MQGET-Aufruf aus, w\u00e4hrend close() aufgerufen wird.
JMSWMQ2003.useraction = Ermitteln Sie die Ursache dieses Fehlers mithilfe der verlinkten Ausnahmebedingung. Sie k\u00f6nnen den Schlie\u00dfvorgang (close()) m\u00f6glicherweise zu einem sp\u00e4teren Zeitpunkt ausf\u00fchren.
JMSWMQ2003.inserts = XMSC_DESTINATION_NAME

# Same as JMSWMQ2008: topic variant.
JMSWMQ2006 = Fehler beim \u00d6ffnen von MQ-Thema ''{0}''.
JMSWMQ2006.explanation = JMS versuchte, MQOPEN auszuf\u00fchren, PRODUCT_NAME gab jedoch einen Fehler zur\u00fcck.
JMSWMQ2006.useraction = Analysieren Sie die verlinkte Ausnahmebedingung, um den Fehler zu ermitteln. Vergewissern Sie sich, dass das angegebene Thema und der angegebene Warteschlangenmanager ordnungsgem\u00e4\u00df definiert sind.
JMSWMQ2006.inserts = XMSC_DESTINATION_NAME

JMSWMQ2007 = Fehler beim Senden einer Nachricht an die Zieladresse ''{0}''.
JMSWMQ2007.explanation = JMS versuchte, MQPUT oder MQPUT1 auszuf\u00fchren; PRODUCT_NAME gab jedoch einen Fehler zur\u00fcck.
JMSWMQ2007.useraction = Analysieren Sie die verlinkte Ausnahmebedingung, um den Fehler zu ermitteln.
JMSWMQ2007.inserts = XMSC_DESTINATION_NAME

# Same as JMSWMQ2006: queue variant.
JMSWMQ2008 = Fehler beim \u00d6ffnen der MQ-Warteschlange ''{0}''.
JMSWMQ2008.explanation = JMS versuchte, MQOPEN auszuf\u00fchren, PRODUCT_NAME gab jedoch einen Fehler zur\u00fcck.
JMSWMQ2008.useraction = Ermitteln Sie die Ursache dieses Fehlers mithilfe der verlinkten Ausnahmebedingung. Vergewissern Sie sich, dass die angegebene Warteschlange und der angegebene Warteschlangenmanager ordnungsgem\u00e4\u00df definiert sind.
JMSWMQ2008.inserts = XMSC_DESTINATION_NAME

JMSWMQ2010 = Die Zieladresse f\u00fcr die persistente Nachrichten\u00fcbertragung (NPMCLASS HIGH) ''{0}'' war ung\u00fcltig.
JMSWMQ2010.explanation = Die angegebene Zieladresse unterst\u00fctzt keine persistente NPMCLASS HIGH-Nachrichten\u00fcbertragung.
JMSWMQ2010.useraction = Verwenden Sie das JMS-Verwaltungstool, um die persistente Nachrichten\u00fcbertragung NPMCLASS HIGH f\u00fcr diese Zieladresse zu aktivieren.
JMSWMQ2010.inserts = XMSC_DESTINATION_NAME
JMSWMQ2010.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSWMQ2011 = Fehler beim \u00d6ffnen der permanenten Subskription ''{0}'' f\u00fcr die Zieladresse ''{1}''.
JMSWMQ2011.explanation = JMS versuchte, eine permanente Subskription zu erstellen, der ausgew\u00e4hlte Name f\u00fcr die Subskription war auf der JVM jedoch bereits in Gebrauch.
JMSWMQ2011.useraction = Verwenden Sie f\u00fcr diesen permanenten Subskribenten einen anderen Subskriptionsnamen oder f\u00fchren Sie diesen Subskribenten in einer anderen JVM aus.
JMSWMQ2011.inserts = XMSC_INSERT_OBJECT, XMSC_DESTINATION_NAME
JMSWMQ2011.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSWMQ2012 = XACLOSE fehlgeschlagen.
JMSWMQ2012.explanation = Beim Schlie\u00dfen der XA-Sitzung konnte die XA-Ressource nicht geschlossen werden.
JMSWMQ2012.useraction = Weitere Informationen finden Sie in der verlinkten XA-Ausnahmebedingung.

JMSWMQ2013 = Die f\u00fcr den Warteschlangenmanager ''{0}'' mit dem Verbindungsmodus ''{1}'' und dem Hostnamen ''{2}'' angegebene Sicherheitsauthentifizierung war ung\u00fcltig.
JMSWMQ2013.useraction = \u00dcberpr\u00fcfen Sie, ob der angegebene Benutzername und das angegebene Kennwort f\u00fcr den Warteschlangenmanager richtig sind, zu dem eine Verbindung hergestellt wird.
JMSWMQ2013.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_HOST_NAME

JMSWMQ2014 = WebSphere MQ \u00fcbertrug ein asynchrones Ereignis mit dem Beendigungscode ''{0}'' und dem Ursachencode ''{1}''.

JMSWMQ2016 = F\u00fcr die Verbindung konnte kein ExceptionListener registriert werden.
JMSWMQ2016.explanation = Der MQCB-Aufruf f\u00fcr die Registrierung dieses ExceptionListener ist fehlgeschlagen.
JMSWMQ2016.useraction = Analysieren Sie die verlinkte Ausnahmebedingung, um den Fehler zu ermitteln.

JMSWMQ2017 = F\u00fcr die Verbindung konnte die Registrierung von ExceptionListener nicht aufgehoben werden.
JMSWMQ2017.explanation = Der MQCB-Aufruf f\u00fcr die Registrierungsr\u00fccknahme dieses ExceptionListener ist fehlgeschlagen.
JMSWMQ2017.useraction = Analysieren Sie die verlinkte Ausnahmebedingung, um den Fehler zu ermitteln.

# Log message
JMSWMQ2018 = Die Ausnahmebedingung wird ignoriert, da kein Empfangsprogramm f\u00fcr Ausnahmebedingungen registriert ist: ''{0}''.
JMSWMQ2018.explanation = Es wurde versucht, eine Ausnahmebedingung an das Empfangsprogramm f\u00fcr Ausnahmebedingungen der Verbindung zu \u00fcbertragen; es wurde jedoch kein Empfangsprogramm registriert.
JMSWMQ2018.useraction = F\u00fcr die Verbindung muss ein Empfangsprogramm f\u00fcr Ausnahmebedingungen registriert sein, damit die zugeh\u00f6rigen Ausnahmebedingungen empfangen werden k\u00f6nnen.
JMSWMQ2018.inserts = XMSC_INSERT_EXCEPTION

#Log message
JMSWMQ2019 = Von der Methode ''{2}'' wurden ein unerwarteter Beendigungscode ''{0}'' und Ursachencode ''{1}'' zur\u00fcckgegeben.
JMSWMQ2019.explanation = Der Ursachencode wurde nicht erwartet, wurde jedoch nicht an die Anwendung zur\u00fcckgegeben.
JMSWMQ2019.useraction = Wenn in der Anwendung Fehler aufgetreten sind, sollte der protokollierte Ursachencode \u00fcberpr\u00fcft werden, um weitere Informationen zu den Fehlern zu erhalten.
JMSWMQ2019.inserts = XMSC_INSERT_COMP_CODE, XMSC_INSERT_REASON, XMSC_INSERT_METHOD

JMSWMQ2020 = Es konnte keine Verbindung zum Warteschlangenmanager ''{0}'' mit dem Verbindungsmodus ''{1}'' und der angegebenen CCDT-URL ''{2}'' hergestellt werden (weitere Informationen enth\u00e4lt die verlinkte Ausnahmebedingung).
JMSWMQ2020.useraction = Vergewissern Sie sich, dass der Warteschlangenmanager gestartet wurde, und falls er im Clientmodus ausgef\u00fchrt wird, pr\u00fcfen Sie, ob ein Empfangsprogramm aktiv ist. Weitere Informationen finden Sie in der verlinkten Ausnahmebedingung.
JMSWMQ2020.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_CCDTURL

JMSWMQ2021 = Die Sicherheitsauthentifizierung, die f\u00fcr den Warteschlangenmanager ''{0}'' mit dem Verbindungsmodus ''{1}'' und der CCDT-URL ''{2}'' angegeben wurde war ung\u00fcltig (weitere Informationen enth\u00e4lt die verlinkte Ausnahmebedingung).
JMSWMQ2021.useraction = \u00dcberpr\u00fcfen Sie, ob der angegebene Benutzername und das angegebene Kennwort f\u00fcr den Warteschlangenmanager richtig sind, zu dem eine Verbindung hergestellt wird.
JMSWMQ2021.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_CCDTURL


JMSWMQ2022 = Es kann kein Nachrichtenproduzent oder Nachrichtenkonsument mit der Modellwarteschlange ''{0}'' als Ziel erstellt werden.
JMSWMQ2022.explanation = Der Nachrichtenproduzent oder Nachrichtenkonsument konnte das Ziel nicht \u00f6ffnen, da es sich um eine Modellwarteschlange handelte.
JMSWMQ2022.useraction = \u00c4ndern Sie den Nachrichtenproduzent oder Nachrichtenkonsument so, dass er einen anderen Zielwarteschlangennamen als die Modellwarteschlange verwendet.
JMSWMQ2022.inserts = XMSC_DESTINATION_NAME

JMSWMQ2023 = Fehler beim Verarbeiten von Nachricht ''{0}'' mit Ausnahme ''{1}'' mit MQMD ''{2}''.
JMSWMQ2023.inserts = XMSC_MSG_DATA,XMSC_INSERT_EXCEPTION,XMSC_DATA

JMSWMQ2024 = Fehler beim Senden einer Nachricht an die Zieladresse ''{0}''.
JMSWMQ2024.explanation = JMS versuchte, MQPUT oder MQPUT1 auszuf\u00fchren; PRODUCT_NAME gab jedoch einen Fehler zur\u00fcck.\n\
Da die Bereitstellungsverz\u00f6gerung festgelegt wurde, bezieht sich das Problem entweder auf die von der Anwendung angegebene Warteschlange\n oder auf die Staging-Warteschlange 'SYSTEM.DDELAY.LOCAL.QUEUE' zur Bereitstellungsverz\u00f6gerung.
JMSWMQ2024.useraction = Analysieren Sie die verlinkte Ausnahmebedingung, um den Fehler zu ermitteln.
JMSWMQ2024.inserts = XMSC_DESTINATION_NAME

JMSWMQ2025 = Die Subskription f\u00fcr Thema ''{0}'' unter dem Subskriptionsnamen {1}'' ist fehlgeschlagen.
JMSWMQ2025.explanation = Es wurde versucht, eine geteilte Subskription auf nicht geteilte Weise oder umgekehrt eine nicht geteilte Subskription auf geteilte Weise zu \u00f6ffnen.
JMSWMQ2025.useraction = Stellen Sie vor der Erstellung einer neuen Subskription unter einem vorhandenen Subskriptionsnamen sicher, dass es keine Subskriptionen mit einem anderen Teilungstyp gibt.
JMSWMQ2025.inserts = XMSC_DESTINATION_NAME,XMSC_SUBSCRIPTION_NAME
