# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE
#

# JMSCMQ0001 doesn't have a .inserts message because it's only used by Reason in
# a WMQException, and never in a JMSException.
JMSCMQ0001 = La llamada de IBM MQ ha fallado con c\u00f3digo de terminaci\u00f3n ''{0}'' (''{1}'') raz\u00f3n ''{2}'' (''{3}'').

JMSCMQ0002 = El m\u00e9todo ''{0}'' ha fallado.
JMSCMQ0002.explanation = Una llamada de IBM MQ ha fallado.
JMSCMQ0002.useraction = Consulte la excepci\u00f3n enlazada para obtener m\u00e1s informaci\u00f3n.
JMSCMQ0002.inserts = XMSC_INSERT_METHOD

JMSCMQ0003 = El destino ''{0}'' no es conocido o ya no es v\u00e1lido.
JMSCMQ0003.explanation = La cola o tema puede haber quedado no disponible, la aplicaci\u00f3n puede estar utilizando una conexi\u00f3n incorrecta para la cola o tema, o el destino proporcionado no es del tipo correcto para este m\u00e9todo.
JMSCMQ0003.useraction = Compruebe que IBM MQ sigue ejecut\u00e1ndose y que el gestor de colas est\u00e1 disponible. Compruebe que se est\u00e1 utilizando la conexi\u00f3n correcta para la cola o tema.
JMSCMQ0003.inserts = XMSC_DESTINATION_NAME
JMSCMQ0003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCMQ0004 = El valor ''{0}'' no era v\u00e1lido para la propiedad ''{1}''.
JMSCMQ0004.explanation = El valor de la propiedad ''{1}'' no era ninguno de los valores v\u00e1lidos para esta propiedad.
JMSCMQ0004.useraction = Establezca la propiedad en un valor v\u00e1lido.
JMSCMQ0004.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_PROPERTY

JMSCMQ0005 = El nombre de destino ''{0}'' no era v\u00e1lido.
JMSCMQ0005.explanation = El nombre de destino especificado no sigue la sintaxis de destino publicada.
JMSCMQ0005.useraction = Corrija el nombre de destino especificado e int\u00e9ntelo de nuevo.
JMSCMQ0005.inserts = XMSC_DESTINATION_NAME
JMSCMQ0005.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCMQ0006 = El destino no es un destino temporal y no se puede suprimir.
JMSCMQ0006.explanation = S\u00f3lo se pueden suprimir los destinos temporales.

JMSCMQ0007 = Se ha establecido una propiedad ''{0}'' desconocida con el valor ''{1}'' en el contexto de la propiedad de destino.
JMSCMQ0007.explanation = La propiedad ''{0}'' no se ha reconocido; podr\u00eda ser una propiedad personalizada.
JMSCMQ0007.useraction = Aseg\u00farese de que su finalidad es ser una propiedad personalizada.
JMSCMQ0007.inserts = XMSC_INSERT_KEY, XMSC_INSERT_VALUE

JMSCMQ0008 = IBM MQ classes for JMS intenta utilizar un tipo de datos no soportado por un mensaje o intenta leer datos del tipo incorrecto.
JMSCMQ0008.explanation = Se han utilizado tipos de datos incorrectos para leer tipos de propiedades de mensaje.
JMSCMQ0008.useraction = Compruebe que el mensaje recibido y las propiedades que se han de leer son del tipo esperado.
JMSCMQ0008.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ0009 = Se ha alcanzado inesperadamente el final de la secuencia cuando se le\u00eda un mensaje de corriente de datos o un mensaje de bytes.
JMSCMQ0009.explanation = La secuencia de bytes que se lee es m\u00e1s peque\u00f1a que el almacenamiento intermedio suministrado. Esto tambi\u00e9n puede deberse a la recepci\u00f3n de un mensaje de corriente de datos o un mensaje de bytes da\u00f1ado.
JMSCMQ0009.useraction = Compruebe la longitud del almacenamiento intermedio suministrado. Consulte el registro de sucesos del sistema para obtener informaci\u00f3n m\u00e1s detallada e informaci\u00f3n de otros posibles errores detectados.
JMSCMQ0009.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCMQ0017 = Fin de secuencia.
JMSCMQ0017.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCMQ0018 = No se ha podido analizar correctamente un mensaje que se ha recibido.
JMSCMQ0018.explanation = No se ha podido analizar correctamente el mensaje que tiene el ID = ''{0}'' y el correlationID = ''{1}''. Los \u00faltimos datos le\u00eddos correctamente del mensaje estaban en la posici\u00f3n ''{2}'', en el almacenamiento intermedio ''{3}''.

JMSCMQ0018.useraction = Examine los datos del mensaje y aseg\u00farese de que tenga el formato correcto para que pueda analizarse como un mensaje MQJMS.
JMSCMQ0018.inserts = XMSC_MESSAGE_ID, XMSC_CORRELATION_ID, XMSC_MESSAGE_BUFFER_POSITION, XMSC_MESSAGE_BUFFER

JMSCMQ1000 = No se ha podido crear un mensaje JMS.
JMSCMQ1000.explanation = Se ha especificado un tipo de mensaje incorrecto o propiedades de mensaje incorrectas al crear un mensaje base que tiene el ID = ''{0}'' y el correlationID = ''{1}''.
JMSCMQ1000.useraction = Consulte el c\u00f3digo de raz\u00f3n y el c\u00f3digo de terminaci\u00f3n de la excepci\u00f3n enlazada de IBM MQ para obtener m\u00e1s informaci\u00f3n, y consulte el archivo de registro para ver el contenido detallado del mensaje.
JMSCMQ1000.inserts = XMSC_MESSAGE_ID, XMSC_CORRELATION_ID

JMSCMQ1006 = El valor para ''{0}'':''{1}'' no es v\u00e1lido.
JMSCMQ1006.explanation = El valor ''{1}'' para la propiedad ''{0}'' no es correcto.
JMSCMQ1006.useraction = Consulte el c\u00f3digo de raz\u00f3n y el c\u00f3digo de terminaci\u00f3n de la excepci\u00f3n enlazada de IBM MQ.
JMSCMQ1006.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_VALUE

JMSCMQ1044 = La serie no es un n\u00famero hexadecimal v\u00e1lido - ''{0}''.
JMSCMQ1044.inserts = XMSC_INSERT_HEX_STRING
JMSCMQ1044.explanation = Se ha intentado especificar un ID de grupo o un ID de correlaci\u00f3n que empieza con el ID de prefijo pero no va seguido de un valor hexadecimal bien formado, o se ha intentado recibir un mensaje que contiene una propiedad MQRFH2 de tipo bin.hex que no tiene un valor hexadecimal bien formado.
JMSCMQ1044.useraction = Aseg\u00farese de que un valor hexadecimal siempre va seguido del ID de prefijo al establecer los valores de ID de grupo o ID de correlaci\u00f3n. Aseg\u00farese de que las cabeceras MQRFH2 generadas por aplicaciones no JMS est\u00e9n bien formadas.

JMSCMQ1046 = El juego de caracteres ''{0}'' no est\u00e1 soportado.
JMSCMQ1046.inserts = CCSID
JMSCMQ1046.explanation = Se ha intentado enviar o recibir un mensaje de correlaci\u00f3n, un mensaje de corriente de datos o un mensaje de texto cuyo cuerpo est\u00e1 codificado con un juego de caracteres no soportado por la JVM. En el caso de los mensajes de texto, esta excepci\u00f3n puede emitirse cuando el cuerpo del mensaje se consulta por primera vez, en vez de durante la recepci\u00f3n.
JMSCMQ1046.useraction = Cuando codifique un mensaje, utilice solamente un juego de caracteres que sepa que est\u00e1 disponible para la aplicaci\u00f3n receptora.

JMSCMQ1047 = El mensaje de correlaci\u00f3n tiene un formato incorrecto.
JMSCMQ1047.explanation = Se ha recibido un mensaje de correlaci\u00f3n pero la informaci\u00f3n de la cabecera MQRFH2 tiene un formato incorrecto.
JMSCMQ1047.useraction = Aseg\u00farese de que las aplicaciones no JMS creen informaci\u00f3n de cabecera MQRFH2 bien formada para su inclusi\u00f3n en mensajes de correlaci\u00f3n.
JMSCMQ1047.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1048 = El mensaje de corriente de datos tiene un formato incorrecto.
JMSCMQ1048.explanation = Se ha recibido un mensaje de corriente de datos pero tiene un formato incorrecto.
JMSCMQ1048.useraction = Aseg\u00farese de que las aplicaciones no JMS creen mensajes de corriente de datos bien formados.
JMSCMQ1048.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1049 = El juego de caracteres ''{0}'' no puede convertir una parte o toda la serie ''{1}''
JMSCMQ1049.inserts = CCSID, XMSC_INSERT_VALUE
JMSCMQ1049.explanation = Se ha intentado enviar o recibir datos de serie utilizando un juego de caracteres que no es capaz de convertir el contenido de la serie.
JMSCMQ1049.useraction = Cuando codifique un mensaje utilice solamente un juego de caracteres que sepa que es adecuada para los datos de serie que se transmiten.

JMSCMQ1050 = La cabecera MQRFH2 tiene un formato incorrecto.
JMSCMQ1050.explanation = Se ha recibido un mensaje con una cabecera MQRFH2 mal formada.
JMSCMQ1050.useraction = Aseg\u00farese de que las aplicaciones no JMS que construyan mensajes con cabeceras MQRFH2 creen cabeceras MQRFH2 bien formadas.
JMSCMQ1050.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1053 = Se ha detectado un car\u00e1cter sustituto UTF-16 incorrecto ''{0}''.
JMSCMQ1053.inserts = XMSC_INSERT_CHARACTER
JMSCMQ1053.explanation = Se ha encontrado un car\u00e1cter sustituto UTF-16 que no es v\u00e1lido como parte de un nombre de tema o una propiedad MQRFH2.
JMSCMQ1053.useraction = Aseg\u00farese de que, cuando especifique UTF-16, los nombres de temas o las propiedades MQRFH2 est\u00e9n bien formados.
JMSCMQ1053.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1054 = Se ha detectado una secuencia de escape XML incorrecta ''{0}''.
JMSCMQ1054.inserts = XMSC_INSERT_STRING
JMSCMQ1054.explanation = Se ha encontrado una secuencia de escape XML que no es v\u00e1lida en la cabecera MQRFH2 de un mensaje recibido.
JMSCMQ1054.useraction = Aseg\u00farese de que s\u00f3lo se transfieren secuencias de escape XML v\u00e1lidas en las cabeceras MQRFH2 creadas por aplicaciones no JMS.
JMSCMQ1054.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1055 = La propiedad o elemento en el mensaje tiene un tipo de datos ''{0}'' incompatible con el m\u00e9todo utilizado para acceder a ella.
JMSCMQ1055.inserts = XMSC_INSERT_TYPE
JMSCMQ1055.explanation = El m\u00e9todo accesor utilizado para recuperar una propiedad de un mensaje JMS es incompatible con el tipo de propiedad que se recupera. Por ejemplo, intentar recuperar una propiedad de entero utilizando el m\u00e9todo getBooleanProperty().
JMSCMQ1055.useraction = Utilice un m\u00e9todo accesor que la especificaci\u00f3n de JMS defina como capaz de recuperar valores de propiedad del tipo requerido.
JMSCMQ1055.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1056 = El tipo de datos ''{0}'' de la propiedad o del elemento no est\u00e1 soportado.
JMSCMQ1056.inserts = XMSC_INSERT_TYPE
JMSCMQ1056.explanation = Este error se debe a que se ha intentado establecer una propiedad de un mensaje JMS utilizando un objeto que no es uno de los tipos soportados o se ha intentado establecer o recibir un mensaje cuya MQRFH2 contiene un elemento que representa una propiedad que no tiene asociado un tipo v\u00e1lido.
JMSCMQ1056.useraction = Aseg\u00farese de que, al establecer las propiedades de mensaje, utiliza un tipo de objeto JMS v\u00e1lido. Si esta excepci\u00f3n se produce al recibir un mensaje que contiene una cabecera MQRFH2 enviada por una aplicaci\u00f3n no JMS, aseg\u00farese de que la cabecera MQRFH2 est\u00e1 bien formada.
JMSCMQ1056.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1066 = Nombre de propiedad no soportado ''{0}''.
JMSCMQ1066.inserts = XMSC_INSERT_PROPERTY
JMSCMQ1066.explanation =  Se ha intentado establecer una propiedad de mensaje utilizando un nombre de propiedad que no es v\u00e1lido, o el nombre de una propiedad para la que no se puede establecer el valor. 
JMSCMQ1066.useraction = Aseg\u00farese de que el nombre de propiedad especificado cumple con la especificaci\u00f3n de JMS. Si el nombre de propiedad suministrado es el de una propiedad JMS, o una extensi\u00f3n espec\u00edfica del proveedor, aseg\u00farese de que esta propiedad se puede establecer. 
JMSCMQ1066.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

