# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE
#

# JMSCMQ0001 doesn't have a .inserts message because it's only used by Reason in
# a WMQException, and never in a JMSException.
JMSCMQ0001 = Der IBM MQ-Aufruf ist mit Beendigungscode ''{0}'' (''{1}'') und Ursache ''{2}'' (''{3}'') fehlgeschlagen.

JMSCMQ0002 = Die Methode ''{0}'' ist fehlgeschlagen.
JMSCMQ0002.explanation = Ein Aufruf von IBM MQ ist fehlgeschlagen.
JMSCMQ0002.useraction = Weitere Informationen finden Sie in der verkn\u00fcpften Ausnahmebedingung.
JMSCMQ0002.inserts = XMSC_INSERT_METHOD

JMSCMQ0003 = Die Zieladresse ''{0}'' ist nicht bekannt oder nicht mehr g\u00fcltig.
JMSCMQ0003.explanation = M\u00f6glicherweise ist die Warteschlange oder das Thema nicht mehr verf\u00fcgbar, die Anwendung verwendet m\u00f6glicherweise eine falsche Verbindung f\u00fcr die Warteschlange oder das Thema oder die mitgelieferte Zieladresse weist f\u00fcr diese Methode nicht den korrekten Typ auf.
JMSCMQ0003.useraction = Pr\u00fcfen Sie, ob IBM MQ immer noch ausgef\u00fchrt wird und der Warteschlangenmanager verf\u00fcgbar ist. Vergewissern Sie sich, dass f\u00fcr Ihre Warteschlange oder Ihr Thema die richtige Verbindung verwendet wird.
JMSCMQ0003.inserts = XMSC_DESTINATION_NAME
JMSCMQ0003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCMQ0004 = Der Wert ''{0}'' war f\u00fcr die Eigenschaft ''{1}'' nicht g\u00fcltig.
JMSCMQ0004.explanation = Der Wert der Eigenschaft ''{1}'' war keiner der g\u00fcltigen Werte f\u00fcr diese Eigenschaft.
JMSCMQ0004.useraction = Legen Sie f\u00fcr die Eigenschaft einen g\u00fcltigen Wert fest.
JMSCMQ0004.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_PROPERTY

JMSCMQ0005 = Der Name der Zieladresse ''{0}'' war nicht g\u00fcltig.
JMSCMQ0005.explanation = Der angegebene Name der Zieladresse stimmt nicht mit der ver\u00f6ffentlichen Syntax f\u00fcr Zieladressen \u00fcberein.
JMSCMQ0005.useraction = Korrigieren Sie den angegebenen Namen der Zieladresse, und wiederholen Sie den Vorgang.
JMSCMQ0005.inserts = XMSC_DESTINATION_NAME
JMSCMQ0005.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCMQ0006 = Die Zieladresse ist keine tempor\u00e4re Zieladresse und kann nicht gel\u00f6scht werden.
JMSCMQ0006.explanation = Nur tempor\u00e4re Zieladressen k\u00f6nnen gel\u00f6scht werden.

JMSCMQ0007 = Eine unbekannte Eigenschaft ''{0}'' mit dem Wert ''{1}'' wurde f\u00fcr den Kontext der Zieleigenschaft festgelegt.
JMSCMQ0007.explanation = Die Eigenschaft ''{0}'' wurde nicht erkennt - unter Umst\u00e4nden handelt es sich um eine benutzerdefinierte Eigenschaft.
JMSCMQ0007.useraction = Stellen Sie sicher, dass die Verwendung einer benutzerdefinierten Eigenschaft beabsichtigt ist.
JMSCMQ0007.inserts = XMSC_INSERT_KEY, XMSC_INSERT_VALUE

JMSCMQ0008 = IBM MQ Classes for JMS verwendet einen Datentyp, der von einer Nachricht nicht unterst\u00fctzt wird, oder liest Daten mit einem falschen Typ.
JMSCMQ0008.explanation = Zum Lesen von Nachrichteneigenschaftentypen werden falsche Datentypen verwendet.
JMSCMQ0008.useraction = Vergewissern Sie sich, dass die empfangene Nachricht und die zu lesenden Eigenschaften den erwarteten Typ aufweisen.
JMSCMQ0008.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ0009 = Beim Lesen einer Datenstrom- oder Bytenachricht wurde unerwartet das Ende des Datenstroms erreicht.
JMSCMQ0009.explanation = Der gelesene Bytestrom ist k\u00fcrzer als der angegebene Puffer. Die Ursache hierf\u00fcr kann auch das Empfangen einer fehlerhaften Datenstrom- oder Bytenachricht sein.
JMSCMQ0009.useraction = \u00dcberpr\u00fcfen Sie die L\u00e4nge des angegebenen Puffers. Weitere Informationen hierzu sowie andere gemeldete Fehler finden Sie in den Systemereignisprotokollen.
JMSCMQ0009.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCMQ0017 = Ende des Datenstroms.
JMSCMQ0017.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCMQ0018 = Eine empfangene Nachricht konnte nicht ordnungsgem\u00e4\u00df analysiert werden.
JMSCMQ0018.explanation = Die Nachricht mit der Nachrichten-ID = ''{0}'' und der Korrelations-ID = ''{1}'' konnte nicht ordnungsgem\u00e4\u00df analysiert werden. Die letzten Daten, die erfolgreich aus der Nachricht gelesen wurden, befanden sich an Position ''{2}'' im Puffer ''{3}''  
JMSCMQ0018.useraction = Pr\u00fcfen Sie die Nachrichtendaten und stellen Sie sicher, dass sie das korrekte Format f\u00fcr die Analyse als MQJMS-Nachricht haben.
JMSCMQ0018.inserts = XMSC_MESSAGE_ID, XMSC_CORRELATION_ID, XMSC_MESSAGE_BUFFER_POSITION, XMSC_MESSAGE_BUFFER

JMSCMQ1000 = Fehler beim Erstellen der JMS-Nachricht.
JMSCMQ1000.explanation = Bei der Erstellung einer Basisnachricht mit der Nachrichten-ID = ''{0}'' und der Korrelations-ID = ''{1}'' wurde der falsche Nachrichtentyp oder falsche Eigenschaften angegeben.
JMSCMQ1000.useraction = \u00dcberpr\u00fcfen Sie die Ursache f\u00fcr die verkn\u00fcpfte IBM MQ-Ausnahmebedingung und den Beendigungscode, um weitere Informationen zu erhalten, und \u00fcberpr\u00fcfen Sie die Protokolldatei auf detaillierte Nachrichteninhalte.
JMSCMQ1000.inserts = XMSC_MESSAGE_ID, XMSC_CORRELATION_ID

JMSCMQ1006 = Der Wert f\u00fcr ''{0}'':''{1}'' ist nicht g\u00fcltig.
JMSCMQ1006.explanation = Der Wert ''{1}'' f\u00fcr die Eigenschaft ''{0}'' ist falsch.
JMSCMQ1006.useraction = Weitere Informationen hierzu finden Sie in den Ursachen der damit verbundenen IBM MQ-Ausnahmebedingung und dem Beendigungscode.
JMSCMQ1006.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_VALUE

JMSCMQ1044 = Zeichenfolge ist keine g\u00fcltige Hexadezimalzahl - ''{0}''.
JMSCMQ1044.inserts = XMSC_INSERT_HEX_STRING
JMSCMQ1044.explanation = Entweder wurde versucht, eine Gruppen-ID oder Korrelations-ID festzulegen, die mit der Pr\u00e4fix-ID beginnt, jedoch nicht durch einen korrekt formatierten Hexadezimalwert gefolgt ist, oder es wurde versucht, eine Nachricht zu empfangen, die eine MQRFH2-Eigenschaft des Typs 'bin.hex' enth\u00e4lt, die keinen korrekt formatierten Hexadezimalwert aufweist.
JMSCMQ1044.useraction = Stellen Sie sicher, dass ein g\u00fcltiger Hexadezimalwert immer dem ID-Pr\u00e4fix folgt, wenn Sie Werte f\u00fcr eine Gruppen-ID oder Korrelations-ID festlegen. Stellen Sie au\u00dferdem sicher, dass alle von Nicht-JMS-Anwendungen generierten MQRFH2-Header richtig formatiert sind.

JMSCMQ1046 = Der Zeichensatz ''{0}'' wird nicht unterst\u00fctzt.
JMSCMQ1046.inserts = CCSID
JMSCMQ1046.explanation = Es wurde versucht, eine Zuordnungsnachricht, Datenstromnachricht oder Textnachricht zu senden oder zu empfangen, deren Hauptteil mit einem Zeichensatz codiert ist, der nicht von der JVM unterst\u00fctzt wird. Bei Textnachrichten wird diese Ausnahmebedingung m\u00f6glicherweise ausgegeben, wenn zuerst der Hauptteil der Nachricht abgefragt wird, nicht zum Zeitpunkt des Empfangs.
JMSCMQ1046.useraction = Codieren Sie eine Nachricht nur mit einem Zeichensatz, welcher der empfangenden Anwendung nachweislich zur Verf\u00fcgung steht.

JMSCMQ1047 = Die Zuordnungsnachricht hat ein unzul\u00e4ssiges Format.
JMSCMQ1047.explanation = Eine Zuordnungsnachricht wurde empfangen, ihre MQRFH2-Headerdaten sind jedoch falsch formatiert.
JMSCMQ1047.useraction = Vergewissern Sie sich, dass alle nicht-JMS-Anwendungen korrekt formatierte MQRFH2-Headerdaten erstellen, die in Zuordnungsnachrichten enthalten sein werden.
JMSCMQ1047.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1048 = Die Datenstromnachricht hat ein falsches Format.
JMSCMQ1048.explanation = Es wurde eine Datenstromnachricht empfangen, die falsch formatiert ist.
JMSCMQ1048.useraction = Stellen Sie sicher, dass alle Nicht-JMS-Anwendungen korrekt formatierte Datenstromnachrichten bilden.
JMSCMQ1048.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1049 = Mit dem Zeichensatz ''{0}'' kann die Zeichenfolge ''{1}'' gar nicht oder nur teilweise konvertiert werden.
JMSCMQ1049.inserts = CCSID, XMSC_INSERT_VALUE
JMSCMQ1049.explanation = Es wurde versucht, Zeichenfolgedaten mit einem Zeichensatz zu versenden bzw. zu empfangen, der den Inhalt der Zeichenfolge nicht umsetzen kann.
JMSCMQ1049.useraction = Codieren Sie eine Nachricht nur mit einem Zeichensatz, von dem bekannt ist, dass er f\u00fcr die zu \u00fcbertragenden Zeichenfolgedaten geeignet ist.

JMSCMQ1050 = Der MQRFH2-Header weist ein falsches Format auf.
JMSCMQ1050.explanation = Es wurde eine Nachricht mit einem falsch formatierten MQRFH2-Header empfangen.
JMSCMQ1050.useraction = Vergewissern Sie sich, dass alle Nicht-JMS-Anwendungen, die Nachrichten mit MQRFH2-Headern erstellen, korrekt formatierte MQRFH2-Header erzeugen.
JMSCMQ1050.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1053 = Es wurde ein falsches UTF-16-Surrogatzeichen (''{0}'') erkannt.
JMSCMQ1053.inserts = XMSC_INSERT_CHARACTER
JMSCMQ1053.explanation = Es wurde ein UTF-16-Ersatzzeichen festgestellt, das in einem Themennamen oder in einer MQRFH2-Eigenschaft nicht g\u00fcltig ist.
JMSCMQ1053.useraction = Vergewissern Sie sich bei der Angabe von UTF-16, dass Themennamen oder MQRFH2-Eigenschaften korrekt formatiert sind.
JMSCMQ1053.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1054 = Es wurde eine falsche XML-Escapezeichenfolge (''{0}'') erkannt.
JMSCMQ1054.inserts = XMSC_INSERT_STRING
JMSCMQ1054.explanation = Es wurde eine XML-Escapezeichenfolge festgestellt, die im MQRFH2-Header einer empfangenen Nachricht nicht zul\u00e4ssig ist.
JMSCMQ1054.useraction = Stellen Sie sicher, dass in MQRFH2-Header, die \u00fcber Nicht-JMS-Anwendungen erstellt werden, nur zul\u00e4ssige XML-Escapezeichenfolgen gestellt werden.
JMSCMQ1054.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1055 = Die Eigenschaft oder das Element in der Nachricht hat den Datentyp ''{0}'', der nicht mit der Methode kompatibel ist, die f\u00fcr den Zugriff auf die Eigenschaft oder das Element verwendet wurde.
JMSCMQ1055.inserts = XMSC_INSERT_TYPE
JMSCMQ1055.explanation = Die Zugriffsmethode, die zum Abrufen einer Eigenschaft aus einer JMS-Nachricht verwendet wurde, ist nicht mit dem Eigenschaftstyp kompatibel, der abgerufen wurde. Ein Beispiel hierf\u00fcr ist der Abruf einer Integer-Eigenschaft mit der Methode getBooleanProperty().
JMSCMQ1055.useraction = Verwenden Sie eine Zugriffsmethode, die in der JMS-Spezifikation f\u00fcr das Abrufen von Eigenschaftswerten mit dem erforderlichen Typ definiert ist.
JMSCMQ1055.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1056 = Der Datentyp ''{0}'' f\u00fcr die Eigenschaft oder das Element wird nicht unterst\u00fctzt.
JMSCMQ1056.inserts = XMSC_INSERT_TYPE
JMSCMQ1056.explanation = Dieser Fehler wird verursacht, wenn versucht wird, eine Eigenschaft einer JMS-Nachricht mit einem Objekt mit nicht unterst\u00fctztem Typ festzulegen, oder wenn versucht wird, eine Nachricht festzulegen oder zu empfangen, deren MQRFH2 ein Element enth\u00e4lt, das eine Eigenschaft darstellt, der kein g\u00fcltiger Typ zugeordnet wurde.
JMSCMQ1056.useraction = Stellen Sie sicher, dass beim Festlegen von Nachrichteneigenschaften ein g\u00fcltiger JMS-Objekttyp verwendet wird. Wenn diese Ausnahmebedingung beim Empfang einer Nachricht auftritt, die einen MQRFH2-Header enth\u00e4lt, der von einer Nicht-JMS-Anwendung gesendet wurde, \u00fcberpr\u00fcfen Sie, ob der MQRFH2-Header korrekt formatiert ist.
JMSCMQ1056.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1066 = Nicht unterst\u00fctzter Eigenschaftsname (''{0}'').
JMSCMQ1066.inserts = XMSC_INSERT_PROPERTY
JMSCMQ1066.explanation =  Es wurde versucht, unter Verwendung eines ung\u00fcltigen Eigenschaftsnamens eine Nachrichteneigenschaft festzulegen. M\u00f6glicherweise wurde auch ein Eigenschaftsname verwendet, dessen Wert nicht festgelegt werden kann. 
JMSCMQ1066.useraction = Stellen Sie sicher, dass der angegebene Eigenschaftsname die JMS-Spezifikationen erf\u00fcllt. Wenn es sich bei dem Eigenschaftsnamen um eine JMS-Eigenschaft oder eine anbieterspezifische Erweiterung handelt, m\u00fcssen Sie sicherstellen, dass diese Eigenschaft festgelegt werden kann. 
JMSCMQ1066.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

