# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE
#

# JMSCMQ0001 doesn't have a .inserts message because it's only used by Reason in
# a WMQException, and never in a JMSException.
JMSCMQ0001 = IBM MQ h\u00edv\u00e1s sikertelen. Befejez\u00e9si k\u00f3d: ''{0}'' (''{1}''), ok: ''{2}'' (''{3}'').

JMSCMQ0002 = A(z) ''{0}'' met\u00f3dus meghi\u00fasult.
JMSCMQ0002.explanation = Egy IBM MQ h\u00edv\u00e1s meghi\u00fasult.
JMSCMQ0002.useraction = Tov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt n\u00e9zze meg a kapcsol\u00f3d\u00f3 kiv\u00e9telt.
JMSCMQ0002.inserts = XMSC_INSERT_METHOD

JMSCMQ0003 = A(z) ''{0}'' c\u00e9l nem ismert vagy m\u00e1r nem \u00e9rv\u00e9nyes.
JMSCMQ0003.explanation = Elk\u00e9pzelhet\u0151, hogy a sor vagy t\u00e9mak\u00f6r m\u00e1r nem \u00e9rhet\u0151 el, az alkalmaz\u00e1s helytelen kapcsolatot haszn\u00e1l a sorhoz vagy t\u00e9mak\u00f6rh\u00f6z, illetve a megadott c\u00e9l nem a megfelel\u0151 t\u00edpus\u00fa a met\u00f3dushoz.
JMSCMQ0003.useraction = Ellen\u0151rizze, hogy az IBM MQ m\u00e9g mindig fut-e \u00e9s a sorkezel\u0151 el\u00e9rhet\u0151-e. Ellen\u0151rizze, hogy a megfelel\u0151 kapcsolatot haszn\u00e1lja a sorhoz vagy t\u00e9mak\u00f6rh\u00f6z.
JMSCMQ0003.inserts = XMSC_DESTINATION_NAME
JMSCMQ0003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCMQ0004 = A(z) ''{0}'' \u00e9rt\u00e9k nem \u00e9rv\u00e9nyes a(z) ''{1}'' tulajdons\u00e1ghoz.
JMSCMQ0004.explanation = A(z) ''{1}'' tulajdons\u00e1g \u00e9rt\u00e9ke nem a lehets\u00e9ges \u00e9rv\u00e9nyes \u00e9rt\u00e9kek k\u00f6z\u00fcl ker\u00fclt ki.
JMSCMQ0004.useraction = \u00c1ll\u00edtsa \u00e9rv\u00e9nyes \u00e9rt\u00e9kre a tulajdons\u00e1got.
JMSCMQ0004.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_PROPERTY

JMSCMQ0005 = A(z) ''{0}'' c\u00e9ln\u00e9v nem \u00e9rv\u00e9nyes.
JMSCMQ0005.explanation = A megadott c\u00e9ln\u00e9v nem felel meg a k\u00f6zz\u00e9tett c\u00e9l szintaxisnak.
JMSCMQ0005.useraction = Jav\u00edtsa ki a megadott c\u00e9lnevet, majd pr\u00f3b\u00e1lkozzon \u00fajra.
JMSCMQ0005.inserts = XMSC_DESTINATION_NAME
JMSCMQ0005.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCMQ0006 = A c\u00e9l nem ideiglenes c\u00e9l, nem lehet t\u00f6r\u00f6lni.
JMSCMQ0006.explanation = Kiz\u00e1r\u00f3lag ideiglenes c\u00e9lok t\u00f6r\u00f6lhet\u0151k.

JMSCMQ0007 = A(z) ''{1}'' \u00e9rt\u00e9k\u0171 ''{0}'' ismeretlen tulajdons\u00e1g van be\u00e1ll\u00edtva a c\u00e9l tulajdons\u00e1gkontextusban.
JMSCMQ0007.explanation = A(z) ''{0}'' tulajdons\u00e1g nem ismerhet\u0151 fel - lehet, hogy egy\u00e9ni tulajdons\u00e1g.
JMSCMQ0007.useraction = Gy\u0151z\u0151dj\u00f6n meg r\u00f3la, hogy val\u00f3ban egy\u00e9ni tulajdons\u00e1gr\u00f3l van sz\u00f3.
JMSCMQ0007.inserts = XMSC_INSERT_KEY, XMSC_INSERT_VALUE

JMSCMQ0008 = Az IBM MQ JMS oszt\u00e1lyok olyan adatt\u00edpust pr\u00f3b\u00e1lnak haszn\u00e1lni, amelyet az \u00fczenet nem t\u00e1mogat, illetve rossz t\u00edpus\u00fa adatokat pr\u00f3b\u00e1lnak beolvasni.
JMSCMQ0008.explanation = A rendszer rossz adatt\u00edpusokat haszn\u00e1lt az \u00fczenettulajdons\u00e1g-t\u00edpusok beolvas\u00e1s\u00e1hoz.
JMSCMQ0008.useraction = Ellen\u0151rizze, hogy a fogadott \u00fczenet \u00e9s a beolvasni k\u00edv\u00e1nt tulajdons\u00e1gok a v\u00e1rt t\u00edpusba tartoznak.
JMSCMQ0008.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ0009 = A rendszer v\u00e1ratlanul el\u00e9rte az adatfolyam v\u00e9g\u00e9t egy folyam\u00fczenet vagy byte\u00fczenet beolvas\u00e1sakor.
JMSCMQ0009.explanation = Az \u00e9ppen beolvasott bytefolyam r\u00f6videbb, mint a biztos\u00edtott puffer. Ezt s\u00e9r\u00fclt folyam\u00fczenet vagy byte\u00fczenet \u00e9rkez\u00e9se is okozhatja.
JMSCMQ0009.useraction = Ellen\u0151rizze a biztos\u00edtott puffer hossz\u00e1t. R\u00e9szletesebb inform\u00e1ci\u00f3k\u00e9rt \u00e9s az egy\u00e9b jelentett hib\u00e1k\u00e9rt n\u00e9zze meg a rendszer esem\u00e9nynapl\u00f3it.
JMSCMQ0009.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCMQ0017 = Adatfolyam v\u00e9ge.
JMSCMQ0017.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCMQ0018 = Egy fogadott \u00fczenet nem \u00e9rtelmezhet\u0151 megfelel\u0151en.
JMSCMQ0018.explanation = Az \u00fczenet (messageID = ''{0}'' \u00e9s correlationID = ''{1}'') nem \u00e9rtelmezhet\u0151 megfelel\u0151en. Az utols\u00f3 sikeres adatbeolvas\u00e1s az \u00fczenetb\u0151l a(z) ''{2}'' poz\u00edci\u00f3ban t\u00f6rt\u00e9nt a(z) ''{3}'' pufferben.  
JMSCMQ0018.useraction = Vizsg\u00e1lja meg az \u00fczenetben szerepel\u0151 adatokat \u00e9s gy\u0151z\u0151dj\u00f6n meg r\u00f3la, hogy azok form\u00e1tuma helyes \u00e9s MQJMS \u00fczenetk\u00e9nt \u00e9rtelmezhet\u0151.
JMSCMQ0018.inserts = XMSC_MESSAGE_ID, XMSC_CORRELATION_ID, XMSC_MESSAGE_BUFFER_POSITION, XMSC_MESSAGE_BUFFER

JMSCMQ1000 = A JMS \u00fczenet l\u00e9trehoz\u00e1sa meghi\u00fasult.
JMSCMQ1000.explanation = Helytelen \u00fczenett\u00edpus vagy tulajdons\u00e1gok ker\u00fcltek megad\u00e1sra egy alap\u00fczenet (messageID = ''{0}'' \u00e9s correlationID = ''{1}'') l\u00e9trehoz\u00e1sakor.
JMSCMQ1000.useraction = Tov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt n\u00e9zze meg a hivatkozott IBM MQ kiv\u00e9telokot \u00e9s befejez\u00e9si k\u00f3dot, a r\u00e9szletes \u00fczenettartalom\u00e9rt pedig ellen\u0151rizze a napl\u00f3f\u00e1jlt.
JMSCMQ1000.inserts = XMSC_MESSAGE_ID, XMSC_CORRELATION_ID

JMSCMQ1006 = A(z) ''{0}'':''{1}'' \u00e9rt\u00e9k nem \u00e9rv\u00e9nyes.
JMSCMQ1006.explanation = A(z) ''{0}'' tulajdons\u00e1g ''{1}'' \u00e9rt\u00e9ke helytelen.
JMSCMQ1006.useraction = Ellen\u0151rizze a hivatkozott IBM MQ kiv\u00e9tel ok- \u00e9s befejez\u00e9si k\u00f3dj\u00e1t.
JMSCMQ1006.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_VALUE

JMSCMQ1044 = A karaktersorozat nem \u00e9rv\u00e9nyes hexadecim\u00e1lis sz\u00e1m - ''{0}''.
JMSCMQ1044.inserts = XMSC_INSERT_HEX_STRING
JMSCMQ1044.explanation = Vagy olyan csoportazonos\u00edt\u00f3 vagy korrel\u00e1ci\u00f3azonos\u00edt\u00f3 megad\u00e1s\u00e1ra t\u00f6rt\u00e9nt k\u00eds\u00e9rlet, ami az ID el\u0151taggal kezd\u0151dik, de nem egy szab\u00e1lyosan form\u00e1zott hexadecim\u00e1lis \u00e9rt\u00e9k k\u00f6veti, vagy pedig olyan \u00fczenet fogad\u00e1s\u00e1ra t\u00f6rt\u00e9nt k\u00eds\u00e9rlet, ami bin.hex t\u00edpus\u00fa MQRFH2 tulajdons\u00e1got tartalmaz, de nem szab\u00e1lyosan form\u00e1zott hexadecim\u00e1lis \u00e9rt\u00e9k k\u00f6veti.
JMSCMQ1044.useraction = Gondoskodj\u00e9k r\u00f3la, hogy mindig \u00e9rv\u00e9nyes hexadecim\u00e1lis \u00e9rt\u00e9k k\u00f6vesse az ID el\u0151tagot a csoportel\u0151tag vagy korrel\u00e1ci\u00f3azonos\u00edt\u00f3 \u00e9rt\u00e9kek be\u00e1ll\u00edt\u00e1sakor. Gondoskodj\u00e9k r\u00f3la, hogy a nem JMS alkalmaz\u00e1sok \u00e1ltal el\u0151\u00e1ll\u00edtott MQRFH2 fejl\u00e9cek szab\u00e1lyosan form\u00e1zottak legyenek.

JMSCMQ1046 = A(z) ''{0}'' karakterk\u00e9szlet nem t\u00e1mogatott.
JMSCMQ1046.inserts = CCSID
JMSCMQ1046.explanation = Olyan lek\u00e9pez\u00e9s\u00fczenet, adatfolyam-\u00fczenet vagy sz\u00f6veg\u00fczenet k\u00fcld\u00e9s\u00e9re, illetve fogad\u00e1s\u00e1ra t\u00f6rt\u00e9nt k\u00eds\u00e9rlet, amelynek a t\u00f6rzse a Java virtu\u00e1lis g\u00e9p \u00e1ltal nem t\u00e1mogatott nem t\u00e1mogat haszn\u00e1lat\u00e1val van k\u00f3dolva. A sz\u00f6veg\u00fczenetek eset\u00e9n akkor t\u00f6rt\u00e9nhet ez a kiv\u00e9tel, amikor a rendszer el\u0151sz\u00f6r k\u00e9rdezi le az \u00fczenet t\u00f6rzs\u00e9t, nem a fogad\u00e1s id\u0151pontj\u00e1ban.
JMSCMQ1046.useraction = Csak olyan karakterk\u00e9szlet haszn\u00e1lat\u00e1val k\u00f3doljon \u00fczenetet, ami ismert \u00e9s el\u00e9rhet\u0151 a fogad\u00f3 alkalmaz\u00e1s sz\u00e1m\u00e1ra.

JMSCMQ1047 = A lek\u00e9pez\u00e9s\u00fczenet helytelen form\u00e1tum\u00fa.
JMSCMQ1047.explanation = Lek\u00e9pez\u00e9s\u00fczenet \u00e9rkezett, de az MQRFH2 fejl\u00e9cinform\u00e1ci\u00f3i rossz form\u00e1tum\u00faak.
JMSCMQ1047.useraction = Gondoskodj\u00e9k r\u00f3la, hogy a nem JMS alkalmaz\u00e1sok szab\u00e1lyosan form\u00e1zott MQRFH2 fejl\u00e9cinform\u00e1ci\u00f3kat \u00e1ll\u00edtsanak \u00f6ssze a lek\u00e9pez\u00e9s\u00fczenetekhez.
JMSCMQ1047.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1048 = Az adatfolyam \u00fczenet helytelen form\u00e1tum\u00fa.
JMSCMQ1048.explanation = Adatfolyam \u00fczenet \u00e9rkezett, de rossz form\u00e1tum\u00faak.
JMSCMQ1048.useraction = Gondoskodj\u00e9k r\u00f3la, hogy a nem JMS alkalmaz\u00e1sok szab\u00e1lyosan form\u00e1zott az adatfolyam \u00fczeneteket \u00e1ll\u00edtsanak \u00f6ssze.
JMSCMQ1048.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1049 = A(z) ''{0}'' karakterk\u00e9szlet nem tudja \u00e1talak\u00edtani a(z) ''{1}'' karaktersorozat egy r\u00e9sz\u00e9t vagy eg\u00e9sz\u00e9t
JMSCMQ1049.inserts = CCSID, XMSC_INSERT_VALUE
JMSCMQ1049.explanation = Olyan karakterk\u00e9szlet felhaszn\u00e1l\u00e1s\u00e1val t\u00f6rt\u00e9nt k\u00eds\u00e9rlet a karaktersorozat-adatok k\u00fcld\u00e9s\u00e9re vagy fogad\u00e1s\u00e1ra, amely nem k\u00e9pes leford\u00edtani a karaktersorozat tartalm\u00e1t.
JMSCMQ1049.useraction = Csak olyan karakterk\u00e9szlet felhaszn\u00e1l\u00e1s\u00e1val k\u00f3dolja az \u00fczenetet, amelyr\u0151l ismert, hogy megfelel\u0151 az \u00e1tvitelre ker\u00fcl\u0151 karaktersorozat-adatok sz\u00e1m\u00e1ra.

JMSCMQ1050 = Az MQRFH2 fejl\u00e9c helytelen form\u00e1tum\u00fa.
JMSCMQ1050.explanation = Rossz form\u00e1tum\u00fa MQRFH2 fejl\u00e9ccel rendelkez\u0151 \u00fczenet \u00e9rkezett.
JMSCMQ1050.useraction = Gondoskodj\u00e9k r\u00f3la, hogy az MQRFH2 fejl\u00e9ccel rendelkez\u0151 \u00fczeneteket \u00f6ssze\u00e1ll\u00edt\u00f3 nem JMS alkalmaz\u00e1sok szab\u00e1lyosan form\u00e1zott MQRFH2 fejl\u00e9ceket hozzanak l\u00e9tre.
JMSCMQ1050.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1053 = A rendszer helytelen UTF-16 p\u00f3tkaraktert tal\u00e1lt (''{0}'').
JMSCMQ1053.inserts = XMSC_INSERT_CHARACTER
JMSCMQ1053.explanation = A rendszer olyan UTF-16 p\u00f3tkaraktert tal\u00e1lt, ami nem \u00e9rv\u00e9nyes egy t\u00e9mak\u00f6rn\u00e9v vagy MQRFH2 tulajdons\u00e1g r\u00e9szek\u00e9nt.
JMSCMQ1053.useraction = Gondoskodj\u00e9k r\u00f3la, hogy UTF-16 megad\u00e1sakor a t\u00e9mak\u00f6rnevek \u00e9s MQRFH2 tulajdons\u00e1gok szab\u00e1lyosan form\u00e1zottak legyenek.
JMSCMQ1053.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1054 = A rendszer helytelen XML vez\u00e9rl\u0151 jelsorozatot tal\u00e1lt (''{0}'').
JMSCMQ1054.inserts = XMSC_INSERT_STRING
JMSCMQ1054.explanation = A rendszer olyan XML vez\u00e9rl\u0151 jelsorozatot tal\u00e1lt, ami nem \u00e9rv\u00e9nyes egy fogadott \u00fczenet MQRFH2 fejl\u00e9c\u00e9ben.
JMSCMQ1054.useraction = Gondoskodj\u00e9k r\u00f3la, hogy csak \u00e9rv\u00e9nyes XML vez\u00e9rl\u0151 jelsorozatok ker\u00fcljenek a nem JMS alkalmaz\u00e1sok \u00e1ltal \u00f6ssze\u00e1ll\u00edtott MQRFH2 fejl\u00e9cekbe.
JMSCMQ1054.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1055 = Az \u00fczenetben szerepl\u0151 tulajdons\u00e1g vagy elem ''{0}'' adatt\u00edpussal rendelkezik, de ez nem kompatibilis az el\u00e9r\u00e9s\u00e9hez haszn\u00e1lt met\u00f3dussal.
JMSCMQ1055.inserts = XMSC_INSERT_TYPE
JMSCMQ1055.explanation = Egy JMS \u00fczenetb\u0151l egy tulajdons\u00e1g visszakeres\u00e9s\u00e9re haszn\u00e1lt el\u00e9r\u00e9si met\u00f3dus nem kompatibilis a visszakeresett tulajdons\u00e1g t\u00edpus\u00e1val. P\u00e9ld\u00e1ul eg\u00e9sz sz\u00e1m tulajdons\u00e1got pr\u00f3b\u00e1l visszakeresni a getBooleanProperty() met\u00f3dussal.
JMSCMQ1055.useraction = Olyan el\u00e9r\u00e9si met\u00f3dust haszn\u00e1ljon, ami a JMS specifik\u00e1ci\u00f3 szerint k\u00e9pes a sz\u00fcks\u00e9ges t\u00edpus\u00fa tulajdons\u00e1g\u00e9rt\u00e9kek visszakeres\u00e9s\u00e9re.
JMSCMQ1055.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1056 = A(z) ''{0}'' tulajdons\u00e1g vagy elem adatt\u00edpus nem t\u00e1mogatott.
JMSCMQ1056.inserts = XMSC_INSERT_TYPE
JMSCMQ1056.explanation = A hib\u00e1t vagy az okozza, hogy egy JMS \u00fczenet egy tulajdons\u00e1g\u00e1t olyan objektum haszn\u00e1lat\u00e1val pr\u00f3b\u00e1lja be\u00e1ll\u00edtani, ami nem a t\u00e1mogatott t\u00edpusok valamelyik\u00e9be tartozik, vagy pedig olyan \u00fczenetet pr\u00f3b\u00e1l k\u00fcldeni vagy fogadni, amelynek az MQRFH2 fejl\u00e9ce olyan tulajdons\u00e1got k\u00e9pvisel\u0151 elemet tartalmaz, amelyhez nem tartozik \u00e9rv\u00e9nyes t\u00edpus.
JMSCMQ1056.useraction = Gondoskodj\u00e9k r\u00f3la, hogy az \u00fczenet tulajdons\u00e1gainak be\u00e1ll\u00edt\u00e1sakor \u00e9rv\u00e9nyes JMS objektumt\u00edpust haszn\u00e1ljon. Ha ez a kiv\u00e9tel egy nem JMS alkalmaz\u00e1s \u00e1ltal k\u00fcld\u00f6tt MQRFH2 fejl\u00e9cet tartalmaz\u00f3 \u00fczenet fogad\u00e1sakor t\u00f6rt\u00e9nik, akkor gy\u0151z\u0151dj\u00f6n meg r\u00f3la, hogy az MQRFH2 fejl\u00e9c szab\u00e1lyosan form\u00e1zott.
JMSCMQ1056.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1066 = Nem t\u00e1mogatott tulajdons\u00e1gn\u00e9v: ''{0}''.
JMSCMQ1066.inserts = XMSC_INSERT_PROPERTY
JMSCMQ1066.explanation =  Vagy olyan tulajdons\u00e1gn\u00e9v haszn\u00e1lat\u00e1val pr\u00f3b\u00e1lt be\u00e1ll\u00edtani egy \u00fczenettulajdons\u00e1got, ami nem \u00e9rv\u00e9nyes, vagy pedig a tulajdons\u00e1g \u00e9rt\u00e9ke nem \u00e1ll\u00edthat\u00f3 be. 
JMSCMQ1066.useraction = Gondoskodj\u00e9k r\u00f3la, hogy a megadott tulajdons\u00e1gn\u00e9v megfeleljen a JMS specifik\u00e1ci\u00f3nak. Ha a megadott tulajdons\u00e1gn\u00e9v egy JMS tulajdons\u00e1g neve vagy egy sz\u00e1ll\u00edt\u00f3ra jellemz\u0151 b\u0151v\u00edtm\u00e9ny, akkor gy\u0151z\u0151dj\u00f6n meg r\u00f3la, hogy a tulajdons\u00e1g be\u00e1ll\u00edthat\u00f3. 
JMSCMQ1066.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

