# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
#


JMSBM0003 = "N\u00e3o foi poss\u00edvel ler os dados de Servi\u00e7os VCAP."
JMSBM0003.explanation = "A vari\u00e1vel de ambiente VCAP_SERVICES n\u00e3o foi configurada"
JMSBM0003.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSBM0004 = "N\u00e3o foi poss\u00edvel analisar os dados de servi\u00e7os VCAP. Consulte a Exce\u00e7\u00e3o vinculada para obter mais detalhes."
JMSBM0004.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSBM0005 =  "Detalhes da conex\u00e3o para o tipo de servi\u00e7o ''{0}'' n\u00e3o puderam ser localizados. Verifique se o aplicativo est\u00e1 vinculado a uma inst\u00e2ncia de um servi\u00e7o MQ Light."
JMSBM0005.inserts = XMSC_SERVICE_TYPE
JMSBM0005.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSBM0006 = "Falha ao criar um ConnectionFactory para a inst\u00e2ncia de servi\u00e7o ''{0}''."
JMSBM0006.inserts = XMSC_SERVICE_INSTANCE_NAME
JMSBM0006.explanation = "N\u00e3o h\u00e1 dados dispon\u00edveis para o nome da inst\u00e2ncia especificado."
JMSBM0006.useraction = "Verifique os dados de servi\u00e7o VCAP do aplicativo."
JMSBM0006.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSBM0007 = "N\u00e3o foi poss\u00edvel configurar a inst\u00e2ncia ConnectionFactory padr\u00e3o"
JMSBM0007.explanation = "V\u00e1rias inst\u00e2ncias de servi\u00e7o est\u00e3o definidas, mas nenhum nome de inst\u00e2ncia foi especificado ao criar uma ConnectionFactory."
JMSBM0007.useraction = "Forne\u00e7a um nome de inst\u00e2ncia de servi\u00e7o v\u00e1lido ao criar uma ConnectionFactory."
JMSBM0007.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSBM0008 = "N\u00e3o foi poss\u00edvel carregar credenciais de servi\u00e7o"
JMSBM0008.explanation = "A defini\u00e7\u00e3o de servi\u00e7o n\u00e3o cont\u00e9m as credenciais necess\u00e1rias."
JMSBM0008.useraction = "Verifique os dados de servi\u00e7o VCAP do aplicativo."
JMSBM0008.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSBM0009 = "A chamada API n\u00e3o \u00e9 permitida com credenciais pr\u00e9-configuradas"
JMSBM0009.explanation = "Um ID do usu\u00e1rio e uma senha j\u00e1 est\u00e3o configurados no ConnectionFactory. As credenciais do usu\u00e1rio n\u00e3o podem ser substitu\u00eddas ao criar uma Conex\u00e3o"
JMSBM0009.useraction = "N\u00e3o forne\u00e7a os par\u00e2metros de ID do usu\u00e1rio ou senha ao criar uma Conex\u00e3o com essa inst\u00e2ncia de servi\u00e7o"
JMSBM0009.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSBM0010 = "Os dados de Servi\u00e7o VCAP est\u00e3o inconsistentes e potencialmente incorretos "
JMSBM0010.explanation = "Ao carregar as informa\u00e7\u00f5es do servi\u00e7o VCAP, um erro nos dados foi detectado"
JMSBM0010.useraction = "Levante um problema com o Servi\u00e7o IBM com esta exce\u00e7\u00e3o inclusa."
JMSBM0010.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSBM0010.inserts = XMSC_INVALID_NAME

JMSBM0011 = "A API JMS1.0.2 n\u00e3o \u00e9 suportada no MQLight for Bluemix"
JMSBM0011.explanation = "Somente a API JMS1.1 ou JMS2.0 pode ser usada"
JMSBM0011.useraction = "Use os connection factories de dom\u00ednio unificado."
JMSBM0011.exception = com.ibm.msg.client.jms.DetailedJMSException

