# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
#


JMSBM0003 = "VCAP \u30b5\u30fc\u30d3\u30b9\u30fb\u30c7\u30fc\u30bf\u3092\u8aad\u307f\u53d6\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002"
JMSBM0003.explanation = "VCAP_SERVICES \u74b0\u5883\u5909\u6570\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093"
JMSBM0003.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSBM0004 = "VCAP \u30b5\u30fc\u30d3\u30b9\u30fb\u30c7\u30fc\u30bf\u3092\u69cb\u6587\u89e3\u6790\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002"
JMSBM0004.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSBM0005 =  "\u30b5\u30fc\u30d3\u30b9\u30fb\u30bf\u30a4\u30d7 ''{0}'' \u306e\u63a5\u7d9a\u306e\u8a73\u7d30\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c MQ Light \u30b5\u30fc\u30d3\u30b9\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u30d0\u30a4\u30f3\u30c9\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002"
JMSBM0005.inserts = XMSC_SERVICE_TYPE
JMSBM0005.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSBM0006 = "\u30b5\u30fc\u30d3\u30b9\u30fb\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9 ''{0}'' \u306b ConnectionFactory \u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002"
JMSBM0006.inserts = XMSC_SERVICE_INSTANCE_NAME
JMSBM0006.explanation = "\u6307\u5b9a\u3055\u308c\u305f\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u540d\u306b\u4f7f\u7528\u3067\u304d\u308b\u30c7\u30fc\u30bf\u304c\u3042\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002"
JMSBM0006.useraction = "\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e VCAP \u30b5\u30fc\u30d3\u30b9\u30fb\u30c7\u30fc\u30bf\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002"
JMSBM0006.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSBM0007 = "\u30c7\u30d5\u30a9\u30eb\u30c8\u306e ConnectionFactory \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u69cb\u6210\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f"
JMSBM0007.explanation = "\u8907\u6570\u306e\u30b5\u30fc\u30d3\u30b9\u30fb\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304c\u5b9a\u7fa9\u3055\u308c\u307e\u3057\u305f\u304c\u3001ConnectionFactory \u3092\u4f5c\u6210\u3059\u308b\u969b\u306b\u3001\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u540d\u304c\u6307\u5b9a\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002"
JMSBM0007.useraction = "ConnectionFactory \u3092\u4f5c\u6210\u3059\u308b\u969b\u306b\u3001\u6709\u52b9\u306a\u30b5\u30fc\u30d3\u30b9\u30fb\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u540d\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002"
JMSBM0007.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSBM0008 = "\u30b5\u30fc\u30d3\u30b9\u8cc7\u683c\u60c5\u5831\u3092\u30ed\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f"
JMSBM0008.explanation = "\u30b5\u30fc\u30d3\u30b9\u5b9a\u7fa9\u306b\u5fc5\u8981\u306a\u8cc7\u683c\u60c5\u5831\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u305b\u3093\u3002"
JMSBM0008.useraction = "\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e VCAP \u30b5\u30fc\u30d3\u30b9\u30fb\u30c7\u30fc\u30bf\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002"
JMSBM0008.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSBM0009 = "API \u547c\u3073\u51fa\u3057\u306f\u4e8b\u524d\u69cb\u6210\u3055\u308c\u305f\u8cc7\u683c\u60c5\u5831\u3067\u306f\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093"
JMSBM0009.explanation = "\u30e6\u30fc\u30b6\u30fc ID \u304a\u3088\u3073\u30d1\u30b9\u30ef\u30fc\u30c9\u306f ConnectionFactory \u3067\u3059\u3067\u306b\u69cb\u6210\u3055\u308c\u3066\u3044\u307e\u3059\u3002 Connection \u306e\u4f5c\u6210\u6642\u306b\u3001\u30e6\u30fc\u30b6\u30fc\u306e\u8cc7\u683c\u60c5\u5831\u3092\u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9\u3067\u304d\u307e\u305b\u3093"
JMSBM0009.useraction = "\u3053\u306e\u30b5\u30fc\u30d3\u30b9\u30fb\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u5bfe\u3057\u3066 Connection \u3092\u4f5c\u6210\u3059\u308b\u5834\u5408\u3001userID \u307e\u305f\u306f password \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u6307\u5b9a\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044"
JMSBM0009.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSBM0010 = "VCAP \u30b5\u30fc\u30d3\u30b9\u30fb\u30c7\u30fc\u30bf\u304c\u77db\u76fe\u3057\u3066\u304a\u308a\u3001\u6b63\u3057\u304f\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059"
JMSBM0010.explanation = "VCAP \u30b5\u30fc\u30d3\u30b9\u60c5\u5831\u306e\u30ed\u30fc\u30c9\u4e2d\u306b\u3001\u30c7\u30fc\u30bf\u5185\u306b\u30a8\u30e9\u30fc\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f"
JMSBM0010.useraction = "\u3053\u306e\u4f8b\u5916\u3092\u542b\u3081\u3066\u3001\u554f\u984c\u3092 IBM \u30b5\u30fc\u30d3\u30b9\u306b\u63d0\u51fa\u3057\u3066\u304f\u3060\u3055\u3044\u3002"
JMSBM0010.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSBM0010.inserts = XMSC_INVALID_NAME

JMSBM0011 = "MQLight for Bluemix \u5185\u3067\u306f JMS1.0.2 API \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093"
JMSBM0011.explanation = "JMS1.1 \u307e\u305f\u306f JMS2.0 API \u306e\u307f\u3092\u4f7f\u7528\u3067\u304d\u307e\u3059"
JMSBM0011.useraction = "\u7d71\u5408\u3055\u308c\u305f\u30c9\u30e1\u30a4\u30f3\u63a5\u7d9a\u30d5\u30a1\u30af\u30c8\u30ea\u30fc\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002"
JMSBM0011.exception = com.ibm.msg.client.jms.DetailedJMSException

