# ===========================================================================
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# ===========================================================================
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
# %Z% %W% %I% %E% %U%

# ---------------------------------------------------------------------------------
#
# Component JMS Standard Exceptions Message Identifiers
# Group prefix '0'
#
# ---------------------------------------------------------------------------------
MQJMS0000 = O m\u00e9todo ''{0}'' foi chamado em momento ilegal ou impr\u00f3prio ou se o provedor n\u00e3o est\u00e1 em um estado apropriado para a opera\u00e7\u00e3o solicitada.
MQJMS0000.inserts = XMSC_INSERT_NAME

MQJMS0002 = O IBM MQ classes for JMS tentou configurar o ID do cliente de conex\u00e3o inv\u00e1lido.
MQJMS0003 = O destino n\u00e3o foi compreendido ou n\u00e3o \u00e9 mais v\u00e1lido.
MQJMS0004 = O IBM MQ classes for JMS forneceu ao Provedor do JMS um seletor de mensagem com sintaxe inv\u00e1lida.
MQJMS0005 = Ocorreu a finaliza\u00e7\u00e3o inesperada do fluxo quando uma StreamMessage ou BytesMessage est\u00e1 sendo lida.
MQJMS0006 = O IBM MQ classes for JMS tenta usar um tipo de dados n\u00e3o suportado por uma mensagem ou ler dados no tipo errado.
MQJMS0007 = O IBM MQ classes for JMS tenta ler uma mensagem somente grava\u00e7\u00e3o.
MQJMS0008 = O IBM MQ classes for JMS tenta gravar uma mensagem somente leitura.
MQJMS0009 = O IBM MQ classes for JMS n\u00e3o pode alocar os recursos necess\u00e1rios para um m\u00e9todo.
MQJMS0010 = Opera\u00e7\u00e3o inv\u00e1lida devido a uma transa\u00e7\u00e3o em progresso.
MQJMS0011 = A chamada ao Session.commit resultou em uma recupera\u00e7\u00e3o da transa\u00e7\u00e3o atual.
MQJMS0012 = O URI n\u00e3o est\u00e1 no formato correto: queue://qmgrName/queueName [pares de nome-valor].

# ---------------------------------------------------------------------------------
#
# Component Common - group prefix '1'
#
# ---------------------------------------------------------------------------------

MQJMS1000 = Falha ao criar a mensagem JMS.
MQJMS1001 = Modo de confirma\u00e7\u00e3o desconhecido ''{0}''.
MQJMS1004 = Conex\u00e3o fechada.
MQJMS1005 = Transi\u00e7\u00e3o de estado n\u00e3o manipulada de ''{0}'' a ''{1}''.
MQJMS1006 = Valor inv\u00e1lido para ''{0}'': ''{1}''.
MQJMS1006.inserts = XMSC_INSERT_NAME, XMSC_INSERT_VALUE

MQJMS1007 = Falha ao criar a inst\u00e2ncia da classe de sa\u00edda ''{0}''.
MQJMS1008 = Valor desconhecido de transportType: ''{0}''.
MQJMS1009 = Nenhum construtor com o argumento de cadeia.
MQJMS1010 = n\u00e3o implementado.
MQJMS1011 = credenciais de seguran\u00e7a n\u00e3o podem ser especificadas ao utilizar as liga\u00e7\u00f5es do MQ.
MQJMS1012 = nenhum listener de mensagens.
MQJMS1013 = opera\u00e7\u00e3o inv\u00e1lida enquanto a sess\u00e3o est\u00e1 utilizando a entrega ass\u00edncrona.
MQJMS1014 = opera\u00e7\u00e3o inv\u00e1lida para o produtor identificado.
MQJMS1015 = valor desconhecido do cliente de destino: ''{0}''.
MQJMS1016 = ocorreu um erro interno. Entre em contato com o administrador do sistema. Detalhe: ''{0}''.
MQJMS1017 = fila MQ n\u00e3o local n\u00e3o v\u00e1lida para receber ou navegar.
MQJMS1018 = nenhuma conex\u00e3o v\u00e1lida dispon\u00edvel.
MQJMS1019 = opera\u00e7\u00e3o inv\u00e1lida para sess\u00e3o n\u00e3o transacionada.
MQJMS1020 = opera\u00e7\u00e3o inv\u00e1lida para sess\u00e3o transacionada.
MQJMS1021 = falha na recupera\u00e7\u00e3o: mensagens n\u00e3o reconhecidas podem n\u00e3o ser entregues novamente.
MQJMS1022 = falha ao redirecionar mensagem.
MQJMS1023 = Falha da recupera\u00e7\u00e3o.
MQJMS1024 = sess\u00e3o fechada.
MQJMS1025 = falha ao procurar a mensagem.
MQJMS1026 = ExceptionListener emitiu a exce\u00e7\u00e3o: ''{0}''.
MQJMS1027 = falha ao reconstituir o destino de ''{0}''.
MQJMS1028 = o nome de elemento \u00e9 nulo.
MQJMS1029 = o nome da propriedade \u00e9 nulo.
MQJMS1030 = o buffer fornecido pelo aplicativo \u00e9 muito pequeno.
MQJMS1031 = ocorreu um erro interno. Entre em contato com o administrador do sistema.
MQJMS1032 = close() falhou por causa de ''{0}''.
MQJMS1033 = start() falhou por causa de ''{0}''.
MQJMS1034 = MessageListener emitiu: ''{0}''.
MQJMS1042 = Modo de Entrega inv\u00e1lido.
MQJMS1044 = A cadeia n\u00e3o \u00e9 um n\u00famero hexadecimal v\u00e1lido - ''{0}''.
MQJMS1045 = N\u00famero fora do intervalo para a Flutua\u00e7\u00e3o de S/390 de precis\u00e3o dupla ''{0}''.
MQJMS1046 = O conjunto de caracteres ''{0}'' n\u00e3o \u00e9 suportado.
MQJMS1047 = A mensagem de mapeamento possui um formato incorreto.
MQJMS1048 = A mensagem de fluxo possui um formato incorreto.
MQJMS1049 = O IBM MQ classes for JMS tentou converter uma matriz de bytes para uma Sequ\u00eancia.
MQJMS1050 = O cabe\u00e7alho de MQRFH2 possui um formato incorreto.
MQJMS1051 = Classe do JMS Message.
MQJMS1052 = Classe do JMS Message Irreconhec\u00edvel.
MQJMS1053 = Substitui\u00e7\u00e3o inv\u00e1lida do UTF-16 detectada ''{0}''.
MQJMS1054 = Detectada seq\u00fc\u00eancia de escape XML inv\u00e1lida ''{0}''.
MQJMS1055 = A propriedade ou elemento na mensagem possui um tipo de dados incompat\u00edvel ''{0}''.
MQJMS1056 = Tipo de dados de propriedade ou elemento n\u00e3o suportado ''{0}''.
MQJMS1057 = A mensagem n\u00e3o possui uma sess\u00e3o associada a ela.
MQJMS1058 = Nome inv\u00e1lido da propriedade da mensagem: ''{0}''.
MQJMS1059 = Erro fatal - UTF8 n\u00e3o suportado.
MQJMS1060 = Imposs\u00edvel serializar objeto.
MQJMS1061 = Imposs\u00edvel desserializar objeto.
MQJMS1062 = Ocorreu uma exce\u00e7\u00e3o ao ler o corpo da mensagem: ''{0}''.
MQJMS1063 = Outros ''{0}'' caractere(s) omitido(s).
MQJMS1064 = Codifica\u00e7\u00e3o de inteiros: ''{0}''=Codifica\u00e7\u00e3o do ponto de flutua\u00e7\u00e3o ''{1}''.
MQJMS1065 = Ocorreu uma exce\u00e7\u00e3o ao gravar o corpo da mensagem.
MQJMS1066 = Nome inv\u00e1lido do elemento da mensagem: ''{0}''.
MQJMS1067 = tempo limite inv\u00e1lido para MQ.
MQJMS1068 = falha ao obter XAResource.
MQJMS1069 = N\u00e3o permitido com XASession.
MQJMS1072 = Imposs\u00edvel pesquisar o nome do Gerenciador de Filas.
MQJMS1073 = A Fila MQ especificada n\u00e3o \u00e9 um QLOCAL nem um QALIAS.
MQJMS1074 = Imposs\u00edvel processar mensagem nula.
MQJMS1075 = Erro ao gravar o cabe\u00e7alho de devolu\u00e7\u00f5es.
MQJMS1076 = Erro ao ler o cabe\u00e7alho de devolu\u00e7\u00f5es.
MQJMS1077 = Incompatibilidade do conex\u00e3o/destino.
MQJMS1078 = Objeto de Sess\u00e3o inv\u00e1lido.
MQJMS1079 = Imposs\u00edvel gravar mensagem na fila de devolu\u00e7\u00f5es.
MQJMS1080 = Nenhuma fila de Restaura\u00e7\u00e3o-Reenfileiramento definida.
MQJMS1081 = Falha no reenfileiramento de mensagens.
MQJMS1082 = Falha ao descartar mensagem.
MQJMS1085 = Erro ao gravar RFH.
MQJMS1086 = Erro ao ler RFH.
MQJMS1087 = Conte\u00fado RFH irreconhec\u00edvel ou inv\u00e1lido.
MQJMS1088 = \u00c9 proibida a atua\u00e7\u00e3o de consumidores de dom\u00ednios mistos na mesma entrada.
MQJMS1089 = Ocorreu uma exce\u00e7\u00e3o ao ler o corpo da mensagem: ''{0}''.
MQJMS1091 = opera\u00e7\u00e3o inv\u00e1lida para o produtor n\u00e3o identificado.
MQJMS1093 = Um par\u00e2metro nulo foi transmitido ao construtor: ''{0}''
MQJMS1094 = quantityHint inv\u00e1lido.
MQJMS1096 = MessageReference inv\u00e1lida.
MQJMS1098 = Vers\u00e3o de MessageReference inv\u00e1lida.
MQJMS1099 = Vers\u00e3o de MQQueueAgentThread inv\u00e1lida.

# ---------------------------------------------------------------------------------
#
# Component Common - group prefix '1' - multicast exceptions
#
# ---------------------------------------------------------------------------------

MQJMS1102 = A conex\u00e3o multicast n\u00e3o pode ser estabelecida.
MQJMS1103 = Mensagens ''{0}'' perdidas no modo de multicast confi\u00e1vel.
MQJMS1104 = Conex\u00e3o multicast desconectada devido a tempo limite.
MQJMS1105 = Imposs\u00edvel conectar com uma porta local espec\u00edfica para multicast disthub.
MQJMS1106 = N\u00e3o \u00e9 poss\u00edvel carregar a biblioteca nativa requerida para PGM/IP.
MQJMS1107 = Ocorreu um problema com a conex\u00e3o.

# ---------------------------------------------------------------------------------
#
# Component Common - group prefix '1' - JMS1.1 additional messages
#
# ---------------------------------------------------------------------------------

MQJMS1110 = JMS1.1 Opera\u00e7\u00e3o n\u00e3o suportada por este tipo.
MQJMS1111 = JMS1.1 Os servi\u00e7os de Publica\u00e7\u00e3o/Assinatura de Filas n\u00e3o est\u00e3o configurados.
MQJMS1112 = JMS1.1 Opera\u00e7\u00e3o inv\u00e1lida para objeto de dom\u00ednio espec\u00edfico.
MQJMS1113 = JMS1.1 Opera\u00e7\u00e3o inv\u00e1lida para objeto de dom\u00ednio cruzado.

MQJMS1115 = Falha ao consultar as propriedades da fila de base ''{0}'' da fila de alias ''{1}'', padronizando para o limite de restaura\u00e7\u00e3o de ''{2}''. C\u00f3digo de conclus\u00e3o ''{3}'' C\u00f3digo de raz\u00e3o ''{4}''
MQJMS1115.explanation = A fila que est\u00e1 sendo processada era uma fila de alias e ocorreu uma falha durante a consulta das propriedades backoutQueue e backoutThreshold da fila de base.
MQJMS1115.useraction = Verifique os c\u00f3digos de conclus\u00e3o e raz\u00e3o para determinar a causa. Se o c\u00f3digo de raz\u00e3o estiver relacionado \u00e0s autoridades necess\u00e1rias, verifique se o usu\u00e1rio conectado tem autoridade de consulta na fila de base referenciada pela fila de alias. Para parar consultas na fila de base e usar o valor de limite de restaura\u00e7\u00e3o padr\u00e3o indicado acima e para reenfileirar mensagens que atingiram este limite na fila de devolu\u00e7\u00f5es, configure a propriedade JVM com.ibm.mq.jms.useDefaultBOValues=true.
MQJMS1115.inserts = XMSC_INSERT_DESTINATION_NAME, XMSC_INSERT_STRING, XMSC_INSERT_VALUE, XMSC_INSERT_COMP_CODE, XMSC_INSERT_REASON

MQJMS1116 = A mensagem ''{0}'', detectada na fila ''{1}'' no gerenciador de filas ''{2}'', n\u00e3o pode ser processada devido a um cabe\u00e7alho MQRFH2 inv\u00e1lido e foi movida para a fila de devolu\u00e7\u00f5es ''{3}''.
MQJMS1116.explanation = Ao executar no modo de migra\u00e7\u00e3o do provedor de sistemas de mensagens do IBM MQ, um ConnectionConsumer, Especifica\u00e7\u00e3o de ativa\u00e7\u00e3o ou Porta do listener do WebSphere Application Server detectou uma mensagem que continha um cabe\u00e7alho MQRFH2 inv\u00e1lido. Como o campo Relat\u00f3rio no MQMD para esta mensagem continha a op\u00e7\u00e3o MQRO_DEAD_LETTER_Q, a mensagem foi movida para a fila de devolu\u00e7\u00f5es. 
MQJMS1116.useraction = Consulte a mensagem na fila de devolu\u00e7\u00f5es para determinar por que o cabe\u00e7alho MQRFH2 \u00e9 inv\u00e1lido e modifique o aplicativo que gerou a mensagem para assegurar que o cabe\u00e7alho MQRFH2 seja v\u00e1lido.
MQJMS1116.inserts = XMSC_INSERT_MESSAGE_ID, XMSC_INSERT_DESTINATION_NAME, XMSC_INSERT_QUEUE_MANAGER_NAME, XMSC_INSERT_STRING 

MQJMS1117 = A mensagem ''{0}'', detectada na fila ''{1}'' no gerenciador de filas ''{2}'', n\u00e3o pode ser processada devido a um cabe\u00e7alho MQRFH2 inv\u00e1lido e foi descartada.
MQJMS1117.explanation = Ao executar no modo de migra\u00e7\u00e3o do provedor de sistemas de mensagens do IBM MQ, um ConnectionConsumer, Especifica\u00e7\u00e3o de ativa\u00e7\u00e3o ou Porta do listener do WebSphere Application Server detectou uma mensagem que continha um cabe\u00e7alho MQRFH2 inv\u00e1lido. Como o campo Relat\u00f3rio no MQMD para essa mensagem continha a op\u00e7\u00e3o MQRO_DISCARD_MSG, a mensagem foi descartada. 
MQJMS1117.useraction = Modifique o aplicativo respons\u00e1vel pela gera\u00e7\u00e3o da mensagem, para que ele gere mensagens que contenham cabe\u00e7alhos MQRFH2 v\u00e1lidos.
MQJMS1117.inserts = XMSC_INSERT_MESSAGE_ID, XMSC_INSERT_DESTINATION_NAME, XMSC_INSERT_QUEUE_MANAGER_NAME 

# ---------------------------------------------------------------------------------
#
# Component BaseMQ - group prefix '2'
#
# ---------------------------------------------------------------------------------

MQJMS2000 = falha ao fechar a fila do MQ.
MQJMS2001 = A refer\u00eancia \u00e0 fila do MQ \u00e9 nula.
MQJMS2002 = falha ao obter a mensagem da fila MQ.
MQJMS2003 = falha ao desconectar o gerenciador de filas.
MQJMS2004 = A refer\u00eancia de MQQueueManager \u00e9 nula.
MQJMS2005 = falha ao criar MQQueueManager para ''{0}''.
MQJMS2006 = Problema do MQ: ''{0}''.
MQJMS2007 = falha ao enviar mensagens \u00e0 fila do MQ.
MQJMS2008 = falha ao abrir a fila do MQ ''{0}''.
MQJMS2009 = Falha do MQQueueManager.commit().
MQJMS2010 = valor desconhecido para definitionType da fila do MQ: ''{0}''.
MQJMS2011 = falha ao consultar a profundidade da fila do MQ.
MQJMS2012 = Falha de XACLOSE.
MQJMS2013 = autentica\u00e7\u00e3o de seguran\u00e7a inv\u00e1lida fornecida para MQQueueManager.
MQJMS2014 = O gerenciador de filas rejeitou a conex\u00e3o do cliente do XA.

# ---------------------------------------------------------------------------------
#
# Component Domain - group prefix '3'
#
# ---------------------------------------------------------------------------------

MQJMS3000 = falha ao criar uma fila tempor\u00e1ria de ''{0}''.
MQJMS3001 = a fila tempor\u00e1ria j\u00e1 foi fechada ou exclu\u00edda.
MQJMS3002 = fila tempor\u00e1ria em uso.
MQJMS3003 = imposs\u00edvel excluir uma fila est\u00e1tica.
MQJMS3004 = falha ao excluir a fila tempor\u00e1ria.
MQJMS3005 = Falha na Publica\u00e7\u00e3o/Assinatura devido ao ''{0}''.
MQJMS3006 = A refer\u00eancia do t\u00f3pico \u00e9 nula.
MQJMS3008 = Falha ao construir o comando ''{0}''.
MQJMS3009 = Falha ao publicar o comando na fila do MQ.
MQJMS3010 = Falha ao construir a mensagem de publica\u00e7\u00e3o.
MQJMS3011 = Falha ao publicar a mensagem na fila do MQ.
MQJMS3013 = Falha ao armazenar a entrada do administrador.
MQJMS3014 = Falha ao abrir a fila de assinantes ''{0}''.
MQJMS3017 = Falha ao excluir a fila de assinantes ''{0}''.
MQJMS3018 = Assinatura dur\u00e1vel desconhecida ''{0}''.
MQJMS3019 = TemporaryTopic j\u00e1 exclu\u00eddo.
MQJMS3020 = TemporaryTopic fora do escopo.
MQJMS3021 = Prefixo da fila de assinantes inv\u00e1lido: ''{0}''.
MQJMS3022 = A resubscri\u00e7\u00e3o dur\u00e1vel deve utilizar a mesma fila de assinantes; especificado:''{0}'' original:''{1}''.
MQJMS3023 = A assinatura possui um TopicSubscriber ativo.
MQJMS3024 = Uso ilegal do ID do cliente n\u00e3o inicializado.
MQJMS3025 = TemporaryTopic em uso.
MQJMS3026 = QueueSender est\u00e1 fechado.
MQJMS3028 = TopicPublisher est\u00e1 fechado.
MQJMS3031 = N\u00e3o \u00e9 poss\u00edvel configurar o clientID ap\u00f3s utilizar a conex\u00e3o.
MQJMS3032 = A reconfigura\u00e7\u00e3o do clientID n\u00e3o \u00e9 permitida.
MQJMS3033 = QueueReceiver est\u00e1 fechado.
MQJMS3034 = TopicSubscriber est\u00e1 fechado.
MQJMS3037 = O Produtor de Mensagem est\u00e1 fechado.
MQJMS3038 = O Consumidor de Mensagem est\u00e1 fechado.
MQJMS3039 = Uso ilegal de nome nulo.
MQJMS3040 = Conte\u00fado inv\u00e1lido da mensagem de controle do intermedi\u00e1rio: ''{0}''.
MQJMS3041 = Campo ''{0}'' j\u00e1 configurado.
MQJMS3042 = Mensagem n\u00e3o reconhecida do Pub/Sub Broker.
MQJMS3043 = N\u00edvel Inv\u00e1lido para a repeti\u00e7\u00e3o da Limpeza.
MQJMS3044 = N\u00edvel de limpeza de NONE solicitado.
MQJMS3045 = Falha ao abrir ''{0}'': uma limpeza de n\u00edvel FORCE ou NONDUR pode estar sendo executada?
MQJMS3046 =  Falha ao abrir ''{0}'': outro aplicativo JMS pode estar usando Pub/Sub com esse gerenciador de filas?
MQJMS3047 = Tipo de armazenamento de assinaturas n\u00e3o suportado pelo gerenciador de filas.
MQJMS3048 = Tipo de Armazenamento de Assinaturas incorreto.
MQJMS3049 = MQJMS_Messages.MQJMS_PS_WRONG_SUBSCRIPTION_TYPE = Tipo de Assinatura Incorreto para este Armazenamento de Assinaturas.
MQJMS3050 = A assinatura j\u00e1 est\u00e1 em uso e n\u00e3o pode ser atualizada.
MQJMS3051 = Nome da Assinatura inv\u00e1lido.

MQJMS3052 = Limpeza iniciada em ''{0}'' no ''{1}''.
MQJMS3052.explanation = O script de Limpeza do IBM MQ classes for JMS est\u00e1 em execu\u00e7\u00e3o e iniciou uma opera\u00e7\u00e3o de limpeza na data e hora especificadas. A hora est\u00e1 no formato HHMMSSTH e a data est\u00e1 no formato AAAAMMDD. 
MQJMS3052.useraction = Nenhum. 
MQJMS3052.inserts = XMSC_INSERT_TIMESTAMP, XMSC_INSERT_DATESTAMP

MQJMS3053 = Limpeza conclu\u00edda em ''{0}'' no ''{1}''.
MQJMS3053.explanation = O script de Limpeza do IBM MQ classes for JMS est\u00e1 em execu\u00e7\u00e3o e concluiu uma opera\u00e7\u00e3o de limpeza na data e hora especificadas. A hora est\u00e1 no formato HHMMSSTH e a data est\u00e1 no formato AAAAMMDD. 
MQJMS3053.useraction = Nenhum. 
MQJMS3053.inserts = XMSC_INSERT_TIMESTAMP, XMSC_INSERT_DATESTAMP

MQJMS3054 = Tempo at\u00e9 a pr\u00f3xima opera\u00e7\u00e3o de Limpeza: ''{0}'' minutos.
MQJMS3054.explanation = O script de Limpeza do IBM MQ classes for JMS est\u00e1 em execu\u00e7\u00e3o e agora est\u00e1 aguardando o n\u00famero de minutos mostrado na mensagem antes de iniciar a pr\u00f3xima opera\u00e7\u00e3o de limpeza. O n\u00famero de minutos mostrado na mensagem foi arredondado para baixo para o minuto mais pr\u00f3ximo.
MQJMS3054.useraction = Nenhum. 
MQJMS3054.inserts = XMSC_INSERT_STRING

# ---------------------------------------------------------------------------------
#
# Admin Domain - group prefix '4'
#
# ---------------------------------------------------------------------------------

MQJMS4124 = O valor da propriedade para ''{0}'' \u00e9 nulo.
MQJMS4125 = Propriedade inv\u00e1lida para um ''{0}'': ''{1}''.
MQJMS4131 = Os tipos de objetos esperados e reais n\u00e3o s\u00e3o correspondentes.

# ---------------------------------------------------------------------------------
#
# Util Domain (IVT, sample etc.) - group prefix '5'
#
# ---------------------------------------------------------------------------------

MQJMS5053 = *** Nenhuma resposta do servidor intermedi\u00e1rio. Verifique se o servidor intermedi\u00e1rio est\u00e1 em execu\u00e7\u00e3o. Se estiver usando o intermedi\u00e1rio do IBM MQ, verifique se sua brokerVersion est\u00e1 configurada para V1 ***
MQJMS5087 = Erro inesperado ''{1}'' ao acessar a fila interna ''{0}''.

# ---------------------------------------------------------------------------------
#
# Gryphon - group prefix '6'
#
# ---------------------------------------------------------------------------------

MQJMS6040 = Nome inv\u00e1lido da fam\u00edlia de soquetes: ''{0}''.
MQJMS6041 = Ocorreu uma exce\u00e7\u00e3o ao tentar carregar a classe do socket factory ''{0}'', exce\u00e7\u00e3o: <''{1}''>.
MQJMS6056 = N\u00e3o \u00e9 poss\u00edvel alterar o par\u00e2metro ''{0}'', visto que nenhuma altera\u00e7\u00e3o adicional do par\u00e2metro BaseConfig \u00e9 permitida.
MQJMS6057 = N\u00e3o \u00e9 poss\u00edvel configurar o par\u00e2metro ''{0}'' para o valor ''{1}''.
MQJMS6058 = ocorreu um erro ao obter o par\u00e2metro BaseConfig ''{0}''.
MQJMS6059 = Ocorreu uma exce\u00e7\u00e3o ao carregar a implementa\u00e7\u00e3o de seguran\u00e7a do cliente m\u00ednimo.
MQJMS6060 = Ocorreu uma exce\u00e7\u00e3o inesperada no cliente m\u00ednimo, exce\u00e7\u00e3o, ''{0}''.
MQJMS6061 = Um t\u00f3pico especificado estava mal formado, ''{0}''.
MQJMS6062 = EOF foi encontrado ao receber dados no cliente m\u00ednimo.
MQJMS6063 = O intermedi\u00e1rio indicou um erro na conex\u00e3o do cliente m\u00ednimo.
MQJMS6064 = Connector.send foi chamado com um valor de mensagem ilegal.
MQJMS6065 = Um valor ilegal foi encontrado para um campo, ''{0}''.
MQJMS6066 = Ocorreu um erro interno inesperado no cliente m\u00ednimo.
MQJMS6067 = Uma opera\u00e7\u00e3o de mensagem de bytes foi solicitada em algo que n\u00e3o \u00e9 uma mensagem de bytes.
MQJMS6068 = Uma opera\u00e7\u00e3o de mensagem de texto foi solicitada em algo que n\u00e3o \u00e9 uma mensagem de texto.
MQJMS6069 = Uma opera\u00e7\u00e3o de mensagem de fluxo foi solicitada em algo que n\u00e3o \u00e9 uma mensagem de fluxo.
MQJMS6070 = Uma opera\u00e7\u00e3o de mensagem de mapeamento foi solicitada em algo que n\u00e3o \u00e9 uma mensagem de mapeamento.
MQJMS6071 = O intermedi\u00e1rio enviou uma mensagem inv\u00e1lida durante a autentica\u00e7\u00e3o.
MQJMS6072 = O intermedi\u00e1rio solicitou um protocolo n\u00e3o dispon\u00edvel durante a autentica\u00e7\u00e3o.
MQJMS6073 = A conex\u00e3o do cliente m\u00ednimo foi rejeitada devido \u00e0 falha na autentica\u00e7\u00e3o.
MQJMS6074 = Nenhum QOP dispon\u00edvel no cliente m\u00ednimo.
MQJMS6079 = Ocorreu uma exce\u00e7\u00e3o ao tentar carregar o suporte ao conjunto de encadeamentos, ''{0}''.
MQJMS6081 = Foi feita uma tentativa de ler a partir de uma mensagem de Fluxo antes da leitura anterior ser conclu\u00edda.
MQJMS6083 = Ocorreu uma exce\u00e7\u00e3o ao inicializar uma inst\u00e2ncia do conjunto de encadeamentos, ''{0}''.
MQJMS6085 = Nenhum ExceptionListener foi configurado.
MQJMS6088 = O monitor de conex\u00e3o do lado do cliente est\u00e1 sendo finalizado.
MQJMS6090 = Tentativa de receber sincronicamente em um MessageConsumer para o qual um listener est\u00e1 ativo.
MQJMS6091 = Ocorreu uma IOException ao iniciar ou parar a entrega na conex\u00e3o, ''{0}''.
MQJMS6093 = Ocorreu uma exce\u00e7\u00e3o durante o recebimento s\u00edncrono, ''{0}''.
MQJMS6096 = Um n\u00edvel JMSPriority de ''{0}'' est\u00e1 fora do intervalo especificado no JMS.
MQJMS6097 = O JMSMessageID especificado, ''{0}'', \u00e9 inv\u00e1lido.
MQJMS6105 = N\u00e3o s\u00e3o permitidas mais altera\u00e7\u00f5es no par\u00e2metro do cliente.
MQJMS6106 = Ocorreu uma exce\u00e7\u00e3o ao inicializar o par\u00e2metro ''{0}'', exce\u00e7\u00e3o ''{1}''.
MQJMS6115 = Ocorreu uma exce\u00e7\u00e3o ao criar a TopicConnection, ''{0}''.
MQJMS6116 = Essa opera\u00e7\u00e3o n\u00e3o \u00e9 permitida em uma entidade fechada.
MQJMS6117 = A implementa\u00e7\u00e3o do T\u00f3pico ''{0}'' n\u00e3o \u00e9 suportada.
MQJMS6118 = O T\u00f3pico ''{0}'' cont\u00e9m um caractere curinga, o qual \u00e9 inv\u00e1lido para publica\u00e7\u00e3o.
MQJMS6119 = Ocorreu uma IOException ao publicar, ''{0}''.
MQJMS6120 = Tentativa de utilizar um t\u00f3pico tempor\u00e1rio n\u00e3o criado na conex\u00e3o atual.
MQJMS6121 = Ocorreu uma IOException ao assinar, ''{0}''.
MQJMS6232 = Ao criar um TopicSubscriber, a tentativa de incluir a assinatura no mecanismo de correspond\u00eancia resultou na seguinte exce\u00e7\u00e3o: ''{0}''.
MQJMS6233 = Foi capturada uma exce\u00e7\u00e3o inesperada no mecanismo de correspond\u00eancia: ''{0}''.
MQJMS6234 = Foi feita uma tentativa de remover um objeto com o t\u00f3pico ''{0}'' de um mecanismo de correspond\u00eancia vazio: ''{1}''.
MQJMS6235 = Foi feita uma tentativa de remover um objeto com o t\u00f3pico {0} do mecanismo de correspond\u00eancia, mas ele n\u00e3o tinha uma entrada em cache: ''{1}''.
MQJMS6236 = Foi encontrado um tipo de verifica\u00e7\u00e3o de classe desconhecido {0} em um recurso de correspond\u00eancia espec\u00edfico do tipo.
MQJMS6237 = Foi feita uma tentativa de acessar um campo desconhecido denominado ''{0}''.
MQJMS6238 = Em uma tentativa de acessar um campo de uma mensagem, ocorreu a seguinte exce\u00e7\u00e3o: ''{0}''.
MQJMS6239 = Ocorreu uma opera\u00e7\u00e3o de entrada ou obten\u00e7\u00e3o EvalCache quando o cache n\u00e3o foi carregado.
MQJMS6240 = Uma opera\u00e7\u00e3o de entrada ou obten\u00e7\u00e3o EvalCache especificou um ID inv\u00e1lido.
MQJMS6241 = Muitos atributos de conte\u00fado foram especificados.
MQJMS6242 = Um MatchTarget duplicado foi detectado em MatchSpace.
MQJMS6243 = Foi feita uma tentativa de remover MatchTarget ''{0}'' de MatchSpace, mas ele n\u00e3o possui nenhuma chave (t\u00f3pico).
MQJMS6244 = O MatchTarget ''{1}'' com a chave (t\u00f3pico) ''{0}'' n\u00e3o p\u00f4de ser removido de MatchSpace porque n\u00e3o foi poss\u00edvel encontr\u00e1-lo.
MQJMS6245 = Foi feita uma tentativa de incluir um MatchTarget ao MatchSpace sem uma tecla (t\u00f3pico).
MQJMS6246 = Foi detectado um uso incorreto de um caractere curinga do t\u00f3pico ''{0}''.
MQJMS6247 = O separador de segmentos do t\u00f3pico ''{0}'' aparece em uma posi\u00e7\u00e3o incorreta.
MQJMS6248 = Ocorreu um erro ao tentar carregar ou chamar o analisador de seletor de assinaturas.
MQJMS6249 = Ocorreu a seguinte exce\u00e7\u00e3o ao analisar um seletor de assinaturas: ''{0}''.
MQJMS6250 = O caractere de escape foi utilizado para finalizar o seguinte padr\u00e3o: ''{0}''.
MQJMS6251 = O caractere de escape ''{0}'' transmitido \u00e0 ferramenta padr\u00e3o \u00e9 maior que um caractere.
MQJMS6252 = Esperava-se que um campo de mensagem contivesse um valor do tipo ''{0}'', mas continha um valor do tipo ''{1}''.
MQJMS6228 = Falha na autentica\u00e7\u00e3o do cliente m\u00ednimo devido \u00e0 exce\u00e7\u00e3o ''{0}''.
MQJMS6229 = QOP necess\u00e1rio mas desativado para esse cliente m\u00ednimo.
MQJMS6311 = O tipo de transporte 'DIRECT' em uma transa\u00e7\u00e3o n\u00e3o \u00e9 suportado.
MQJMS6312 = Assinatura n\u00e3o autorizada no t\u00f3pico ''{0}''.
MQJMS6350 = Uma opera\u00e7\u00e3o de mensagem de objeto foi solicitada em algo que n\u00e3o \u00e9 uma mensagem de objeto.
MQJMS6351 = Ocorreu uma exce\u00e7\u00e3o ao criar assinatura para <''{0}'',''{1}''>, ''{2}''.
MQJMS6401 = Mensagens persistentes n\u00e3o suportadas para tipo de transporte 'DIRECT'.
MQJMS6402 = Tempo Ativo > 0 n\u00e3o suportado para tipo de transporte 'DIRECT'.
MQJMS6403 = Expira\u00e7\u00e3o de T\u00f3pico > 0 n\u00e3o suportada para tipo de transporte 'DIRECT'.
MQJMS6404 = Conhecimento de Cliente n\u00e3o suportado para tipo de transporte 'DIRECT'.
MQJMS6405 = A funcionalidade do JMS 2.0 n\u00e3o \u00e9 suportada com o ProviderVersion 6.
MQJMS6406 = O modo de migra\u00e7\u00e3o do provedor de sistemas de mensagens do IBM MQ n\u00e3o \u00e9 suportado em um ambiente CICS.
MQJMS6407 = O modo de migra\u00e7\u00e3o do provedor de sistemas de mensagens do IBM MQ n\u00e3o \u00e9 suportado em um ambiente IMS.
