#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE
# %Z% %W% %I% %E% %U%

# Note to translators: the comments for the JMSMQxxxx.documentation properties in
# this file do NOT need to be translated, they are used at build time to create
# untranslated Javadoc documentation. 

#MQJMSIVT messages
JMSMQ0000 = A(z) ''{0}'' met\u00f3dus illeg\u00e1lis vagy nem megfelel\u0151 id\u0151pontban ker\u00fclt megh\u00edv\u00e1sra, illetve a szolg\u00e1ltat\u00f3 nincs megfelel\u0151 \u00e1llapotban a k\u00e9rt m\u0171velethez. 
JMSMQ0000.explanation = A kiv\u00e9telt \u00e1ltal\u00e1ban az okozza, hogy az SSL tan\u00fas\u00edtv\u00e1nyt\u00e1rol\u00f3k nincsenek meghat\u00e1rozva. \
A(z) ''{0}'' jelzi a probl\u00e9m\u00e1t okoz\u00f3 met\u00f3dust.
JMSMQ0000.inserts = XMSC_INSERT_NAME

JMSMQ1046 = A(z) ''{0}'' karakterk\u00e9szlet nem t\u00e1mogatott.
JMSMQ1046.documentation = A(z) {0} karakterk\u00e9szlet nem t\u00e1mogatott. \
<br> <b>Magyar\u00e1zat:</b> Olyan lek\u00e9pez\u00e9s\u00fczenet, adatfolyam-\u00fczenet vagy \
sz\u00f6veg\u00fczenet k\u00fcld\u00e9s\u00e9re, illetve fogad\u00e1s\u00e1ra t\u00f6rt\u00e9nt k\u00eds\u00e9rlet, amelynek a \
t\u00f6rzse a Java virtu\u00e1lis g\u00e9p \u00e1ltal nem t\u00e1mogatott karakterk\u00e9szlet \
haszn\u00e1lat\u00e1val van k\u00f3dolva. \
A sz\u00f6veg\u00fczenetek eset\u00e9n akkor t\u00f6rt\u00e9nhet ez a kiv\u00e9tel, amikor \
a rendszer el\u0151sz\u00f6r k\u00e9rdezi le az \u00fczenet t\u00f6rzs\u00e9t, nem a fogad\u00e1s \
id\u0151pontj\u00e1ban. \
<br> <b>Felhaszn\u00e1l\u00f3i v\u00e1lasz:</b> Csak olyan karakterk\u00e9szlet haszn\u00e1lat\u00e1val \
k\u00f3doljon \u00fczenetet, ami ismert \u00e9s el\u00e9rhet\u0151 a fogad\u00f3 alkalmaz\u00e1s sz\u00e1m\u00e1ra.

JMSMQ1002 = IBM MQ oszt\u00e1lyok Java(tm) \u00fczenetszolg\u00e1ltat\u00e1shoz 
JMSMQ3043 = \u00c9rv\u00e9nytelen szint a tiszt\u00edt\u00e1s ism\u00e9tl\u00e9s\u00e9hez.
JMSMQ3043.documentation = A tiszt\u00edt\u00e1s ism\u00e9tl\u00e9s\u00e9hez megadott szint nem \u00e9rv\u00e9nyes. \
<br> <b>Felhaszn\u00e1l\u00f3i v\u00e1lasz:</b> \u00c1ll\u00edtsa a cleanupLevel tulajdons\u00e1got megfelel\u0151 \u00e9rt\u00e9kre. 

JMSMQ5032 = Kapcsolat bez\u00e1r\u00e1sa
JMSMQ5010 = Kapcsolat l\u00e9tes\u00edt\u00e9se
JMSMQ5034 = Elfogott kiv\u00e9tel
JMSMQ5021 = Nem siker\u00fclt \u00fajra visszaszerezni az \u00fczenetet
JMSMQ5002 = -icf kapcsol\u00f3 figyelmen k\u00edv\u00fcl hagy\u00e1sa; nincs megadva \u00e9rt\u00e9k
JMSMQ5003 = ''{0}'' ismeretlen kapcsol\u00f3 figyelmen k\u00edv\u00fcl hagy\u00e1sa
JMSMQ5001 = -url kapcsol\u00f3 figyelmen k\u00edv\u00fcl hagy\u00e1sa; nincs megadva \u00e9rt\u00e9k
JMSMQ5006 = InitialContext nem hozhat\u00f3 l\u00e9tre. Ellen\u0151rizze a JNDI be\u00e1ll\u00edt\u00e1sokat
JMSMQ5035 = IVT befejez\u0151d\u00f6tt
JMSMQ5000 = Telep\u00edt\u00e9s-ellen\u0151rz\u00e9si teszt
JMSMQ5033 = IVT sikeresen befejez\u0151d\u00f6tt
JMSMQ5017 = TextMessage l\u00e9trehoz\u00e1sa
JMSMQ5024 = Hiba. A v\u00e1lasz karaktersorozat elt\u00e9r az eredeti karaktersorozatt\u00f3l
JMSMQ5023 = A v\u00e1lasz karaktersorozat egyenl\u0151 az eredeti karaktersorozattal
JMSMQ5020 = Az \u00fczenet \u00fajb\u00f3li visszaolvas\u00e1s\u00e1ra tett k\u00eds\u00e9rlet meghi\u00fasult, mivel az nem volt ott
JMSMQ5019 = Az \u00fczenet \u00fajb\u00f3li visszaolvas\u00e1sa
JMSMQ5022 = \u00dczenet megvan
JMSMQ5027 = A v\u00e1lasz\u00fczenet nem TextMessage volt
JMSMQ5025 = Eredeti karaktersorozat
JMSMQ5026 = V\u00e1lasz karaktersorozat
JMSMQ5018 = Az \u00fczenet elk\u00fcld\u00e9se ide: ''{0}''
JMSMQ5028 = Rossz t\u00edpus\u00fa \u00fczenet j\u00f6tt
JMSMQ5037 = A(z) ''{0}'' JAR f\u00e1jl vagy oszt\u00e1ly nem tal\u00e1lhat\u00f3. Ez az\u00e9rt fordulhat el\u0151, mert hi\u00e1nyzik az oszt\u00e1ly\u00fatvonalb\u00f3l.
JMSMQ5038 = A(z) ''{0}'' oszt\u00e1ly nem tal\u00e1lhat\u00f3. Ez az\u00e9rt fordulhat el\u0151, mert a JNDI szolg\u00e1ltat\u00f3 hi\u00e1nyzik az oszt\u00e1ly\u00fatvonalb\u00f3l.
JMSMQ5036 = ''{0}'' be\u00e1ll\u00edt\u00e1s figyelmen k\u00edv\u00fcl hagy\u00e1sa, nincs megadva \u00e9rt\u00e9k
JMSMQ5064 = A -port param\u00e9ternek numerikusnak kell lennie
JMSMQ5058 = kapcsol\u00f3d\u00f3 kiv\u00e9tel
JMSMQ5007 = QueueConnectionFactory l\u00e9trehoz\u00e1sa
JMSMQ5009 = A QCF objektum nem k\u00e9rhet\u0151 le a JNDI-b\u0151l
JMSMQ5008 = QueueConnectionFactory lek\u00e9r\u00e9se a JNDI-b\u0151l
JMSMQ5012 = Sor l\u00e9trehoz\u00e1sa
JMSMQ5014 = A Q objektum nem k\u00e9rhet\u0151 le a JNDI-b\u0151l
JMSMQ5013 = Sor lek\u00e9r\u00e9se a JNDI-b\u0151l
JMSMQ5029 = QueueReceiver bez\u00e1r\u00e1sa
JMSMQ5016 = QueueReceiver l\u00e9trehoz\u00e1sa
JMSMQ5030 = QueueSender bez\u00e1r\u00e1sa
JMSMQ5015 = QueueSender l\u00e9trehoz\u00e1sa
JMSMQ5031 = Session bez\u00e1r\u00e1sa
JMSMQ5011 = Session l\u00e9trehoz\u00e1sa
JMSMQ5004 = Meg kell adni az -url szolg\u00e1ltat\u00f3URL param\u00e9tert
JMSMQ5065 = Haszn\u00e1lat:
JMSMQ5066 = IVTRun -url szolg\u00e1ltat\u00f3URL [-icf kezdetiKontextusGy\u00e1r] [-t]
JMSMQ5067 = IVTRun -nojndi [-m sorkezel\u0151] [-t] [-v szolg\u00e1ltat\u00f3v\u00e1ltozat]
JMSMQ5068 = IVTRun -nojndi -client -m sorkezel\u0151 -host hosztn\u00e9v [-port port] [-channel csatorna] [-ccsid ccsazonos\u00edt\u00f3] [-t] [-v szolg\u00e1ltat\u00f3v\u00e1ltozat]
JMSMQ5005 = Fel\u00fcgyelt objektumok haszn\u00e1lata eset\u00e9n gy\u0151z\u0151dj\u00f6n meg r\u00f3la, hogy el\u00e9rhet\u0151ek
JMSMQ5100 = \u00dczenet
JMSMQ5101 = Oszt\u00e1ly
JMSMQ5102 = Verem
JMSMQ5103 = [{0}] okozta --> \u00dczenet
JMSMQ5104 = Hibak\u00f3d
JMSMQ5105 = Magyar\u00e1zat
JMSMQ5106 = Felhaszn\u00e1l\u00f3i m\u0171velet
JMSMQ5107 = Befejez\u00e9si k\u00f3d
JMSMQ5108 = Okk\u00f3d
JMSMQ5109 = Napl\u00f3\u00fczenet
JMSMQ5110 = Napl\u00f3 magyar\u00e1zat
JMSMQ5111 = Napl\u00f3 s\u00falyoss\u00e1ga
JMSMQ5112 = Napl\u00f3 \u00f6sszegz\u00e9se
JMSMQ5113 = Felhaszn\u00e1l\u00f3i v\u00e1lasz
JMSMQ5114 = {0} futtat\u00e1sa innen: {1}
JMSMQ5115 = A sor kapcsolatgy\u00e1r tulajdons\u00e1gainak be\u00e1ll\u00edt\u00e1sa meghi\u00fasult


#MQJMSPSIVT messages
JMSMQ5039 = K\u00f6zz\u00e9t\u00e9tel/El\u0151fizet\u00e9s telep\u00edt\u00e9s-ellen\u0151rz\u00e9si teszt
JMSMQ5040 = TopicConnectionFactory lek\u00e9r\u00e9se a JNDI-b\u0151l
JMSMQ5041 = A TopicConnectionFactory objektum nem k\u00e9rhet\u0151 le a JNDI-b\u0151l
JMSMQ5042 = T\u00e9mak\u00f6r lek\u00e9r\u00e9se a JNDI-b\u0151l
JMSMQ5043 = A t\u00e9mak\u00f6robjektum nem k\u00e9rhet\u0151 le a JNDI-b\u0151l
JMSMQ5044 = TopicConnectionFactory l\u00e9trehoz\u00e1sa
JMSMQ5045 = TopicConnectionFactory nem hozhat\u00f3 l\u00e9tre
JMSMQ5046 = T\u00e9mak\u00f6r l\u00e9trehoz\u00e1sa
JMSMQ5047 = Nem hozhat\u00f3 l\u00e9tre T\u00e9mak\u00f6r nem JNDI met\u00f3dusok haszn\u00e1lat\u00e1val
JMSMQ5048 = TopicPublisher l\u00e9trehoz\u00e1sa
JMSMQ5049 = TopicSubscriber l\u00e9trehoz\u00e1sa
JMSMQ5050 = Sz\u00f6veg felv\u00e9tele
JMSMQ5051 = Az \u00fczenet k\u00f6zz\u00e9t\u00e9tele ide: ''{0}''
JMSMQ5052 = V\u00e1rakoz\u00e1s egy \u00fczenet meg\u00e9rkez\u00e9s\u00e9re [legfeljebb 5 m\u00e1sodperc]...
JMSMQ5053 = *** Nincs v\u00e1lasz a k\u00f6zvet\u00edt\u0151t\u0151l. Gy\u0151z\u0151dj\u00f6n meg r\u00f3la, hogy a k\u00f6zvet\u00edt\u0151 fut. Az IBM MQ k\u00f6zvet\u00edt\u0151 haszn\u00e1lata eset\u00e9n ellen\u0151rizze, hogy a brokerVersion be\u00e1ll\u00edt\u00e1sa V1 ***
JMSMQ5053.documentation = Nincs v\u00e1lasz a k\u00f6zvet\u00edt\u0151t\u0151l. \
<br> <b>Magyar\u00e1zat:</b> Lehets\u00e9ges okok: <li>A k\u00f6zvet\u00edt\u0151 nem fut. \
<li>BrokerVersion=V2 \u00e9rt\u00e9ket haszn\u00e1l a TopicConnectionFactory eset\u00e9n az IBM MQ k\u00f6zz\u00e9t\u00e9tel/el\u0151fizet\u00e9s k\u00f6zvet\u00edt\u0151vel, ami nem t\u00e1mogatja ezt. \
<li>A k\u00f6zvet\u00edt\u0151 visszautas\u00edtotta a k\u00f6zz\u00e9t\u00e9telt vagy el\u0151fizet\u00e9st, \u00e9s a SYSTEM.DEAD.LETTER.QUEUE sorba helyezte azt. </sl> <br> <b>Felhaszn\u00e1l\u00f3i v\u00e1lasz:</b> Gy\u0151z\u0151dj\u00f6n meg r\u00f3la, hogy a k\u00f6zvet\u00edt\u0151 fut. \
N\u00e9zze meg a rendszer esem\u00e9nynapl\u00f3j\u00e1t a k\u00f6zvet\u00edt\u0151 hiba\u00fczenetei ut\u00e1n kutatva. \
Ellen\u0151rizze, hogy a k\u00f6zvet\u00edt\u0151 t\u00e1mogatja a haszn\u00e1lt k\u00f6zvet\u00edt\u0151v\u00e1ltozatot. \
Keressen visszautas\u00edtott \u00fczeneteket a SYSTEM.DEAD.LETTER.QUEUE sorban.

JMSMQ5054 = \u00dagy t\u0171nik, hogy a k\u00f6zvet\u00edt\u0151 fut, de az \u00fczenet nem \u00e9rkezett meg.
JMSMQ5054.documentation = \u00dagy t\u0171nik, hogy a k\u00f6zvet\u00edt\u0151 fut, de az \u00fczenet nem \u00e9rkezett meg. \
<br> <b>Magyar\u00e1zat:</b> Ezt a telep\u00edt\u00e9st ellen\u0151rz\u0151 teszt \u00e1ll\u00edtja el\u0151, amikor az el\u0151fizet\u0151 nem kapja meg a k\u00f6zz\u00e9tett \u00fczenetet. \
<br> <b>Felhaszn\u00e1l\u00f3i v\u00e1lasz:</b> Ellen\u0151rizze, hogy helyesen \u00e1ll\u00edtotta be a k\u00f6zvet\u00edt\u0151t. \
N\u00e9zze meg a rendszer esem\u00e9nynapl\u00f3it a k\u00f6zvet\u00edt\u0151 hiba\u00fczenetei ut\u00e1n kutatva. \
Keressen a k\u00f6zvet\u00edt\u0151 \u00e1ltal visszautas\u00edtott \u00fczeneteket a SYSTEM.DEAD.LETTER.QUEUE sorban.

JMSMQ5055 = PSIVT meghi\u00fasult
JMSMQ5056 = TopicSubscriber bez\u00e1r\u00e1sa
JMSMQ5057 = TopicPublisher bez\u00e1r\u00e1sa
JMSMQ5059 = PSIVT befejez\u0151d\u00f6tt
JMSMQ5060 = Nem lehet csatlakozni a sorkezel\u0151h\u00f6z.
JMSMQ5060.documentation = Nem lehet csatlakozni a sorkezel\u0151h\u00f6z. \
<br> <b>Magyar\u00e1zat:</b> Ezt a telep\u00edt\u00e9st ellen\u0151rz\u0151 teszt \u00e1ll\u00edtja el\u0151. \
<br> <b>Felhaszn\u00e1l\u00f3i v\u00e1lasz:</b> Ellen\u0151rizze, hogy a sorkezel\u0151 fut \u00e9s a neve helyesen van megadva az IVTTest param\u00e9terekben.

JMSMQ5061 = Nem lehet hozz\u00e1f\u00e9rni a k\u00f6zvet\u00edt\u0151vez\u00e9rl\u0151 sorhoz a sorkezel\u0151n.
JMSMQ5061.documentation = Nem lehet hozz\u00e1f\u00e9rni a k\u00f6zvet\u00edt\u0151vez\u00e9rl\u0151 sorhoz a sorkezel\u0151n. \
<br> <b>Felhaszn\u00e1l\u00f3i v\u00e1lasz:</b> Ellen\u0151rizze, hogy a vez\u00e9rl\u0151sor l\u00e9tezik. \
Az alap\u00e9rtelmezett n\u00e9v: SYSTEM.BROKER.CONTROL.QUEUE.

JMSMQ5062 = Gy\u0151z\u0151dj\u00f6n meg r\u00f3la, hogy a k\u00f6zvet\u00edt\u0151 telep\u00edtve van a sorkezel\u0151re
JMSMQ5063 = Kiv\u00e9tel itt: 'brokerIsRunning'
JMSMQ5069 = Haszn\u00e1lat:
JMSMQ5070 = PSIVTRun -url szolg\u00e1ltat\u00f3URL [-icf kezdetiKontextusGy\u00e1r] [-t]
JMSMQ5071 = PSIVTRun -nojndi [-m sorkezel\u0151] [-bqm k\u00f6zvet\u00edt\u0151] [-t] [-v szolg\u00e1ltat\u00f3v\u00e1ltozat]
JMSMQ5072 = PSIVTRun -nojndi -client -m sorkezel\u0151 -host hosztn\u00e9v [-port port] [-channel csatorna] [-bqm k\u00f6zvet\u00edt\u0151] [-ccsid ccsazonos\u00edt\u00f3] [-t] [-v szolg\u00e1ltat\u00f3v\u00e1ltozat]
JMSMQ5073 = Szinkron munkamenet l\u00e9trehoz\u00e1sa
JMSMQ5074 = Aszinkron munkamenet l\u00e9trehoz\u00e1sa
JMSMQ5075 = Kapcsolat ind\u00edt\u00e1sa
JMSMQ5076 = \u00dczenetfigyel\u0151 aktiv\u00e1l\u00f3dott
JMSMQ5077 = \u00dczenetfigyel\u0151 be\u00e1ll\u00edtva
JMSMQ5078 = Hoszt, port vagy csatorna nem \u00e1ll\u00edthat\u00f3 be \u00fcgyf\u00e9lkapcsolat n\u00e9lk\u00fcl
JMSMQ5079 = K\u00f6zz\u00e9t\u00e9tel/El\u0151fizet\u00e9s tiszt\u00edt\u00e1si seg\u00e9dprogram
JMSMQ5080 = Haszn\u00e1lat:
JMSMQ5081 = Cleanup [-m sorkezel\u0151] [-r id\u0151k\u00f6z] [SAFE | STRONG | FORCE | NONDUR] [-t]
JMSMQ5082 = Cleanup -client [-m sorkezel\u0151] -host hosztn\u00e9v [-port port] [-channel csatorna]
JMSMQ5083 =         -r interval [SAFE | STRONG | FORCE | NONDUR] [-t]
JMSMQ5084 = A tiszt\u00edt\u00e1s befejez\u0151d\u00f6tt
JMSMQ5085 = Kiv\u00e9tel a tiszt\u00edt\u00e1s sor\u00e1n:
JMSMQ5086 = Kapcsol\u00f3d\u00f3 kiv\u00e9tel:
JMSMQ5090 = SAFE, STRONG, FORCE vagy NONDUR valamelyik\u00e9t kell megadni
JMSMQ5091 = \u00dcgyf\u00e9lcsatlakoz\u00e1s haszn\u00e1latakor meg kell adni hosztnevet
JMSMQ5092 = Nem numerikus \u00e9rt\u00e9k k\u00f6veti ezt: ''{0}''
JMSMQ5093 = Nem felismerhet\u0151 param\u00e9ter: ''{0}''
JMSMQ5094 = V\u00e1rt param\u00e9ter a(z) ''{0}'' ut\u00e1n:
JMSMQ5095 = IVT meghi\u00fasult, tov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt ellen\u0151rizze az el\u0151z\u0151 hiba\u00fczenetet.

#MQJMS messages
JMSMQ0003 = A c\u00e9l nem ismert vagy m\u00e1r nem \u00e9rv\u00e9nyes.
JMSMQ0003.explanation = Elk\u00e9pzelhet\u0151, hogy a sor vagy t\u00e9mak\u00f6r m\u00e1r nem \u00e9rhet\u0151 el, az alkalmaz\u00e1s helytelen kapcsolatot haszn\u00e1l a sorhoz vagy t\u00e9mak\u00f6rh\u00f6z, illetve a megadott c\u00e9l nem a megfelel\u0151 t\u00edpus\u00fa a met\u00f3dushoz.
JMSMQ0003.useraction = Ellen\u0151rizze, hogy az IBM MQ m\u00e9g mindig fut-e \u00e9s a sorkezel\u0151 el\u00e9rhet\u0151-e. Ellen\u0151rizze, hogy a megfelel\u0151 kapcsolatot haszn\u00e1lja a sorhoz vagy t\u00e9mak\u00f6rh\u00f6z.
JMSMQ0003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException
JMSMQ0003.documentation = A ProviderDestination nem ismert vagy m\u00e1r nem \u00e9rv\u00e9nyes. \
<br> <b>Magyar\u00e1zat:</b> Elk\u00e9pzelhet\u0151, hogy a sor vagy t\u00e9mak\u00f6r m\u00e1r nem \u00e9rhet\u0151 el, az alkalmaz\u00e1s helytelen kapcsolatot haszn\u00e1l a sorhoz vagy t\u00e9mak\u00f6rh\u00f6z, illetve a megadott c\u00e9l nem a megfelel\u0151 t\u00edpus\u00fa a met\u00f3dushoz. \
<br> <b>Felhaszn\u00e1l\u00f3i v\u00e1lasz:</b> Ellen\u0151rizze, hogy az IBM MQ m\u00e9g fut \u00e9s hogy a sorkezel\u0151 el\u00e9rhet\u0151. \
Ellen\u0151rizze, hogy a megfelel\u0151 kapcsolatot haszn\u00e1lja a sorhoz vagy t\u00e9mak\u00f6rh\u00f6z.

JMSMQ1006 = Helytelen ''{0}'' \u00e9rt\u00e9k: ''{1}''.
JMSMQ1006.explanation = A tulajdons\u00e1gnak megadott \u00e9rt\u00e9k k\u00edv\u00fcl esik az \u00e9rv\u00e9nyes \u00e9rt\u00e9kek tartom\u00e1ny\u00e1n.
JMSMQ1006.useraction = Ellen\u0151rizze a megadott \u00e9rt\u00e9ket.
JMSMQ1006.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_VALUE
JMSMQ1006.documentation = A(z) {0}:{1} \u00e9rt\u00e9ke nem \u00e9rv\u00e9nyes. \
<br> <b>Magyar\u00e1zat:</b> A(z) {1} \u00e9rt\u00e9k a(z) {0} tulajdons\u00e1ghoz helytelen. \
<br> <b>Felhaszn\u00e1l\u00f3i v\u00e1lasz:</b> Ellen\u0151rizze a megadott \u00e9rt\u00e9ket. 

JMSMQ0012 = A verzi\u00f3sz\u00e1m nem m\u00f3dos\u00edthat\u00f3 a kapcsolati gy\u00e1r vagy c\u00e9l l\u00e9trehoz\u00e1sa ut\u00e1n.
JMSMQ0012.useraction = Adja meg a helyes verzi\u00f3sz\u00e1mot a kapcsolati gy\u00e1r vagy c\u00e9l l\u00e9trehoz\u00e1sakor.
JMSMQ0012.documentation = A verzi\u00f3sz\u00e1m nem m\u00f3dos\u00edthat\u00f3 a kapcsolati gy\u00e1r l\u00e9trehoz\u00e1sa ut\u00e1n.

JMSMQ1096 = Helytelen \u00fczenethivatkoz\u00e1s.
JMSMQ1096.explanation = Rossz form\u00e1tum\u00fa MessageReference ker\u00fclt \u00e1tad\u00e1sra a met\u00f3dusnak. Az \u00fczenethivatkoz\u00e1snak az MQMessageReference p\u00e9ld\u00e1ny\u00e1nak kell lennie.
JMSMQ1096.useraction = Gondoskodj\u00e9k r\u00f3la, hogy helyes \u00fczenethivatkoz\u00e1sok legyenek.
JMSMQ1096.documentation = \u00c9rv\u00e9nytelen \u00fczenethivatkoz\u00e1s.

JMSMQ1112 = Egy tartom\u00e1nyra jellemz\u0151 objektumon v\u00e9gzett m\u0171velet \u00e9rv\u00e9nytelen volt. A(z) ''{0}'' m\u0171velet nem \u00e9rv\u00e9nyes a(z) ''{1}'' t\u00edpushoz.
JMSMQ1112.explanation = Egy JMS alkalmaz\u00e1s megpr\u00f3b\u00e1lt m\u0171veletet v\u00e9grehajtani egy tartom\u00e1nyra jellemz\u0151 objektumon, de a m\u0171velet csak a m\u00e1sik \u00fczenetkezel\u00e9si tartom\u00e1nyban \u00e9rv\u00e9nyes.
JMSMQ1112.useraction = Gy\u0151z\u0151dj\u00f6n meg r\u00f3la, hogy az alkalmaz\u00e1s \u00e1ltal haszn\u00e1lt JMS objektumok \u00e9s m\u0171veletek \u00e9rintettek a sz\u00fcks\u00e9ges \u00fczenetkezel\u00e9si tartom\u00e1ny szempontj\u00e1b\u00f3l. Ha az alkalmaz\u00e1s mindk\u00e9t \u00fczenetkezel\u00e9si tartom\u00e1nyt haszn\u00e1lja, akkor fontolja meg a tartom\u00e1nyf\u00fcggetlen objektumok haszn\u00e1lat\u00e1t az alkalmaz\u00e1sban.
JMSMQ1112.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_TYPE
JMSMQ1112.documentation = Egy tartom\u00e1nyra jellemz\u0151 objektumon v\u00e9gzett m\u0171velet \u00e9rv\u00e9nytelen volt. \
<br> <b>Magyar\u00e1zat:</b> Egy JMS alkalmaz\u00e1s megpr\u00f3b\u00e1lt m\u0171veletet v\u00e9grehajtani egy tartom\u00e1nyra jellemz\u0151 objektumon, de a m\u0171velet csak a m\u00e1sik \u00fczenetkezel\u00e9si tartom\u00e1nyban \u00e9rv\u00e9nyes. \
<br> <b>Felhaszn\u00e1l\u00f3i v\u00e1lasz:</b> Gy\u0151z\u0151dj\u00f6n meg r\u00f3la, hogy az alkalmaz\u00e1s \u00e1ltal haszn\u00e1lt JMS objektumok \u00e9rintettek a sz\u00fcks\u00e9ges \u00fczenetkezel\u00e9si tartom\u00e1ny szempontj\u00e1b\u00f3l. \
Ha az alkalmaz\u00e1s mindk\u00e9t \u00fczenetkezel\u00e9si tartom\u00e1nyt haszn\u00e1lja, akkor fontolja meg a tartom\u00e1nyf\u00fcggetlen objektumok haszn\u00e1lat\u00e1t az alkalmaz\u00e1sban.

JMSMQ1113 = A c\u00e9lhoz nincs be\u00e1ll\u00edtva n\u00e9v.
JMSMQ1113.explanation = Olyan MQQueue vagy MQTopic haszn\u00e1lat\u00e1ra t\u00f6rt\u00e9nt k\u00eds\u00e9rlet, ami az alap\u00e9rtelmezett konstruktorral lett l\u00e9trehozva. A sor haszn\u00e1lata el\u0151tt be kellett volna \u00e1ll\u00edtani egy nevet.
JMSMQ1113.useraction = A l\u00e9trehoz\u00e1s ut\u00e1n \u00e1ll\u00edtson be nevet az MQQueue vagy MQTopic sz\u00e1m\u00e1ra.
JMSMQ1113.documentation = A c\u00e9lhoz nincs be\u00e1ll\u00edtva n\u00e9v. \
<br> <b>Magyar\u00e1zat:</b> Olyan MQQueue vagy MQTopic haszn\u00e1lat\u00e1ra t\u00f6rt\u00e9nt k\u00eds\u00e9rlet, ami az alap\u00e9rtelmezett konstruktorral lett l\u00e9trehozva; ezut\u00e1n be kellett volna \u00e1ll\u00edtani egy nevet a sor haszn\u00e1lata el\u0151tt. \
<br> <b>Felhaszn\u00e1l\u00f3i v\u00e1lasz:</b> A l\u00e9trehoz\u00e1s ut\u00e1n \u00e1ll\u00edtson be nevet az MQQueue vagy MQTopic sz\u00e1m\u00e1ra.

JMSMQ1114 = A(z) ''{0}'' met\u00f3dus egy bels\u0151 met\u00f3dus, \u00e9s nem szabad megh\u00edvni.
JMSMQ1114.explanation = Olyan met\u00f3dus haszn\u00e1lat\u00e1ra t\u00f6rt\u00e9nt k\u00eds\u00e9rlet, ami csak bels\u0151 haszn\u00e1latra van. A met\u00f3dus nem r\u00e9sze a k\u00f6zz\u00e9tett alkalmaz\u00e1sprogramoz\u00e1si fel\u00fcletnek, \u00e9s nem haszn\u00e1lhat\u00f3.
JMSMQ1114.useraction = T\u00e1vol\u00edtsa el a met\u00f3dus haszn\u00e1lat\u00e1t az alkalmaz\u00e1sb\u00f3l. Tov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt l\u00e9pjen kapcsolatba az IBM szervizzel.
JMSMQ1114.inserts = XMSC_INSERT_METHOD
JMSMQ1114.documentation = A megadott met\u00f3dus egy bels\u0151 met\u00f3dus, \u00e9s nem szabad megh\u00edvni. \
<br> <b>Magyar\u00e1zat:</b> Olyan met\u00f3dus haszn\u00e1lat\u00e1ra t\u00f6rt\u00e9nt k\u00eds\u00e9rlet, ami csak bels\u0151 haszn\u00e1latra van. \
A met\u00f3dus nem r\u00e9sze a k\u00f6zz\u00e9tett alkalmaz\u00e1sprogramoz\u00e1si fel\u00fcletnek, \u00e9s nem haszn\u00e1lhat\u00f3. \
<br> <b>Felhaszn\u00e1l\u00f3i v\u00e1lasz:</b> T\u00e1vol\u00edtsa el a met\u00f3dus haszn\u00e1lat\u00e1t az alkalmaz\u00e1sb\u00f3l. \
Tov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt l\u00e9pjen kapcsolatba az IBM szervizzel.

JMSMQ1115 = Nem tal\u00e1lhat\u00f3k \u00f6sszetev\u0151k.
JMSMQ1115.explanation = A Component Manager nem tal\u00e1lt \u00f6sszetev\u0151ket.
JMSMQ1115.useraction = Ellen\u0151rizze, hogy a telep\u00edt\u00e9s \u00e9s az oszt\u00e1ly\u00fatvonal be\u00e1ll\u00edt\u00e1sa helyes.
JMSMQ1115.documentation = Nem tal\u00e1lhat\u00f3k \u00f6sszetev\u0151k. \
<br> <b>Magyar\u00e1zat:</b> A Component Manager nem tal\u00e1lt \u00f6sszetev\u0151ket. \
<br> <b>Felhaszn\u00e1l\u00f3i v\u00e1lasz:</b> Ellen\u0151rizze, hogy a telep\u00edt\u00e9s \u00e9s az oszt\u00e1ly\u00fatvonal be\u00e1ll\u00edt\u00e1sa helyes.

JMSMQ1120 = A Takar\u00edt\u00e1s funkci\u00f3 nem t\u00e1mogatott a(z) ''{0}'' k\u00e9rt szolg\u00e1ltat\u00f3v\u00e1ltozaton.
JMSMQ1120.explanation = A takar\u00edt\u00e1s \u00e1ltal v\u00e9grehajtott m\u0171veletek a k\u00e9rt szolg\u00e1ltat\u00f3v\u00e1ltozat eset\u00e9n nem sz\u00fcks\u00e9gesek.
JMSMQ1120.useraction = Ellen\u0151rizze a megadott szolg\u00e1ltat\u00f3v\u00e1ltozat helyess\u00e9g\u00e9t.
JMSMQ1120.inserts = XMSC_WMQ_PROVIDER_VERSION
JMSMQ1120.documentation = A Takar\u00edt\u00e1s funkci\u00f3 nem t\u00e1mogatott a k\u00e9rt szolg\u00e1ltat\u00f3v\u00e1ltozaton. \
<br> <b>Magyar\u00e1zat</b> A takar\u00edt\u00e1s \u00e1ltal v\u00e9grehajtott m\u0171veletek a k\u00e9rt \
szolg\u00e1ltat\u00f3v\u00e1ltozat eset\u00e9n nem sz\u00fcks\u00e9gesek. <br> <b>Felhaszn\u00e1l\u00f3i \
v\u00e1lasz:</b> Ellen\u0151rizze a megadott szolg\u00e1ltat\u00f3v\u00e1ltozat helyess\u00e9g\u00e9t.

JMSMQ1121 = A ConnectionMetaData objektum a konstruktor haszn\u00e1lat\u00e1val ker\u00fclt l\u00e9trehoz\u00e1sra, nem pedig kapcsolatb\u00f3l lett beszerezve.
JMSMQ1121.explanation = A ConnectionMetaData objektumokat a kapcsolatb\u00f3l kell beszerezni, nem k\u00f6zvetlen\u00fcl l\u00e9trehozni. \
Emiatt elk\u00e9pzelhet\u0151, hogy a visszaadott v\u00e1ltozatinform\u00e1ci\u00f3k pontatlanok.
JMSMQ1121.useraction = Kapcsolatb\u00f3l szerezze be a ConnectionMetaData objektumot, vagy pedig a v\u00e1ltozat API seg\u00edts\u00e9g\u00e9vel szerezze be a statikus v\u00e1ltozatinform\u00e1ci\u00f3kat.

JMSMQ1122 = K\u00eds\u00e9rlet t\u00f6rt\u00e9nt egy olyan tulajdons\u00e1g be\u00e1ll\u00edt\u00e1s\u00e1ra vagy lek\u00e9rdez\u00e9s\u00e9re, amely \
elavult, m\u00e1r nem t\u00e1mogatott.
JMSMQ1122.explanation = A tulajdons\u00e1got a JMS \u00fcgyf\u00e9l m\u00e1r nem haszn\u00e1lja, \u00edgy az annak \
be\u00e1ll\u00edt\u00e1s\u00e1ra vagy lek\u00e9rdez\u00e9s\u00e9re haszn\u00e1lt met\u00f3dusokat m\u00e1r nem lehet megh\u00edvni.

JMSMQ1123 = A rendszer \u00fcgyf\u00e9ltelep\u00edt\u00e9st t\u00e9telez fel, mivel a JNI f\u00fcggv\u00e9nyt\u00e1r nem tal\u00e1lhat\u00f3 

