#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE
# %Z% %W% %I% %E% %U%

# Note to translators: the comments for the JMSMQxxxx.documentation properties in
# this file do NOT need to be translated, they are used at build time to create
# untranslated Javadoc documentation. 

#MQJMSIVT messages
JMSMQ0000 = El m\u00e9todo ''{0}'' se ha invocado en un momento no permitido o inadecuado o el proveedor no est\u00e1 en un estado adecuado para la operaci\u00f3n solicitada. 
JMSMQ0000.explanation = Generalmente el motivo de esta excepci\u00f3n es que no se han definido los almacenes de certificados SSL. \
''{0}'' identifica el m\u00e9todo que ha causado el problema.
JMSMQ0000.inserts = XMSC_INSERT_NAME

JMSMQ1046 = El juego de caracteres ''{0}'' no est\u00e1 soportado.
JMSMQ1046.documentation = El juego de caracteres {0} no est\u00e1 soportado. \
<br> <b>Explicaci\u00f3n:</b> Se ha intentado enviar o recibir un mensaje de correlaci\u00f3n, un mensaje de corriente de datos o un mensaje de texto cuyo \
cuerpo est\u00e1 codificado con un juego de caracteres que no est\u00e1 soportado por la JVM. \
En el caso de los mensajes de texto, esta excepci\u00f3n puede emitirse cuando el cuerpo del mensaje se consulta por primera vez, en vez de durante la recepci\u00f3n. \
<br> <b>Respuesta del usuario:</b> Cuando codifique un mensaje, utilice solamente un juego de caracteres que sepa que est\u00e1 disponible para la aplicaci\u00f3n receptora.

JMSMQ1002 = Servicio de mensajes de IBM MQ classes for Java(tm) 
JMSMQ3043 = Nivel no v\u00e1lido para repetir operaci\u00f3n de limpieza.
JMSMQ3043.documentation = El nivel para repetir la operaci\u00f3n de limpieza no es v\u00e1lido. \
<br> <b>Respuesta del usuario: </b> Establezca la propiedad cleanupLevel en un valor adecuado. 

JMSMQ5032 = Se est\u00e1 finalizando la conexi\u00f3n
JMSMQ5010 = Se est\u00e1 creando una conexi\u00f3n
JMSMQ5034 = Excepci\u00f3n
JMSMQ5021 = Anomal\u00eda al volver a obtener el mensaje
JMSMQ5002 = Se omite el distintivo -icf; no se ha suministrado ning\u00fan valor
JMSMQ5003 = Se omite el distintivo desconocido ''{0}''
JMSMQ5001 = Se omite el distintivo -url; no se ha suministrado ning\u00fan valor
JMSMQ5006 = \u00a1No se puede crear un contexto inicial! Compruebe los valores de JNDI
JMSMQ5035 = IVT finalizado
JMSMQ5000 = Prueba de verificaci\u00f3n de la instalaci\u00f3n
JMSMQ5033 = IVT ha finalizado correctamente
JMSMQ5017 = Se est\u00e1 creando un mensaje de texto
JMSMQ5024 = \u00a1Error! La serie de respuesta es distinta de la serie original
JMSMQ5023 = La serie de respuesta es igual que la serie original
JMSMQ5020 = El intento de volver a leer el mensaje ha resultado an\u00f3malo, aparentemente porque no se localiza
JMSMQ5019 = Se est\u00e1 volviendo a leer el mensaje
JMSMQ5022 = Mensaje obtenido
JMSMQ5027 = El mensaje de respuesta no era un mensaje de texto
JMSMQ5025 = Serie original
JMSMQ5026 = Serie de respuesta
JMSMQ5018 = Se est\u00e1 enviando el mensaje a ''{0}''
JMSMQ5028 = Se ha recuperado el tipo de mensaje incorrecto
JMSMQ5037 = No se ha podido encontrar el archivo jar o la clase ''{0}''. Esto puede ser debido a que no est\u00e1 presente en la v\u00eda de acceso de clases.
JMSMQ5038 = No se ha podido encontrar la clase ''{0}''. Esto puede deberse a que el proveedor JNDI no est\u00e1 presente en la v\u00eda de acceso de clases.
JMSMQ5036 = Se hace caso omiso de la opci\u00f3n ''{0}'', no se ha proporcionado ning\u00fan valor
JMSMQ5064 = El par\u00e1metro -port debe ser num\u00e9rico
JMSMQ5058 = excepci\u00f3n enlazada
JMSMQ5007 = Se est\u00e1 creando un QueueConnectionFactory
JMSMQ5009 = No se puede recuperar el objeto QCF de JNDI
JMSMQ5008 = Se est\u00e1 recuperando un QueueConnectionFactory de JNDI
JMSMQ5012 = Se est\u00e1 creando una cola
JMSMQ5014 = No se puede recuperar el objeto Q de JNDI
JMSMQ5013 = Se est\u00e1 recuperando una cola de JNDI
JMSMQ5029 = Se est\u00e1 cerrando el receptor de colas
JMSMQ5016 = Se est\u00e1 creando un receptor de colas
JMSMQ5030 = Se est\u00e1 cerrando el emisor de colas
JMSMQ5015 = Se est\u00e1 creando un emisor de colas
JMSMQ5031 = Se est\u00e1 cerrando la sesi\u00f3n
JMSMQ5011 = Se est\u00e1 creando una sesi\u00f3n
JMSMQ5004 = Debe especificar el par\u00e1metro -url URLproveedor
JMSMQ5065 = Uso:
JMSMQ5066 = IVTRun -url URLproveedor [-icf f\u00e1bricaContextoInicial] [-t]
JMSMQ5067 = IVTRun -nojndi [-m gestorColas] [-t] [-v versi\u00f3nProveedor]
JMSMQ5068 = IVTRun -nojndi -client -m gestorColas -host nombreHost [-port puerto] [-channel canal] [-ccsid ccsid] [-t] [-v versi\u00f3nProveedor]
JMSMQ5005 = Se est\u00e1n utilizando objetos administrados, aseg\u00farese de que est\u00e9n disponibles
JMSMQ5100 = Mensaje
JMSMQ5101 = Clase
JMSMQ5102 = Pila
JMSMQ5103 = Se debe a [{0}] --> Mensaje
JMSMQ5104 = C\u00f3digo de error
JMSMQ5105 = Explicaci\u00f3n
JMSMQ5106 = Acci\u00f3n del usuario
JMSMQ5107 = C\u00f3digo de terminaci\u00f3n
JMSMQ5108 = C\u00f3digo de raz\u00f3n
JMSMQ5109 = Mensaje del registro
JMSMQ5110 = Explicaci\u00f3n del registro
JMSMQ5111 = Gravedad del registro
JMSMQ5112 = Resumen del registro
JMSMQ5113 = Respuesta del usuario
JMSMQ5114 = Ejecutando {0} desde {1}
JMSMQ5115 = No se han podido establecer propiedades en la f\u00e1brica de conexiones de cola


#MQJMSPSIVT messages
JMSMQ5039 = Prueba de verificaci\u00f3n de la instalaci\u00f3n de Publish/Subscribe
JMSMQ5040 = Se est\u00e1 recuperando un TopicConnectionFactory de JNDI
JMSMQ5041 = No se ha podido recuperar el objeto TopicConnectionFactory de JNDI
JMSMQ5042 = Se est\u00e1 recuperando un Topic de JNDI
JMSMQ5043 = No se ha podido recuperar el objeto Topic de JNDI
JMSMQ5044 = Se est\u00e1 creando un TopicConnectionFactory
JMSMQ5045 = No se ha podido crear TopicConnectionFactory
JMSMQ5046 = Se est\u00e1 creando un Topic
JMSMQ5047 = No se ha podido crear un Topic utilizando m\u00e9todos no JNDI
JMSMQ5048 = Se est\u00e1 recuperando un TopicPublisher
JMSMQ5049 = Se est\u00e1 recuperando un TopicSubscriber
JMSMQ5050 = Se est\u00e1 a\u00f1adiendo texto
JMSMQ5051 = Se est\u00e1 publicando el mensaje a ''{0}''
JMSMQ5052 = Esperando a que llegue un mensaje [5 segundos m\u00e1ximo]...
JMSMQ5053 = *** Sin respuesta del intermediario. Aseg\u00farese de que se est\u00e9 ejecutando el intermediario. Si est\u00e1 utilizando el intermediario de IBM MQ, compruebe si brokerVersion tiene el valor V1 ***
JMSMQ5053.documentation = No hay respuesta del intermediario. \
<br> <b>Explicaci\u00f3n:</b> Las posibles causas son: <sl> <li>El intermediario no est\u00e1 ejecut\u00e1ndose. \
<li>Est\u00e1 utilizando BrokerVersion=V2 en TopicConnectionFactory con el intermediario de publicaci\u00f3n/suscripci\u00f3n de IBM MQ, lo que no se admite. \
<li>El intermediario ha rechazado la publicaci\u00f3n o suscripci\u00f3n y la ha colocado en la cola SYSTEM.DEAD.LETTER.QUEUE </sl> \
<br> <b>Respuesta del usuario:</b> Aseg\u00farese de que el intermediario est\u00e1 en ejecuci\u00f3n. \
Consulte el registro de sucesos del sistema para ver si hay mensajes de error del intermediario. \
Compruebe que el intermediario admite el valor de BrokerVersion que est\u00e1 utilizando. \
Consulte la cola SYSTEM.DEAD.LETTER.QUEUE para ver si hay mensajes rechazados.

JMSMQ5054 = El intermediario parece estar ejecut\u00e1ndose, pero el mensaje no ha llegado.
JMSMQ5054.documentation = El intermediario parece estar ejecut\u00e1ndose, pero el mensaje no ha llegado. \
<br> <b>Explicaci\u00f3n:</b> Este mensaje lo genera la prueba de verificaci\u00f3n de la instalaci\u00f3n cuando el suscriptor no recibe el mensaje publicado. \
<br> <b>Respuesta del usuario:</b> Compruebe que ha configurado el intermediario correctamente. \
Consulte los registros de sucesos del sistema para ver si hay mensajes de error del intermediario. \
Consulte la cola SYSTEM.DEAD.LETTER.QUEUE para ver si hay mensajes rechazados por el intermediario.

JMSMQ5055 = Ha fallado PSIVT
JMSMQ5056 = Cerrando TopicSubscriber
JMSMQ5057 = Cerrando TopicPublisher
JMSMQ5059 = Ha finalizado PSIVT
JMSMQ5060 = No se puede conectar con el gestor de colas.
JMSMQ5060.documentation = No se puede conectar con el gestor de colas. \
<br> <b>Explicaci\u00f3n:</b> Este mensaje lo genera la prueba de verificaci\u00f3n de la instalaci\u00f3n. \
<br> <b>Respuesta del usuario:</b> Compruebe que el gestor de colas est\u00e1 ejecut\u00e1ndose y que su nombre est\u00e1 especificado correctamente en los par\u00e1metros de IVTTest.

JMSMQ5061 = No se puede acceder a la cola de control del intermediario en el gestor de colas.
JMSMQ5061.documentation = No se puede acceder a la cola de control del intermediario en el gestor de colas. \
<br> <b>Respuesta del usuario:</b> Compruebe que la cola de control existe. \
El nombre predeterminado es SYSTEM.BROKER.CONTROL.QUEUE.

JMSMQ5062 = Aseg\u00farese de que el intermediario est\u00e9 instalado en este gestor de colas
JMSMQ5063 = Excepci\u00f3n en 'brokerIsRunning'
JMSMQ5069 = Uso:
JMSMQ5070 = PSIVTRun -url URLproveedor [-icf f\u00e1bricaContextoInicial] [-t]
JMSMQ5071 = PSIVTRun -nojndi [-m gestorColas] [-bqm intermediario] [-t] [-v versi\u00f3nProveedor]
JMSMQ5072 = PSIVTRun -nojndi -client -m gestorColas -host nombreHost [-port puerto] [-channel canal] [-bqm intermediario] [-ccsid ccsid] [-t] [-v versi\u00f3nProveedor]
JMSMQ5073 = Se est\u00e1 creando una sesi\u00f3n s\u00edncrona
JMSMQ5074 = Se est\u00e1 creando una sesi\u00f3n as\u00edncrona
JMSMQ5075 = Iniciando conexi\u00f3n
JMSMQ5076 = Escucha de mensajes activado
JMSMQ5077 = Escucha de mensajes establecido
JMSMQ5078 = El host, el puerto o el canal no se pueden establecer sin que se establezca la conexi\u00f3n de cliente
JMSMQ5079 = Programa de utilidad de limpieza de Publish/Subscribe
JMSMQ5080 = Uso:
JMSMQ5081 = Cleanup [-m gestorColas] [-r intervalo] [SAFE | STRONG | FORCE | NONDUR] [-t]
JMSMQ5082 = Cleanup -client [-m gestorColas] -host nombreHost [-port puerto] [-channel canal]
JMSMQ5083 =         -r intervalo [SAFE | STRONG | FORCE | NONDUR] [-t]
JMSMQ5084 = Limpieza finalizada
JMSMQ5085 = Excepci\u00f3n durante la operaci\u00f3n de limpieza:
JMSMQ5086 = Excepci\u00f3n enlazada:
JMSMQ5090 = Se debe especificar una de las opciones SAFE, STRONG, FORCE o NONDUR
JMSMQ5091 = Se debe especificar el nombre de host cuando se establece la conexi\u00f3n de cliente
JMSMQ5092 = Valor no num\u00e9rico despu\u00e9s de ''{0}''
JMSMQ5093 = Par\u00e1metro no reconocible ''{0}''
JMSMQ5094 = Argumento esperado despu\u00e9s de ''{0}''
JMSMQ5095 = IVT ha fallado, para obtener m\u00e1s informaci\u00f3n compruebe el mensaje de error anterior.

#MQJMS messages
JMSMQ0003 = El destino no es conocido o ya no es v\u00e1lido.
JMSMQ0003.explanation = La cola o tema puede haber quedado no disponible, la aplicaci\u00f3n puede estar utilizando una conexi\u00f3n incorrecta para la cola o tema, o el destino proporcionado no es del tipo correcto para este m\u00e9todo.
JMSMQ0003.useraction = Compruebe que IBM MQ sigue ejecut\u00e1ndose y que el gestor de colas est\u00e1 disponible. Compruebe que se est\u00e1 utilizando la conexi\u00f3n correcta para la cola o tema.
JMSMQ0003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException
JMSMQ0003.documentation = ProviderDestination no es conocido o ya no es v\u00e1lido. \
<br> <b>Explicaci\u00f3n:</b> La cola o tema puede haber quedado no disponible, la aplicaci\u00f3n puede estar utilizando una conexi\u00f3n incorrecta para la cola o tema, o el destino proporcionado no es del tipo correcto para este m\u00e9todo. \
<br> <b>Respuesta del usuario:</b> Compruebe que IBM MQ sigue ejecut\u00e1ndose y que el gestor de colas est\u00e1 disponible. \
Compruebe que se est\u00e1 utilizando la conexi\u00f3n correcta para la cola o tema.

JMSMQ1006 = Valor incorrecto para ''{0}'': ''{1}''.
JMSMQ1006.explanation = El valor proporcionado para la propiedad est\u00e1 fuera del rango de valores v\u00e1lidos.
JMSMQ1006.useraction = Compruebe el valor que se ha proporcionado
JMSMQ1006.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_VALUE
JMSMQ1006.documentation = El valor para {0}:{1} no es v\u00e1lido. \
<br> <b>Explicaci\u00f3n: </b> El valor {1} para la propiedad {0} no es correcto. \
<br> <b>Respuesta del usuario: </b> Compruebe el valor que se ha proporcionado. 

JMSMQ0012 = La versi\u00f3n no se puede cambiar una vez que se ha creado la f\u00e1brica de conexiones o el destino.
JMSMQ0012.useraction = Especifique la versi\u00f3n correcta al crear la f\u00e1brica de conexiones o el destino.
JMSMQ0012.documentation = La versi\u00f3n no se puede cambiar una vez que se ha creado la f\u00e1brica de conexiones.

JMSMQ1096 = Referencia de mensaje incorrecta
JMSMQ1096.explanation = Se ha pasado una MessageReference formada incorrectamente a este m\u00e9todo. La referencia de mensaje debe ser una instancia de MQMessageReference.
JMSMQ1096.useraction = Aseg\u00farese de que se est\u00e1n utilizando MessageReferences correctas.
JMSMQ1096.documentation = Referencia de mensaje no v\u00e1lida.

JMSMQ1112 = La operaci\u00f3n para un objeto espec\u00edfico del dominio no era v\u00e1lida. La operaci\u00f3n ''{0}'' no es v\u00e1lida para el tipo ''{1}''.
JMSMQ1112.explanation = Una aplicaci\u00f3n JMS ha intentado realizar una operaci\u00f3n en un objeto espec\u00edfico del dominio pero la operaci\u00f3n s\u00f3lo es v\u00e1lida para el otro dominio de mensajer\u00eda.
JMSMQ1112.useraction = Aseg\u00farese de que los objetos y las operaciones JMS utilizados por su aplicaci\u00f3n son apropiados para el dominio de mensajer\u00eda requerido. Si su aplicaci\u00f3n utiliza ambos dominios de mensajer\u00eda, considere la posibilidad de utilizar objetos independientes del dominio en toda la aplicaci\u00f3n.
JMSMQ1112.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_TYPE
JMSMQ1112.documentation = Una operaci\u00f3n para un objeto espec\u00edfico del dominio no era v\u00e1lida. \
<br> <b>Explicaci\u00f3n:</b> Una aplicaci\u00f3n JMS ha intentado realizar una operaci\u00f3n en un objeto espec\u00edfico del dominio pero la operaci\u00f3n s\u00f3lo es v\u00e1lida para el otro dominio de mensajer\u00eda. \
<br> <b>Respuesta del usuario:</b> Aseg\u00farese de que los objetos JMS utilizados por su aplicaci\u00f3n son apropiados para el dominio de mensajer\u00eda requerido. \
Si su aplicaci\u00f3n utiliza ambos dominios de mensajer\u00eda, considere la posibilidad de utilizar objetos independientes del dominio en toda la aplicaci\u00f3n.

JMSMQ1113 = El destino no tiene un nombre establecido.
JMSMQ1113.explanation = Se ha intentado utilizar un MQQueue o MQTopic que se cre\u00f3 con el constructor predeterminado. Luego deber\u00eda haberse establecido un nombre antes de utilizar la cola.
JMSMQ1113.useraction = Despu\u00e9s de la creaci\u00f3n, establezca un nombre en el MQQueue o MQTopic.
JMSMQ1113.documentation = El destino no tiene un nombre establecido. \
<br> <b>Explicaci\u00f3n:</b> Se ha intentado utilizar un MQQueue o MQTopic que se cre\u00f3 con el constructor predeterminado; luego deber\u00eda haberse establecido un nombre antes de utilizar la cola. \
<br> <b>Respuesta del usuario:</b> Despu\u00e9s de la creaci\u00f3n, establezca un nombre en el MQQueue o MQTopic.

JMSMQ1114 = El m\u00e9todo ''{0}'' es un m\u00e9todo interno y no debe invocarse.
JMSMQ1114.explanation = Se ha intentado utilizar un m\u00e9todo que es s\u00f3lo para uso interno. Este m\u00e9todo no forma parte de la API publicada y no debe utilizarse.
JMSMQ1114.useraction = Elimine el uso de este m\u00e9todo de la aplicaci\u00f3n. P\u00f3ngase en contacto con el servicio t\u00e9cnico de IBM para obtener m\u00e1s informaci\u00f3n.
JMSMQ1114.inserts = XMSC_INSERT_METHOD
JMSMQ1114.documentation = El m\u00e9todo especificado es un m\u00e9todo interno y no debe invocarse. \
<br> <b>Explicaci\u00f3n:</b> Se ha intentado utilizar un m\u00e9todo que es s\u00f3lo para uso interno. \
Este m\u00e9todo no forma parte de la API publicada y no debe utilizarse. \
<br> <b>Respuesta del usuario:</b> Elimine el uso de este m\u00e9todo de la aplicaci\u00f3n. \
P\u00f3ngase en contacto con el servicio t\u00e9cnico de IBM para obtener m\u00e1s informaci\u00f3n.

JMSMQ1115 = No se han encontrado componentes.
JMSMQ1115.explanation = El Gestor de componentes no ha localizado ning\u00fan componente.
JMSMQ1115.useraction = Compruebe que la configuraci\u00f3n de la instalaci\u00f3n y de la v\u00eda de acceso de clases es correcta.
JMSMQ1115.documentation = No se han encontrado componentes. \
<br> <b>Explicaci\u00f3n:</b> El Gestor de componentes no ha localizado ning\u00fan componente. \
<br> <b>Respuesta del usuario:</b> Compruebe que la configuraci\u00f3n de la instalaci\u00f3n y de la v\u00eda de acceso de clases es correcta.

JMSMQ1120 = La funci\u00f3n de limpieza no est\u00e1 soportada en la versi\u00f3n de proveedor solicitada ''{0}''.
JMSMQ1120.explanation = Las operaciones realizadas por la limpieza no se requieren para la versi\u00f3n de proveedor solicitada.
JMSMQ1120.useraction = Aseg\u00farese de que la versi\u00f3n de proveedor proporcionada sea correcta.
JMSMQ1120.inserts = XMSC_WMQ_PROVIDER_VERSION
JMSMQ1120.documentation = La funci\u00f3n de limpieza no est\u00e1 soportada en la versi\u00f3n de proveedor solicitada. \
<br> <b>Explicaci\u00f3n:</b> Las operaciones realizadas por la limpieza no se requieren para la versi\u00f3n de proveedor solicitada <br> <b>Respuesta de usuario:</b> Aseg\u00farese de que la versi\u00f3n de proveedor proporcionada sea correcta.

JMSMQ1121 = Se ha creado un objeto ConnectionMetaData utilizando el constructor en lugar de obtenerlo de una conexi\u00f3n.
JMSMQ1121.explanation = Los objetos ConnectionMetaData deben obtenerse de la conexi\u00f3n, no deben crearse directamente. \
Por tanto, la informaci\u00f3n de versi\u00f3n que se ha devuelto es posible que no sea correcta.
JMSMQ1121.useraction = Obtenga ConnectionMetaData de una conexi\u00f3n o utilice la API de versi\u00f3n para obtener informaci\u00f3n de versi\u00f3n est\u00e1tica.

JMSMQ1122 = Se ha intentado establecer o consultar una propiedad que ha quedado en desuso y ya no est\u00e1 soportada.
JMSMQ1122.explanation = El cliente JMS ya no utiliza la propiedad, por lo que ya no deben invocarse los m\u00e9todos para establecerla o consultarla. 
JMSMQ1123 = Se supone que la instalaci\u00f3n de cliente como biblioteca JNI no ubicada

