#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE
# %Z% %W% %I% %E% %U%

# Note to translators: the comments for the JMSMQxxxx.documentation properties in
# this file do NOT need to be translated, they are used at build time to create
# untranslated Javadoc documentation. 

#MQJMSIVT messages
JMSMQ0000 = La m\u00e9thode ''{0}'' a \u00e9t\u00e9 appel\u00e9e \u00e0 un moment interdit ou inappropri\u00e9, ou le fournisseur ne se trouve pas dans l''\u00e9tat appropri\u00e9 pour l''op\u00e9ration demand\u00e9e. 
JMSMQ0000.explanation = La cause normale de cette exception est que les espaces de stockage des certificats SSL n''ont pas \u00e9t\u00e9 d\u00e9finis. \
''{0}'' identifie la m\u00e9thode qui a engendr\u00e9 l''incident.
JMSMQ0000.inserts = XMSC_INSERT_NAME

JMSMQ1046 = Le jeu de caract\u00e8res ''{0}'' n''est pas pris en charge.
JMSMQ1046.documentation = Le jeu de caract\u00e8res {0} n''est pas pris en charge. \
<br> <b>Explication :</b> Tentative d''envoi ou de r\u00e9ception d''un message de mappe, d''un message de flux ou d''un message de texte dont le corps est cod\u00e9 \u00e0 l''aide d''un jeu de caract\u00e8res non pris en charge par la machine JVM. \
Dans le cas des messages de texte, cette exception peut \u00eatre g\u00e9n\u00e9r\u00e9e lorsque le corps du message est interrog\u00e9 pour la premi\u00e8re fois et non lors de la r\u00e9ception. \
<br> <b>R\u00e9ponse utilisateur :</b> Ne codez un message qu''\u00e0 l''aide d''un jeu de caract\u00e8res accessible par l''application destinatrice.

JMSMQ1002 = IBM MQ classes for Java(tm) Message Service 
JMSMQ3043 = Niveau non valide pour la r\u00e9p\u00e9tition du nettoyage.
JMSMQ3043.documentation = Le niveau de r\u00e9p\u00e9tition du nettoyage n'est pas valide. \
<br> <b>R\u00e9ponse utilisateur : </b> Affectez \u00e0 la propri\u00e9t\u00e9 cleanupLevel une valeur appropri\u00e9e. 

JMSMQ5032 = Fermeture de connexion
JMSMQ5010 = Cr\u00e9ation d'une connexion.
JMSMQ5034 = Exception intercept\u00e9e
JMSMQ5021 = Impossible d'obtenir le message de nouveau.
JMSMQ5002 = Option -icf ignor\u00e9e ; aucune valeur fournie.
JMSMQ5003 = Option inconnue ''{0}'' ignor\u00e9e
JMSMQ5001 = Option -url ignor\u00e9e ; aucune valeur fournie.
JMSMQ5006 = Impossible de cr\u00e9er InitialContext. V\u00e9rifiez vos r\u00e9glages JNDI.
JMSMQ5035 = Le test IVT est termin\u00e9
JMSMQ5000 = Test de v\u00e9rification de l'installation
JMSMQ5033 = Le test IVT a abouti
JMSMQ5017 = Cr\u00e9ation de TextMessage.
JMSMQ5024 = Erreur. La cha\u00eene de r\u00e9ponse est diff\u00e9rente de la cha\u00eene d'origine.
JMSMQ5023 = La cha\u00eene de r\u00e9ponse est identique \u00e0 celle d'origine.
JMSMQ5020 = La tentative de relecture du message a \u00e9chou\u00e9, apparemment parce qu'il \u00e9tait absent.
JMSMQ5019 = Relecture du message
JMSMQ5022 = Message obtenu
JMSMQ5027 = Le message de r\u00e9ponse n'\u00e9tait pas de type TextMessage.
JMSMQ5025 = Cha\u00eene d'origine
JMSMQ5026 = Cha\u00eene de r\u00e9ponse
JMSMQ5018 = Envoi du message \u00e0 ''{0}''
JMSMQ5028 = Le type du message extrait est incorrect
JMSMQ5037 = Le fichier jar de la classe ''{0}'' est introuvable. Il ne se trouve peut-\u00eatre pas dans votre chemin d''acc\u00e8s aux classes.
JMSMQ5038 = La classe ''{0}'' est introuvable. Il se peut que le fournisseur jndi ne se trouve pas dans votre chemin d''acc\u00e8s aux classes.
JMSMQ5036 = Option ''{0}'' ignor\u00e9e ; aucune valeur fournie.
JMSMQ5064 = Le param\u00e8tre -port doit \u00eatre num\u00e9rique
JMSMQ5058 = Exceptions li\u00e9es.
JMSMQ5007 = Cr\u00e9ation de QueueConnectionFactory.
JMSMQ5009 = Impossible d'extraire l'objet QCF depuis JNDI.
JMSMQ5008 = Extraction de QueueConnectionFactory depuis JNDI.
JMSMQ5012 = Cr\u00e9ation d'une file d'attente
JMSMQ5014 = Impossible d'extraire l'objet Q depuis JNDI.
JMSMQ5013 = Extraction de Q depuis JNDI.
JMSMQ5029 = Fermeture de QueueReceiver
JMSMQ5016 = Cr\u00e9ation de QueueReceiver.
JMSMQ5030 = Fermeture de QueueSender
JMSMQ5015 = Cr\u00e9ation de QueueSender.
JMSMQ5031 = Fermeture de session
JMSMQ5011 = Cr\u00e9ation d'une session.
JMSMQ5004 = Vous devez indiquer le param\u00e8tre -url URL_fournisseur.
JMSMQ5065 = Syntaxe :
JMSMQ5066 = IVTRun -url URL_fournisseur [-icf fabrique_contexte_initial] [-t]
JMSMQ5067 = IVTRun -nojndi [-m gest_files_attente] [-t] [-v version_fournisseur]
JMSMQ5068 = IVTRun -nojndi -client -m gest_files_attente -host nom_h\u00f4te [-port port] [-channel canal] [-ccsid ccsid] [-t] [-v \
version_fournisseur]
JMSMQ5005 = Utilisation d'objets g\u00e9r\u00e9s, assurez-vous qu'ils sont disponibles.
JMSMQ5100 = Message
JMSMQ5101 = Classe
JMSMQ5102 = Pile
JMSMQ5103 = Provoqu\u00e9 par [{0}] --> Message
JMSMQ5104 = Code d'erreur
JMSMQ5105 = Explication
JMSMQ5106 = Intervention de l'utilisateur
JMSMQ5107 = Code ach\u00e8vement
JMSMQ5108 = Code anomalie
JMSMQ5109 = Message du journal
JMSMQ5110 = Explication du journal
JMSMQ5111 = Gravit\u00e9 du journal
JMSMQ5112 = R\u00e9capitulatif du journal
JMSMQ5113 = R\u00e9ponse utilisateur
JMSMQ5114 = Ex\u00e9cution de {0} \u00e0 partir de {1}
JMSMQ5115 = Impossible de d\u00e9finir les propri\u00e9t\u00e9s sur la fabrique de connexions de file d'attente


#MQJMSPSIVT messages
JMSMQ5039 = Test de v\u00e9rification de l'installation  de la publication/abonnement.
JMSMQ5040 = Extraction de l'objet TopicConnectionFactory depuis JNDI.
JMSMQ5041 = Impossible d'extraire l'objet TopicConnectionFactory depuis JNDI.
JMSMQ5042 = Extraction d'un objet Topic depuis JNDI.
JMSMQ5043 = Impossible d'extraire l'objet Topic depuis JNDI.
JMSMQ5044 = Cr\u00e9ation d'un objet TopicConnectionFactory.
JMSMQ5045 = Impossible de cr\u00e9er l'objet TopicConnectionFactory.
JMSMQ5046 = Cr\u00e9ation d'un objet Topic.
JMSMQ5047 = Impossible de cr\u00e9er un objet Topic sans utiliser JNDI.
JMSMQ5048 = Cr\u00e9ation d'un objet TopicPublisher.
JMSMQ5049 = Cr\u00e9ation d'un objet TopicSubscriber.
JMSMQ5050 = Ajout de texte.
JMSMQ5051 = Publication du message pour ''{0}''
JMSMQ5052 = Attente de l'arriv\u00e9e d'un message [5 secondes max]...
JMSMQ5053 = *** Aucune r\u00e9ponse du courtier. V\u00e9rifiez que le courtier est actif. Si vous utilisez le courtier IBM MQ, v\u00e9rifiez que la version du courtier est V1. ***
JMSMQ5053.documentation = Aucune r\u00e9ponse du courtier. \
<br> <b>Explication :</b> Les motifs possibles sont les suivants : <sl> <li>Le courtier n'est pas actif. \
<li>Vous utilisez BrokerVersion=V2 dans votre fabrique de connexions de rubriques avec le courtier de publication/abonnement du produit IBM MQ, qui ne prend pas en charge cette valeur. \
<li>Le courtier a rejet\u00e9 la publication ou l'abonnement et l'a plac\u00e9 dans SYSTEM.DEAD.LETTER.QUEUE </sl> <br> <b>R\u00e9ponse utilisateur :</b> V\u00e9rifiez que votre courtier est actif. \
V\u00e9rifiez si le journal des \u00e9v\u00e9nements syst\u00e8me contient des messages d'erreur du courtier. \
V\u00e9rifiez que le courtier prend en charge la version de courtier que vous utilisez. \
V\u00e9rifiez si SYSTEM.DEAD.LETTER.QUEUE contient des messages rejet\u00e9s.

JMSMQ5054 = Le courtier semble actif, mais le message n'est pas arriv\u00e9.
JMSMQ5054.documentation = Le courtier semble actif, mais le message n'est pas arriv\u00e9. \
<br> <b>Explication :</b> G\u00e9n\u00e9r\u00e9 par le test de v\u00e9rification de l'installation lorsque l'abonn\u00e9 ne re\u00e7oit pas le message publi\u00e9. \
<br> <b>R\u00e9ponse utilisateur :</b> V\u00e9rifiez que vous avez bien configur\u00e9 le courtier correctement. \
V\u00e9rifiez si les journaux des \u00e9v\u00e9nements syst\u00e8me contiennent des messages d'erreur du courtier. \
V\u00e9rifiez si SYSTEM.DEAD.LETTER.QUEUE contient des messages rejet\u00e9s par le courtier.

JMSMQ5055 = Echec de PSIVT.
JMSMQ5056 = Fermeture de TopicSubscriber.
JMSMQ5057 = Fermeture de TopicPublisher.
JMSMQ5059 = Fin du PSIVT.
JMSMQ5060 = Impossible de se connecter au gestionnaire de files d'attente.
JMSMQ5060.documentation = Impossible de se connecter au gestionnaire de files d'attente. \
<br> <b>Explication :</b> G\u00e9n\u00e9r\u00e9 par le test de v\u00e9rification de l'installation. \
<br> <b>R\u00e9ponse utilisateur :</b> V\u00e9rifiez que le gestionnaire de files d'attente est actif et que son nom est correctement sp\u00e9cifi\u00e9 dans les param\u00e8tres IVTTest.

JMSMQ5061 = Impossible d'acc\u00e9der \u00e0 la file de contr\u00f4le du courtier dans le gestionnaire de files d'attente.
JMSMQ5061.documentation = Impossible d'acc\u00e9der \u00e0 la file de contr\u00f4le du courtier dans le gestionnaire de files d'attente. \
<br> <b>R\u00e9ponse utilisateur :</b> V\u00e9rifiez que la file de contr\u00f4le existe. \
Son nom par d\u00e9faut est SYSTEM.BROKER.CONTROL.QUEUE.

JMSMQ5062 = V\u00e9rifiez que le courtier est install\u00e9 dans ce gestionnaire de files d'attente.
JMSMQ5063 = Exception dans 'brokerIsRunning'
JMSMQ5069 = Syntaxe :
JMSMQ5070 = PSIVTRun -url URL_fournisseur [-icf fabrique_contexte_initial] [-t]
JMSMQ5071 = PSIVTRun -nojndi [-m gest_files_attente] [-bqm courtier] [-t] [-v version_fournisseur]
JMSMQ5072 = PSIVTRun -nojndi -client -m gest_files_attente -host nom_h\u00f4te [-port port] [-channel canal] [-bqm courtier] [-ccsid ccsid] \
[-t] [-v version_fournisseur]
JMSMQ5073 = Cr\u00e9ation d'une session synchrone
JMSMQ5074 = Cr\u00e9ation d'une session asynchrone
JMSMQ5075 = Lancement de la connexion
JMSMQ5076 = Programme d'\u00e9coute des messages d\u00e9clench\u00e9
JMSMQ5077 = Programme d'\u00e9coute des messages d\u00e9fini
JMSMQ5078 = Impossible de d\u00e9finir l'h\u00f4te, le port ou le canal sans connexion client
JMSMQ5079 = Utilitaire de nettoyage publication/abonnement
JMSMQ5080 = Syntaxe :
JMSMQ5081 = Cleanup [-m gest_files_attente] [-r intervalle] [SAFE | STRONG | FORCE | NONDUR] [-t]
JMSMQ5082 = Cleanup -client [-m gest_files_attente] -host nom_h\u00f4te [-port port] [-channel canal]
JMSMQ5083 =         -r intervalle [SAFE | STRONG | FORCE | NONDUR] [-t]
JMSMQ5084 = Nettoyage termin\u00e9
JMSMQ5085 = Exception lors du nettoyage :
JMSMQ5086 = Exception associ\u00e9e :
JMSMQ5090 = Niveau SAFE, STRONG, FORCE ou NONDUR \u00e0 indiquer
JMSMQ5091 = Nom h\u00f4te \u00e0 indiquer lors de l'utilisation de la connexion client
JMSMQ5092 = Valeur non num\u00e9rique suivant ''{0}''
JMSMQ5093 = Param\u00e8tre ''{0}'' non reconnu
JMSMQ5094 = Argument attendu apr\u00e8s ''{0}''
JMSMQ5095 = IVT a \u00e9chou\u00e9. Pour plus d'informations, reportez-vous au message d'erreur pr\u00e9c\u00e9dent.

#MQJMS messages
JMSMQ0003 = La destination n'est pas reconnue ou elle n'est plus valide.
JMSMQ0003.explanation = La file d'attente ou la rubrique n'est peut-\u00eatre plus disponible, l'application utilise peut-\u00eatre une connexion incorrecte pour la file d'attente ou la rubrique ou le type de la destination fournie n'est pas correct pour cette m\u00e9thode.
JMSMQ0003.useraction = V\u00e9rifiez que IBM MQ est toujours actif et que le gestionnaire de files d'attente est disponible. V\u00e9rifiez que la connexion appropri\u00e9e est utilis\u00e9e pour votre file d'attente ou votre rubrique.
JMSMQ0003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException
JMSMQ0003.documentation = La destination du fournisseur n'est pas reconnue ou elle n'est plus valide. \
<br> <b>Explication :</b> La file d'attente ou la rubrique n'est peut-\u00eatre plus disponible, l'application utilise peut-\u00eatre une connexion incorrecte pour la file d'attente ou la rubrique ou le type de la destination fournie n'est pas correct pour cette m\u00e9thode. \
<br> <b>R\u00e9ponse utilisateur :</b> v\u00e9rifiez que IBM MQ est toujours actif et que le gestionnaire de files d'attente est disponible. \
V\u00e9rifiez que la connexion appropri\u00e9e est utilis\u00e9e pour votre file d'attente ou votre rubrique.

JMSMQ1006 = Valeur incorrecte pour ''{0}'' : ''{1}''.
JMSMQ1006.explanation = La valeur indiqu\u00e9e pour la propri\u00e9t\u00e9 se trouve en dehors de sa plage de valeurs valides.
JMSMQ1006.useraction = V\u00e9rifiez la valeur fournie
JMSMQ1006.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_VALUE
JMSMQ1006.documentation = La valeur de {0} : {1} n''est pas valide. \
<br> <b>Explication : </b> La valeur {1} de la propri\u00e9t\u00e9 {0} n''est pas correcte. \
<br> <b>R\u00e9ponse utilisateur : </b> V\u00e9rifiez la valeur fournie. 

JMSMQ0012 = La version ne peut pas \u00eatre modifi\u00e9e une fois que la fabrique de connexions ou la destination a \u00e9t\u00e9 cr\u00e9\u00e9e.
JMSMQ0012.useraction = Sp\u00e9cifiez la version correcte lorsque vous cr\u00e9ez la fabrique de connexions ou la destination.
JMSMQ0012.documentation = La version ne peut pas \u00eatre modifi\u00e9e une fois que la fabrique de connexions a \u00e9t\u00e9 cr\u00e9\u00e9e.

JMSMQ1096 = R\u00e9f\u00e9rence de message incorrecte.
JMSMQ1096.explanation = Une r\u00e9f\u00e9rence de message dont la syntaxe est incorrecte a \u00e9t\u00e9 transmise \u00e0 cette m\u00e9thode. La r\u00e9f\u00e9rence de message doit \u00eatre une instance de MQMessageReference.
JMSMQ1096.useraction = Assurez-vous que les r\u00e9f\u00e9rences de message utilis\u00e9es sont correctes.
JMSMQ1096.documentation = R\u00e9f\u00e9rence de message non valide.

JMSMQ1112 = L''op\u00e9ration pour un objet sp\u00e9cifique \u00e0 un domaine n''\u00e9tait pas valide. L''op\u00e9ration ''{0}'' n''est pas valide pour le type ''{1}''.
JMSMQ1112.explanation = Une application JMS a essay\u00e9 d'effectuer une op\u00e9ration sur un objet sp\u00e9cifique \u00e0 un domaine, mais cette op\u00e9ration n'est valide que pour l'autre domaine de messagerie.
JMSMQ1112.useraction = V\u00e9rifiez que les op\u00e9rations et les objets JMS utilis\u00e9s par votre application sont appropri\u00e9es pour le domaine de messagerie requis. Si votre application utilise les deux domaines de messagerie, il est conseill\u00e9 d'utiliser des objets ind\u00e9pendants du domaine dans l'application.
JMSMQ1112.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_TYPE
JMSMQ1112.documentation = L'op\u00e9ration pour un objet sp\u00e9cifique \u00e0 un domaine n'\u00e9tait pas valide. \
<br> <b>Explication :</b> Une application JMS a essay\u00e9 d'effectuer une op\u00e9ration sur un objet sp\u00e9cifique \u00e0 un domaine, mais cette op\u00e9ration n'est valide que pour l'autre domaine de messagerie. \
<br> <b>R\u00e9ponse utilisateur :</b> V\u00e9rifiez que les objets JMS utilis\u00e9s par votre application sont appropri\u00e9es pour le domaine de messagerie requis. \
Si votre application utilise les deux domaines de messagerie, il est conseill\u00e9 d'utiliser des objets ind\u00e9pendants du domaine dans l'application.

JMSMQ1113 = Aucun nom n'est d\u00e9fini pour la destination.
JMSMQ1113.explanation = Tentative d'utilisation d'une file d'attente ou d'une rubrique MQ cr\u00e9\u00e9e \u00e0 l'aide du constructeur par d\u00e9faut. Un nom doit avoir \u00e9t\u00e9 d\u00e9fini pour que la file d'attente puisse \u00eatre utilis\u00e9e.
JMSMQ1113.useraction = Apr\u00e8s la cr\u00e9ation, d\u00e9finissez un nom dans la file d'attente ou la rubrique MQ.
JMSMQ1113.documentation = Aucun nom n'est d\u00e9fini pour la destination. \
<br> <b>Explication :</b> Tentative d'utilisation d'une file d'attente ou d'une rubrique MQ cr\u00e9\u00e9e \u00e0 l'aide du constructeur par d\u00e9faut ; un nom aurait d\u00fb \u00eatre d\u00e9fini avant que la file d'attente ne soit utilis\u00e9e. \
<br> <b>R\u00e9ponse utilisateur :</b> Apr\u00e8s la cr\u00e9ation, d\u00e9finissez un nom dans la file d'attente ou la rubrique MQ.

JMSMQ1114 = La m\u00e9thode ''{0}'' correspond \u00e0 une m\u00e9thode interne et ne doit pas \u00eatre appel\u00e9e.
JMSMQ1114.explanation = Tentative d'utilisation d'une m\u00e9thode \u00e0 usage interne uniquement. Cette m\u00e9thode ne fait pas partie de l'API publi\u00e9e et ne doit pas \u00eatre utilis\u00e9e.
JMSMQ1114.useraction = Supprimez l'utilisation de cette m\u00e9thode dans l'application. Pour plus d'informations, adressez-vous au service d'assistance IBM.
JMSMQ1114.inserts = XMSC_INSERT_METHOD
JMSMQ1114.documentation = La m\u00e9thode sp\u00e9cifi\u00e9e correspond \u00e0 une m\u00e9thode interne et ne doit pas \u00eatre appel\u00e9e. \
<br> <b>Explication :</b> Tentative d'utilisation d'une m\u00e9thode \u00e0 usage interne uniquement. \
Cette m\u00e9thode ne fait pas partie de l'API publi\u00e9e et ne doit pas \u00eatre utilis\u00e9e. \
<br> <b>R\u00e9ponse utilisateur :</b> Supprimez l'utilisation de cette m\u00e9thode dans l'application. \
Pour plus d'informations, adressez-vous au service d'assistance IBM.

JMSMQ1115 = Aucun composant d\u00e9tect\u00e9.
JMSMQ1115.explanation = Aucun composant n'a \u00e9t\u00e9 d\u00e9tect\u00e9 par le gestionnaire de composants.
JMSMQ1115.useraction = V\u00e9rifiez que l'installation et la configuration du chemin d'acc\u00e8s aux classes sont corrects.
JMSMQ1115.documentation = Aucun composant d\u00e9tect\u00e9. \
<br> <b>Explication :</b> Aucun composant n'a \u00e9t\u00e9 d\u00e9tect\u00e9 par le gestionnaire de composants. \
<br> <b>R\u00e9ponse utilisateur :</b> V\u00e9rifiez que l'installation et la configuration du chemin d'acc\u00e8s aux classes sont corrects.

JMSMQ1120 = La fonction de nettoyage n''est pas prise en charge sur la version de fournisseur ''{0}'' demand\u00e9e.
JMSMQ1120.explanation = Les op\u00e9rations effectu\u00e9es par le nettoyage ne sont pas requises pour la version de fournisseur demand\u00e9e.
JMSMQ1120.useraction = Assurez-vous que la version de fournisseur fournie est correcte.
JMSMQ1120.inserts = XMSC_WMQ_PROVIDER_VERSION
JMSMQ1120.documentation = La fonction de nettoyage n'est pas prise en charge sur la version de fournisseur demand\u00e9e. \
<br> <b>Explication :</b> Les op\u00e9rations effectu\u00e9es par le nettoyage ne sont pas requises pour la version de fournisseur demand\u00e9e <br> <b>R\u00e9ponse utilisateur :</b> Assurez-vous que la version de fournisseur fournie est correcte.

JMSMQ1121 = Un objet ConnectionMetaData a \u00e9t\u00e9 cr\u00e9\u00e9 \u00e0 l'aide du constructeur au lieu d'\u00eatre extrait d'une connexion.
JMSMQ1121.explanation = Les objets ConnectionMetaData doivent provenir de la connexion et ne pas \u00eatre cr\u00e9\u00e9s directement. \
Les informations de version renvoy\u00e9es risquent donc de ne pas \u00eatre pr\u00e9cises.
JMSMQ1121.useraction = Extrayez les objets ConnectionMetaData d'une connexion ou utilisez l'API de version pour extraire les informations de version statiques.

JMSMQ1122 = Une tentative de d\u00e9finition ou de consultation d'une propri\u00e9t\u00e9 qui est obsol\u00e8te et n'est plus prise en charge a \u00e9t\u00e9 effectu\u00e9e
JMSMQ1122.explanation = La propri\u00e9t\u00e9 n'est plus utilis\u00e9e par le client JMS, les m\u00e9thodes pour la d\u00e9finir ou la consulter ne doivent donc plus \u00eatre appel\u00e9es.

JMSMQ1123 = Le syst\u00e8me suppose que l'installation client en tant que biblioth\u00e8que JNI n'est pas localis\u00e9e 

