# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
#


JMSBM0003 = "Impossible de lire les donn\u00e9es des services VCAP."
JMSBM0003.explanation = "La variable d'environnement VCAP_SERVICES n'a pas \u00e9t\u00e9 d\u00e9finie"
JMSBM0003.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSBM0004 = "Impossible d'analyser les donn\u00e9es des services VCAP. Voir l'exception associ\u00e9e pour plus de d\u00e9tails."
JMSBM0004.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSBM0005 =  "Les d\u00e9tails de connexion pour le type de service ''{0}'' sont introuvables. V\u00e9rifiez que l''application est li\u00e9e \u00e0 l''instance d''un service MQ Light."
JMSBM0005.inserts = XMSC_SERVICE_TYPE
JMSBM0005.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSBM0006 = "Echec de la cr\u00e9ation de la fabrique de connexions pour l''instance de service ''{0}''."
JMSBM0006.inserts = XMSC_SERVICE_INSTANCE_NAME
JMSBM0006.explanation = "Aucune donn\u00e9e n'est disponible pour le nom d'instance sp\u00e9cifi\u00e9."
JMSBM0006.useraction = "V\u00e9rifiez les donn\u00e9es des services VCAP pour l'application."
JMSBM0006.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSBM0007 = "Impossible de configurer l'instance de fabrique de connexions par d\u00e9faut"
JMSBM0007.explanation = "Plusieurs instances de service sont d\u00e9finies mais aucun nom d'instance n'a \u00e9t\u00e9 sp\u00e9cifi\u00e9 lors de la cr\u00e9ation d'une fabrique de connexions."
JMSBM0007.useraction = "Indiquez un nom d'instance de service valide lors de la cr\u00e9ation d'une fabrique de connexions."
JMSBM0007.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSBM0008 = "Impossible de charger les donn\u00e9es d'identification du service"
JMSBM0008.explanation = "La d\u00e9finition de service ne contient pas les donn\u00e9es d'identification requises."
JMSBM0008.useraction = "V\u00e9rifiez les donn\u00e9es des services VCAP pour l'application."
JMSBM0008.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSBM0009 = "L'appel d'API n'est pas autoris\u00e9 avec des donn\u00e9es d'identification pr\u00e9configur\u00e9es"
JMSBM0009.explanation = "Un ID utilisateur et un mot de passe sont d\u00e9j\u00e0 configur\u00e9s dans ConnectionFactory. Les donn\u00e9es d'identification de l'utilisateur sont remplac\u00e9es lors de la cr\u00e9ation d'une connexion"
JMSBM0009.useraction = 'N'indiquez pas de param\u00e8tre d'ID utilisateur ou de mot de passe lors de la cr\u00e9ation d'une connexion \u00e0 cette instance de service"
JMSBM0009.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSBM0010 = "Les donn\u00e9es de service VCAP sont incoh\u00e9rentes et potentiellement incorrectes"
JMSBM0010.explanation = "Lors du chargement des informations du service VCAP, une erreur dans les donn\u00e9es a \u00e9t\u00e9 d\u00e9tect\u00e9e"
JMSBM0010.useraction = "Signalez le probl\u00e8me au service IBM en mentionnant cette exception."
JMSBM0010.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSBM0010.inserts = XMSC_INVALID_NAME

JMSBM0011 = "L'API JMS1.0.2 n'est pas prise en charge dans MQLight for Bluemix"
JMSBM0011.explanation = "Seule l'API JMS1.1 ou JMS2.0 peut \u00eatre utilis\u00e9e"
JMSBM0011.useraction = "Utilisez les fabriques de connexions de domaine unifi\u00e9es."
JMSBM0011.exception = com.ibm.msg.client.jms.DetailedJMSException

