# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE
#

# JMSCMQ0001 doesn't have a .inserts message because it's only used by Reason in
# a WMQException, and never in a JMSException.
JMSCMQ0001 = Wywo\u0142anie produktu IBM MQ nie powiod\u0142o si\u0119. Kod zako\u0144czenia: {0} ({1}). Przyczyna: {2} ({3}).

JMSCMQ0002 = Wykonanie metody {0} nie powiod\u0142o si\u0119.
JMSCMQ0002.explanation = Wywo\u0142anie produktu IBM MQ nie powiod\u0142o si\u0119.
JMSCMQ0002.useraction = Wi\u0119cej informacji na ten temat zawiera do\u0142\u0105czony wyj\u0105tek.
JMSCMQ0002.inserts = XMSC_INSERT_METHOD

JMSCMQ0003 = Miejsce docelowe {0} nie zosta\u0142o rozpoznane lub nie jest ju\u017c poprawne.
JMSCMQ0003.explanation = Kolejka lub temat mog\u0142y sta\u0107 si\u0119 niedost\u0119pne, aplikacja mo\u017ce u\u017cywa\u0107 niepoprawnego po\u0142\u0105czenia dla kolejki lub tematu b\u0105d\u017a typ podanego miejsca docelowego nie jest poprawny dla tej metody.
JMSCMQ0003.useraction = Sprawd\u017a, czy produkt IBM MQ jest nadal uruchomiony i czy jest dost\u0119pny mened\u017cer kolejek. Sprawd\u017a, czy dla kolejki lub tematu jest u\u017cywane w\u0142a\u015bciwe po\u0142\u0105czenie.
JMSCMQ0003.inserts = XMSC_DESTINATION_NAME
JMSCMQ0003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCMQ0004 = Warto\u015b\u0107 {0} nie by\u0142a poprawna dla w\u0142a\u015bciwo\u015bci {1}.
JMSCMQ0004.explanation = Warto\u015b\u0107 {1} nie nale\u017ca\u0142a do poprawnych warto\u015bci dla tej w\u0142a\u015bciwo\u015bci.
JMSCMQ0004.useraction = Ustaw poprawn\u0105 warto\u015b\u0107 w\u0142a\u015bciwo\u015bci.
JMSCMQ0004.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_PROPERTY

JMSCMQ0005 = Nazwa miejsca docelowego {0} nie by\u0142a poprawna.
JMSCMQ0005.explanation = Podana nazwa miejsca docelowego nie jest zgodna z opublikowanymi regu\u0142ami sk\u0142adni nazwy miejsca docelowego.
JMSCMQ0005.useraction = Popraw podan\u0105 nazw\u0119 miejsca docelowego i spr\u00f3buj ponownie.
JMSCMQ0005.inserts = XMSC_DESTINATION_NAME
JMSCMQ0005.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCMQ0006 = Miejsce docelowe nie jest tymczasowym miejscem docelowym i dlatego nie mo\u017cna go usun\u0105\u0107.
JMSCMQ0006.explanation = Usuwa\u0107 mo\u017cna tylko tymczasowe miejsca docelowe.

JMSCMQ0007 = W kontek\u015bcie w\u0142a\u015bciwo\u015bci docelowej zosta\u0142a ustawiona nieznana w\u0142a\u015bciwo\u015b\u0107 {0} o warto\u015bci {1}.
JMSCMQ0007.explanation = W\u0142a\u015bciwo\u015b\u0107 ''{0}'' nie zosta\u0142a rozpoznana - mo\u017ce to by\u0107 w\u0142a\u015bciwo\u015b\u0107 niestandardowa.
JMSCMQ0007.useraction = Sprawd\u017a, czy ma to by\u0107 w\u0142a\u015bciwo\u015b\u0107 niestandardowa.
JMSCMQ0007.inserts = XMSC_INSERT_KEY, XMSC_INSERT_VALUE

JMSCMQ0008 = Produkt IBM MQ classes for JMS podejmuje pr\u00f3b\u0119 u\u017cycia typu danych, kt\u00f3ry nie jest obs\u0142ugiwany przez komunikat, lub pr\u00f3b\u0119 odczytania danych niew\u0142a\u015bciwego typu.
JMSCMQ0008.explanation = U\u017cyto niew\u0142a\u015bciwych typ\u00f3w danych w celu odczytania typ\u00f3w w\u0142a\u015bciwo\u015bci komunikatu.
JMSCMQ0008.useraction = Sprawd\u017a, czy odebrane komunikaty i w\u0142a\u015bciwo\u015bci do odczytania maj\u0105 oczekiwany typ.
JMSCMQ0008.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ0009 = Podczas odczytywania komunikatu strumienia lub komunikatu bajtowego nieoczekiwanie osi\u0105gni\u0119to koniec strumienia.
JMSCMQ0009.explanation = Odczytywany strumie\u0144 bajt\u00f3w jest kr\u00f3tszy ni\u017c podany bufor. Przyczyn\u0105 tego mo\u017ce by\u0107 r\u00f3wnie\u017c odebranie uszkodzonego komunikatu strumienia lub komunikatu bajtowego.
JMSCMQ0009.useraction = Sprawd\u017a d\u0142ugo\u015b\u0107 podanego buforu. Wi\u0119cej szczeg\u00f3\u0142owych informacji oraz zg\u0142oszonych niepowodze\u0144 mo\u017cna znale\u017a\u0107 w dziennikach zdarze\u0144 systemowych.
JMSCMQ0009.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCMQ0017 = Koniec strumienia.
JMSCMQ0017.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCMQ0018 = Nie mo\u017cna poprawnie przeanalizowa\u0107 odebranego komunikatu.
JMSCMQ0018.explanation = Nie mo\u017cna poprawnie przeanalizowa\u0107 komunikatu o identyfikatorze komunikatu {0} i identyfikatorze korelacji {1}. Ostatni pomy\u015blny odczyt danych z komunikatu wyst\u0105pi\u0142 w pozycji {2} w buforze {3}  
JMSCMQ0018.useraction = Sprawd\u017a dane komunikatu i upewnij si\u0119, \u017ce maj\u0105 one format poprawny do przeanalizowania jako komunikat MQJMS.
JMSCMQ0018.inserts = XMSC_MESSAGE_ID, XMSC_CORRELATION_ID, XMSC_MESSAGE_BUFFER_POSITION, XMSC_MESSAGE_BUFFER

JMSCMQ1000 = Tworzenie komunikatu JMS nie powiod\u0142o si\u0119.
JMSCMQ1000.explanation = Podczas tworzenia podstawowego komunikatu o identyfikatorze komunikatu {0} i identyfikatorze korelacji {1} podano niepoprawne w\u0142a\u015bciwo\u015bci lub niepoprawny typ komunikatu.
JMSCMQ1000.useraction = Wi\u0119cej informacji zawiera do\u0142\u0105czony kod zako\u0144czenia oraz opis przyczyny wyj\u0105tku produktu IBM MQ. Szczeg\u00f3\u0142ow\u0105 tre\u015b\u0107 komunikatu zawiera plik dziennika.
JMSCMQ1000.inserts = XMSC_MESSAGE_ID, XMSC_CORRELATION_ID

JMSCMQ1006 = Niepoprawna warto\u015b\u0107 dla w\u0142a\u015bciwo\u015bci {0}: {1}.
JMSCMQ1006.explanation = Warto\u015b\u0107 {1} dla w\u0142a\u015bciwo\u015bci {0} jest niepoprawna.
JMSCMQ1006.useraction = Sprawd\u017a do\u0142\u0105czony kod zako\u0144czenia oraz opis przyczyny wyj\u0105tku produktu IBM MQ.
JMSCMQ1006.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_VALUE

JMSCMQ1044 = \u0141a\u0144cuch nie jest poprawn\u0105 liczb\u0105 szesnastkow\u0105 - {0}.
JMSCMQ1044.inserts = XMSC_INSERT_HEX_STRING
JMSCMQ1044.explanation = Podj\u0119to pr\u00f3b\u0119 okre\u015blenia identyfikatora grupy lub identyfikatora korelacji rozpoczynaj\u0105cego si\u0119 od identyfikatora przedrostkowego, po kt\u00f3rym nie nast\u0119puje jednak poprawnie sformatowana warto\u015b\u0107 szesnastkowa, lub pr\u00f3b\u0119 odebrania komunikatu zawieraj\u0105cego w\u0142a\u015bciwo\u015b\u0107 struktury MQRFH2 typu bin.hex, kt\u00f3ra nie ma poprawnie sformatowanej warto\u015bci szesnastkowej.
JMSCMQ1044.useraction = Podczas ustawiania warto\u015bci identyfikatora grupy lub identyfikatora korelacji sprawd\u017a, czy po identyfikatorze przedrostkowym zawsze nast\u0119puje poprawna warto\u015b\u0107 szesnastkowa. Sprawd\u017a, czy wszystkie nag\u0142\u00f3wki MQRFH2 generowane przez aplikacje inne ni\u017c JMS s\u0105 poprawnie sformatowane.

JMSCMQ1046 = Zestaw znak\u00f3w {0} nie jest obs\u0142ugiwany.
JMSCMQ1046.inserts = CCSID
JMSCMQ1046.explanation = Podj\u0119to pr\u00f3b\u0119 wys\u0142ania lub odebrania komunikatu odwzorowania, komunikatu strumienia lub komunikatu tekstowego, kt\u00f3rego tre\u015b\u0107 jest zakodowana za pomoc\u0105 zestawu znak\u00f3w nieobs\u0142ugiwanego przez maszyn\u0119 JVM. W przypadku komunikat\u00f3w tekstowych ten wyj\u0105tek mo\u017ce zosta\u0107 zg\u0142oszony, je\u015bli tre\u015b\u0107 wiadomo\u015bci komunikatu jest odpytywana w pierwszej kolejno\u015bci, a nie podczas odbierania.
JMSCMQ1046.useraction = Koduj komunikaty wy\u0142\u0105cznie za pomoc\u0105 zestaw\u00f3w znak\u00f3w dost\u0119pnych dla aplikacji odbieraj\u0105cej.

JMSCMQ1047 = Format komunikatu odwzorowania jest niepoprawny.
JMSCMQ1047.explanation = Komunikat odwzorowania zosta\u0142 odebrany, ale informacje jego nag\u0142\u00f3wka MQRFH2 s\u0105 niepoprawnie sformatowane.
JMSCMQ1047.useraction = Sprawd\u017a, czy wszystkie aplikacje inne ni\u017c JMS tworz\u0105 poprawnie sformatowane informacje nag\u0142\u00f3wka MQRFH2 w celu ich w\u0142\u0105czenia do komunikat\u00f3w odwzorowania.
JMSCMQ1047.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1048 = Format komunikatu strumienia jest niepoprawny.
JMSCMQ1048.explanation = Odebrano niepoprawnie sformatowany komunikat strumienia.
JMSCMQ1048.useraction = Sprawd\u017a, czy wszystkie aplikacje nie b\u0119d\u0105ce aplikacjami JMS buduj\u0105 poprawnie sformatowane komunikaty strumienia.
JMSCMQ1048.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1049 = Nie mo\u017cna dokona\u0107 konwersji cz\u0119\u015bci lub ca\u0142o\u015bci \u0142a\u0144cucha {1} w przypadku zestawu znak\u00f3w {0}
JMSCMQ1049.inserts = CCSID, WARTO\u015a\u0106_WSTAWIANA_XMSC
JMSCMQ1049.explanation = Podj\u0119to pr\u00f3b\u0119 wys\u0142ania lub odebrania danych \u0142a\u0144cucha przy u\u017cyciu zestawu znak\u00f3w nieobs\u0142uguj\u0105cego translacji tre\u015bci \u0142a\u0144cucha.
JMSCMQ1049.useraction = Koduj komunikat tylko przy u\u017cyciu zestawu znak\u00f3w odpowiedniego dla przesy\u0142anych danych \u0142a\u0144cucha.

JMSCMQ1050 = Format nag\u0142\u00f3wka MQRFH2 jest niepoprawny.
JMSCMQ1050.explanation = Odebrano komunikat, kt\u00f3rego nag\u0142\u00f3wek MQRFH2 jest niepoprawnie sformatowany.
JMSCMQ1050.useraction = Sprawd\u017a, czy wszystkie aplikacje inne ni\u017c JMS, kt\u00f3re s\u0142u\u017c\u0105 do tworzenia komunikat\u00f3w z nag\u0142\u00f3wkami MQRFH2, tworz\u0105 poprawnie sformatowane nag\u0142\u00f3wki MQRFH2.
JMSCMQ1050.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1053 = Wykryto niepoprawny znak odpowiednika UTF-16 {0}.
JMSCMQ1053.inserts = XMSC_INSERT_CHARACTER
JMSCMQ1053.explanation = Napotkano znak odpowiednika UTF-16, kt\u00f3ry nie jest poprawny jako cz\u0119\u015b\u0107 nazwy tematu lub w\u0142a\u015bciwo\u015bci nag\u0142\u00f3wka MQRFH2.
JMSCMQ1053.useraction = Sprawd\u017a, czy podczas okre\u015blania kodowania UTF-16 nazwy temat\u00f3w lub w\u0142a\u015bciwo\u015bci nag\u0142\u00f3wka MQRFH2 s\u0105 poprawnie sformatowane.
JMSCMQ1053.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1054 = Wykryto nast\u0119puj\u0105c\u0105 niepoprawn\u0105 sekwencj\u0119 o zmienionym znaczeniu dla kodu XML: {0}.
JMSCMQ1054.inserts = XMSC_INSERT_STRING
JMSCMQ1054.explanation = W nag\u0142\u00f3wku MQRFH2 lub odebranym komunikacie napotkano niepoprawn\u0105 sekwencj\u0119 o zmienionym znaczeniu dla kodu XML.
JMSCMQ1054.useraction = Sprawd\u017a, czy aplikacje inne ni\u017c JMS umieszczaj\u0105 w tworzonych przez siebie nag\u0142\u00f3wkach MQRFH2 wy\u0142\u0105cznie poprawne sekwencje o zmienionym znaczeniu dla kodu XML.
JMSCMQ1054.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1055 = Typ danych {0} w\u0142a\u015bciwo\u015bci lub elementu komunikatu jest niezgodny z metod\u0105 s\u0142u\u017c\u0105c\u0105 do uzyskiwania dost\u0119pu do niego.
JMSCMQ1055.inserts = XMSC_INSERT_TYPE
JMSCMQ1055.explanation = Metoda obiektu korzystaj\u0105cego s\u0142u\u017c\u0105ca do pobierania w\u0142a\u015bciwo\u015bci z komunikatu JMS jest niezgodna z pobieranym typem w\u0142a\u015bciwo\u015bci. Przyk\u0142ad: Podj\u0119to pr\u00f3b\u0119 pobrania w\u0142a\u015bciwo\u015bci typu integer przy u\u017cyciu metody getBooleanProperty().
JMSCMQ1055.useraction = U\u017cyj metody obiektu korzystaj\u0105cego zdefiniowanej przez specyfikacj\u0119 JMS jako metoda, kt\u00f3ra mo\u017ce pobra\u0107 warto\u015bci w\u0142a\u015bciwo\u015bci wymaganego typu.
JMSCMQ1055.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1056 = Typ danych {0} w\u0142a\u015bciwo\u015bci lub elementu nie jest obs\u0142ugiwany.
JMSCMQ1056.inserts = XMSC_INSERT_TYPE
JMSCMQ1056.explanation = Przyczyn\u0105 tego b\u0142\u0119du jest pr\u00f3ba ustawienia w\u0142a\u015bciwo\u015bci komunikatu JMS za pomoc\u0105 obiektu, kt\u00f3ry nie nale\u017cy do obs\u0142ugiwanych typ\u00f3w, lub pr\u00f3ba ustawienia b\u0105d\u017a odebrania komunikatu o nag\u0142\u00f3wku MQRFH2 zawieraj\u0105cym element odpowiadaj\u0105cy w\u0142a\u015bciwo\u015bci, z kt\u00f3rym nie jest powi\u0105zany poprawny typ.
JMSCMQ1056.useraction = Sprawd\u017a, czy podczas ustawiania w\u0142a\u015bciwo\u015bci komunikatu jest u\u017cywany poprawny typ obiektu JMS. Je\u015bli ten wyj\u0105tek wyst\u0119puje podczas odbierania komunikatu zawieraj\u0105cego nag\u0142\u00f3wek MQRFH2 wys\u0142any przez aplikacj\u0119 inn\u0105 ni\u017c JMS, sprawd\u017a, czy nag\u0142\u00f3wek MQRFH2 jest poprawnie sformatowany.
JMSCMQ1056.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1066 = Nieobs\u0142ugiwana nazwa w\u0142a\u015bciwo\u015bci {0}.
JMSCMQ1066.inserts = XMSC_INSERT_PROPERTY
JMSCMQ1066.explanation =  Podj\u0119to pr\u00f3b\u0119 ustawienia w\u0142a\u015bciwo\u015bci komunikatu przy u\u017cyciu nazwy w\u0142a\u015bciwo\u015bci, kt\u00f3ra nie jest poprawna, lub nazwy w\u0142a\u015bciwo\u015bci, dla kt\u00f3rej nie mo\u017cna ustawi\u0107 warto\u015bci. 
JMSCMQ1066.useraction = Sprawd\u017a, czy okre\u015blona nazwa w\u0142a\u015bciwo\u015bci jest zgodna ze specyfikacj\u0105 JMS. Je\u015bli podana nazwa w\u0142a\u015bciwo\u015bci jest nazw\u0105 w\u0142a\u015bciwo\u015bci JMS lub rozszerzeniem specyficznym dla dostawcy, sprawd\u017a, czy t\u0119 w\u0142a\u015bciwo\u015b\u0107 mo\u017cna ustawi\u0107. 
JMSCMQ1066.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

