# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE
#

# JMSCMQ0001 doesn't have a .inserts message because it's only used by Reason in
# a WMQException, and never in a JMSException.
JMSCMQ0001 = L''appel IBM MQ a \u00e9chou\u00e9 avec le code ach\u00e8vement ''{0}'' (''{1}'') ; motif ''{2}'' (''{3}'').

JMSCMQ0002 = La m\u00e9thode ''{0}'' a \u00e9chou\u00e9.
JMSCMQ0002.explanation = Un appel IBM MQ a \u00e9chou\u00e9.
JMSCMQ0002.useraction = Reportez-vous \u00e0 l'exception associ\u00e9e pour plus d'informations.
JMSCMQ0002.inserts = XMSC_INSERT_METHOD

JMSCMQ0003 = La destination ''{0}'' n''est pas reconnue ou elle n''est plus valide.
JMSCMQ0003.explanation = La file d'attente ou la rubrique n'est peut-\u00eatre plus disponible, l'application utilise peut-\u00eatre une connexion incorrecte pour la file d'attente ou la rubrique ou le type de la destination fournie n'est pas correct pour cette m\u00e9thode.
JMSCMQ0003.useraction = V\u00e9rifiez que IBM MQ est toujours actif et que le gestionnaire de files d'attente est disponible. V\u00e9rifiez que la connexion appropri\u00e9e est utilis\u00e9e pour votre file d'attente ou votre rubrique.
JMSCMQ0003.inserts = XMSC_DESTINATION_NAME
JMSCMQ0003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCMQ0004 = La valeur ''{0}'' n''\u00e9tait pas valide pour la propri\u00e9t\u00e9 ''{1}''.
JMSCMQ0004.explanation = La valeur de la propri\u00e9t\u00e9 ''{1}'' ne correspondait \u00e0 aucune des valeurs valides pour cette propri\u00e9t\u00e9.
JMSCMQ0004.useraction = Affectez une valeur valide \u00e0 la propri\u00e9t\u00e9.
JMSCMQ0004.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_PROPERTY

JMSCMQ0005 = Le nom de destination ''{0}'' n''\u00e9tait pas valide.
JMSCMQ0005.explanation = Le nom de destination sp\u00e9cifi\u00e9 ne respecte pas la syntaxe de destination publi\u00e9e.
JMSCMQ0005.useraction = Corrigez le nom de destination sp\u00e9cifi\u00e9 et recommencez.
JMSCMQ0005.inserts = XMSC_DESTINATION_NAME
JMSCMQ0005.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCMQ0006 = La destination n'est pas une destination temporaire. Elle ne peut pas \u00eatre supprim\u00e9e.
JMSCMQ0006.explanation = Seules les destinations temporaires peuvent \u00eatre supprim\u00e9es.

JMSCMQ0007 = Une propri\u00e9t\u00e9 inconnue ''{0}'' ayant pour valeur ''{1}'' a \u00e9t\u00e9 d\u00e9finie sur le contexte de la propri\u00e9t\u00e9 de destination.
JMSCMQ0007.explanation = La propri\u00e9t\u00e9 ''{0}'' n''a pas \u00e9t\u00e9 reconnue. Il s''agit peut-\u00eatre d''une propri\u00e9t\u00e9 personnalis\u00e9e.
JMSCMQ0007.useraction = V\u00e9rifiez qu'il s'agit bien d'une propri\u00e9t\u00e9 personnalis\u00e9e.
JMSCMQ0007.inserts = XMSC_INSERT_KEY, XMSC_INSERT_VALUE

JMSCMQ0008 = IBM MQ classes for JMS tente d'utiliser un type de donn\u00e9es non pris en charge par un message ou de lire des donn\u00e9es de type incorrect.
JMSCMQ0008.explanation = Types de donn\u00e9es incorrects utilis\u00e9s pour lire les types de propri\u00e9t\u00e9s de message.
JMSCMQ0008.useraction = V\u00e9rifiez que les types du message re\u00e7u et des propri\u00e9t\u00e9s \u00e0 lire sont corrects.
JMSCMQ0008.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ0009 = La fin du flux a \u00e9t\u00e9 atteinte de mani\u00e8re inattendue lors de la lecture d'un message de flux ou d'un message d'octets.
JMSCMQ0009.explanation = Le flux d'octets lu est plus court que celui fourni. Il se peut qu'un message de flux ou d'octets endommag\u00e9 ait \u00e9t\u00e9 re\u00e7u.
JMSCMQ0009.useraction = V\u00e9rifiez la longueur de la m\u00e9moire tampon fournie. Pour plus d'informations, consultez les journaux des \u00e9v\u00e9nements syst\u00e8me et tous les autres incidents rapport\u00e9s.
JMSCMQ0009.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCMQ0017 = Fil du flux.
JMSCMQ0017.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCMQ0018 = Un message re\u00e7u n'a pas pu \u00eatre correctement analys\u00e9.
JMSCMQ0018.explanation = Le message avec messageID = ''{0}'' et correlationID = ''{1}'' n''a pas pu \u00eatre correctement analys\u00e9. La derni\u00e8re lecture de donn\u00e9es ayant abouti dans le message \u00e9tait \u00e0 la position ''{2}'' dans la m\u00e9moire tampon ''{3}''  
JMSCMQ0018.useraction = Examinez les donn\u00e9es du message et assurez-vous qu'il est dans un format correct pour \u00eatre analys\u00e9 en tant que message MQJMS.
JMSCMQ0018.inserts = XMSC_MESSAGE_ID, XMSC_CORRELATION_ID, XMSC_MESSAGE_BUFFER_POSITION, XMSC_MESSAGE_BUFFER

JMSCMQ1000 = Impossible de cr\u00e9er le message JMS.
JMSCMQ1000.explanation = Un type de message ou des propri\u00e9t\u00e9s incorrects ont \u00e9t\u00e9 sp\u00e9cifi\u00e9s lors de la cr\u00e9ation d''un message de base avec messageID = ''{0}'' et correlationID = ''{1}''.
JMSCMQ1000.useraction = Pour plus d'informations, v\u00e9rifiez le motif d'exception IBM MQ associ\u00e9 et le code ach\u00e8vement, et consultez le fichier journal pour un contenu de message d\u00e9taill\u00e9.
JMSCMQ1000.inserts = XMSC_MESSAGE_ID, XMSC_CORRELATION_ID

JMSCMQ1006 = La valeur de ''{0}'' : ''{1}'' n''est pas valide.
JMSCMQ1006.explanation = La valeur ''{1}'' de la propri\u00e9t\u00e9 ''{0}'' n''est pas correcte.
JMSCMQ1006.useraction = V\u00e9rifiez le motif d'exception IBM MQ associ\u00e9 et le code ach\u00e8vement.
JMSCMQ1006.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_VALUE

JMSCMQ1044 = La cha\u00eene n''est pas une valeur hexad\u00e9cimale valide - ''{0}''.
JMSCMQ1044.inserts = XMSC_INSERT_HEX_STRING
JMSCMQ1044.explanation = Tentative de sp\u00e9cification d'un ID groupe ou d'un ID corr\u00e9lation commen\u00e7ant par l'ID pr\u00e9fixe, mais non suivi d'une valeur hexad\u00e9cimale syntaxiquement correcte ou tentative de r\u00e9ception d'un message contenant une propri\u00e9t\u00e9 MQRFH2 de type bin.hex ne poss\u00e9dant pas une valeur hexad\u00e9cimale syntaxiquement correcte.
JMSCMQ1044.useraction = V\u00e9rifiez qu'une valeur hexad\u00e9cimale valide suit l'ID pr\u00e9fixe lorsque vous d\u00e9finissez des ID groupe ou des ID corr\u00e9lation. V\u00e9rifiez que les en-t\u00eates MQRFH2 g\u00e9n\u00e9r\u00e9s par les applications non JMS sont syntaxiquement corrects.

JMSCMQ1046 = Le jeu de caract\u00e8res ''{0}'' n''est pas pris en charge.
JMSCMQ1046.inserts = CCSID
JMSCMQ1046.explanation = Tentative d'envoi ou de r\u00e9ception d'un message de mappe, d'un message de flux ou d'un message de texte dont le corps est cod\u00e9 \u00e0 l'aide d'un jeu de caract\u00e8res non pris en charge par la machine JVM. Dans le cas des messages de texte, cette exception peut \u00eatre g\u00e9n\u00e9r\u00e9e lorsque le corps du message est interrog\u00e9 pour la premi\u00e8re fois et non lors de la r\u00e9ception.
JMSCMQ1046.useraction = Ne codez un message qu'\u00e0 l'aide d'un jeu de caract\u00e8res accessible par l'application destinataire.

JMSCMQ1047 = Le format du message de mappe est incorrect.
JMSCMQ1047.explanation = Un message de mappe a \u00e9t\u00e9 re\u00e7u, mais la syntaxe de ses informations d'en-t\u00eate MQRFH2 est incorrecte.
JMSCMQ1047.useraction = V\u00e9rifiez que les applications non JMS g\u00e9n\u00e8rent des informations d'en-t\u00eate MQRFH2 syntaxiquement correctes \u00e0 inclure dans les messages de mappe.
JMSCMQ1047.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1048 = Le format du message de flot est incorrect.
JMSCMQ1048.explanation = Un message de flux a \u00e9t\u00e9 re\u00e7u avec une syntaxe incorrecte.
JMSCMQ1048.useraction = V\u00e9rifiez que les applications non JMS g\u00e9n\u00e8rent des messages de flux syntaxiquement corrects.
JMSCMQ1048.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1049 = Le jeu de caract\u00e8res ''{0}'' ne peut pas convertir une partie ou l''int\u00e9gralit\u00e9 des cha\u00eenes ''{1}''
JMSCMQ1049.inserts = CCSID, XMSC_INSERT_VALUE
JMSCMQ1049.explanation = Une tentative d'envoi ou de r\u00e9ception de donn\u00e9es de cha\u00eene a \u00e9t\u00e9 effectu\u00e9e avec un jeu de caract\u00e8res qui ne peut pas traduire le contenu de la cha\u00eene.
JMSCMQ1049.useraction = Ne codez un message qu'avec un jeu de caract\u00e8res dont vous savez qu'il est appropri\u00e9 aux donn\u00e9es de cha\u00eene transmises.

JMSCMQ1050 = Le format de l'en-t\u00eate MQRFH2 est incorrect.
JMSCMQ1050.explanation = Un message contenant un en-t\u00eate MQRFH2 dont la syntaxe est incorrecte a \u00e9t\u00e9 re\u00e7u.
JMSCMQ1050.useraction = V\u00e9rifiez que les applications non JMS qui g\u00e9n\u00e8rent des messages avec des en-t\u00eates MQRFH2 cr\u00e9ent des en-t\u00eates syntaxiquement corrects.
JMSCMQ1050.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1053 = Un caract\u00e8re de substitut UTF-16 incorrect (''{0}'') est d\u00e9tect\u00e9.
JMSCMQ1053.inserts = XMSC_INSERT_CHARACTER
JMSCMQ1053.explanation = Un caract\u00e8re de substitut UTF-16 non valide a \u00e9t\u00e9 rencontr\u00e9 dans un nom de rubrique ou une propri\u00e9t\u00e9 MQRFH2.
JMSCMQ1053.useraction = Lorsque vous sp\u00e9cifiez UTF-16, v\u00e9rifiez que les noms de rubrique ou les propri\u00e9t\u00e9s MQRFH2 sont syntaxiquement corrects.
JMSCMQ1053.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1054 = Une s\u00e9quence d''\u00e9chappement XML incorrecte (''{0}'') est d\u00e9tect\u00e9e.
JMSCMQ1054.inserts = XMSC_INSERT_STRING
JMSCMQ1054.explanation = Une s\u00e9quence d'\u00e9chappement XML non valide a \u00e9t\u00e9 rencontr\u00e9e dans l'en-t\u00eate MQRFH2 d'un message re\u00e7u.
JMSCMQ1054.useraction = V\u00e9rifiez que seules des s\u00e9quences d'\u00e9chappement XML valides sont plac\u00e9es dans les en-t\u00eates MQRFH2 g\u00e9n\u00e9r\u00e9s par des applications non JMS.
JMSCMQ1054.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1055 = La propri\u00e9t\u00e9 ou l''\u00e9l\u00e9ment du message poss\u00e8de un type de donn\u00e9es ''{0}'' incompatible avec la m\u00e9thode utilis\u00e9e pour y acc\u00e9der.
JMSCMQ1055.inserts = XMSC_INSERT_TYPE
JMSCMQ1055.explanation = La m\u00e9thode d'acc\u00e8s utilis\u00e9e pour extraire une propri\u00e9t\u00e9 d'un message JMS est incompatible avec le type de la propri\u00e9t\u00e9 extraite. Par exemple, tentative d'extraction d'une propri\u00e9t\u00e9 entier \u00e0 l'aide de la m\u00e9thode getBooleanProperty().
JMSCMQ1055.useraction = Utilisez une m\u00e9thode d'acc\u00e8s d\u00e9finie par la sp\u00e9cification JMS comme pouvant extraire des valeurs de propri\u00e9t\u00e9 du type requis.
JMSCMQ1055.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1056 = Type de donn\u00e9es de propri\u00e9t\u00e9 ou d''\u00e9l\u00e9ment non pris en charge : ''{0}''.
JMSCMQ1056.inserts = XMSC_INSERT_TYPE
JMSCMQ1056.explanation = Cette erreur est due \u00e0 une tentative de d\u00e9finition d'une propri\u00e9t\u00e9 d'un message JMS \u00e0 l'aide d'un objet dont le type n'est pas pris en charge ou \u00e0 une tentative de d\u00e9finition ou de r\u00e9ception d'un message pour lequel MQRFH2 contient un \u00e9l\u00e9ment repr\u00e9sentant une propri\u00e9t\u00e9 \u00e0 laquelle aucun type valide n'est associ\u00e9.
JMSCMQ1056.useraction = Lors de la d\u00e9finition des propri\u00e9t\u00e9s du message, utilisez bien un type d'objet JMS valide. Si cette exception se produit lors de la r\u00e9ception d'un message contenant un en-t\u00eate MQRFH2 envoy\u00e9 par une application non JMS, v\u00e9rifiez que l'en-t\u00eate MQRFH2 est syntaxiquement correct.
JMSCMQ1056.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1066 = Nom de propri\u00e9t\u00e9 ''{0}'' non pris en charge.
JMSCMQ1066.inserts = XMSC_INSERT_PROPERTY
JMSCMQ1066.explanation =  Tentative de d\u00e9finition d'une propri\u00e9t\u00e9 de message \u00e0 l'aide d'un nom de propri\u00e9t\u00e9 non valide ou du nom d'une propri\u00e9t\u00e9 dont la valeur ne peut pas \u00eatre d\u00e9finie. 
JMSCMQ1066.useraction = V\u00e9rifiez que le nom de propri\u00e9t\u00e9 sp\u00e9cifi\u00e9 est conforme \u00e0 la sp\u00e9cification JMS. Si le nom de propri\u00e9t\u00e9 fourni est celui d'une propri\u00e9t\u00e9 JMS ou d'une extension sp\u00e9cifique \u00e0 un fournisseur, v\u00e9rifiez que cette propri\u00e9t\u00e9 peut \u00eatre d\u00e9finie. 
JMSCMQ1066.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

