#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE
# %Z% %W% %I% %E% %U%

# Note to translators: the comments for the JMSMQxxxx.documentation properties in
# this file do NOT need to be translated, they are used at build time to create
# untranslated Javadoc documentation. 

#MQJMSIVT messages
JMSMQ0000 = Methode ''{0}'' wurde zu einer unzul\u00e4ssigen oder falschen Zeit aufgerufen, oder der Provider hat nicht den richtigen Status f\u00fcr die angeforderte Operation. 
JMSMQ0000.explanation = Die \u00fcbliche Ursache f\u00fcr diese Ausnahme ist, dass die SSL-Zertifikatsspeicher definiert wurden. \
''{0}'' verweist auf die Methode, die als Ursache f\u00fcr das Problem erkannt wurde.
JMSMQ0000.inserts = XMSC_INSERT_NAME

JMSMQ1046 = Der Zeichensatz ''{0}'' wird nicht unterst\u00fctzt.
JMSMQ1046.documentation = Der Zeichensatz {0} wird nicht unterst\u00fctzt. \
<br> <b>Erl\u00e4uterung:</b> Es wurde versucht, eine Zuordnungsnachricht, eine Datenstromnachricht oder eine Textnachricht zu senden oder zu empfangen, deren Hauptteil mit einem Zeichensatz codiert wurde, der nicht von der JVM unterst\u00fctzt wird. \
Bei Textnachrichten wird diese Ausnahmebedingung m\u00f6glicherweise ausgegeben, wenn zuerst der Hauptteil der Nachricht abgefragt wird, nicht zum Zeitpunkt des Empfangs. \
<br> <b>Benutzeraktion:</b> Codieren Sie eine Nachricht nur mit einem Zeichensatz, von dem bekannt ist, dass er f\u00fcr die empfangende Anwendung zur Verf\u00fcgung steht.

JMSMQ1002 = IBM MQ Classes for Java(tm) Message Service 
JMSMQ3043 = Ung\u00fcltige Stufe f\u00fcr Bereinigungswiederholung.
JMSMQ3043.documentation = Die Stufe f\u00fcr die Bereinigungswiederholung ist ung\u00fcltig. \
<br> <b>Benutzeraktion: </b> Legen Sie f\u00fcr die Eigenschaft 'cleanupLevel' einen geeigneten Wert fest. 

JMSMQ5032 = Verbindung wird geschlossen
JMSMQ5010 = Verbindung wird hergestellt
JMSMQ5034 = Ausnahmebedingung ermittelt
JMSMQ5021 = Fehler beim erneuten Abrufen der Nachricht
JMSMQ5002 = Markierung '-icf' wird ignoriert; kein Wert \u00fcbergeben
JMSMQ5003 = Unbekannte Markierung (''{0}'') wird ignoriert
JMSMQ5001 = Markierung '-url' wird ignoriert; kein Wert \u00fcbergeben
JMSMQ5006 = Fehler beim Erstellen von InitialContext. \u00dcberpr\u00fcfen Sie die JNDI-Einstellungen.
JMSMQ5035 = Installationsfunktionstest beendet
JMSMQ5000 = Installationsfunktionstest
JMSMQ5033 = Installationsfunktionstest erfolgreich abgeschlossen
JMSMQ5017 = TextMessage wird erstellt
JMSMQ5024 = Fehler! Antwortzeichenfolge und urspr\u00fcngliche Zeichenfolge nicht identisch
JMSMQ5023 = Antwortzeichenfolge mit urspr\u00fcnglicher Zeichenfolge identisch
JMSMQ5020 = Fehler beim erneuten Lesen der Nachricht; wahrscheinlich war sie nicht vorhanden.
JMSMQ5019 = Nachricht wird erneut gelesen
JMSMQ5022 = Nachricht abgerufen
JMSMQ5027 = Antwortnachricht war keine TextMessage
JMSMQ5025 = Urspr\u00fcngliche Zeichenfolge
JMSMQ5026 = Antwortzeichenfolge
JMSMQ5018 = Nachricht wird gesendet an: ''{0}''
JMSMQ5028 = Falschen Nachrichtentyp abgerufen
JMSMQ5037 = Die JAR-Datei oder Klasse ''{0}'' konnte nicht gefunden werden. Der Grund hierf\u00fcr k\u00f6nnte sein, dass die zugeh\u00f6rige Angabe im Klassenpfad fehlt.
JMSMQ5038 = Die Klasse ''{0}'' konnte nicht gefunden werden. Der Grund hierf\u00fcr k\u00f6nnte sein, dass die Angabe des JNDI-Providers im Klassenpfad fehlt.
JMSMQ5036 = Option ''{0}'' wird ignoriert, kein Wert angegeben
JMSMQ5064 = Parameter '-port' muss numerisch sein.
JMSMQ5058 = Verkn\u00fcpfte Ausnahmebedingung
JMSMQ5007 = QueueConnectionFactory wird erstellt
JMSMQ5009 = Fehler beim Abrufen des QCF-Objekts aus JNDI
JMSMQ5008 = QueueConnectionFactory wird aus JNDI abgerufen
JMSMQ5012 = Warteschlange wird erstellt
JMSMQ5014 = Fehler beim Abrufen des Warteschlangenobjekts aus JNDI
JMSMQ5013 = Warteschlange aus JNDI wird abgerufen
JMSMQ5029 = QueueReceiver wird geschlossen
JMSMQ5016 = QueueReceiver wird erstellt
JMSMQ5030 = QueueSender wird geschlossen
JMSMQ5015 = QueueSender wird erstellt
JMSMQ5031 = Sitzung wird geschlossen
JMSMQ5011 = Sitzung wird erstellt
JMSMQ5004 = Geben Sie den Parameter '-url providerURL' an
JMSMQ5065 = Syntax:
JMSMQ5066 = IVTRun -url providerURL [-icf initialContextFactory] [-t]
JMSMQ5067 = IVTRun -nojndi [-m Warteschlangenmanager] [-t] [-v Provider-Version]
JMSMQ5068 = IVTRun -nojndi -client -m qmgr -host hostname [-port Port] [-channel Kanal] [-ccsid CCS-ID] [-t] [-v Provider-Version]
JMSMQ5005 = Stellen Sie bei Verwendung verwalteter Objekte sicher, dass diese verf\u00fcgbar sind.
JMSMQ5100 = Nachricht
JMSMQ5101 = Klasse
JMSMQ5102 = Stapel
JMSMQ5103 = Verursacht durch [{0}] --> Nachricht
JMSMQ5104 = Fehlercode
JMSMQ5105 = Erl\u00e4uterung
JMSMQ5106 = Benutzeraktion
JMSMQ5107 = Beendigungscode
JMSMQ5108 = Ursachencode
JMSMQ5109 = Nachricht protokollieren
JMSMQ5110 = Erl\u00e4uterung protokollieren
JMSMQ5111 = Dringlichkeit protokollieren
JMSMQ5112 = Zusammenfassung protokollieren
JMSMQ5113 = Benutzeraktion
JMSMQ5114 = {0} wird ausgef\u00fchrt von {1}
JMSMQ5115 = Fehler beim Festlegen der Eigenschaften in der Verbindungsfactory der Warteschlange


#MQJMSPSIVT messages
JMSMQ5039 = Installationsfunktionstest f\u00fcr Publish/Subscribe
JMSMQ5040 = TopicConnectionFactory von JNDI wird abgerufen
JMSMQ5041 = Fehler beim Abrufen des TopicConnectionFactory-Objekts von JNDI
JMSMQ5042 = Thema wird von JNDI abgerufen
JMSMQ5043 = Objekt Thema von JNDI kann nicht abgerufen werden
JMSMQ5044 = TopicConnectionFactory wird erstellt
JMSMQ5045 = TopicConnectionFactory kann nicht erstellt werden
JMSMQ5046 = Thema wird erstellt
JMSMQ5047 = Thema kann nicht mit Nicht-JNDI-Methoden erstellt werden
JMSMQ5048 = TopicPublisher wird erstellt
JMSMQ5049 = TopicSubscriber wird erstellt
JMSMQ5050 = Text wird hinzugef\u00fcgt
JMSMQ5051 = Nachricht wird ver\u00f6ffentlicht f\u00fcr: ''{0}''
JMSMQ5052 = Warten auf anstehende Nachricht [max. 5 Sek.]...
JMSMQ5053 = *** Broker antwortet nicht. Stellen Sie sicher, dass der Broker aktiv ist. Wenn Sie den IBM MQ-Broker verwenden, muss f\u00fcr 'brokerVersion' folgender Wert gesetzt sein: V1 ***
JMSMQ5053.documentation = Keine Antwort vom Broker. \
<br> <b>Erl\u00e4uterung:</b> M\u00f6gliche Ursachen: <sl> <li>Der Broker ist nicht aktiv. \
<li>Sie verwenden 'BrokerVersion=V2' in 'TopicConnectionFactory' mit dem IBM MQ Publish/Subscribe-Broker. Dies wird vom Broker nicht unterst\u00fctzt. \
<li>Der Broker hat die Ver\u00f6ffentlichung oder die Subskription zur\u00fcckgewiesen und in SYSTEM.DEAD.LETTER.QUEUE gestellt. </sl> <br> <b>Benutzeraktion:</b> Stellen Sie sicher, dass der Broker ausgef\u00fchrt wird. \
\u00dcberpr\u00fcfen Sie, ob im Systemereignisprotokoll Broker-Fehlernachrichten enthalten sind. \
\u00dcberpr\u00fcfen Sie, ob der Broker die von Ihnen verwendete Broker-Version unterst\u00fctzt. \
\u00dcberpr\u00fcfen Sie, ob in SYSTEM.DEAD.LETTER.QUEUE zur\u00fcckgewiesene Nachrichten enthalten sind.

JMSMQ5054 = Der Broker ist zwar aktiv, aber die Nachricht ist nicht angekommen.
JMSMQ5054.documentation = Der Broker ist zwar aktiv, aber die Nachricht ist nicht angekommen. \
<br> <b>Erl\u00e4uterung:</b> Diese Nachricht wird w\u00e4hrend des Installationspr\u00fcftests generiert, wenn der Subskribent die ver\u00f6ffentlichte Nachricht nicht empfangen kann. \
<br> <b>Benutzeraktion:</b> \u00dcberpr\u00fcfen Sie, ob der Broker richtig konfiguriert wurde. \
\u00dcberpr\u00fcfen Sie, ob in den Systemereignisprotokollen Broker-Fehlernachrichten enthalten sind. \
\u00dcberpr\u00fcfen Sie, ob in SYSTEM.DEAD.LETTER.QUEUE Nachrichten enthalten sind, die vom Broker zur\u00fcckgewiesen wurden.

JMSMQ5055 = PSIVT fehlgeschlagen!
JMSMQ5056 = TopicSubscriber wird geschlossen
JMSMQ5057 = TopicPublisher wird geschlossen
JMSMQ5059 = PSIVT beendet
JMSMQ5060 = Die Verbindung zum Warteschlangenmanager kann nicht hergestellt werden.
JMSMQ5060.documentation = Die Verbindung zum Warteschlangenmanager kann nicht hergestellt werden. \
<br> <b>Erl\u00e4uterung:</b> Diese Nachricht wird w\u00e4hrend des Installationspr\u00fcftests generiert. \
<br> <b>Benutzeraktion:</b> \u00dcberpr\u00fcfen Sie, ob der Warteschlangenmanager ausgef\u00fchrt wird und ob der zugeh\u00f6rige Name richtig in den IVTTest-Parametern angegeben wurde.

JMSMQ5061 = Zugriff auf Broker-Steuerungswarteschlange auf Warteschlangenmanager nicht m\u00f6glich.
JMSMQ5061.documentation = Der Zugriff auf die Broker-Steuerwarteschlange auf dem Warteschlangenmanager ist nicht m\u00f6glich. \
<br> <b>Benutzeraktion:</b> \u00dcberpr\u00fcfen Sie, ob die Steuerwarteschlange vorhanden ist. \
Der Standardname lautet SYSTEM.BROKER.CONTROL.QUEUE.

JMSMQ5062 = Stellen Sie sicher, dass der Broker auf diesem Warteschlangenmanager installiert ist.
JMSMQ5063 = Ausnahmebedingung in 'brokerIsRunning'
JMSMQ5069 = Syntax:
JMSMQ5070 = PSIVTRun -url providerURL [-icf initialContextFactory] [-t]
JMSMQ5071 = PSIVTRun -nojndi [-m Warteschlangenmanager] [-bqm Broker] [-t] [-v Provider-Version]
JMSMQ5072 = PSIVTRun -nojndi -client -m qmgr -host hostname [-port Port] [-channel Kanal] [-bqm Broker] [-ccsid CCS-ID] [-t] [-v Provider-Version]
JMSMQ5073 = Synchrone Sitzung wird erstellt
JMSMQ5074 = Asynchrone Sitzung wird erstellt
JMSMQ5075 = Verbindung wird hergestellt
JMSMQ5076 = Nachrichtenempfangsprogramm gestartet
JMSMQ5077 = Nachrichtenempfangsprogramm festgelegt
JMSMQ5078 = Host, Port oder Kanal kann nicht ohne Clientverbindung gesetzt werden
JMSMQ5079 = Publish/Subscribe-Dienstprogramm zur Bereinigung
JMSMQ5080 = Syntax:
JMSMQ5081 = Cleanup [-m Warteschlangenmanager] [-r Intervall] [SAFE | STRONG | FORCE | NONDUR] [-t]
JMSMQ5082 = Cleanup -client [-m Warteschlangenmanager] -host Hostname [-port Port] [-channel Kanal]
JMSMQ5083 =         -r Intervall [SAFE | STRONG | FORCE | NONDUR] [-t]
JMSMQ5084 = Bereinigung abgeschlossen
JMSMQ5085 = Ausnahmebedingung w\u00e4hrend Bereinigung:
JMSMQ5086 = Damit verbundene Ausnahmebedingung:
JMSMQ5090 = Angabe von SAFE, STRONG, FORCE oder NONDUR erforderlich
JMSMQ5091 = Angabe des Hostnamens bei Clientverbindung erforderlich
JMSMQ5092 = Nicht numerischer Wert nach ''{0}''
JMSMQ5093 = Nicht erkennbarer Parameter ''{0}''
JMSMQ5094 = Argument nach ''{0}'' erwartet
JMSMQ5095 = IVT fehlgeschlagen, weitere Informationen finden Sie in der vorhergehenden Fehlernachricht.

#MQJMS messages
JMSMQ0003 = Zieladresse nicht bekannt oder nicht mehr g\u00fcltig.
JMSMQ0003.explanation = Die Warteschlange oder das Thema steht m\u00f6glicherweise nicht mehr zur Verf\u00fcgung, die Anwendung verwendet m\u00f6glicherweise eine falsche Verbindung f\u00fcr die Warteschlange oder das Thema bzw. die angegebene Zieladresse weist nicht den richtigen Typ f\u00fcr diese Methode auf.
JMSMQ0003.useraction = Pr\u00fcfen Sie, ob IBM MQ immer noch ausgef\u00fchrt wird und der Warteschlangenmanager verf\u00fcgbar ist. \u00dcberpr\u00fcfen Sie au\u00dferdem, ob f\u00fcr die Warteschlange oder das Thema die richtige Verbindung verwendet wird.
JMSMQ0003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException
JMSMQ0003.documentation = Die Provider-Zieladresse (ProviderDestination) ist nicht bekannt oder nicht mehr g\u00fcltig. \
<br> <b>Erl\u00e4uterung:</b> Die Warteschlange oder das Thema steht m\u00f6glicherweise nicht mehr zur Verf\u00fcgung, die Anwendung verwendet m\u00f6glicherweise eine falsche Verbindung f\u00fcr die Warteschlange oder das Thema bzw. die angegebene Zieladresse weist nicht den richtigen Typ f\u00fcr diese Methode auf. \
<br> <b>Benutzeraktion:</b> \u00dcberpr\u00fcfen Sie, ob IBM MQ weiterhin ausgef\u00fchrt wird und der Warteschlangenmanager verf\u00fcgbar ist. \
\u00dcberpr\u00fcfen Sie au\u00dferdem, ob f\u00fcr die Warteschlange oder das Thema die richtige Verbindung verwendet wird.

JMSMQ1006 = Falscher Wert f\u00fcr ''{0}'': ''{1}''.
JMSMQ1006.explanation = Der f\u00fcr die Eigenschaft angegebene Wert liegt au\u00dferhalb des Bereichs mit g\u00fcltigen Werten.
JMSMQ1006.useraction = \u00dcberpr\u00fcfen Sie den angegebenen Wert.
JMSMQ1006.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_VALUE
JMSMQ1006.documentation = Der Wert f\u00fcr {0}:{1} ist nicht g\u00fcltig. \
<br> <b>Erl\u00e4uterung: </b> Der Wert {1} f\u00fcr die Eigenschaft {0} ist falsch. \
<br> <b>Benutzeraktion: </b> \u00dcberpr\u00fcfen Sie den angegebenen Wert. 

JMSMQ0012 = Die Version kann nicht ge\u00e4ndert werden, sobald die Verbindungsfactory oder die Zieladresse erstellt wurde.
JMSMQ0012.useraction = Geben Sie beim Erstellen der Verbindungsfactory oder der Zieladresse die richtige Version an.
JMSMQ0012.documentation = Die Version kann nicht ge\u00e4ndert werden, sobald die Verbindungsfactory erstellt wurde.

JMSMQ1096 = Falsche Nachrichtenreferenz.
JMSMQ1096.explanation = MessageReference wurde im falschen Format an diese Methode \u00fcbergeben. Die Nachrichtenreferenz muss eine Instanz von MQMessageReference sein.
JMSMQ1096.useraction = Stellen Sie sicher, dass MessageReference im richtigen Format verwendet wird.
JMSMQ1096.documentation = Ung\u00fcltige Nachrichtenreferenz.

JMSMQ1112 = Die Operation f\u00fcr ein dom\u00e4nenspezifisches Objekt war ung\u00fcltig. Die Operation ''{0}'' ist nicht g\u00fcltig f\u00fcr den Typ ''{1}''.
JMSMQ1112.explanation = Eine JMS-Anwendung versuchte, eine Operation f\u00fcr ein dom\u00e4nenspezifisches Objekt durchzuf\u00fchren. Diese Operation ist jedoch nur f\u00fcr die andere Nachrichtendom\u00e4ne g\u00fcltig.
JMSMQ1112.useraction = Stellen Sie sicher, dass die JMS-Objekte und -Operationen, die Ihre Anwendung verwendet, f\u00fcr die erforderliche Nachrichtendom\u00e4ne relevant sind. Falls Ihre Anwendung beide Nachrichtendom\u00e4nen verwendet, empfiehlt es sich, dom\u00e4nenunabh\u00e4ngige Objekte in der gesamten Anwendung zu verwenden.
JMSMQ1112.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_TYPE
JMSMQ1112.documentation = Die Operation f\u00fcr ein dom\u00e4nenspezifisches Objekt war ung\u00fcltig. \
<br> <b>Erl\u00e4uterung:</b> Eine JMS-Anwendung versuchte, eine Operation f\u00fcr ein dom\u00e4nenspezifisches Objekt durchzuf\u00fchren. Diese Operation ist jedoch nur f\u00fcr die andere Nachrichtendom\u00e4ne g\u00fcltig. \
<br> <b>Benutzeraktion:</b> Stellen Sie sicher, dass die JMS-Objekte, die Ihre Anwendung verwendet, f\u00fcr die erforderliche Nachrichtendom\u00e4ne relevant sind. \
Falls Ihre Anwendung beide Nachrichtendom\u00e4nen verwendet, empfiehlt es sich, dom\u00e4nenunabh\u00e4ngige Objekte in der gesamten Anwendung zu verwenden.

JMSMQ1113 = F\u00fcr die Zieladresse wurde kein Name festgelegt.
JMSMQ1113.explanation = Es wurde versucht, ein mit dem Standardkonstruktor erstelltes MQQueue oder MQTopic zu verwenden. Es muss ein Name festgelegt worden sein, bevor die Warteschlange verwendet wird.
JMSMQ1113.useraction = Legen Sie nach dem Erstellen einen Namen bei MQQueue oder MQTopic fest.
JMSMQ1113.documentation = F\u00fcr die Zieladresse wurde kein Name festgelegt. \
<br> <b>Erl\u00e4uterung:</b> Es wurde versucht, ein mit dem Standardkonstruktor erstelltes MQQueue oder MQTopic zu verwenden; vor Verwendung der Warteschlange muss jedoch ein Name festgelegt werden. \
<br> <b>Benutzeraktion:</b> Legen Sie nach dem Erstellen einen Namen bei MQQueue oder MQTopic fest.

JMSMQ1114 = Methode ''{0}'' ist eine interne Methode und darf nicht aufgerufen werden.
JMSMQ1114.explanation = Es wurde versucht, eine Methode zu verwenden, die nur f\u00fcr den internen Gebrauch ist. Diese Methode ist nicht Teil der ver\u00f6ffentlichten API und darf nicht verwendet werden.
JMSMQ1114.useraction = Entfernen Sie diese Methode aus der Anwendung. Weitere Informationen erhalten Sie \u00fcber den IBM Kundendienst.
JMSMQ1114.inserts = XMSC_INSERT_METHOD
JMSMQ1114.documentation = Die angegebene Methode ist eine interne Methode, die nicht aufgerufen werden darf. \
<br> <b>Erl\u00e4uterung:</b> Es wurde versucht, eine Methode zu verwenden, die nur f\u00fcr den internen Gebrauch ist. \
Diese Methode ist nicht Teil der ver\u00f6ffentlichten API und darf nicht verwendet werden. \
<br> <b>Benutzeraktion:</b> Entfernen Sie diese Methode aus der Anwendung. \
Weitere Informationen erhalten Sie \u00fcber den IBM Kundendienst.

JMSMQ1115 = Es wurden keine Komponenten gefunden.
JMSMQ1115.explanation = Vom Komponentenmanager konnten keine Komponenten gefunden werden.
JMSMQ1115.useraction = \u00dcberpr\u00fcfen Sie, ob die Installation und die Konfiguration des Klassenpfads richtig sind.
JMSMQ1115.documentation = Es wurden keine Komponenten gefunden. \
<br> <b>Erl\u00e4uterung:</b> Vom Komponentenmanager konnten keine Komponenten gefunden werden. \
<br> <b>Benutzeraktion:</b> \u00dcberpr\u00fcfen Sie, ob die Installation und die Konfiguration des Klassenpfads richtig sind.

JMSMQ1120 = Die Bereinigungsfunktion wird f\u00fcr die angeforderte Providerversion ''{0}'' nicht unterst\u00fctzt.
JMSMQ1120.explanation = Die \u00fcber 'cleanup' durchgef\u00fchrten Operationen sind f\u00fcr die angeforderte Providerversion nicht erforderlich.
JMSMQ1120.useraction = Stellen Sie sicher, dass die angegebene Providerversion richtig ist.
JMSMQ1120.inserts = XMSC_WMQ_PROVIDER_VERSION
JMSMQ1120.documentation = Die Bereinigungsfunktion wird f\u00fcr die angeforderte Providerversion nicht unterst\u00fctzt. \
<br> <b>Erl\u00e4uterung:</b> Die \u00fcber 'cleanup' durchgef\u00fchrten Operationen sind f\u00fcr die angeforderte Providerversion nicht erforderlich. <br> <b>Benutzeraktion:</b> Stellen Sie sicher, dass die angegebene Providerversion richtig ist.

JMSMQ1121 = Ein Objekt 'ConnectionMetaData' wurde mithilfe eines Konstruktors erstellt und nicht \u00fcber eine Verbindung zugewiesen.
JMSMQ1121.explanation = Die Objekte 'ConnectionMetaData' m\u00fcssen \u00fcber eine Verbindung zugewiesen werden und d\u00fcrfen nicht direkt erstellt werden. \
Die zur\u00fcckgegebenen Versionsinformationen k\u00f6nnen daher falsch sein.
JMSMQ1121.useraction = Lassen Sie das Objekt 'ConnectionMetaData' \u00fcber eine Verbindung zuweisen, oder verwenden Sie die Versions-API zum Abrufen statischer Versionsinformationen.

JMSMQ1122 = Es wurde versucht, eine Eigenschaft festzulegen oder abzufragen, die veraltet ist oder nicht mehr unterst\u00fctzt wird.
JMSMQ1122.explanation = Die Eigenschaft wird nicht mehr vom JMS-Client verwendet, daher werden auch die Methoden zum Festlegen oder Abrufen dieser Eigenschaft nicht mehr aufgerufen.

JMSMQ1123 = Es wird davon ausgegangen, dass die Clientinstallation als JNI-Bibliothek nicht gefunden wurde. 

