# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
#

JMSFMQ0001 = O modo de conex\u00e3o ''{0}'' n\u00e3o \u00e9 suportado para as conex\u00f5es XA.
JMSFMQ0001.explanation = Nem todos os modos de conex\u00e3o s\u00e3o suportados por cada tipo de conex\u00e3o. O XA requer uma conex\u00e3o do modo cliente.
JMSFMQ0001.useraction = Modifique o modo de conex\u00e3o para um valor suportado.
JMSFMQ0001.inserts = XMSC_WMQ_CONNECTION_MODE

JMSFMQ0003 = O n\u00edvel de comando do gerenciador de filas ''{0}'' n\u00e3o correspondeu \u00e0 Vers\u00e3o do Provedor solicitada ''{1}''.
JMSFMQ0003.explanation = A vers\u00e3o especificada do gerenciador de filas no connection factory n\u00e3o corresponde ao gerenciador de filas solicitado. Uma Vers\u00e3o do Provedor 'n\u00e3o-especificada' tentar\u00e1 uma conex\u00e3o em Modo Normal. 
JMSFMQ0003.useraction = Selecione um gerenciador de filas correspondente ou modifique o n\u00edvel de comando solicitado.
JMSFMQ0003.inserts = XMSC_INSERT_COMMAND_LEVEL, XMSC_WMQ_PROVIDER_VERSION

JMSFMQ0004 = O valor do canal de conversa\u00e7\u00f5es compartilhadas ''{0}'' n\u00e3o \u00e9 suportado para a vers\u00e3o do provedor solicitada ''{1}''.
JMSFMQ0004.explanation = O valor especificado para a propriedade do canal de conversa\u00e7\u00f5es compartilhadas n\u00e3o \u00e9 suportado pela Vers\u00e3o do Provedor do gerenciador de filas solicitada. Uma Vers\u00e3o do Provedor 'n\u00e3o-especificada' tentar\u00e1 uma conex\u00e3o em Modo Normal.
JMSFMQ0004.useraction = Selecione uma Vers\u00e3o do Provedor que pode suportar a configura\u00e7\u00e3o solicitada ou altere a configura\u00e7\u00e3o de conversa\u00e7\u00f5es de compartilhamento como um valor suportado.
JMSFMQ0004.inserts = XMSC_INSERT_VALUE, XMSC_WMQ_PROVIDER_VERSION

JMSFMQ0005 = O uso de uma conex\u00e3o do cliente n\u00e3o \u00e9 suportado no ambiente atual.
JMSFMQ0005.explanation = O modo de conex\u00e3o do cliente n\u00e3o \u00e9 suportado em todos os ambientes.
JMSFMQ0005.useraction = Modifique o modo de conex\u00e3o para especificar uma conex\u00e3o de liga\u00e7\u00e3o para um gerenciador de filas locais.

JMSFMQ0007 = Uma propriedade desconhecida ''{0}'' com o valor ''{1}'' foi definida no contexto da propriedade do connection factory.
JMSFMQ0007.explanation = A propriedade ''{0}'' n\u00e3o foi reconhecida - ela pode ser uma propriedade customizada.
JMSFMQ0007.useraction = Certifique-se de que ela deva ser uma propriedade customizada.
JMSFMQ0007.inserts = XMSC_INSERT_KEY, XMSC_INSERT_VALUE

JMSFMQ0010 = O valor ''{0}'' n\u00e3o \u00e9 v\u00e1lido para a propriedade de configura\u00e7\u00e3o do cliente ''{1}'', o valor foi ignorado.
JMSFMQ0010.explanation = Foi feita uma tentativa de configurar uma propriedade de configura\u00e7\u00e3o do cliente fora do intervalo v\u00e1lido.
JMSFMQ0010.useraction = A configura\u00e7\u00e3o deve ser modificada para conter um valor v\u00e1lido. Consulte a documenta\u00e7\u00e3o para obter mais informa\u00e7\u00f5es.
JMSFMQ0010.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_NAME

JMSFMQ1006 = O valor ''{0}'' para a propriedade ''{1}'' n\u00e3o \u00e9 v\u00e1lido.
JMSFMQ1006.explanation = O valor especificado para a propriedade n\u00e3o \u00e9 suportado.
JMSFMQ1006.useraction = Modifique o valor para que esteja no intervalo de valores aceitos.
JMSFMQ1006.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_NAME

JMSFMQ1007 = Uma mensagem de log a partir do Transporte de Tempo Real ''{0}''.
JMSFMQ1007.explanation = O Transporte de Tempo Real registrou em log um erro.
JMSFMQ1007.inserts = XMSC_REAL_TIME_LOG_MSG

JMSFMQ1056 = O tipo de dados da propriedade ou do elemento ''{0}'' n\u00e3o \u00e9 suportado.
JMSFMQ1056.explanation = O tipo de dados do objeto fornecido n\u00e3o \u00e9 aceito para o campo fornecido.  
JMSFMQ1056.useraction = Modifique o objeto para que seja de um tipo aceito.
JMSFMQ1056.inserts = XMSC_INSERT_NAME

JMSFMQ1105 = Uma porta local ''{0}'' n\u00e3o pode ser especificada para uma conex\u00e3o direta a um intermedi\u00e1rio, utilizando multicast.
JMSFMQ1105.explanation = Um n\u00famero de porta foi especificado. Isso n\u00e3o \u00e9 v\u00e1lido para multicast.
JMSFMQ1105.useraction = Remova a refer\u00eancia da porta da configura\u00e7\u00e3o de endere\u00e7o local de multicast.
JMSFMQ1105.inserts = XMSC_WMQ_LOCAL_ADDRESS

JMSFMQ3032 = A reconfigura\u00e7\u00e3o do clientID n\u00e3o \u00e9 permitida.
JMSFMQ3032.explanation = O ID de Cliente de uma conex\u00e3o pode ser configurado apenas uma vez e apenas antes de a conex\u00e3o ser utilizada.
JMSFMQ3032.useraction = Configure o ID do Cliente antes de utilizar a conex\u00e3o.

JMSFMQ3036 = A sele\u00e7\u00e3o da mensagem do lado do intermedi\u00e1rio \u00e9 v\u00e1lida somente ao usar o IBM Integration Bus.
JMSFMQ3036.explanation = A vers\u00e3o do intermedi\u00e1rio e a sele\u00e7\u00e3o de mensagens n\u00e3o s\u00e3o consistentes.
JMSFMQ3036.useraction = Assegure-se de que a vers\u00e3o do intermedi\u00e1rio (JMSC.MQJMS_BROKER_V2) foi configurada no ConnectionFactory.

JMSFMQ3037 = A vers\u00e3o do intermedi\u00e1rio e a vers\u00e3o do provedor foram configuradas simultaneamente - vers\u00e3o do provedor ''{0}'' substituindo a vers\u00e3o do intermedi\u00e1rio ''{1}''.
JMSFMQ3037.explanation = A vers\u00e3o do intermedi\u00e1rio e a vers\u00e3o do provedor n\u00e3o devem ser configuradas simultaneamente.
JMSFMQ3037.useraction = Assegure-se de que a vers\u00e3o do intermedi\u00e1rio ou a vers\u00e3o do provedor tenham sido configuradas no ConnectionFactory, n\u00e3o ambas.
JMSFMQ3037.inserts = XMSC_WMQ_PROVIDER_VERSION, XMSC_WMQ_BROKER_VERSION

JMSFMQ6115 = Ocorreu uma exce\u00e7\u00e3o ao criar o TopicConnection.
JMSFMQ6115.useraction = Consulte a exce\u00e7\u00e3o vinculada para obter informa\u00e7\u00f5es adicionais.

JMSFMQ6311 = O tipo de transporte 'DIRECT' em uma transa\u00e7\u00e3o n\u00e3o \u00e9 suportado.
JMSFMQ6311.explanation = O aplicativo tentou utilizar um m\u00e9todo transacional. Isso n\u00e3o \u00e9 suportado em um tipo de transporte DirectIP.
JMSFMQ6311.useraction = O aplicativo deve ser modificado para evitar o uso das transa\u00e7\u00f5es.

JMSFMQ6312 = Ocorreu uma exce\u00e7\u00e3o no Java(tm) MQI.
JMSFMQ6312.explanation = O Java(tm) MQI emitiu uma exce\u00e7\u00e3o descrevendo o problema. 
JMSFMQ6312.useraction = Consulte a exce\u00e7\u00e3o vinculada para obter informa\u00e7\u00f5es adicionais.

JMSFMQ6313 = Foi estabelecida uma Conex\u00e3o do WMQ de tipo ''{0}''.
JMSFMQ6313.inserts = XMSC_INSERT_VALUE
JMSFMQ6313.explanation = Uma Conex\u00e3o pode ser de Modo Normal ou de Modo de Migra\u00e7\u00e3o.
JMSFMQ6313.useraction = Se este n\u00e3o for o tipo de conex\u00e3o esperado, procure no Centro de Informa\u00e7\u00f5es o t\u00f3pico jm41140_ para obter informa\u00e7\u00f5es adicionais.

JMSFMQ6314 = A Vers\u00e3o do Provedor fornecida pela Connection Factory de ''{0}'' foi substitu\u00edda para ''{1}''.
JMSFMQ6314.inserts = XMSC_WMQ_PROVIDER_VERSION,XMSC_INSERT_NAME
JMSFMQ6314.explanation = A Vers\u00e3o do Provedor da Connection Factory pode ser substitu\u00edda pela Propriedade de Configura\u00e7\u00e3o do Cliente.
JMSFMQ6314.useraction = Nenhum; esta \u00e9 uma mensagem de informa\u00e7\u00e3o para indicar que uma propriedade foi substitu\u00edda.

JMSFMQ6315 = Vers\u00e3o do Provedor substitu\u00edda para 6.0.0.0 como Vers\u00e3o do Intermedi\u00e1rio configurada como V2 e BrokerQmgr presente na ConnectionFactory.
JMSFMQ6315.explanation = A Vers\u00e3o do Provedor da Connection Factory foi alterada com base em outras propriedades na Connection Factory.
JMSFMQ6315.useraction = Nenhum; esta \u00e9 uma mensagem de informa\u00e7\u00e3o para indicar que uma propriedade foi substitu\u00edda.

JMSFMQ6316 = O Modo de Assinatura de Publica\u00e7\u00e3o do Gerenciador de Filas \u00e9 o modo ''{0}'', portanto, ''{1}'' \u00e9 necess\u00e1rio para a fun\u00e7\u00e3o Assinatura de Publica\u00e7\u00e3o.
JMSFMQ6316.inserts = XMSC_INSERT_TYPE,XMSC_INSERT_OTHER_TYPE
JMSFMQ6316.explanation = Com base no modo de Assinatura Publicada do Gerenciador de Filas, foi tomada uma decis\u00e3o sobre o uso do modo Normal ou de Migra\u00e7\u00e3o.
JMSFMQ6316.useraction = Nenhum; esta \u00e9 uma mensagem de informa\u00e7\u00e3o. Procure no Centro de Informa\u00e7\u00f5es o t\u00f3pico jm41140_ para obter informa\u00e7\u00f5es adicionais.

JMSFMQ6317 = N\u00e3o \u00e9 poss\u00edvel abrir o modo ''{0}'' de BrokerControlQ, portanto, o Modo Normal \u00e9 necess\u00e1rio para a fun\u00e7\u00e3o de Assinatura de Publica\u00e7\u00e3o.
JMSFMQ6317.inserts = XMSC_INSERT_TYPE
JMSFMQ6317.explanation = Com base no modo de Assinatura Publicada do Gerenciador de Filas, foi tomada uma decis\u00e3o sobre o uso do modo Normal ou de Migra\u00e7\u00e3o.
JMSFMQ6317.useraction = Nenhum; esta \u00e9 uma mensagem de informa\u00e7\u00e3o. Procure no Centro de Informa\u00e7\u00f5es o t\u00f3pico jm41140_ para obter informa\u00e7\u00f5es adicionais.

JMSFMQ6318 = N\u00e3o \u00e9 poss\u00edvel integrar com o WMQ Server Trace Control ''{0}'' .
JMSFMQ6318.inserts = Exce\u00e7\u00e3o
JMSFMQ6318.explanation = N\u00e3o foi poss\u00edvel conectar ao WMQ Server Trace.
JMSFMQ6318.useraction = Verifique o caminho de classe para certificar-se de que o com.ibm.mq.commonservices.jar esteja presente.
