# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
#

JMSFMQ0001 = Le mode de connexion ''{0}'' n''est pas pris en charge pour les connexions XA.
JMSFMQ0001.explanation = Les modes de connexion ne sont pas tous pris en charge par chaque type de connexion. XA requiert une connexion en mode client.
JMSFMQ0001.useraction = Remplacez le mode de connexion par une valeur prise en charge.
JMSFMQ0001.inserts = XMSC_WMQ_CONNECTION_MODE

JMSFMQ0003 = Le niveau de commande ''{0}'' du gestionnaire de files d''attente ne correspondait pas \u00e0 la version de fournisseur ''{1}'' demand\u00e9e.
JMSFMQ0003.explanation = La version de gestionnaire de files d'attente sp\u00e9cifi\u00e9e dans la fabrique de connexions ne correspond pas au gestionnaire de files d'attente demand\u00e9. Une version de fournisseur 'non sp\u00e9cifi\u00e9e' va tenter une  connexion en mode normal. 
JMSFMQ0003.useraction = S\u00e9lectionnez un gestionnaire de files d'attente correspondant ou modifiez le niveau de commande demand\u00e9.
JMSFMQ0003.inserts = XMSC_INSERT_COMMAND_LEVEL, XMSC_WMQ_PROVIDER_VERSION

JMSFMQ0004 = La valeur du canal de partage des conversations ''{0}'' n''est pas prise en charge pour la version de fournisseur ''{1}'' demand\u00e9e.
JMSFMQ0004.explanation = La valeur sp\u00e9cifi\u00e9e pour la propri\u00e9t\u00e9 du canal de partage des conversations n'est pas prise en charge par la Version de fournisseur de gestionnaire de files d'attente demand\u00e9e. Une version de fournisseur 'non sp\u00e9cifi\u00e9e' va tenter une  connexion en mode normal.
JMSFMQ0004.useraction = S\u00e9lectionnez une Version de fournisseur pouvant prendre en charge le param\u00e8tre demand\u00e9 ou affectez au param\u00e8tre de partage des conversations une valeur prise en charge.
JMSFMQ0004.inserts = XMSC_INSERT_VALUE, XMSC_WMQ_PROVIDER_VERSION

JMSFMQ0005 = L'utilisation d'une connexion client n'est pas prise en charge dans l'environnement actuel.
JMSFMQ0005.explanation = Le mode de connexion client n'est pas pris en charge dans tous les environnements.
JMSFMQ0005.useraction = Modifiez le mode de connexion pour sp\u00e9cifier une connexion de liaisons avec un gestionnaire de files d'attente local.

JMSFMQ0007 = Une propri\u00e9t\u00e9 inconnue ''{0}'' associ\u00e9e \u00e0 la valeur ''{1}'' a \u00e9t\u00e9 d\u00e9finie sur le contexte de la propri\u00e9t\u00e9 des fabriques de connexions.
JMSFMQ0007.explanation = La propri\u00e9t\u00e9 ''{0}'' n''a pas \u00e9t\u00e9 reconnue. Il s''agit peut-\u00eatre d''une propri\u00e9t\u00e9 personnalis\u00e9e.
JMSFMQ0007.useraction = V\u00e9rifiez qu'il s'agit bien d'une propri\u00e9t\u00e9 personnalis\u00e9e.
JMSFMQ0007.inserts = XMSC_INSERT_KEY, XMSC_INSERT_VALUE

JMSFMQ0010 = La valeur ''{0}'' n''est pas valide pour la propri\u00e9t\u00e9 de configuration client ''{1}'' ; elle a \u00e9t\u00e9 ignor\u00e9e.
JMSFMQ0010.explanation = Tentative de d\u00e9finition d'une propri\u00e9t\u00e9 de configuration client en dehors de sa plage valide.
JMSFMQ0010.useraction = Ce param\u00e8tre doit \u00eatre modifi\u00e9 de sorte \u00e0 contenir une valeur valide. Pour plus d'informations, reportez-vous \u00e0 la documentation.
JMSFMQ0010.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_NAME

JMSFMQ1006 = La valeur ''{0}'' de la propri\u00e9t\u00e9 ''{1}'' n''est pas valide.
JMSFMQ1006.explanation = La valeur sp\u00e9cifi\u00e9e pour la propri\u00e9t\u00e9 n'est pas prise en charge.
JMSFMQ1006.useraction = Modifiez la valeur pour qu'elle se trouve dans la plage des valeurs accept\u00e9es.
JMSFMQ1006.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_NAME

JMSFMQ1007 = Message de journal du syst\u00e8me RTT (Real Time Transport) ''{0}''.
JMSFMQ1007.explanation = Real Time Transport a consign\u00e9 une erreur.
JMSFMQ1007.inserts = XMSC_REAL_TIME_LOG_MSG

JMSFMQ1056 = Type de donn\u00e9es de propri\u00e9t\u00e9 ou d''\u00e9l\u00e9ment non pris en charge : ''{0}''.
JMSFMQ1056.explanation = Le type de donn\u00e9es de l'objet donn\u00e9 n'est pas accept\u00e9 pour la zone donn\u00e9e.  
JMSFMQ1056.useraction = Modifiez l'objet pour que son type soit accept\u00e9.
JMSFMQ1056.inserts = XMSC_INSERT_NAME

JMSFMQ1105 = Le port local ''{0}'' ne peut pas \u00eatre sp\u00e9cifi\u00e9 pour une connexion directe \u00e0 un courtier \u00e0 l''aide de la multidiffusion.
JMSFMQ1105.explanation = Un num\u00e9ro de port a \u00e9t\u00e9 sp\u00e9cifi\u00e9. Cette action n'est pas valide pour la multidiffusion.
JMSFMQ1105.useraction = Supprimez la r\u00e9f\u00e9rence de port du param\u00e8tre d'adresse locale de la multidiffusion.
JMSFMQ1105.inserts = XMSC_WMQ_LOCAL_ADDRESS

JMSFMQ3032 = Red\u00e9finition de l'ID client non admise.
JMSFMQ3032.explanation = L'ID client d'une connexion ne peut \u00eatre d\u00e9fini qu'une seule fois, et uniquement avant que la connexion ne soit utilis\u00e9e.
JMSFMQ3032.useraction = D\u00e9finissez l'ID client avant d'utiliser la connexion.

JMSFMQ3036 = La s\u00e9lection du message c\u00f4t\u00e9 courtier n'est valide qu'en cas d'utilisation d'IBM Integration Bus.
JMSFMQ3036.explanation = La version du courtier et le message s\u00e9lectionn\u00e9 ne sont pas compatibles.
JMSFMQ3036.useraction = V\u00e9rifiez que la version du courtier (JMSC.MQJMS_BROKER_V2) a \u00e9t\u00e9 d\u00e9finie dans la fabrique de connexions.

JMSFMQ3037 = Version du courtier et version du fournisseur d\u00e9finies simultan\u00e9ment : la version du fournisseur ''{0}'' remplace la version du courtier ''{1}''.
JMSFMQ3037.explanation = Les versions du courtier et du fournisseur ne doivent pas \u00eatre d\u00e9finies simultan\u00e9ment.
JMSFMQ3037.useraction = V\u00e9rifiez que la version du courtier ou la version du fournisseur a \u00e9t\u00e9 d\u00e9finie dans la fabrique de connexions, mais pas les deux versions.
JMSFMQ3037.inserts = XMSC_WMQ_PROVIDER_VERSION, XMSC_WMQ_BROKER_VERSION

JMSFMQ6115 = Une exception s'est produite lors de la cr\u00e9ation de TopicConnection.
JMSFMQ6115.useraction = Reportez-vous \u00e0 l'exception associ\u00e9e pour plus d'informations.

JMSFMQ6311 = Le type de transport 'DIRECT' n'est pas pris en charge dans une transaction.
JMSFMQ6311.explanation = L'application a tent\u00e9 d'utiliser une m\u00e9thode transactionnelle. Cette op\u00e9ration n'est pas prise en charge avec un type de transport DirectIP.
JMSFMQ6311.useraction = L'application doit \u00eatre modifi\u00e9e pour emp\u00eacher l'utilisation des transactions.

JMSFMQ6312 = Une exception s'est produite dans l'interface MQI Java(tm).
JMSFMQ6312.explanation = L'interface MQI Java(tm) a g\u00e9n\u00e9r\u00e9 une exception d\u00e9crivant l'incident. 
JMSFMQ6312.useraction = Reportez-vous \u00e0 l'exception associ\u00e9e pour plus d'informations.

JMSFMQ6313 = Une connexion WMQ de type ''{0}'' a \u00e9t\u00e9 \u00e9tablie.
JMSFMQ6313.inserts = XMSC_INSERT_VALUE
JMSFMQ6313.explanation = Le type de la connexion peut \u00eatre le mode normal ou le mode de migration.
JMSFMQ6313.useraction = S'il ne s'agit pas du type de connexion attendu, recherchez la rubrique jm41140_ dans le centre de documentation pour plus d'informations.

JMSFMQ6314 = La Version de fournisseur ''{0}'' fournie par la fabrique de connexions a \u00e9t\u00e9 remplac\u00e9e par ''{1}''.
JMSFMQ6314.inserts = XMSC_WMQ_PROVIDER_VERSION,XMSC_INSERT_NAME
JMSFMQ6314.explanation = La Version de fournisseur de la fabrique de connexions peut \u00eatre remplac\u00e9e par la propri\u00e9t\u00e9 de configuration client.
JMSFMQ6314.useraction = Aucune. Il s'agit d'un message d'information indiquant qu'une propri\u00e9t\u00e9 a \u00e9t\u00e9 remplac\u00e9e.

JMSFMQ6315 = La version de fournisseur a \u00e9t\u00e9 remplac\u00e9e par 6.0.0.0 puisque la version de courtier est V2 et que BrokerQmgr est pr\u00e9sent dans la fabrique de connexions
JMSFMQ6315.explanation = La version de fournisseur de la fabrique de connexions a \u00e9t\u00e9 modifi\u00e9e sur la base d'autres propri\u00e9t\u00e9s dans la fabrique de connexions.
JMSFMQ6315.useraction = Aucune. Il s'agit d'un message d'information indiquant qu'une propri\u00e9t\u00e9 a \u00e9t\u00e9 remplac\u00e9e.

JMSFMQ6316 = Le mode publication/abonnement du gestionnaire de files d''attente correspond au mode ''{0}'', ''{1}'' est par cons\u00e9quent requis pour la fonction de publication/abonnement.
JMSFMQ6316.inserts = XMSC_INSERT_TYPE,XMSC_INSERT_OTHER_TYPE
JMSFMQ6316.explanation = Une d\u00e9cision, bas\u00e9e sur le mode publication/abonnement du gestionnaire de files d'attente, a \u00e9t\u00e9 prise concernant l'utilisation du mode normal ou du mode de migration.
JMSFMQ6316.useraction = Aucune ; il s'agit d'un message d'information. Pour plus d'informations, recherchez la rubrique jm41140_ dans le centre de documentation.

JMSFMQ6317 = Impossible d''ouvrir le mode ''{0}'' BrokerControlQ. Le mode normal est par cons\u00e9quent requis pour la fonction de publication/abonnement.
JMSFMQ6317.inserts = XMSC_INSERT_TYPE
JMSFMQ6317.explanation = Une d\u00e9cision, bas\u00e9e sur le mode publication/abonnement du gestionnaire de files d'attente, a \u00e9t\u00e9 prise concernant l'utilisation du mode normal ou du mode de migration.
JMSFMQ6317.useraction = Aucune ; il s'agit d'un message d'information. Pour plus d'informations, recherchez la rubrique  jm41140_ dans le centre de documentation.

JMSFMQ6318 = Impossible de s''int\u00e9grer \u00e0 WMQ Server Trace Control ''{0}'' .
JMSFMQ6318.inserts = Exception
JMSFMQ6318.explanation = Il n'a pas \u00e9t\u00e9 possible de se connecter \u00e0 WMQ Server Trace.
JMSFMQ6318.useraction = V\u00e9rifiez le chemin d'acc\u00e8s aux classes pour vous assurer que com.ibm.mq.commonservices.jar est pr\u00e9sent.
