# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
#

JMSFMQ0001 = U p\u0159ipojen\u00ed XA nen\u00ed podporov\u00e1n re\u017eim p\u0159ipojen\u00ed {0}.
JMSFMQ0001.explanation = Jednotliv\u00e9 typy p\u0159ipojen\u00ed nemus\u00ed podporovat v\u0161echny re\u017eimy p\u0159ipojen\u00ed. P\u0159ipojen\u00ed XA mus\u00ed pracovat v re\u017eimu klienta.
JMSFMQ0001.useraction = Zm\u011b\u0148te re\u017eim p\u0159ipojen\u00ed na podporovanou hodnotu.
JMSFMQ0001.inserts = XMSC_WMQ_CONNECTION_MODE

JMSFMQ0003 = \u00darove\u0148 p\u0159\u00edkaz\u016f spr\u00e1vce front ''{0}'' neodpov\u00eddala po\u017eadovan\u00e9 verzi poskytovatele ''{1}''.
JMSFMQ0003.explanation = Verze spr\u00e1vce front ur\u010den\u00e1 v tov\u00e1rn\u011b p\u0159ipojen\u00ed neodpov\u00edd\u00e1 po\u017eadovan\u00e9mu spr\u00e1vci front. Verze poskytovatele 'nespecifikov\u00e1no' vede k pokusu o p\u0159ipojen\u00ed v b\u011b\u017en\u00e9m re\u017eimu. 
JMSFMQ0003.useraction = Vyberte odpov\u00eddaj\u00edc\u00edho spr\u00e1vce front nebo zm\u011b\u0148te po\u017eadovanou \u00farove\u0148 p\u0159\u00edkaz\u016f.
JMSFMQ0003.inserts = XMSC_INSERT_COMMAND_LEVEL, XMSC_WMQ_PROVIDER_VERSION

JMSFMQ0004 = Hodnota kan\u00e1lu konverzac\u00ed sd\u00edlen\u00ed ''{0}'' nen\u00ed u po\u017eadovan\u00e9 verze poskytovatele ''{1}'' podporov\u00e1na.
JMSFMQ0004.explanation = Po\u017eadovan\u00e1 verze poskytovatele spr\u00e1vce front nepodporuje zadanou hodnotu vlastnosti kan\u00e1lu konverzac\u00ed sd\u00edlen\u00ed. Verze poskytovatele 'nespecifikov\u00e1no' vede k pokusu o p\u0159ipojen\u00ed v b\u011b\u017en\u00e9m re\u017eimu.
JMSFMQ0004.useraction = Vyberte verzi poskytovatele, kter\u00e1 podporuje po\u017eadovan\u00e9 nastaven\u00ed, nebo zm\u011b\u0148te nastaven\u00ed konverzac\u00ed sd\u00edlen\u00ed na podporovanou hodnotu.
JMSFMQ0004.inserts = XMSC_INSERT_VALUE, XMSC_WMQ_PROVIDER_VERSION

JMSFMQ0005 = Pou\u017eit\u00ed p\u0159ipojen\u00ed klienta nen\u00ed v aktu\u00e1ln\u00edm prost\u0159ed\u00ed podporov\u00e1no.
JMSFMQ0005.explanation = Re\u017eim p\u0159ipojen\u00ed klienta nen\u00ed podporov\u00e1n ve v\u0161ech prost\u0159ed\u00edch.
JMSFMQ0005.useraction = Zm\u011b\u0148te re\u017eim p\u0159ipojen\u00ed na p\u0159ipojen\u00ed vazeb k lok\u00e1ln\u00edmu spr\u00e1vci front.

JMSFMQ0007 = Nezn\u00e1m\u00e1 vlastnost ''{0}'' s hodnotou ''{1}'' byla nastavena pro kontext vlastnosti tov\u00e1rny p\u0159ipojen\u00ed.
JMSFMQ0007.explanation = Vlastnost ''{0}'' nebyla rozpozn\u00e1na, m\u016f\u017ee se jednat o u\u017eivatelskou vlastnost.
JMSFMQ0007.useraction = Zkontrolujte, zda se m\u00e1 opravdu jednat o u\u017eivatelskou vlastnost.
JMSFMQ0007.inserts = XMSC_INSERT_KEY, XMSC_INSERT_VALUE

JMSFMQ0010 = Hodnota ''{0}'' vlastnosti konfigurace klienta ''{1}'' je neplatn\u00e1 a byla ignorov\u00e1na.
JMSFMQ0010.explanation = Do\u0161lo k pokusu o nastaven\u00ed vlastnosti konfigurace klienta mimo platn\u00fd rozsah.
JMSFMQ0010.useraction = Nastaven\u00ed je nutn\u00e9 upravit tak, aby obsahovalo platnou hodnotu. Dal\u0161\u00ed informace naleznete v dokumentaci.
JMSFMQ0010.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_NAME

JMSFMQ1006 = Hodnota {0} vlastnosti {1} je neplatn\u00e1.
JMSFMQ1006.explanation = Zadan\u00e1 hodnota vlastnosti nen\u00ed podporov\u00e1na.
JMSFMQ1006.useraction = Zm\u011b\u0148te hodnotu tak, aby se nach\u00e1zela v rozsahu povolen\u00fdch hodnot.
JMSFMQ1006.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_NAME

JMSFMQ1007 = Zpr\u00e1va protokolu z funkce transportu v re\u00e1ln\u00e9m \u010dase ''{0}''.
JMSFMQ1007.explanation = Funkce transportu v re\u00e1ln\u00e9m \u010dase zaznamenala chybu.
JMSFMQ1007.inserts = XMSC_REAL_TIME_LOG_MSG

JMSFMQ1056 = Nepodporovan\u00e1 vlastnost nebo datov\u00fd typ prvku {0}
JMSFMQ1056.explanation = Datov\u00fd typ dan\u00e9ho objektu nelze v tomto poli pou\u017e\u00edt. 
JMSFMQ1056.useraction = Zm\u011b\u0148te objekt na povolen\u00fd typ.
JMSFMQ1056.inserts = XMSC_INSERT_NAME

JMSFMQ1105 = Pro p\u0159\u00edm\u00e9 p\u0159ipojen\u00ed k zprost\u0159edkovateli pomoc\u00ed v\u00fdb\u011brov\u00e9ho vys\u00edl\u00e1n\u00ed nelze zadat lok\u00e1ln\u00ed port {0}.
JMSFMQ1105.explanation = Bylo zad\u00e1no \u010d\u00edslo portu. Tento postup nen\u00ed u v\u00fdb\u011brov\u00e9ho vys\u00edl\u00e1n\u00ed platn\u00fd.
JMSFMQ1105.useraction = Odeberte odkaz na port z nastaven\u00ed lok\u00e1ln\u00ed adresy pro v\u00fdb\u011brov\u00e9 vys\u00edl\u00e1n\u00ed.
JMSFMQ1105.inserts = XMSC_WMQ_LOCAL_ADDRESS

JMSFMQ3032 = Resetov\u00e1n\u00ed polo\u017eky clientID nen\u00ed povoleno.
JMSFMQ3032.explanation = ID klienta pro p\u0159ipojen\u00ed lze nastavit pouze jednou, a to p\u0159ed pou\u017eit\u00edm p\u0159ipojen\u00ed.
JMSFMQ3032.useraction = Nastavte ID klienta p\u0159ed pou\u017eit\u00edm p\u0159ipojen\u00ed.

JMSFMQ3036 = V\u00fdb\u011br zpr\u00e1vy na stran\u011b zprost\u0159edkovatele je platn\u00fd jen p\u0159i pou\u017eit\u00ed sb\u011brnice IBM Integration Bus.
JMSFMQ3036.explanation = Verze zprost\u0159edkovatele nen\u00ed konzistentn\u00ed s v\u00fdb\u011brem zpr\u00e1v.
JMSFMQ3036.useraction = Zajist\u011bte nastaven\u00ed verze zprost\u0159edkovatele (JMSC.MQJMS_BROKER_V2) ve faktorii p\u0159ipojen\u00ed.

JMSFMQ3037 = Byla sou\u010dasn\u011b nastavena verze zprost\u0159edkovatele a verze poskytovatele. Verze poskytovatele {0} potla\u010d\u00ed verzi zprost\u0159edkovatele {1}.
JMSFMQ3037.explanation = Verze zprost\u0159edkovatele by nem\u011bla b\u00fdt nastavena soub\u011b\u017en\u011b s verz\u00ed poskytovatele.
JMSFMQ3037.useraction = Zajist\u011bte, aby byla ve faktorii p\u0159ipojen\u00ed nastavena bu\u010f verze zprost\u0159edkovatele, nebo verze poskytovatele, nikoli ob\u011b verze sou\u010dasn\u011b.
JMSFMQ3037.inserts = XMSC_WMQ_PROVIDER_VERSION, XMSC_WMQ_BROKER_VERSION

JMSFMQ6115 = P\u0159i vytvo\u0159en\u00ed objektu TopicConnection se vyskytla v\u00fdjimka.
JMSFMQ6115.useraction = Dal\u0161\u00ed informace naleznete v propojen\u00e9 v\u00fdjimce.

JMSFMQ6311 = Typ transportu 'DIRECT' v r\u00e1mci transakce nen\u00ed podporov\u00e1n.
JMSFMQ6311.explanation = Aplikace se pokusila pou\u017e\u00edt transak\u010dn\u00ed metodu. U typu transportu DirectIP nen\u00ed tento postup podporov\u00e1n.
JMSFMQ6311.useraction = M\u011bli byste upravit aplikaci tak, aby nepou\u017e\u00edvala transakce.

JMSFMQ6312 = V rozhran\u00ed Java(tm) MQI se vyskytla v\u00fdjimka.
JMSFMQ6312.explanation = Rozhran\u00ed Java(tm) MQI vygenerovalo v\u00fdjimku popisuj\u00edc\u00ed vznikl\u00fd probl\u00e9m. 
JMSFMQ6312.useraction = Dal\u0161\u00ed informace naleznete v propojen\u00e9 v\u00fdjimce.

JMSFMQ6313 = Bylo provedeno p\u0159ipojen\u00ed WMQ typu ''{0}''.
JMSFMQ6313.inserts = XMSC_INSERT_VALUE
JMSFMQ6313.explanation = P\u0159ipojen\u00ed m\u016f\u017ee b\u00fdt v b\u011b\u017en\u00e9m re\u017eimu nebo v re\u017eimu migrace.
JMSFMQ6313.useraction = V p\u0159\u00edpad\u011b, \u017ee se nejedn\u00e1 o o\u010dek\u00e1van\u00fd typ p\u0159ipojen\u00ed, naleznete dal\u0161\u00ed informace v t\u00e9matu jm41140_ v Informa\u010dn\u00edm centru.

JMSFMQ6314 = Verze poskytovatele ''{0}'' ur\u010den\u00e1 tov\u00e1rnou p\u0159ipojen\u00ed byla p\u0159eps\u00e1na na hodnotu ''{1}''.
JMSFMQ6314.inserts = XMSC_WMQ_PROVIDER_VERSION,XMSC_INSERT_NAME
JMSFMQ6314.explanation = Verzi poskytovatele tov\u00e1rny p\u0159ipojen\u00ed lze p\u0159epsat pomoc\u00ed vlastnosti konfigurace klienta.
JMSFMQ6314.useraction = Nevy\u017eadov\u00e1na; jedn\u00e1 se o informa\u010dn\u00ed zpr\u00e1vu, kter\u00e1 oznamuje, \u017ee do\u0161lo k p\u0159eps\u00e1n\u00ed vlastnosti.

JMSFMQ6315 = Verze poskytovatele byla p\u0159eps\u00e1na na hodnotu 6.0.0.0, proto\u017ee verze zprost\u0159edkovatele je nastavena na hodnotu V2 a ve faktorii p\u0159ipojen\u00ed se nach\u00e1z\u00ed spr\u00e1vce front zprost\u0159edkovatele.
JMSFMQ6315.explanation = Verze poskytovatele tov\u00e1rny p\u0159ipojen\u00ed byla zm\u011bn\u011bna na z\u00e1klad\u011b ostatn\u00edch vlastnost\u00ed ve faktorii p\u0159ipojen\u00ed.
JMSFMQ6315.useraction = Nevy\u017eadov\u00e1na; jedn\u00e1 se o informa\u010dn\u00ed zpr\u00e1vu, kter\u00e1 oznamuje, \u017ee do\u0161lo k p\u0159eps\u00e1n\u00ed vlastnosti.

JMSFMQ6316 = Vzhledem k tomu, \u017ee re\u017eim publikov\u00e1n\u00ed/odb\u011bru spr\u00e1vce front m\u00e1 hodnotu ''{0}'', je pro funkci publikov\u00e1n\u00ed/odb\u011br vy\u017eadov\u00e1na hodnota ''{1}''.
JMSFMQ6316.inserts = XMSC_INSERT_TYPE,XMSC_INSERT_OTHER_TYPE
JMSFMQ6316.explanation = Na z\u00e1klad\u011b re\u017eimu publikov\u00e1n\u00ed/odb\u011bru spr\u00e1vce front byl zvolen b\u011b\u017en\u00fd re\u017eim nebo re\u017eim migrace.
JMSFMQ6316.useraction = Nevy\u017eadov\u00e1na; jedn\u00e1 se o informa\u010dn\u00ed zpr\u00e1vu. Dal\u0161\u00ed informace naleznete v t\u00e9matu jm41140_ v Informa\u010dn\u00edm centru.

JMSFMQ6317 = Otev\u0159en\u00ed re\u017eimu ''{0}'' fronty \u0159\u00edzen\u00ed zprost\u0159edkovatele se nezda\u0159ilo, pro funkci publikov\u00e1n\u00ed/odb\u011br je proto vy\u017eadov\u00e1n b\u011b\u017en\u00fd re\u017eim.
JMSFMQ6317.inserts = XMSC_INSERT_TYPE
JMSFMQ6317.explanation = Na z\u00e1klad\u011b re\u017eimu publikov\u00e1n\u00ed/odb\u011bru spr\u00e1vce front byl zvolen b\u011b\u017en\u00fd re\u017eim nebo re\u017eim migrace.
JMSFMQ6317.useraction = Nevy\u017eadov\u00e1na; jedn\u00e1 se o informa\u010dn\u00ed zpr\u00e1vu. Dal\u0161\u00ed informace naleznete v t\u00e9matu jm41140_ v Informa\u010dn\u00edm centru.

JMSFMQ6318 = Nelze prov\u00e9st integraci s \u0159\u00edzen\u00edm trasov\u00e1n\u00ed serveru WMQ {0}.
JMSFMQ6318.inserts = V\u00fdjimka
JMSFMQ6318.explanation = Nav\u00e1z\u00e1n\u00ed p\u0159ipojen\u00ed k trasov\u00e1n\u00ed serveru WMQ se nezda\u0159ilo.
JMSFMQ6318.useraction = Zkontroluje, zda je v cest\u011b k t\u0159\u00edd\u011b p\u0159\u00edtomen soubor com.ibm.mq.commonservices.jar.
