# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright>  
#
# Messages produced by the IBM MQ Java interface classes
# (shared by bindings and by client)
# Messages beginning with MQJI are explanations for exceptions
# Messages beginning with MQJE are errors
#
# From class MQDistributionList
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
MQJI001=MQJI001: L'objet gestionnaire de files d'attente \u00e9tait nul.
MQJI002=MQJI002: Pas de connexion \u00e0 un gestionnaire de files d'attente.
MQJI003=MQJI003: Aucun enregistrement d'objet fourni.
MQJI006=MQJI006: Un enregistrement de r\u00e9ponse ou d'objet \u00e9tait nul.
MQJI008=MQJI008: Message null transmis en insertion.
MQJI009=MQJI009: Options de message null transmises en insertion.
MQJI011=MQJI011: La liste de distribution a \u00e9t\u00e9 ferm\u00e9e.
#
# From class MQGetMessageOptions
#
MQJI013=MQJI013: Num\u00e9ro de version non pris en charge - ''{0}''.
MQJI014=MQJI014: Donn\u00e9es re\u00e7ues du gestionnaire de files d'attente insuffisantes.
MQJI015=MQJI015: Label erron\u00e9 : ''{0}''.
#
# From class MQManagedObject
#
MQJI016=MQJI016: L'objet a \u00e9t\u00e9 ferm\u00e9.
MQJI017=MQJI017: Aucun s\u00e9lecteur indiqu\u00e9.
#
# From class MQOD
#
MQJI022=MQJI022: Le nombre d'enregistrements d'objet et de r\u00e9ponse ne correspondent pas.
#
# From class MQPutMessageOptions
#
MQJI023=MQJI023: L'objet MQMessageTracker fourni \u00e9tait null.
#
# From class MQMessageTracker
#
MQJI024=MQJI024: Erreur de copie de tableau dans MQMessageTracker.
#
# From class MQQueue
#
MQJI025=MQJI025: MQMessage null transmis pour extraction.
MQJI026=MQJI026: MQGetMessageOptions null transmis pour extraction.
MQJI027=MQJI027: La file d'attente a \u00e9t\u00e9 ferm\u00e9e.
MQJI028=MQJI028: MQMessage null transmis pour insertion.
MQJI029=MQJI029: MQPutMessageOptions null transmis pour insertion.
#
# From class MQQueueManager
#
MQJI030=MQJI030: Le gestionnaire de files d'attente ne prend pas en charge les listes de distribution.
#
# From class MQException
#
MQJE001b=MQJE001: Code ach\u00e8vement ''{0}'', Motif ''{1}''.
MQJE001=MQJE001: MQException : Code ach\u00e8vement ''{0}'', motif ''{1}''\n ''{2}''.
#
# Messages produced by client only classes...
#
MQJI038=MQJI038: Erreur interne inattendue lors du traitement de l'index de cha\u00eene.
MQJE002=MQJE002: Flux en sortie de socket null.
MQJE003=MQJE003: Erreur d'E-S lors de la transmission de la m\u00e9moire tampon de messages.
MQJE004=MQJE004: Flux en entr\u00e9e de socket null.
MQJE005=MQJE005: Label TSH introuvable.  Le label \u00e9tait ''{0}''.
MQJE006=MQJE006: Erreur interne lors de la copie de tableau.
MQJE007=MQJE007: Erreur d'E-S lors de la lecture des donn\u00e9es du message.
MQJE008=MQJE008: Exception d'E-S lors de l'envoi du message d'\u00e9tat.
MQJE009=MQJE009: Impossible de cr\u00e9er l'en-t\u00eate d'API.
MQJE010=MQJE010: H\u00f4te inconnu : ''{0}''.
MQJE011=MQJE011: Tentative de connexion au socket refus\u00e9e.
MQJE012=MQJE012: Erreur de s\u00e9curit\u00e9 - connexion \u00e0 l''h\u00f4te ''{0}'' impossible.
MQJE013=MQJE013: Erreur d'acc\u00e8s aux flux de socket.
MQJE016=MQJE016: Le gestionnaire de files d''''attente MQ a ferm\u00e9 imm\u00e9diatement le canal lors de la connexion.\nCode anomalie de fermeture = ''{0}''.
MQJE017=MQJE017: Le gestionnaire de files d''attente MQ a envoy\u00e9 une erreur d''\u00e9tat ''{0}'' lors de la connexion.
MQJE018=MQJE018: Erreur de protocole - type de segment inattendu re\u00e7u.
MQJE019=MQJE019: Erreur lors de la cr\u00e9ation du segment de donn\u00e9es initial.
MQJE020=MQJE020: CCSID non pris en charge par le gestionnaire de files d'attente.
MQJE021=MQJE021: Codage non pris en charge par le gestionnaire de files d'attente.
MQJE022=MQJE022: Niveau FAP non pris en charge par le gestionnaire de files d'attente.
MQJE023=MQJE023: Echec de la n\u00e9gociation sur le nombre maximal de messages par lot.
MQJE024=MQJE024: La valeur de boucle de la s\u00e9quence n'est pas prise en charge par le gestionnaire de files d'attente.
MQJE025=MQJE025: Le canal s''est ferm\u00e9 apr\u00e8s deux changements initiaux.  Code anomalie de fermeture : ''{0}''.
MQJE026=MQJE026: Le gestionnaire de files d''attente a envoy\u00e9 une erreur d''\u00e9tat ''{0}'' lors de la connexion.
MQJE027=MQJE027: L''exit de s\u00e9curit\u00e9 du gestionnaire de files d''attente a rejet\u00e9 la connexion avec le code d''erreur ''{0}''.
MQJE028=MQJE028: Le canal s'est ferm\u00e9 lors des \u00e9changes de s\u00e9curit\u00e9.
MQJE029=MQJE029: Type de message inattendu envoy\u00e9 par le gestionnaire de files d'attente.
MQJE030=MQJE030: Exception d'E-S lors des flux de s\u00e9curit\u00e9.
MQJE031=MQJE031: L'exit de s\u00e9curit\u00e9 a ferm\u00e9 le canal.
MQJE032=MQJE032: L''exit de s\u00e9curit\u00e9 du gestionnaire de files d''attente a rejet\u00e9 la connexion avec le code anomalie ''{0}''.
MQJE033=MQJE033: Un flux de s\u00e9curit\u00e9 requis n'a pas \u00e9t\u00e9 envoy\u00e9 par le gestionnaire de files d'attente.
MQJE034=MQJE034: Type de message inattendu envoy\u00e9 par le gestionnaire de files d'attente.
MQJE035=MQJE035: La taille de transmission maximale n\u00e9goci\u00e9e est trop petite.
MQJE036=MQJE036: Le gestionnaire de files d'attente a rejet\u00e9 la tentative de connexion.
MQJE037=MQJE037: Le gestionnaire de files d'attente \u00e9loign\u00e9es a ferm\u00e9 la connexion.
MQJE038=MQJE038: Type de segment inattendu ''{0}'' re\u00e7u.
MQJE039=MQJE039: Une Exception d'E-S s'est produite lors de la cr\u00e9ation du flux de donn\u00e9es.
MQJE040=MQJE040: Canal ferm\u00e9 par un exit
MQJE041=MQJE041: Le num\u00e9ro de version ''{0}'' n''est pas pris en charge.
MQJE042=MQJE042: Label ''{0}'' erron\u00e9.
MQJE043=MQJE043: Donn\u00e9es insuffisantes re\u00e7ues du gestionnaire de files d'attente.
MQJE044=MQJE044: Erreur de copie de tableau dans MQMD.
MQJE046=MQJE046: La page de codes ''{0}'' n''est pas prise en charge.
MQJE055=MQJE055: Le gestionnaire de files d'attente ne prend pas en charge les structures d'API IBM MQ version 2.
MQJE056=MQJE056: Echec de n\u00e9gociation initiale.
MQJE057=MQJE057: Le canal s'est ferm\u00e9 lors des \u00e9changes de s\u00e9curit\u00e9.
MQJE058=MQJE058: Nombre d'enregistrements d'objet ou de r\u00e9ponse incorrect.
#
# Messages used by MQManagedConnectionJ11, ManagedConnectionFactories
# and MQManagedConnectionMetaData
#
MQJI039=MQJI039: Objet ConnectionRequestInfo non valide.
MQJI040=MQJI040: Objet MQManagedConnection d\u00e9j\u00e0 supprim\u00e9.
MQJI041=MQJI041: M\u00e9thode ''{0}'' non prise en charge par IBM MQ classes for Java(tm).
MQJI042=MQJI042: Objet MQManagedConnection non r\u00e9utilisable.
#
# Messages from MQManagedConnectionMetaData
#
MID_ProductName=IBM MQ classes for Java(tm)
MID_MngCon_CmdLvl=Niveau de commande ''{0}''
#
# Messages from MQXAi
#
MID_SecManError=Le gestionnaire de s\u00e9curit\u00e9 a emp\u00each\u00e9 l'acc\u00e8s \u00e0 la biblioth\u00e8que de m\u00e9thodes natives pour le support XA IBM MQ.
MID_XANativeError=Echec de chargement de la biblioth\u00e8que de m\u00e9thodes natives pour le support XA IBM MQ.
#
# Messages from MQXAResource
#
MID_OpenFailed=Echec de xa_open().
MID_OpFailed=Echec d'une op\u00e9ration XA ; voir code d'erreur.
MID_ResourceClosed=La ressource XA est ferm\u00e9e.

#
# Messages produced by com.ibm.mq.MQMsg2
#
MQJE064=MQJE064: Version de la structure MQMD ''{0}'' non prise en charge.
MQJE065=MQJE065: Etat interne incoh\u00e9rent d\u00e9tect\u00e9.

# message when server doesn't support client XA
MID_Rejected_XA_Client=Connexion client non compatible XA.

#
# Messages produced via SSL options on a client connection
#
MQJE066=MQJE066: Type d''objet non pris en charge pour le ''{0}'' fourni.
MQJE067=MQJE067: Le nom d''homologue ''{0}'' ne correspond pas au nom demand\u00e9 ''{1}''.
MQJE068=MQJE068: Le certificat de serveur n'a pas \u00e9t\u00e9 r\u00e9voqu\u00e9.
MQJE069=MQJE069: Impossible de contacter CertStore.
#
# Messages for MQJava Firewall support
#
MQJE071=MQJE071: Une tentative de connexion au socket a \u00e9t\u00e9 refus\u00e9e en raison des restrictions de LOCAL_ADDRESS_PROPERTY.
#
# Block of messages reserved for Extended Transactional Client - XA Client .
#
MQJE080=MQJE080: Unit\u00e9s de licence insuffisantes - ex\u00e9cutez la commande setmqcap.
MQJE081=MQJE081: Le format du fichier contenant les informations relatives aux unit\u00e9s de licence est incorrect - ex\u00e9cutez la commande setmqcap.
MQJE082=MQJE082: Le fichier contenant les informations relatives aux unit\u00e9s de licence est introuvable - ex\u00e9cutez la commande setmqcap.

#
# Misc exception messages
#
MQCCF_NOT_SUPPURTED=MQJI043: createConnectionFactory non pris en charge par IBM MQ classes for Java.
MQINVCRF_OBJECT=MQJE083: Objet ConnectionRequestInfo non valide.
MQRESOURCE_ERROR=MQJE084: Erreur de ressource dans la m\u00e9thode ''{0}''.
MQNULLPOINTER=MQJE085: L''objet ''{0}'' est null.
MQEOFEXCEPTION=MQJE086: Fin de l''exception de fichier (''{0}'').
MQIOEXCEPTION=MQJE087: Exception d''E-S (''{0}'').
MQDECODEERROR=MQJE088: Echec du d\u00e9codage (''{0}'').
MQJE089=MQJE089: IBM MQ classes for Java n'est pas pris en charge dans un environnement IMS.
MQJE090=MQJE090: Tentative de remplacement d''une propri\u00e9t\u00e9 non modifiable : ''{0}''.
MQJE091=MQJE091: Avertissements : la propri\u00e9t\u00e9 ''{0}'' n''a pas \u00e9t\u00e9 remplac\u00e9e en raison de l''exception suivante : ''{1}''. Assurez-vous que la valeur de propri\u00e9t\u00e9 est du type attendu.

MQJIMQPROPERTY_OVERRIDE = Substitution des propri\u00e9t\u00e9s MQQueueManager depuis PropertyStore :\n {0}
MQJIMQPROPERTY_OVERRIDE.inserts = XMSC_INSERT_PROPERTY_OVERRIDE_LIST
MQJIMQPROPERTY_OVERRIDE.explanation = Les propri\u00e9t\u00e9s r\u00e9pertori\u00e9es ont \u00e9t\u00e9 remplac\u00e9es dans la table de hachage du constructeur MQQueueManager

MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED = Impossible de rechercher la constante de propri\u00e9t\u00e9 {0}
MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED.inserts = XMSC_INSERT_INDIRECT_PROPERTY_OVERRIDE
MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED.explanation = Un remplacement de propri\u00e9t\u00e9 de connexion a \u00e9t\u00e9 tent\u00e9 \u00e0 l'aide d'un nom de consultation indirect, mais ce nom n'a pas pu \u00eatre r\u00e9solu correctement.
MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED.useraction = V\u00e9rifiez les d\u00e9clarations de remplacement de propri\u00e9t\u00e9 de connexion
