# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright>  
#
# Messages produced by the IBM MQ Java interface classes
# (shared by bindings and by client)
# Messages beginning with MQJI are explanations for exceptions
# Messages beginning with MQJE are errors
#
# From class MQDistributionList
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
MQJI001=MQJI001: O objeto do gerenciador de filas era nulo.
MQJI002=MQJI002: N\u00e3o conectado a um gerenciador de filas.
MQJI003=MQJI003: Nenhum registro de objeto foi fornecido.
MQJI006=MQJI006: Um registro de objeto ou resposta era nulo.
MQJI008=MQJI008: Uma mensagem nula foi transmitida para coloca\u00e7\u00e3o.
MQJI009=MQJI009: Foram colocadas op\u00e7\u00f5es de mensagens nulas para coloca\u00e7\u00e3o.
MQJI011=MQJI011: A lista de distribui\u00e7\u00e3o foi fechada.
#
# From class MQGetMessageOptions
#
MQJI013=MQJI013: N\u00famero de vers\u00e3o n\u00e3o suportado - ''{0}''.
MQJI014=MQJI014: Dados insuficientes recebidos do gerenciador de filas.
MQJI015=MQJI015: Capturador incorreto : ''{0}''.
#
# From class MQManagedObject
#
MQJI016=MQJI016: O objeto foi fechado.
MQJI017=MQJI017: Nenhum seletor foi especificado.
#
# From class MQOD
#
MQJI022=MQJI022: O n\u00famero de registros de objetos e respostas n\u00e3o corresponde.
#
# From class MQPutMessageOptions
#
MQJI023=MQJI023: O objeto MQMessageTracker fornecido era nulo.
#
# From class MQMessageTracker
#
MQJI024=MQJI024: Erro da c\u00f3pia da matriz no MQMessageTracker.
#
# From class MQQueue
#
MQJI025=MQJI025: Uma MQMessage nula foi transmitida para obten\u00e7\u00e3o.
MQJI026=MQJI026: Uma MQGetMessageOptions nula foi transmitida para obten\u00e7\u00e3o.
MQJI027=MQJI027: A fila foi fechada.
MQJI028=MQJI028: Uma MQMessage nula foi transmitida para coloca\u00e7\u00e3o.
MQJI029=MQJI029: Uma MQPutMessageOptions nula foi transmitida para coloca\u00e7\u00e3o.
#
# From class MQQueueManager
#
MQJI030=MQJI030: O gerenciador de filas n\u00e3o suporta listas de distribui\u00e7\u00e3o.
#
# From class MQException
#
MQJE001b=MQJE001: C\u00f3digo de Conclus\u00e3o ''{0}'', Raz\u00e3o ''{1}''.
MQJE001=MQJE001: Ocorreu uma MQException: C\u00f3digo de Conclus\u00e3o ''{0}'', Raz\u00e3o ''{1}''\n''{2}''.
#
# Messages produced by client only classes...
#
MQJI038=MQJI038: Ocorreu um erro interno inesperado durante o processamento de \u00edndice da cadeia.
MQJE002=MQJE002: O fluxo de sa\u00edda do soquete era nulo.
MQJE003=MQJE003: Ocorreu um erro de E/S ao transmitir o buffer de mensagem.
MQJE004=MQJE004: O fluxo da entrada de soquete era nulo.
MQJE005=MQJE005: O capturador TSH n\u00e3o foi localizado.  O capturador era ''{0}''.
MQJE006=MQJE006: Ocorreu um erro interno durante a c\u00f3pia de matriz.
MQJE007=MQJE007: Ocorreu um erro de E/S ao ler os dados da mensagem.
MQJE008=MQJE008: Ocorreu uma IOException ao enviar a mensagem de status.
MQJE009=MQJE009: Falha ao construir o cabe\u00e7alho da API.
MQJE010=MQJE010: Host desconhecido: ''{0}''.
MQJE011=MQJE011: A tentativa de conex\u00e3o de soquete foi recusada.
MQJE012=MQJE012: Erro de seguran\u00e7a - imposs\u00edvel conectar-se ao host ''{0}''.
MQJE013=MQJE013: Erro ao acessar os fluxos de soquete.
MQJE016=MQJE016: O gerenciador de filas MQ fechou o canal imediatamente durante a conex\u00e3o.\nRaz\u00e3o do fechamento = ''{0}''.
MQJE017=MQJE017: O gerenciador de filas do MQ enviou o erro de status ''{0}'' durante a conex\u00e3o.
MQJE018=MQJE018: Erro de protocolo - um tipo de segmento inesperado foi recebido.
MQJE019=MQJE019: Ocorreu um erro ao criar o segmento de dados inicial.
MQJE020=MQJE020: O CCSID n\u00e3o \u00e9 suportado pelo gerenciador de filas.
MQJE021=MQJE021: A codifica\u00e7\u00e3o n\u00e3o \u00e9 suportada pelo gerenciador de filas.
MQJE022=MQJE022: O n\u00edvel de FAP n\u00e3o \u00e9 suportado pelo gerenciador de filas.
MQJE023=MQJE023: Falha da negocia\u00e7\u00e3o no m\u00e1ximo de mensagens por lote.
MQJE024=MQJE024: O valor de agrupamento da sequ\u00eancia n\u00e3o \u00e9 suportado pelo gerenciador de filas.
MQJE025=MQJE025: O canal foi fechado ap\u00f3s duas altera\u00e7\u00f5es iniciais.  Raz\u00e3o do fechamento ''{0}''.
MQJE026=MQJE026: O gerenciador de filas enviou o erro de status ''{0}'' durante a conex\u00e3o.
MQJE027=MQJE027: A sa\u00edda de seguran\u00e7a do gerenciador de filas rejeitou a conex\u00e3o com o c\u00f3digo de erro ''{0}''.
MQJE028=MQJE028: O canal foi fechado durante as trocas de seguran\u00e7a.
MQJE029=MQJE029: O tipo de mensagem inesperado foi enviado pelo gerenciador de filas.
MQJE030=MQJE030: Ocorreu uma IOException durante os fluxos de seguran\u00e7a.
MQJE031=MQJE031: A sa\u00edda de seguran\u00e7a fechou o canal.
MQJE032=MQJE032: A sa\u00edda de seguran\u00e7a do gerenciador de filas rejeitou a conex\u00e3o com o c\u00f3digo de raz\u00e3o ''{0}''.
MQJE033=MQJE033: Um fluxo de seguran\u00e7a necess\u00e1rio n\u00e3o foi enviado pelo gerenciador de filas.
MQJE034=MQJE034: Tipo de mensagem inesperado foi enviado pelo gerenciador de filas.
MQJE035=MQJE035: O tamanho de transmiss\u00e3o m\u00e1xima negociado \u00e9 muito pequeno.
MQJE036=MQJE036: O gerenciador de filas rejeitou a tentativa de conex\u00e3o.
MQJE037=MQJE037: O gerenciador de filas remoto fechou a conex\u00e3o.
MQJE038=MQJE038: Um tipo de segmento inesperado ''{0}'' foi recebido.
MQJE039=MQJE039: Ocorreu uma IOException ao construir o fluxo de dados.
MQJE040=MQJE040: O canal foi fechado por uma sa\u00edda.
MQJE041=MQJE041: O n\u00famero da vers\u00e3o ''{0}'' n\u00e3o \u00e9 suportado.
MQJE042=MQJE042: O capturador ''{0}'' \u00e9 err\u00f4neo.
MQJE043=MQJE043: dados insuficientes foram recebidos do gerenciador de filas.
MQJE044=MQJE044: Ocorreu um erro de c\u00f3pia da matriz no MQMD.
MQJE046=MQJE046: O conjunto de c\u00f3digo ''{0}'' n\u00e3o \u00e9 suportado.
MQJE055=MQJE055: o gerenciador de filas n\u00e3o suporta estruturas de API do IBM MQ da vers\u00e3o 2.
MQJE056=MQJE056: Ocorreu uma falha da negocia\u00e7\u00e3o inicial.
MQJE057=MQJE057: O canal foi fechado durante as trocas de seguran\u00e7a.
MQJE058=MQJE058: Houve um n\u00famero incorreto de registros de objetos ou respostas.
#
# Messages used by MQManagedConnectionJ11, ManagedConnectionFactories
# and MQManagedConnectionMetaData
#
MQJI039=MQJI039: O objeto ConnectionRequestInfo n\u00e3o era v\u00e1lido.
MQJI040=MQJI040: O objeto MQManagedConnection j\u00e1 est\u00e1 destru\u00eddo.
MQJI041=MQJI041: o m\u00e9todo ''{0}'' n\u00e3o \u00e9 suportado pelo IBM MQ classes for Java(tm).
MQJI042=MQJI042: O objeto MQManagedConnection n\u00e3o \u00e9 reutiliz\u00e1vel.
#
# Messages from MQManagedConnectionMetaData
#
MID_ProductName=IBM MQ classes for Java(tm)
MID_MngCon_CmdLvl=N\u00edvel de Comando ''{0}''
#
# Messages from MQXAi
#
MID_SecManError=O gerenciador de seguran\u00e7a impediu o acesso \u00e0 biblioteca de m\u00e9todos nativos para o suporte ao IBM MQ XA.
MID_XANativeError=Falha ao carregar a biblioteca de m\u00e9todos nativos para o suporte ao IBM MQ XA.
#
# Messages from MQXAResource
#
MID_OpenFailed=Falha de xa_open().
MID_OpFailed=Falha na opera\u00e7\u00e3o do XA, consulte o errorCode.
MID_ResourceClosed=XAResource est\u00e1 fechado.

#
# Messages produced by com.ibm.mq.MQMsg2
#
MQJE064=MQJE064: N\u00e3o suportada a vers\u00e3o da estrutura do MQMD ''{0}''
MQJE065=MQJE065: Estado interno inconsistente detectado

# message when server doesn't support client XA
MID_Rejected_XA_Client=A conex\u00e3o do cliente n\u00e3o est\u00e1 ativada para XA.

#
# Messages produced via SSL options on a client connection
#
MQJE066=MQJE066: ''{0}'' fornecido possui um tipo de objeto n\u00e3o suportado.
MQJE067=MQJE067: O nome do peer ''{0}'' n\u00e3o corresponde ao nome solicitado ''{1}''.
MQJE068=MQJE068: O certificado do servidor foi revogado.
MQJE069=MQJE069: Imposs\u00edvel entrar em contato com CertStore.
#
# Messages for MQJava Firewall support
#
MQJE071=MQJE071: Uma tentativa de conex\u00e3o do soquete foi recusada devido \u00e0s restri\u00e7\u00f5es de LOCAL_ADDRESS_PROPERTY.
#
# Block of messages reserved for Extended Transactional Client - XA Client .
#
MQJE080=MQJE080: H\u00e1 unidades de licen\u00e7a insuficientes - executar setmqcap
MQJE081=MQJE081: O arquivo contendo as informa\u00e7\u00f5es da unidade de licen\u00e7a est\u00e1 no formato errado - executar setmqcap.
MQJE082=MQJE082: O arquivo contendo as informa\u00e7\u00f5es da unidade de licen\u00e7a n\u00e3o p\u00f4de ser localizado - executar setmqcap.

#
# Misc exception messages
#
MQCCF_NOT_SUPPURTED=MQJI043: createConnectionFactory n\u00e3o suportado pelo IBM MQ classes for Java.
MQINVCRF_OBJECT=MQJE083: Objeto ConnectionRequestInfo inv\u00e1lido.
MQRESOURCE_ERROR=MQJE084: Erro de recurso no m\u00e9todo ''{0}''.
MQNULLPOINTER=MQJE085: O objeto ''{0}'' \u00e9 nulo.
MQEOFEXCEPTION=MQJE086: Final da exce\u00e7\u00e3o do arquivo (''{0}'').
MQIOEXCEPTION=MQJE087: Exce\u00e7\u00e3o de E/S (''{0}'').
MQDECODEERROR=MQJE088: Falha ao decodificar (''{0}'').
MQJE089=MQJE089: as classes do IBM MQ para Java n\u00e3o s\u00e3o suportadas em um ambiente IMS.
MQJE090=MQJE090: tentativa de substituir a propriedade imut\u00e1vel ''{0}''.
MQJE091=MQJE091: aviso: a propriedade ''{0}'' n\u00e3o foi substitu\u00edda por causa da exce\u00e7\u00e3o: ''{1}''. Verifique se o valor da propriedade \u00e9 do tipo esperado.

MQJIMQPROPERTY_OVERRIDE = Substituindo propriedades MQQueueManager do PropertyStore:\n \ {0}
MQJIMQPROPERTY_OVERRIDE.inserts = XMSC_INSERT_PROPERTY_OVERRIDE_LIST
MQJIMQPROPERTY_OVERRIDE.explanation = As propriedades listadas foram substitu\u00eddas na tabela de dispers\u00e3o do construtor MQQueueManager

MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED = N\u00e3o foi poss\u00edvel consultar a constante da propriedade {0}
MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED.inserts = XMSC_INSERT_INDIRECT_PROPERTY_OVERRIDE
MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED.explanation = Houve a tentativa de substitui\u00e7\u00e3o da propriedade da conex\u00e3o usando um nome de consulta indireta, mas o nome n\u00e3o p\u00f4de ser resolvido corretamente.
MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED.useraction = Verifique as declara\u00e7\u00f5es de substitui\u00e7\u00e3o de propriedade da conex\u00e3o
