# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright>  
#
# Messages produced by the IBM MQ Java interface classes
# (shared by bindings and by client)
# Messages beginning with MQJI are explanations for exceptions
# Messages beginning with MQJE are errors
#
# From class MQDistributionList
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
MQJI001=MQJI001: Objekt spr\u00e1vce front m\u011bl hodnotu Null.
MQJI002=MQJI002: Nen\u00ed nav\u00e1z\u00e1no p\u0159ipojen\u00ed ke spr\u00e1vci front.
MQJI003=MQJI003: Nebyly zad\u00e1ny \u017e\u00e1dn\u00e9 z\u00e1znamy objekt\u016f.
MQJI006=MQJI006: Z\u00e1znam odezvy nebo z\u00e1znam objektu m\u00e1 hodnotu null.
MQJI008=MQJI008: Operaci vlo\u017een\u00ed byla p\u0159ed\u00e1na zpr\u00e1va s hodnotou Null.
MQJI009=MQJI009: Operaci vlo\u017een\u00ed byly p\u0159ed\u00e1ny volby zpr\u00e1vy vlo\u017een\u00ed s hodnotou Null.
MQJI011=MQJI011: Distribu\u010dn\u00ed seznam byl uzav\u0159en.
#
# From class MQGetMessageOptions
#
MQJI013=MQJI013: Nepodporovan\u00e9 \u010d\u00edslo verze - {0}.
MQJI014=MQJI014: Data z\u00edskan\u00e1 od spr\u00e1vce front byla ne\u00fapln\u00e1.
MQJI015=MQJI015: Chybn\u00e1 upout\u00e1vka: {0}
#
# From class MQManagedObject
#
MQJI016=MQJI016: Objekt byl uzav\u0159en.
MQJI017=MQJI017: Nebyly ur\u010deny \u017e\u00e1dn\u00e9 selektory.
#
# From class MQOD
#
MQJI022=MQJI022: Po\u010dty z\u00e1znam\u016f odezvy a z\u00e1znam\u016f objektu si neodpov\u00eddaj\u00ed.
#
# From class MQPutMessageOptions
#
MQJI023=MQJI023: Zadan\u00fd objekt MQMessageTracker m\u011bl hodnotu Null.
#
# From class MQMessageTracker
#
MQJI024=MQJI024: V objektu MQMessageTracker byla zji\u0161t\u011bna chyba kop\u00edrov\u00e1n\u00ed pole.
#
# From class MQQueue
#
MQJI025=MQJI025: Operaci na\u010dten\u00ed byl p\u0159ed\u00e1n objekt MQMessage s hodnotou Null.
MQJI026=MQJI026: Operaci na\u010dten\u00ed byl p\u0159ed\u00e1n objekt MQGetMessageOptions s hodnotou Null.
MQJI027=MQJI027: Fronta byla uzav\u0159ena.
MQJI028=MQJI028: Operaci vlo\u017een\u00ed byl p\u0159ed\u00e1n objekt MQMessage s hodnotou Null.
MQJI029=MQJI029: Operaci vlo\u017een\u00ed byl p\u0159ed\u00e1n objekt MQPutMessageOptions s hodnotou Null.
#
# From class MQQueueManager
#
MQJI030=MQJI030: Spr\u00e1vce front nepodporuje distribu\u010dn\u00ed seznamy.
#
# From class MQException
#
MQJE001b=MQJE001: K\u00f3d dokon\u010den\u00ed: {0}, p\u0159\u00ed\u010dina: {1}
MQJE001=MQJE001: Do\u0161lo k v\u00fdjimce MQException: K\u00f3d dokon\u010den\u00ed {0}, p\u0159\u00ed\u010dina {1}\n {2}
#
# Messages produced by client only classes...
#
MQJI038=MQJI038: P\u0159i zpracov\u00e1n\u00ed indexu \u0159et\u011bzce do\u0161lo k neo\u010dek\u00e1van\u00e9 intern\u00ed chyb\u011b.
MQJE002=MQJE002: V\u00fdstupn\u00ed proud soketu m\u00e1 hodnotu Null.
MQJE003=MQJE003: P\u0159i p\u0159enosu vyrovn\u00e1vac\u00ed pam\u011bti zpr\u00e1v do\u0161lo k chyb\u011b vstupu/v\u00fdstupu.
MQJE004=MQJE004: Vstupn\u00ed proud soketu m\u00e1 hodnotu Null.
MQJE005=MQJE005: Nepoda\u0159ilo se naj\u00edt pole upout\u00e1vky TSH. Upout\u00e1vka: {0}
MQJE006=MQJE006: P\u0159i kop\u00edrov\u00e1n\u00ed pole do\u0161lo k intern\u00ed chyb\u011b.
MQJE007=MQJE007: P\u0159i na\u010d\u00edt\u00e1n\u00ed dat zpr\u00e1vy do\u0161lo k chyb\u011b vstupu/v\u00fdstupu.
MQJE008=MQJE008: P\u0159i odes\u00edl\u00e1n\u00ed zpr\u00e1vy o stavu se vyskytla v\u00fdjimka IOException.
MQJE009=MQJE009: Nezda\u0159ilo se sestavit z\u00e1hlav\u00ed rozhran\u00ed API.
MQJE010=MQJE010: Nezn\u00e1m\u00fd hostitel: {0}
MQJE011=MQJE011: Pokus o p\u0159ipojen\u00ed k soketu byl odm\u00edtnut.
MQJE012=MQJE012: Chyba zabezpe\u010den\u00ed - nelze se p\u0159ipojit k hostiteli {0}.
MQJE013=MQJE013: P\u0159i p\u0159\u00edstupu k proud\u016fm soketu do\u0161lo k chyb\u011b.
MQJE016=MQJE016: Spr\u00e1vce front MQ provedl okam\u017eit\u00e9 uzav\u0159en\u00ed kan\u00e1lu b\u011bhem p\u0159ipojen\u00ed.\nP\u0159\u00ed\u010dina uzav\u0159en\u00ed: {0}
MQJE017=MQJE017: Spr\u00e1vce front MQ odeslal b\u011bhem p\u0159ipojen\u00ed chybu stavu {0}.
MQJE018=MQJE018: Chyba protokolu - byl p\u0159ijat segment neo\u010dek\u00e1van\u00e9ho typu.
MQJE019=MQJE019: P\u0159i vytv\u00e1\u0159en\u00ed po\u010d\u00e1te\u010dn\u00edho datov\u00e9ho segmentu do\u0161lo k chyb\u011b.
MQJE020=MQJE020: Spr\u00e1vce front nepodporuje danou sadu CCSID.
MQJE021=MQJE021: Spr\u00e1vce front nepodporuje dan\u00e9 k\u00f3dov\u00e1n\u00ed.
MQJE022=MQJE022: Spr\u00e1vce front nepodporuje danou \u00farove\u0148 FAP.
MQJE023=MQJE023: Vyjedn\u00e1v\u00e1n\u00ed se nezda\u0159ilo kv\u016fli maxim\u00e1ln\u00edmu po\u010dtu zpr\u00e1v v d\u00e1vce.
MQJE024=MQJE024: Spr\u00e1vce front nepodporuje danou hodnotu nejvy\u0161\u0161\u00edho po\u0159adov\u00e9ho \u010d\u00edsla.
MQJE025=MQJE025: Kan\u00e1l byl po dvou po\u010d\u00e1te\u010dn\u00edch zm\u011bn\u00e1ch uzav\u0159en. P\u0159\u00ed\u010dina uzav\u0159en\u00ed: {0}
MQJE026=MQJE026: Spr\u00e1vce front odeslal b\u011bhem p\u0159ipojen\u00ed chybu stavu {0}.
MQJE027=MQJE027: U\u017eivatelsk\u00e1 procedura pro zabezpe\u010den\u00ed zpr\u00e1vy spr\u00e1vce front odm\u00edtla p\u0159ipojen\u00ed. Chybov\u00fd k\u00f3d: {0}
MQJE028=MQJE028: P\u0159i v\u00fdm\u011bn\u00e1ch \u00fadaj\u016f zabezpe\u010den\u00ed byl kan\u00e1l uzav\u0159en.
MQJE029=MQJE029: Spr\u00e1vce front odeslal neo\u010dek\u00e1van\u00e9 typy zpr\u00e1vy.
MQJE030=MQJE030: V pr\u016fb\u011bhu tok\u016f zabezpe\u010den\u00ed byla zaznamen\u00e1na v\u00fdjimka IOException.
MQJE031=MQJE031: U\u017eivatelsk\u00e1 procedura pro zabezpe\u010den\u00ed zpr\u00e1vy uzav\u0159ela kan\u00e1l.
MQJE032=MQJE032: U\u017eivatelsk\u00e1 procedura pro zabezpe\u010den\u00ed zpr\u00e1vy spr\u00e1vce front odm\u00edtla p\u0159ipojen\u00ed. K\u00f3d p\u0159\u00ed\u010diny: {0}
MQJE033=MQJE033: Spr\u00e1vce front neodeslal po\u017eadovan\u00fd tok zabezpe\u010den\u00ed.
MQJE034=MQJE034: Spr\u00e1vce front odeslal neo\u010dek\u00e1van\u00fd typ zpr\u00e1vy.
MQJE035=MQJE035: Vyjednan\u00e1 maxim\u00e1ln\u00ed velikost p\u0159enosu nen\u00ed dostate\u010dn\u00e1.
MQJE036=MQJE036: Spr\u00e1vce front odm\u00edtl pokus o p\u0159ipojen\u00ed.
MQJE037=MQJE037: Vzd\u00e1len\u00fd spr\u00e1vce front uzav\u0159el p\u0159ipojen\u00ed.
MQJE038=MQJE038: Byl p\u0159ijat neo\u010dek\u00e1van\u00fd typ segmentu {0}.
MQJE039=MQJE039: P\u0159i sestavov\u00e1n\u00ed datov\u00e9ho proudu se vyskytla v\u00fdjimka IOException.
MQJE040=MQJE040: Kan\u00e1l byl uzav\u0159en u\u017eivatelskou procedurou.
MQJE041=MQJE041: \u010c\u00edslo verze {0} nen\u00ed podporov\u00e1no.
MQJE042=MQJE042: Chybn\u00e1 upout\u00e1vka {0}.
MQJE043=MQJE043: Od spr\u00e1vce front byla p\u0159ijata ne\u00fapln\u00e1 data.
MQJE044=MQJE044: Ve struktu\u0159e MQMD do\u0161lo k chyb\u011b kop\u00edrov\u00e1n\u00ed pole.
MQJE046=MQJE046: K\u00f3dov\u00e1 sada {0} nen\u00ed podporov\u00e1na.
MQJE055=MQJE055: Spr\u00e1vce front nepodporuje struktury rozhran\u00ed API IBM MQ verze 2.
MQJE056=MQJE056: Do\u0161lo k selh\u00e1n\u00ed po\u010d\u00e1te\u010dn\u00edho vyjedn\u00e1v\u00e1n\u00ed.
MQJE057=MQJE057: P\u0159i v\u00fdm\u011bn\u00e1ch \u00fadaj\u016f zabezpe\u010den\u00ed byl kan\u00e1l uzav\u0159en.
MQJE058=MQJE058: Byl zji\u0161t\u011bn nespr\u00e1vn\u00fd po\u010det z\u00e1znam\u016f pro objekty nebo odezvy.
#
# Messages used by MQManagedConnectionJ11, ManagedConnectionFactories
# and MQManagedConnectionMetaData
#
MQJI039=MQJI039: Objekt ConnectionRequestInfo byl neplatn\u00fd.
MQJI040=MQJI040: Objekt MQManagedConnection je ji\u017e zlikvidov\u00e1n.
MQJI041=MQJI041: T\u0159\u00eddy IBM MQ pro jazyk Java nepodporuj\u00ed metodu {0}.
MQJI042=MQJI042: Objekt MQManagedConnection nelze pou\u017e\u00edt opakovan\u011b.
#
# Messages from MQManagedConnectionMetaData
#
MID_ProductName=T\u0159\u00eddy IBM MQ pro jazyk Java(tm)
MID_MngCon_CmdLvl=\u00darove\u0148 p\u0159\u00edkaz\u016f {0}
#
# Messages from MQXAi
#
MID_SecManError=Spr\u00e1vce zabezpe\u010den\u00ed zablokoval p\u0159\u00edstup ke knihovn\u011b nativn\u00edch metod pro podporu IBM MQ XA.
MID_XANativeError=Nezda\u0159ilo se na\u010d\u00edst knihovnu nativn\u00edch metod pro podporu IBM MQ XA.
#
# Messages from MQXAResource
#
MID_OpenFailed=Metoda xa_open() se nezda\u0159ila.
MID_OpFailed=Operace XA se nezda\u0159ila - viz k\u00f3d chyby.
MID_ResourceClosed=Prost\u0159edek XA je uzav\u0159en.

#
# Messages produced by com.ibm.mq.MQMsg2
#
MQJE064=MQJE064: Verze {0} struktury MQMD nen\u00ed podporov\u00e1na.
MQJE065=MQJE065: Byl zji\u0161t\u011bn nekonzistentn\u00ed intern\u00ed stav.

# message when server doesn't support client XA
MID_Rejected_XA_Client=P\u0159ipojen\u00ed klienta nepodporuje standard XA.

#
# Messages produced via SSL options on a client connection
#
MQJE066=MQJE066: Byl zad\u00e1n objekt nepodporovan\u00e9ho typu: {0}.
MQJE067=MQJE067: N\u00e1zev partnera {0} neodpov\u00edd\u00e1 po\u017eadovan\u00e9mu n\u00e1zvu {1}.
MQJE068=MQJE068: Certifik\u00e1t serveru byl odvol\u00e1n.
MQJE069=MQJE069: Nelze nav\u00e1zat kontakt s \u00falo\u017ei\u0161t\u011bm certifik\u00e1t\u016f.
#
# Messages for MQJava Firewall support
#
MQJE071=MQJE071: Pokus o p\u0159ipojen\u00ed k soketu byl odm\u00edtnut v d\u016fsledku omezen\u00ed LOCAL_ADDRESS_PROPERTY.
#
# Block of messages reserved for Extended Transactional Client - XA Client .
#
MQJE080=MQJE080: Nedostate\u010dn\u00fd po\u010det licen\u010dn\u00edch jednotek - spus\u0165te program setmqcap.
MQJE081=MQJE081: Soubor obsahuj\u00edc\u00ed \u00fadaje licen\u010dn\u00edch jednotek m\u00e1 nespr\u00e1vn\u00fd form\u00e1t - spus\u0165te program setmqcap.
MQJE082=MQJE082: Soubor obsahuj\u00edc\u00ed \u00fadaje licen\u010dn\u00edch jednotek se nepoda\u0159ilo naj\u00edt - spus\u0165te program setmqcap.

#
# Misc exception messages
#
MQCCF_NOT_SUPPURTED=MQJI043: T\u0159\u00eddy IBM MQ pro jazyk Java nepodporuj\u00ed metodu createConnectionFactory.
MQINVCRF_OBJECT=MQJE083: Neplatn\u00fd objekt ConnectionRequestInfo.
MQRESOURCE_ERROR=MQJE084: Chyba prost\u0159edku v metod\u011b {0}
MQNULLPOINTER=MQJE085: Objekt {0} m\u00e1 hodnotu Null.
MQEOFEXCEPTION=MQJE086: V\u00fdjimka konce souboru ({0})
MQIOEXCEPTION=MQJE087: V\u00fdjimka vstupu/v\u00fdstupu ({0})
MQDECODEERROR=MQJE088: Dek\u00f3dov\u00e1n\u00ed se nezda\u0159ilo ({0}).
MQJE089=MQJE089: T\u0159\u00eddy MQ IBM pro jazyk Java nejsou v prost\u0159ed\u00ed IMS podporov\u00e1ny.
MQJE090=MQJE090: Do\u0161lo k pokusu o p\u0159eps\u00e1n\u00ed nem\u011bniteln\u00e9 vlastnosti ''{0}''.
MQJE091=MQJE091: Varov\u00e1n\u00ed: Vlastnost ''{0}'' nebyla p\u0159eps\u00e1na kv\u016fli v\u00fdjimce: ''{1}''. Zkontrolujte, zda je hodnota vlastnosti o\u010dek\u00e1van\u00e9ho typu.

MQJIMQPROPERTY_OVERRIDE = Potla\u010den\u00ed vlastnost\u00ed MQQueueManager z objektu PropertyStore:\n {0}
MQJIMQPROPERTY_OVERRIDE.inserts = XMSC_INSERT_PROPERTY_OVERRIDE_LIST
MQJIMQPROPERTY_OVERRIDE.explanation = Uveden\u00e9 vlastnosti byly v ha\u0161ovac\u00ed tabulce konstruktoru MQQueueManager potla\u010deny

MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED = Nelze vyhledat konstantu vlastnosti {0}
MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED.inserts = XMSC_INSERT_INDIRECT_PROPERTY_OVERRIDE
MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED.explanation = Do\u0161lo k pokusu o potla\u010den\u00ed vlastnosti p\u0159ipojen\u00ed s pou\u017eit\u00edm nep\u0159\u00edm\u00e9ho vyhled\u00e1vac\u00edho n\u00e1zvu, ale tento n\u00e1zev nebylo mo\u017en\u00e9 spr\u00e1vn\u011b vy\u0159e\u0161it.
MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED.useraction = Zkontrolujte deklarace potla\u010den\u00ed vlastnost\u00ed p\u0159ipojen\u00ed
