# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright>  
#
# Messages produced by the IBM MQ Java interface classes
# (shared by bindings and by client)
# Messages beginning with MQJI are explanations for exceptions
# Messages beginning with MQJE are errors
#
# From class MQDistributionList
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
MQJI001=MQJI001: El objeto gestor de colas era nulo.
MQJI002=MQJI002: No est\u00e1 conectado a un gestor de colas.
MQJI003=MQJI003: No se ha suministrado ning\u00fan registro de objeto.
MQJI006=MQJI006: Un registro de objeto o de respuesta era nulo.
MQJI008=MQJI008: Se ha pasado un mensaje nulo al m\u00e9todo put.
MQJI009=MQJI009: Se han pasado opciones de transferencia de mensaje nulas al m\u00e9todo put.
MQJI011=MQJI011: La lista de distribuci\u00f3n se ha cerrado.
#
# From class MQGetMessageOptions
#
MQJI013=MQJI013: N\u00famero de versi\u00f3n no soportado - ''{0}''.
MQJI014=MQJI014: Se han recibido datos insuficientes del gestor de colas.
MQJI015=MQJI015: Captador de atenci\u00f3n err\u00f3neo: ''{0}''.
#
# From class MQManagedObject
#
MQJI016=MQJI016: El objeto se ha cerrado.
MQJI017=MQJI017: No se ha especificado ning\u00fan selector.
#
# From class MQOD
#
MQJI022=MQJI022: El n\u00famero de registros de objeto y de respuesta no coinciden.
#
# From class MQPutMessageOptions
#
MQJI023=MQJI023: El objeto MQMessageTracker suministrado era nulo.
#
# From class MQMessageTracker
#
MQJI024=MQJI024: Error de copia de matriz en MQMessageTracker.
#
# From class MQQueue
#
MQJI025=MQJI025: Se ha pasado un MQMessage nulo al m\u00e9todo get.
MQJI026=MQJI026: Se ha pasado un MQGetMessageOptions nulo al m\u00e9todo get.
MQJI027=MQJI027: La cola se ha cerrado.
MQJI028=MQJI028: Se ha pasado un MQMessage nulo al m\u00e9todo put.
MQJI029=MQJI029: Se ha pasado un MQPutMessageOptions nulo al m\u00e9todo put.
#
# From class MQQueueManager
#
MQJI030=MQJI030: El gestor de colas no da soporte a listas de distribuci\u00f3n.
#
# From class MQException
#
MQJE001b=MQJE001: C\u00f3digo de terminaci\u00f3n ''{0}'', Raz\u00f3n ''{1}''.
MQJE001=MQJE001: Se ha producido una Excepci\u00f3n MQ: C\u00f3digo de terminaci\u00f3n ''{0}'', Raz\u00f3n ''{1}''\n ''{2}''.
#
# Messages produced by client only classes...
#
MQJI038=MQJI038: Se ha producido un error interno inesperado durante el proceso de \u00edndice de series de caracteres.
MQJE002=MQJE002: La corriente de salida del socket era nula.
MQJE003=MQJE003: Se ha producido un error de E/S al transmitir el almacenamiento intermedio de mensajes.
MQJE004=MQJE004: La corriente de entrada del socket era nula.
MQJE005=MQJE005: No se ha encontrado el captador de atenci\u00f3n TSH.  El captador de atenci\u00f3n era ''{0}''.
MQJE006=MQJE006: Se ha producido un error interno durante la copia de la matriz.
MQJE007=MQJE007: Se ha producido un error de E/S al leer datos del mensaje.
MQJE008=MQJE008: Se ha producido una Excepci\u00f3n de E/S mientras se enviaba un mensaje de estado.
MQJE009=MQJE009: No se ha podido crear la cabecera de la API.
MQJE010=MQJE010: Host desconocido: ''{0}''.
MQJE011=MQJE011: Se ha rechazado el intento de conexi\u00f3n con el socket.
MQJE012=MQJE012: Error de seguridad - no se puede conectar con el host ''{0}''.
MQJE013=MQJE013: Error al acceder a las corrientes de datos del socket.
MQJE016=MQJE016: El gestor de colas de MQ cerr\u00f3 el canal inmediatamente durante la conexi\u00f3n.\nRaz\u00f3n del cierre = ''{0}''.
MQJE017=MQJE017: El gestor de colas MQ envi\u00f3 el error de estado ''{0}'' durante la conexi\u00f3n.
MQJE018=MQJE018: Error de protocolo - se ha recibido un tipo de segmento inesperado.
MQJE019=MQJE019: Se ha producido un error al crear un segmento de datos inicial.
MQJE020=MQJE020: El CCSID no est\u00e1 soportado por el gestor de colas.
MQJE021=MQJE021: La codificaci\u00f3n no est\u00e1 soportada por el gestor de colas.
MQJE022=MQJE022: El nivel FAP no est\u00e1 soportado por el gestor de colas.
MQJE023=MQJE023: La negociaci\u00f3n ha fallado en el n\u00famero m\u00e1ximo de mensajes por lote.
MQJE024=MQJE024: El valor de reinicio de secuencia no est\u00e1 soportado por el gestor de colas.
MQJE025=MQJE025: El canal se ha cerrado despu\u00e9s de dos cambios iniciales.  Raz\u00f3n del cierre ''{0}''.
MQJE026=MQJE026: El gestor de colas envi\u00f3 el error de estado ''{0}'' durante la conexi\u00f3n.
MQJE027=MQJE027: La salida de seguridad del gestor de colas ha rechazado la conexi\u00f3n con el c\u00f3digo de error ''{0}''.
MQJE028=MQJE028: El canal se ha cerrado durante los intercambios de seguridad
MQJE029=MQJE029: El gestor de colas ha enviado un tipo de mensaje inesperado.
MQJE030=MQJE030: Se ha producido una Excepci\u00f3n de E/S durante los flujos de seguridad.
MQJE031=MQJE031: La salida de seguridad ha cerrado el canal
MQJE032=MQJE032: La salida de seguridad del gestor de colas ha rechazado la conexi\u00f3n con el c\u00f3digo de raz\u00f3n ''{0}''.
MQJE033=MQJE033: El gestor de colas no envi\u00f3 un flujo de seguridad necesario.
MQJE034=MQJE034: El gestor de colas ha enviado un tipo de mensaje inesperado.
MQJE035=MQJE035: El tama\u00f1o m\u00e1ximo de transmisi\u00f3n negociado es demasiado peque\u00f1o.
MQJE036=MQJE036: El gestor de colas ha rechazado el intento de conexi\u00f3n.
MQJE037=MQJE037: El gestor de colas remoto ha cerrado la conexi\u00f3n.
MQJE038=MQJE038: Se ha recibido un tipo de segmento inesperado ''{0}''.
MQJE039=MQJE039: Se ha producido una Excepci\u00f3n de E/S mientras se creaba la corriente de datos.
MQJE040=MQJE040: Una salida ha cerrado el canal.
MQJE041=MQJE041: El n\u00famero de versi\u00f3n ''{0}'' no est\u00e1 soportado.
MQJE042=MQJE042: El captador de atenci\u00f3n ''{0}'' es err\u00f3neo.
MQJE043=MQJE043: Se han recibido datos insuficientes del gestor de colas.
MQJE044=MQJE044: Se ha producido un error de copia de matriz en el MQMD.
MQJE046=MQJE046: El conjunto de c\u00f3digos ''{0}'' no est\u00e1 soportado.
MQJE055=MQJE055: El gestor de colas no da soporte a estructuras de API de IBM MQ versi\u00f3n 2.
MQJE056=MQJE056: Se ha producido un error en la negociaci\u00f3n inicial.
MQJE057=MQJE057: El canal se ha cerrado durante los intercambios de seguridad.
MQJE058=MQJE058: Hab\u00eda un n\u00famero incorrecto de registros de objeto o de respuesta.
#
# Messages used by MQManagedConnectionJ11, ManagedConnectionFactories
# and MQManagedConnectionMetaData
#
MQJI039=MQJI039: El objeto ConnectionRequestInfo no era v\u00e1lido.
MQJI040=MQJI040: El objeto MQManagedConnection ya est\u00e1 destruido.
MQJI041=MQJI041: El m\u00e9todo ''{0}'' no est\u00e1 soportado por IBM MQ classes for Java(tm).
MQJI042=MQJI042: El objeto MQManagedConnection no es reutilizable.
#
# Messages from MQManagedConnectionMetaData
#
MID_ProductName=IBM MQ classes for Java(tm)
MID_MngCon_CmdLvl=Nivel de mandato ''{0}''
#
# Messages from MQXAi
#
MID_SecManError=El gestor de seguridad ha impedido el acceso a la biblioteca de m\u00e9todos nativos para soporte XA de IBM MQ.
MID_XANativeError=No se ha podido cargar la biblioteca de m\u00e9todos nativos para el soporte XA de IBM MQ.
#
# Messages from MQXAResource
#
MID_OpenFailed=xa_open() no se ha ejecutado correctamente.
MID_OpFailed=Una operaci\u00f3n XA no se ha ejecutado correctamente, consulte el c\u00f3digo de error
MID_ResourceClosed=El XAResource est\u00e1 cerrado.

#
# Messages produced by com.ibm.mq.MQMsg2
#
MQJE064=MQJE064: La versi\u00f3n de la estructura MQMD ''{0}'' no est\u00e1 soportada.
MQJE065=MQJE065: Se ha detectado un estado interno incoherente.

# message when server doesn't support client XA
MID_Rejected_XA_Client=La conexi\u00f3n de cliente no est\u00e1 habilitada para XA.

#
# Messages produced via SSL options on a client connection
#
MQJE066=MQJE066: Se ha proporcionado ''{0}'' con un tipo de objeto no soportado.
MQJE067=MQJE067: El nombre de igual ''{0}'' no coincid\u00eda con el nombre solicitado ''{1}''.
MQJE068=MQJE068: Se ha revocado el certificado de servidor.
MQJE069=MQJE069: No se ha podido contactar con CertStore.
#
# Messages for MQJava Firewall support
#
MQJE071=MQJE071: Se ha rechazado un intento de conexi\u00f3n con el socket debido a restricciones de LOCAL_ADDRESS_PROPERTY.
#
# Block of messages reserved for Extended Transactional Client - XA Client .
#
MQJE080=MQJE080: No hay suficientes unidades de licencia - ejecute setmqcap.
MQJE081=MQJE081: El archivo que contiene la informaci\u00f3n de unidades de licencia est\u00e1 en un formato incorrecto - ejecute setmqcap.
MQJE082=MQJE082: No se ha podido encontrar el archivo que contiene la informaci\u00f3n de unidades de licencia - ejecute setmqcap.

#
# Misc exception messages
#
MQCCF_NOT_SUPPURTED=MQJI043: createConnectionFactory no est\u00e1 soportado por IBM MQ classes for Java.
MQINVCRF_OBJECT=MQJE083: Objeto ConnectionRequestInfo no v\u00e1lido.
MQRESOURCE_ERROR=MQJE084: Error de recurso en el m\u00e9todo ''{0}''.
MQNULLPOINTER=MQJE085: El objeto ''{0}'' es nulo.
MQEOFEXCEPTION=MQJE086: Excepci\u00f3n de fin de archivo (''{0}'').
MQIOEXCEPTION=MQJE087: Excepci\u00f3n de entrada/salida (''{0}'').
MQDECODEERROR=MQJE088: La decodificaci\u00f3n ha fallado (''{0}'').
MQJE089=MQJE089: IBM MQ classes for Java no est\u00e1 soportado en un entorno IMS.
MQJE090=MQJE090: Se ha intentado alterar temporalmente la propiedad inmodificable ''{0}''.
MQJE091=MQJE091: Aviso: La propiedad ''{0}'' no se ha alterado temporalmente debido a la excepci\u00f3n: ''{1}''. Compruebe que el valor de la propiedad sea del tipo esperado.

MQJIMQPROPERTY_OVERRIDE = Se est\u00e1n alterando temporalmente las propiedades MQQueueManager de PropertyStore:\n {0}
MQJIMQPROPERTY_OVERRIDE.inserts = XMSC_INSERT_PROPERTY_OVERRIDE_LIST
MQJIMQPROPERTY_OVERRIDE.explanation = Las propiedades listadas se han alterado temporalmente en la tabla hash del constructor MQQueueManager

MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED = No se ha podido buscar la constante de propiedad {0}
MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED.inserts = XMSC_INSERT_INDIRECT_PROPERTY_OVERRIDE
MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED.explanation = Se ha intentado alterar temporalmente una propiedad de la conexi\u00f3n utilizando un nombre de b\u00fasqueda indirecto, pero el nombre no se ha podido resolver correctamente.
MQJIMQPROPERTY_OVERRIDE_LOOKUP_FAILED.useraction = Compruebe las declaraciones de alteraci\u00f3n temporal de la propiedad de conexi\u00f3n
