# ===========================================================================
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# ===========================================================================
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
# %Z% %W% %I% %E% %U%

# ---------------------------------------------------------------------------------
#
# Component JMS Standard Exceptions Message Identifiers
# Group prefix '0'
#
# ---------------------------------------------------------------------------------
MQJMS0000 = El m\u00e9todo ''{0}'' se ha invocado en un momento no permitido o inadecuado o el proveedor no est\u00e1 en un estado adecuado para la operaci\u00f3n solicitada.
MQJMS0000.inserts = XMSC_INSERT_NAME

MQJMS0002 = IBM MQ classes for JMS ha intentado establecer un ID de cliente no v\u00e1lido en una conexi\u00f3n.
MQJMS0003 = El destino no es conocido o ya no es v\u00e1lido.
MQJMS0004 = IBM MQ classes for JMS ha asignado al proveedor JMS un selector de mensajes con sintaxis no v\u00e1lida.
MQJMS0005 = Se ha alcanzado un fin de secuencia inesperado mientras se le\u00eda un StreamMessage o BytesMessage.
MQJMS0006 = IBM MQ classes for JMS intenta utilizar un tipo de datos no soportado por un mensaje o intenta leer datos del tipo incorrecto.
MQJMS0007 = IBM MQ classes for JMS intenta leer un mensaje de s\u00f3lo grabaci\u00f3n.
MQJMS0008 = IBM MQ classes for JMS intenta escribir un mensaje de s\u00f3lo lectura.
MQJMS0009 = IBM MQ classes for JMS no puede asignar los recursos necesarios para un m\u00e9todo.
MQJMS0010 = Operaci\u00f3n no v\u00e1lida porque hay una transacci\u00f3n en progreso.
MQJMS0011 = La llamada a Session.commit ha dado como resultado una retrotracci\u00f3n de la transacci\u00f3n actual.
MQJMS0012 = El URI no tiene el formato correcto: cola://nombreGestorColas/nombreCola [parejas nombre-valor].

# ---------------------------------------------------------------------------------
#
# Component Common - group prefix '1'
#
# ---------------------------------------------------------------------------------

MQJMS1000 = No se ha podido crear un mensaje JMS.
MQJMS1001 = Modalidad de acuse de recibo desconocida ''{0}''.
MQJMS1004 = Se ha cerrado la conexi\u00f3n.
MQJMS1005 = Transici\u00f3n de estado no manejada de ''{0}'' a ''{1}''.
MQJMS1006 = valor no v\u00e1lido para ''{0}'': ''{1}''.
MQJMS1006.inserts = XMSC_INSERT_NAME, XMSC_INSERT_VALUE

MQJMS1007 = no se ha podido crear una instancia de la clase de salida ''{0}''.
MQJMS1008 = valor desconocido de transportType: ''{0}''.
MQJMS1009 = no hay ning\u00fan constructor con el argumento de la serie.
MQJMS1010 = no se ha implementado.
MQJMS1011 = no se pueden especificar credenciales de seguridad cuando se utilizan enlaces MQ.
MQJMS1012 = no hay ning\u00fan escucha de mensajes.
MQJMS1013 = operaci\u00f3n no v\u00e1lida mientras la sesi\u00f3n est\u00e1 utilizando entrega as\u00edncrona
MQJMS1014 = operaci\u00f3n no v\u00e1lida para el productor identificado.
MQJMS1015 = valor desconocido de cliente destino: ''{0}''.
MQJMS1016 = se ha producido un error interno. P\u00f3ngase en contacto con el administrador del sistema. Detalle: ''{0}''.
MQJMS1017 = cola MQ no local no v\u00e1lida para recibir o examinar.
MQJMS1018 = no hay disponible ninguna conexi\u00f3n v\u00e1lida.
MQJMS1019 = operaci\u00f3n no v\u00e1lida para una sesi\u00f3n sin transacci\u00f3n.
MQJMS1020 = operaci\u00f3n no v\u00e1lida para una sesi\u00f3n con transacci\u00f3n.
MQJMS1021 = la recuperaci\u00f3n ha fallado: puede que los mensajes no reconocidos no se vuelvan a enviar.
MQJMS1022 = no se ha podido redirigir el mensaje.
MQJMS1023 = la retrotracci\u00f3n ha fallado.
MQJMS1024 = la sesi\u00f3n se ha cerrado.
MQJMS1025 = no se ha podido examinar el mensaje.
MQJMS1026 = ExceptionListener ha emitido la excepci\u00f3n: ''{0}''.
MQJMS1027 = no se ha podido reconstruir el destino a partir de ''{0}''.
MQJMS1028 = el nombre de elemento es nulo.
MQJMS1029 = el nombre de propiedad es nulo.
MQJMS1030 = el almacenamiento intermedio suministrado por la aplicaci\u00f3n es demasiado peque\u00f1o.
MQJMS1031 = se ha producido un error interno. P\u00f3ngase en contacto con el administrador del sistema.
MQJMS1032 = close() ha fallado debido a ''{0}''.
MQJMS1033 = start() ha fallado debido a ''{0}''.
MQJMS1034 = MessageListener ha emitido: ''{0}''.
MQJMS1042 = modalidad de entrega no v\u00e1lida.
MQJMS1044 = La serie no es un n\u00famero hexadecimal v\u00e1lido - ''{0}''.
MQJMS1045 = N\u00famero fuera de rango para flotante de precisi\u00f3n doble S/390 ''{0}''.
MQJMS1046 = El juego de caracteres ''{0}'' no est\u00e1 soportado.
MQJMS1047 = El mensaje de correlaci\u00f3n tiene un formato incorrecto.
MQJMS1048 = El mensaje de corriente de datos tiene un formato incorrecto.
MQJMS1049 = IBM MQ classes for JMS ha intentado convertir una matriz de bytes en una serie de caracteres.
MQJMS1050 = La cabecera MQRFH2 tiene un formato incorrecto.
MQJMS1051 = Clase de mensaje JMS.
MQJMS1052 = Clase de mensaje JMS no reconocida.
MQJMS1053 = Se ha detectado un sustituto UTF-16 no v\u00e1lido ''{0}''.
MQJMS1054 = Se ha detectado una secuencia de escape XML no v\u00e1lida ''{0}''.
MQJMS1055 = La propiedad o elemento en el mensaje tiene un tipo de datos incompatible ''{0}''.
MQJMS1056 = Tipo de datos de propiedad o de elemento no soportado ''{0}''.
MQJMS1057 = El mensaje no tiene ninguna sesi\u00f3n asociada.
MQJMS1058 = Nombre de propiedad de mensaje no v\u00e1lido: ''{0}''.
MQJMS1059 = Error muy grave - UTF8 no est\u00e1 soportada.
MQJMS1060 = No se ha podido serializar el objeto.
MQJMS1061 = No se ha podido deserializar el objeto.
MQJMS1062 = Se ha producido una excepci\u00f3n al leer el cuerpo del mensaje: ''{0}''.
MQJMS1063 = Se ha omitido otro car\u00e1cter o caracteres ''{0}''.
MQJMS1064 = Codificaci\u00f3n de enteros: ''{0}''= Codificaci\u00f3n de coma flotante ''{1}''.
MQJMS1065 = Se ha producido una excepci\u00f3n al escribir el cuerpo del mensaje.
MQJMS1066 = Nombre de elemento de mensaje no v\u00e1lido: ''{0}''.
MQJMS1067 = tiempo de espera no v\u00e1lido para MQ.
MQJMS1068 = no se ha podido obtener XAResource.
MQJMS1069 = No permitido con XASession.
MQJMS1072 = No se ha podido realizar una consulta sobre el nombre del gestor de colas.
MQJMS1073 = La cola MQ especificada no es QLOCAL ni QALIAS.
MQJMS1074 = No se puede procesar un mensaje nulo
MQJMS1075 = Error al escribir la cabecera de mensaje no entregado.
MQJMS1076 = Error al leer la cabecera de mensaje no entregado.
MQJMS1077 = Discrepancia entre conexi\u00f3n y destino.
MQJMS1078 = Objeto de sesi\u00f3n no v\u00e1lido.
MQJMS1079 = No se ha podido grabar el mensaje en la cola de mensajes no entregados.
MQJMS1080 = No se ha definido ninguna cola de reposici\u00f3n en cola para restituci\u00f3n.
MQJMS1081 = No se ha podido realizar la reposici\u00f3n en cola del mensaje.
MQJMS1082 = Anomal\u00eda al descartar el mensaje.
MQJMS1085 = Error al escribir RFH.
MQJMS1086 = Error al leer RFH.
MQJMS1087 = Contenido de RFH no reconocido o no v\u00e1lido.
MQJMS1088 = Est\u00e1 prohibido que consumidores de dominios diversos act\u00faen en la misma entrada.
MQJMS1089 = Se ha producido una excepci\u00f3n al leer el cuerpo del mensaje: ''{0}''.
MQJMS1091 = operaci\u00f3n no v\u00e1lida para el productor no identificado.
MQJMS1093 = Se ha pasado un par\u00e1metro nulo al constructor: ''{0}''.
MQJMS1094 = quantityHint no v\u00e1lido.
MQJMS1096 = MessageReference no v\u00e1lida.
MQJMS1098 = Versi\u00f3n de MessageReference no v\u00e1lida.
MQJMS1099 = Versi\u00f3n de MQQueueAgentThread no v\u00e1lida.

# ---------------------------------------------------------------------------------
#
# Component Common - group prefix '1' - multicast exceptions
#
# ---------------------------------------------------------------------------------

MQJMS1102 = No se puede establecer una conexi\u00f3n multidifusi\u00f3n.
MQJMS1103 = Se han perdido ''{0}'' mensajes en modalidad de multidifusi\u00f3n fiable.
MQJMS1104 = Conexi\u00f3n de multidifusi\u00f3n desconectada debido a un tiempo de espera excedido.
MQJMS1105 = No se puede conectar con un puerto local espec\u00edfico para multidifusi\u00f3n DistHub.
MQJMS1106 = No se ha podido cargar la biblioteca nativa necesaria para PGM/IP.
MQJMS1107 = Ha surgido un problema con la conexi\u00f3n.

# ---------------------------------------------------------------------------------
#
# Component Common - group prefix '1' - JMS1.1 additional messages
#
# ---------------------------------------------------------------------------------

MQJMS1110 = JMS1.1 Operaci\u00f3n no soportada por este tipo.
MQJMS1111 = JMS1.1 Los servicios de Colas/Publicaci\u00f3n Suscripci\u00f3n necesarios no est\u00e1n configurados.
MQJMS1112 = JMS1.1 Operaci\u00f3n no v\u00e1lida para objeto espec\u00edfico del dominio.
MQJMS1113 = JMS1.1 Operaci\u00f3n no v\u00e1lida para objeto de dominio cruzado.

MQJMS1115 = No se han podido consultar las propiedades de la cola base ''{0}'' de la cola alias ''{1}'', se toma el valor predeterminado del umbral de restituci\u00f3n ''{2}''. C\u00f3digo de terminaci\u00f3n ''{3}'' C\u00f3digo de raz\u00f3n ''{4}''
MQJMS1115.explanation = La cola que se procesaba era una cola alias, y se ha producido un error durante la consulta de las propiedades backoutQueue y backoutThreshold de cola base.
MQJMS1115.useraction = Compruebe los c\u00f3digos de terminaci\u00f3n y de raz\u00f3n para determinar la causa. Si el c\u00f3digo de raz\u00f3n est\u00e1 relacionado con las autorizaciones necesarias, compruebe que el usuario conectado tenga autorizaci\u00f3n para poder consultar la cola base a la que hace referencia la cola alias. Para detener las consultas sobre la cola base y utilizar el valor predeterminado de umbral de restituci\u00f3n indicado anteriormente, y volver poner en cola los mensajes que lleguen a este umbral en la cola de mensajes no entregados, establezca la propiedad de JVM en com.ibm.mq.jms.useDefaultBOValues=true.
MQJMS1115.inserts = XMSC_INSERT_DESTINATION_NAME, XMSC_INSERT_STRING, XMSC_INSERT_VALUE, XMSC_INSERT_COMP_CODE, XMSC_INSERT_REASON

MQJMS1116 = El mensaje ''{0}'', detectado en la cola ''{1}'' en el gestor de colas ''{2}'', no se puede procesar debido a una cabecera MQRFH2 no v\u00e1lida y se ha trasladado a la cola de mensajes no entregados ''{3}''.
MQJMS1116.explanation = Al ejecutarse en el modo de migraci\u00f3n del proveedor de mensajer\u00eda IBM MQ, un ConnectionConsumer, una Especificaci\u00f3n de activaci\u00f3n o un Puerto de escucha de WebSphere Application Server ha detectado un mensaje que inclu\u00eda una cabecera MQRFH2 no v\u00e1lida. Puesto que el campo Informe en el MQMD para este mensaje inclu\u00eda la opci\u00f3n MQRO_DEAD_LETTER_Q, el mensaje se movi\u00f3 a la cola de mensajes no entregados. 
MQJMS1116.useraction = Consulte el mensaje en la cola de mensajes no entregados para determinar por qu\u00e9 la cabecera MQRFH2 no es v\u00e1lida y modifique la aplicaci\u00f3n que gener\u00f3 el mensaje para asegurarse de que la cabecera MQRFH2 es v\u00e1lida.
MQJMS1116.inserts = XMSC_INSERT_MESSAGE_ID, XMSC_INSERT_DESTINATION_NAME, XMSC_INSERT_QUEUE_MANAGER_NAME, XMSC_INSERT_STRING 

MQJMS1117 = El mensaje ''{0}'', detectado en la cola ''{1}'' en el gestor de colas ''{2}'', no se puede procesar debido a una cabecera MQRFH2 no v\u00e1lida y se ha descartado.
MQJMS1117.explanation = Al ejecutarse en el modo de migraci\u00f3n del proveedor de mensajer\u00eda IBM MQ, un ConnectionConsumer, una Especificaci\u00f3n de activaci\u00f3n o un Puerto de escucha de WebSphere Application Server ha detectado un mensaje que inclu\u00eda una cabecera MQRFH2 no v\u00e1lida. Puesto que el campo Informe en MQMD para este mensaje inclu\u00eda la opci\u00f3n MQRO_DISCARD_MSG, el mensaje se descart\u00f3. 
MQJMS1117.useraction = Modifique la aplicaci\u00f3n responsable para generar el mensaje, de forma que genere mensajes que contengan cabeceras MQRFH2 v\u00e1lidas.
MQJMS1117.inserts = XMSC_INSERT_MESSAGE_ID, XMSC_INSERT_DESTINATION_NAME, XMSC_INSERT_QUEUE_MANAGER_NAME 

# ---------------------------------------------------------------------------------
#
# Component BaseMQ - group prefix '2'
#
# ---------------------------------------------------------------------------------

MQJMS2000 = no se ha podido cerrar la cola MQ.
MQJMS2001 = La referencia de la cola MQ es nula.
MQJMS2002 = no se ha podido obtener mensaje de la cola MQ.
MQJMS2003 = no se ha podido desconectar el gestor de colas.
MQJMS2004 = la referencia a MQQueueManager es nula.
MQJMS2005 = no se ha podido crear MQQueueManager para ''{0}''.
MQJMS2006 = problema de MQ: ''{0}''.
MQJMS2007 = no se ha podido enviar mensaje a la cola MQ.
MQJMS2008 = no se ha podido abrir la cola MQ ''{0}''.
MQJMS2009 = MQQueueManager.commit() ha fallado.
MQJMS2010 = valor desconocido para el tipo de definici\u00f3n de la cola MQ: ''{0}''.
MQJMS2011 = no se ha podido consultar la profundidad de la cola MQ
MQJMS2012 = XACLOSE ha fallado.
MQJMS2013 = autenticaci\u00f3n de seguridad no v\u00e1lida suministrada para MQQueueManager.
MQJMS2014 = El gestor de colas ha rechazado la conexi\u00f3n de cliente XA.

# ---------------------------------------------------------------------------------
#
# Component Domain - group prefix '3'
#
# ---------------------------------------------------------------------------------

MQJMS3000 = no se ha podido crear una cola temporal de ''{0}''.
MQJMS3001 = la cola temporal ya se ha cerrado o suprimido.
MQJMS3002 = la cola temporal est\u00e1 en uso.
MQJMS3003 = no se puede suprimir una cola est\u00e1tica.
MQJMS3004 = no se ha podido suprimir la cola temporal.
MQJMS3005 = La publicaci\u00f3n/suscripci\u00f3n ha fallado debido a ''{0}''.
MQJMS3006 = La referencia de tema es nula.
MQJMS3008 = No se ha podido crear el mandato ''{0}''.
MQJMS3009 = No se ha podido publicar el mandato en la cola MQ.
MQJMS3010 = No se ha podido crear el mensaje de publicaci\u00f3n.
MQJMS3011 = No se ha podido publicar el mensaje en la cola MQ.
MQJMS3013 = No se ha podido almacenar la entrada admin.
MQJMS3014 = No se ha podido abrir la cola de suscriptores ''{0}''.
MQJMS3017 = No se ha podido suprimir la cola de suscriptores ''{0}''.
MQJMS3018 = Suscripci\u00f3n duradera desconocida ''{0}''.
MQJMS3019 = TemporaryTopic ya suprimido.
MQJMS3020 = TemporaryTopic fuera de \u00e1mbito.
MQJMS3021 = Prefijo de cola de suscriptores no v\u00e1lido: ''{0}''.
MQJMS3022 = Una resuscripci\u00f3n duradera debe utilizar la misma cola de suscriptores; especificada:''{0}'' original:''{1}''.
MQJMS3023 = La suscripci\u00f3n tiene un TopicSubscriber activo.
MQJMS3024 = Uso no permitido de ID de cliente no inicializado.
MQJMS3025 = TemporaryTopic en uso.
MQJMS3026 = QueueSender est\u00e1 cerrado.
MQJMS3028 = TopicPublisher est\u00e1 cerrado.
MQJMS3031 = No se puede establecer clientID despu\u00e9s de haber utilizado la conexi\u00f3n.
MQJMS3032 = No est\u00e1 permitido restablecer el clientID.
MQJMS3033 = QueueReceiver est\u00e1 cerrado.
MQJMS3034 = TopicSubscriber est\u00e1 cerrado.
MQJMS3037 = El productor de mensajes est\u00e1 cerrado.
MQJMS3038 = El consumidor de mensajes est\u00e1 cerrado.
MQJMS3039 = Uso no permitido de nombre nulo.
MQJMS3040 = Contenido del mensaje de control de intermediario no v\u00e1lido: ''{0}''.
MQJMS3041 = El campo ''{0}'' ya est\u00e1 establecido.
MQJMS3042 = Mensaje no reconocible del intermediario de Publicaci\u00f3n/Suscripci\u00f3n.
MQJMS3043 = Nivel no v\u00e1lido para repetir operaci\u00f3n de limpieza.
MQJMS3044 = Se ha solicitado una operaci\u00f3n de limpieza con un nivel de NONE.
MQJMS3045 = No se ha podido abrir ''{0}'': quiz\u00e1 se est\u00e9 ejecutando un nivel de limpieza FORCE o NONDUR.
MQJMS3046 =  No se ha podido abrir ''{0}'': quiz\u00e1 otra aplicaci\u00f3n JMS est\u00e9 utilizando Publicaci\u00f3n/Suscripci\u00f3n con este gestor de colas.
MQJMS3047 = Tipo de almac\u00e9n de suscripciones no soportado por el gestor de colas.
MQJMS3048 = Tipo de almac\u00e9n de suscripciones incorrecto.
MQJMS3049 = MQJMS_Messages.MQJMS_PS_WRONG_SUBSCRIPTION_TYPE = Tipo de suscripci\u00f3n incorrecto para este almac\u00e9n de suscripciones.
MQJMS3050 = La suscripci\u00f3n ya est\u00e1 en uso y no se puede actualizar.
MQJMS3051 = Nombre de suscripci\u00f3n no v\u00e1lido.

MQJMS3052 = La limpieza se ha iniciado a las ''{0}'' el ''{1}''.
MQJMS3052.explanation = El script de limpieza de IBM MQ classes for JMS se est\u00e1 ejecutando y ha iniciado una operaci\u00f3n de limpieza a la hora y fecha especificadas. La hora est\u00e1 en el formato HHMMSSTH, y la fecha est\u00e1 en el formato AAAAMMDD. 
MQJMS3052.useraction = Ninguna. 
MQJMS3052.inserts = XMSC_INSERT_TIMESTAMP, XMSC_INSERT_DATESTAMP

MQJMS3053 = La limpieza ha finalizado a las ''{0}'' el ''{1}''.
MQJMS3053.explanation = El script de limpieza de IBM MQ classes for JMS se est\u00e1 ejecutando y ha finalizado una operaci\u00f3n de limpieza a la hora y fecha especificadas. La hora est\u00e1 en el formato HHMMSSTH, y la fecha est\u00e1 en el formato AAAAMMDD. 
MQJMS3053.useraction = Ninguna. 
MQJMS3053.inserts = XMSC_INSERT_TIMESTAMP, XMSC_INSERT_DATESTAMP

MQJMS3054 = Tiempo hasta la pr\u00f3xima operaci\u00f3n de limpieza: ''{0}'' minutos.
MQJMS3054.explanation = El script de limpieza de IBM MQ classes for JMS se est\u00e1 ejecutando y est\u00e1 ahora esperando durante el n\u00famero de minutos que aparece en el mensaje antes de iniciar la pr\u00f3xima operaci\u00f3n de limpieza. El n\u00famero de minutos mostrado en el mensaje se ha redondeado a la baja al minuto m\u00e1s cercano.
MQJMS3054.useraction = Ninguna. 
MQJMS3054.inserts = XMSC_INSERT_STRING

# ---------------------------------------------------------------------------------
#
# Admin Domain - group prefix '4'
#
# ---------------------------------------------------------------------------------

MQJMS4124 = El valor de propiedad para ''{0}'' es nulo.
MQJMS4125 = Propiedad no v\u00e1lida para ''{0}'': ''{1}''.
MQJMS4131 = Los tipos de objeto previsto y real no coinciden.

# ---------------------------------------------------------------------------------
#
# Util Domain (IVT, sample etc.) - group prefix '5'
#
# ---------------------------------------------------------------------------------

MQJMS5053 = *** Sin respuesta del intermediario. Aseg\u00farese de que se est\u00e9 ejecutando el intermediario. Si est\u00e1 utilizando el intermediario de IBM MQ, compruebe si brokerVersion tiene el valor V1 ***
MQJMS5087 = Se ha encontrado un error inesperado ''{1}'' al acceder a la cola interna ''{0}''.

# ---------------------------------------------------------------------------------
#
# Gryphon - group prefix '6'
#
# ---------------------------------------------------------------------------------

MQJMS6040 = Nombre de familia de sockets no v\u00e1lido: ''{0}''.
MQJMS6041 = Se ha producido una excepci\u00f3n al intentar cargar la clase de f\u00e1brica de sockets ''{0}'', excepci\u00f3n: <''{1}''>.
MQJMS6056 = No se puede cambiar el par\u00e1metro ''{0}'' ya que no se permiten m\u00e1s cambios en el par\u00e1metro BaseConfig.
MQJMS6057 = No se puede establecer el par\u00e1metro ''{0}'' en el valor ''{1}''.
MQJMS6058 = se ha producido un error al obtener el par\u00e1metro BaseConfig ''{0}''.
MQJMS6059 = Se ha producido una excepci\u00f3n al cargar la implementaci\u00f3n de seguridad de cliente m\u00ednimo.
MQJMS6060 = Se ha encontrado una excepci\u00f3n inesperada en el cliente m\u00ednimo, ''{0}''.
MQJMS6061 = Un tema especificado estaba mal formado, ''{0}''.
MQJMS6062 = Se ha encontrado un EOF (fin de archivo) al recibir datos en el cliente m\u00ednimo.
MQJMS6063 = El intermediario ha indicado un error en la conexi\u00f3n con el cliente m\u00ednimo.
MQJMS6064 = Se ha llamado a Connector.send con un valor de mensaje no permitido.
MQJMS6065 = Se ha encontrado un valor no permitido para un campo, ''{0}''.
MQJMS6066 = Se ha producido un error interno inesperado en el cliente m\u00ednimo.
MQJMS6067 = Se ha solicitado una operaci\u00f3n de mensaje de bytes en algo que no es un mensaje de bytes.
MQJMS6068 = Se ha solicitado una operaci\u00f3n de mensaje de texto en algo que no es un mensaje de texto.
MQJMS6069 = Se ha solicitado una operaci\u00f3n de mensaje de corriente de datos en algo que no es un mensaje de corriente de datos.
MQJMS6070 = Se ha solicitado una operaci\u00f3n de mensaje de correlaci\u00f3n en algo que no es un mensaje de correlaci\u00f3n.
MQJMS6071 = El intermediario ha enviado un mensaje no v\u00e1lido durante la autenticaci\u00f3n.
MQJMS6072 = El intermediario ha solicitado un protocolo no disponible durante la autenticaci\u00f3n.
MQJMS6073 = Se ha rechazado la conexi\u00f3n con el cliente m\u00ednimo debido a una anomal\u00eda de autenticaci\u00f3n.
MQJMS6074 = No hay disponible ning\u00fan QOP en el cliente m\u00ednimo.
MQJMS6079 = Se ha producido una excepci\u00f3n al intentar cargar el soporte de agrupaci\u00f3n de hebras, ''{0}''.
MQJMS6081 = Se ha intentado leer de un mensaje de corriente de datos antes de que terminara una lectura anterior.
MQJMS6083 = Se ha producido una excepci\u00f3n al inicializar una instancia de agrupaci\u00f3n de hebras, ''{0}''.
MQJMS6085 = No se ha establecido ning\u00fan ExceptionListener.
MQJMS6088 = El supervisor de conexiones del lado del cliente est\u00e1 terminando.
MQJMS6090 = Se ha intentado recibir de forma sincronizada en un MessageConsumer para el que hay un escucha activo.
MQJMS6091 = Se ha producido una Excepci\u00f3n de E/S al iniciar o detener la entrega en la conexi\u00f3n, ''{0}''.
MQJMS6093 = Se ha producido una excepci\u00f3n durante la recepci\u00f3n s\u00edncrona, ''{0}''.
MQJMS6096 = Un nivel JMSPriority de ''{0}'' est\u00e1 fuera del rango especificado en JMS.
MQJMS6097 = El JMSMessageID especificado, ''{0}'', no es v\u00e1lido.
MQJMS6105 = No se permiten m\u00e1s cambios en par\u00e1metros de cliente.
MQJMS6106 = Se ha producido una excepci\u00f3n al inicializar el par\u00e1metro ''{0}'', excepci\u00f3n ''{1}''.
MQJMS6115 = Se ha producido una excepci\u00f3n al crear TopicConnection, ''{0}''.
MQJMS6116 = Esta operaci\u00f3n no est\u00e1 permitida en una entidad que est\u00e1 cerrada.
MQJMS6117 = La implementaci\u00f3n ''{0}'' de Topic no est\u00e1 soportada.
MQJMS6118 = El tema ''{0}'' contiene un comod\u00edn que no es v\u00e1lido para la publicaci\u00f3n.
MQJMS6119 = Se ha producido una Excepci\u00f3n de E/S durante la publicaci\u00f3n, ''{0}''.
MQJMS6120 = Se ha intentado utilizar un tema temporal no creado en la conexi\u00f3n actual.
MQJMS6121 = Se ha producido una Excepci\u00f3n de E/S durante la suscripci\u00f3n, ''{0}''.
MQJMS6232 = Al crear un TopicSubscriber, el intento de a\u00f1adir la suscripci\u00f3n al motor de comparaciones ha dado como resultado la siguiente excepci\u00f3n: ''{0}''.
MQJMS6233 = Se ha capturado una excepci\u00f3n inesperada en el motor de comparaciones: ''{0}''.
MQJMS6234 = Se ha intentado eliminar un objeto con el tema ''{0}'' de un motor de comparaciones vac\u00edo: ''{1}''.
MQJMS6235 = Se ha intentado eliminar un objeto con el tema ''{0}'' del motor de comparaciones, pero \u00e9ste no ten\u00eda una entrada de memoria cach\u00e9: ''{1}''.
MQJMS6236 = Se ha encontrado un tipo de comprobaci\u00f3n desconocido de clase ''{0}'' en un comparador espec\u00edfico de un tipo.
MQJMS6237 = Se ha intentado acceder a un campo desconocido denominado ''{0}''.
MQJMS6238 = Al intentar acceder a un campo de un mensaje se ha producido la siguiente excepci\u00f3n: ''{0}''.
MQJMS6239 = Se ha producido una operaci\u00f3n de obtener o transferir EvalCache cuando la memoria cach\u00e9 no estaba cargada.
MQJMS6240 = Una operaci\u00f3n de obtener o transferir EvalCache especificaba un ID no v\u00e1lido.
MQJMS6241 = Se han especificado demasiados atributos de contenido.
MQJMS6242 = Se ha detectado un MatchTarget duplicado en MatchSpace.
MQJMS6243 = Se ha intentado eliminar MatchTarget ''{0}'' de MatchSpace, pero no tiene ninguna clave (tema).
MQJMS6244 = El MatchTarget ''{1}'' con clave (tema) ''{0}'' no se ha podido eliminar de MatchSpace porque no se ha podido encontrar.
MQJMS6245 = Se ha intentado a\u00f1adir un MatchTarget a MatchSpace sin una clave (tema).
MQJMS6246 = Se ha detectado un uso incorrecto del car\u00e1cter comod\u00edn de tema ''{0}''.
MQJMS6247 = El separador de segmentos de tema ''{0}'' aparece en una posici\u00f3n incorrecta.
MQJMS6248 = Se ha producido un error al intentar cargar o invocar el analizador del selector de suscripciones.
MQJMS6249 = Se ha producido la siguiente excepci\u00f3n al analizar un selector de suscripciones: ''{0}''.
MQJMS6250 = Se ha utilizado el car\u00e1cter de escape para terminar el siguiente patr\u00f3n: ''{0}''.
MQJMS6251 = El car\u00e1cter de escape ''{0}'' que se ha pasado a la herramienta de patrones tiene m\u00e1s de un car\u00e1cter.
MQJMS6252 = Se esperaba que un campo de mensaje contuviera un valor de tipo ''{0}'' pero conten\u00eda uno de tipo ''{1}''.
MQJMS6228 = La autenticaci\u00f3n de cliente m\u00ednimo ha fallado debido a la excepci\u00f3n ''{0}''.
MQJMS6229 = QOP necesario pero inhabilitado para este cliente m\u00ednimo.
MQJMS6311 = El tipo de transporte 'DIRECT' dentro de una transacci\u00f3n no est\u00e1 soportado.
MQJMS6312 = Suscripci\u00f3n no autorizada al tema ''{0}''.
MQJMS6350 = Se ha solicitado una operaci\u00f3n de mensaje de objeto en algo que no es un mensaje de objeto.
MQJMS6351 = Se ha producido una excepci\u00f3n al crear una suscripci\u00f3n a <''{0}'',''{1}''>, ''{2}''.
MQJMS6401 = Los mensajes persistentes no est\u00e1n soportados para el tipo de transporte 'DIRECT'.
MQJMS6402 = Tiempo de vida > 0 no soportado para tipo de transporte 'DIRECT'.
MQJMS6403 = Caducidad del tema > 0 no soportada para tipo de transporte 'DIRECT'.
MQJMS6404 = Acuse de recibo de cliente no soportado para tipo de transporte 'DIRECT'.
MQJMS6405 = No se ofrece la funcionalidad de JMS 2.0 en la versi\u00f3n 6 del proveedor.
MQJMS6406 = La modalidad de migraci\u00f3n del proveedor de mensajer\u00eda de IBM MQ no est\u00e1 soportada en un entorno CICS.
MQJMS6407 = La modalidad de migraci\u00f3n del proveedor de mensajer\u00eda de IBM MQ no est\u00e1 soportada en un entorno IMS.
