# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE
#

# JMSCMQ0001 doesn't have a .inserts message because it's only used by Reason in
# a WMQException, and never in a JMSException.
JMSCMQ0001 = A chamada do IBM MQ falhou com o compcode ''{0}'' (''{1}'') motivo ''{2}'' (''{3}'').

JMSCMQ0002 = Falha do m\u00e9todo ''{0}''.
JMSCMQ0002.explanation = Uma chamada do IBM MQ falhou.
JMSCMQ0002.useraction = Consulte a exce\u00e7\u00e3o vinculada para obter mais informa\u00e7\u00f5es.
JMSCMQ0002.inserts = XMSC_INSERT_METHOD

JMSCMQ0003 = O destino ''{0}'' n\u00e3o foi compreendido ou n\u00e3o \u00e9 mais v\u00e1lido.
JMSCMQ0003.explanation = A fila ou t\u00f3pico pode ter se tornado n\u00e3o dispon\u00edvel, o aplicativo pode estar utilizando uma conex\u00e3o incorreta para a fila ou t\u00f3pico ou o destino fornecido n\u00e3o \u00e9 do tipo correto para este m\u00e9todo.
JMSCMQ0003.useraction = Verifique se o IBM MQ ainda est\u00e1 em execu\u00e7\u00e3o e se o gerenciador de filas est\u00e1 dispon\u00edvel. Verifique se a conex\u00e3o correta est\u00e1 sendo utilizada para a fila ou t\u00f3pico.
JMSCMQ0003.inserts = XMSC_DESTINATION_NAME
JMSCMQ0003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCMQ0004 = O valor ''{0}'' n\u00e3o era v\u00e1lido para a propriedade ''{1}''.
JMSCMQ0004.explanation = O valor da propriedade ''{1}'' n\u00e3o era nenhum dos valores v\u00e1lidos para esta propriedade.
JMSCMQ0004.useraction = Configure a propriedade para um valor v\u00e1lido.
JMSCMQ0004.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_PROPERTY

JMSCMQ0005 = O nome do destino ''{0}'' n\u00e3o era v\u00e1lido.
JMSCMQ0005.explanation = O nome de destino especificado n\u00e3o est\u00e1 em conformidade com a sintaxe do destino publicado.
JMSCMQ0005.useraction = Corrija o nome do destino especificado e tente novamente.
JMSCMQ0005.inserts = XMSC_DESTINATION_NAME
JMSCMQ0005.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCMQ0006 = O destino n\u00e3o \u00e9 um destino tempor\u00e1rio ou n\u00e3o pode ser exclu\u00eddo.
JMSCMQ0006.explanation = Apenas destinos tempor\u00e1rios podem ser exclu\u00eddos.

JMSCMQ0007 = Uma propriedade desconhecida ''{0}'' com o valor ''{1}'' foi definida no contexto da propriedade de destino.
JMSCMQ0007.explanation = A propriedade ''{0}'' n\u00e3o foi reconhecida - ela pode ser uma propriedade customizada.
JMSCMQ0007.useraction = Certifique-se de que ela deva ser uma propriedade customizada.
JMSCMQ0007.inserts = XMSC_INSERT_KEY, XMSC_INSERT_VALUE

JMSCMQ0008 = O IBM MQ classes for JMS tenta usar um tipo de dados n\u00e3o suportado por uma mensagem ou ler dados no tipo errado.
JMSCMQ0008.explanation = Os tipos de dados incorretos foram utilizados para ler os tipos de propriedades de mensagem.
JMSCMQ0008.useraction = Verifique se a mensagem recebida e as propriedades a serem lidas s\u00e3o do tipo esperado.
JMSCMQ0008.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ0009 = O fim do fluxo foi alcan\u00e7ado inesperadamente, quando uma mensagem de fluxo ou mensagem de bytes foi lida.
JMSCMQ0009.explanation = O fluxo de bytes lido \u00e9 menor que o buffer fornecido. Isso tamb\u00e9m pode ser causado pelo recebimento de uma mensagem de fluxo ou mensagem de bytes corrompida.
JMSCMQ0009.useraction = Verifique o comprimento do buffer fornecido. Verifique os logs de eventos do sistema para obter informa\u00e7\u00f5es mais detalhadas e quaisquer outras falhas relatadas.
JMSCMQ0009.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCMQ0017 = Fim do fluxo.
JMSCMQ0017.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCMQ0018 = Uma mensagem recebida n\u00e3o p\u00f4de ser analisada corretamente.
JMSCMQ0018.explanation = A mensagem com messageID = ''{0}'' e correlationID = ''{1}'' n\u00e3o p\u00f4de ser analisada corretamente. Os \u00faltimos dados da mensagem lidos com sucesso estavam na posi\u00e7\u00e3o ''{2}'' no buffer ''{3}''  
JMSCMQ0018.useraction = Examine os dados da mensagem e certifique-se de que eles estejam no formato correto para serem analisados como uma Mensagem do MQJMS.
JMSCMQ0018.inserts = XMSC_MESSAGE_ID, XMSC_CORRELATION_ID, XMSC_MESSAGE_BUFFER_POSITION, XMSC_MESSAGE_BUFFER

JMSCMQ1000 = Falha ao criar a mensagem JMS.
JMSCMQ1000.explanation = Especificado tipo ou propriedades da mensagem incorretas ao criar uma mensagem de base com messageID = ''{0}'' e correlationID = ''{1}''.
JMSCMQ1000.useraction = Verifique o motivo da exce\u00e7\u00e3o e o c\u00f3digo de conclus\u00e3o vinculados do IBM MQ para obter mais informa\u00e7\u00f5es e verifique o arquivo de log para obter o conte\u00fado da mensagem detalhado.
JMSCMQ1000.inserts = XMSC_MESSAGE_ID, XMSC_CORRELATION_ID

JMSCMQ1006 = O valor para ''{0}'':''{1}'' n\u00e3o \u00e9 v\u00e1lido.
JMSCMQ1006.explanation = O valor ''{1}'' para a propriedade ''{0}'' n\u00e3o \u00e9 correto.
JMSCMQ1006.useraction = Verifique o motivo da exce\u00e7\u00e3o do IBM MQ vinculado e o c\u00f3digo de conclus\u00e3o.
JMSCMQ1006.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_VALUE

JMSCMQ1044 = A cadeia n\u00e3o \u00e9 um n\u00famero hexadecimal v\u00e1lido - ''{0}''.
JMSCMQ1044.inserts = XMSC_INSERT_HEX_STRING
JMSCMQ1044.explanation = Foi feita uma tentativa de especificar um ID de grupo ou ID de correla\u00e7\u00e3o, que inicia com o ID de prefixo, mas n\u00e3o \u00e9 seguido por um valor hexadecimal bem formado, ou foi feita uma tentativa de receber uma mensagem que cont\u00e9m uma propriedade MQRFH2 do tipo bin.hex, que n\u00e3o possui um valor hexadecimal bem formado.
JMSCMQ1044.useraction = Assegure-se de que um valor hexadecimal v\u00e1lido sempre siga o prefixo de ID ao configurar o ID do grupo ou os valores de ID de correla\u00e7\u00e3o. Assegure-se de que qualquer cabe\u00e7alho MQRFH2, gerado por aplicativos n\u00e3o JMS, seja bem formado.

JMSCMQ1046 = O conjunto de caracteres ''{0}'' n\u00e3o \u00e9 suportado.
JMSCMQ1046.inserts = CCSID
JMSCMQ1046.explanation = Foi feita uma tentativa de enviar ou receber uma mensagem de mapeamento, mensagem de fluxo ou mensagem de texto, cujo corpo est\u00e1 codificado utilizando um conjunto de caracteres n\u00e3o suportado pela JVM. No caso de mensagem de texto, esta exce\u00e7\u00e3o pode ser emitida quando o corpo da mensagem \u00e9 consultado primeiro, em vez de no tempo de recebimento.
JMSCMQ1046.useraction = Codifique uma mensagem utilizando apenas um conjunto de caracteres conhecido, dispon\u00edvel no aplicativo de recep\u00e7\u00e3o.

JMSCMQ1047 = A mensagem de mapeamento possui um formato incorreto.
JMSCMQ1047.explanation = Uma mensagem de mapeamento foi recebida, mas as informa\u00e7\u00f5es do cabe\u00e7alho de MQRFH2 est\u00e3o mal formadas.
JMSCMQ1047.useraction = Assegure-se de que todos os aplicativos n\u00e3o JMS est\u00e3o construindo informa\u00e7\u00f5es do cabe\u00e7alho MQRFH2 bem formadas para a inclus\u00e3o nas mensagens de mapeamento.
JMSCMQ1047.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1048 = A mensagem de fluxo possui um formato incorreto.
JMSCMQ1048.explanation = Uma mensagem de fluxo foi recebida e est\u00e1 mal formatada.
JMSCMQ1048.useraction = Certifique-se de que todos os aplicativos n\u00e3o-JMS estejam construindo mensagens de fluxo bem formadas.
JMSCMQ1048.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1049 = O conjunto de caracteres ''{0}'' n\u00e3o pode converter alguma ou todas as sequ\u00eancias de caracteres ''{1}''
JMSCMQ1049.inserts = CCSID, XMSC_INSERT_VALUE
JMSCMQ1049.explanation = Foi feita uma tentativa de enviar ou receber dados da sequ\u00eancia de caracteres usando um conjunto de caracteres incapaz de converter o conte\u00fado da sequ\u00eancia de caracteres.
JMSCMQ1049.useraction = Apenas codifique uma mensagem usando um conjunto de caracteres conhecido que seja apropriado para os dados da sequ\u00eancia de caracteres que est\u00e1 sendo transmitida.

JMSCMQ1050 = O cabe\u00e7alho de MQRFH2 possui um formato incorreto.
JMSCMQ1050.explanation = Uma mensagem com um cabe\u00e7alho de MQRFH2 mal formado foi recebida.
JMSCMQ1050.useraction = Assegure-se de que qualquer aplicativo n\u00e3o JMS que esteja construindo mensagens com cabe\u00e7alhos de MQRFH2 crie cabe\u00e7alhos bem formados.
JMSCMQ1050.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1053 = Foi detectado um caractere substituto de UTF-16 incorreto ''{0}''.
JMSCMQ1053.inserts = XMSC_INSERT_CHARACTER
JMSCMQ1053.explanation = Um caractere substituto de UTF-16 foi encontrado, que n\u00e3o \u00e9 v\u00e1lido como parte de um nome de t\u00f3pico ou propriedade de MQRFH2.
JMSCMQ1053.useraction = Assegure-se que, ao especificar UTF-16, os nomes dos t\u00f3picos ou propriedades de MQRFH2 sejam bem formados.
JMSCMQ1053.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1054 = Foi detectada uma seq\u00fc\u00eancia de escape do XML incorreta ''{0}''.
JMSCMQ1054.inserts = XMSC_INSERT_STRING
JMSCMQ1054.explanation = Uma seq\u00fc\u00eancia de escape do XML foi encontrada, que n\u00e3o \u00e9 v\u00e1lida no cabe\u00e7alho de MQRFH2 de uma mensagem recebida.
JMSCMQ1054.useraction = Assegure-se de que apenas as seq\u00fc\u00eancias de escape do XML v\u00e1lidas sejam colocadas nos cabe\u00e7alhos de MQRFH2 constru\u00eddos pelos aplicativos n\u00e3o JMS.
JMSCMQ1054.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1055 = A propriedade ou elemento na mensagem possui um tipo de dados ''{0}'' incompat\u00edvel com o m\u00e9todo utilizado para acess\u00e1-lo.
JMSCMQ1055.inserts = XMSC_INSERT_TYPE
JMSCMQ1055.explanation = O m\u00e9todo do acessador utilizado para recuperar uma propriedade de uma mensagem JMS \u00e9 incompat\u00edvel com o tipo de propriedade que est\u00e1 sendo recuperada. Por exemplo, uma tentativa de recuperar uma propriedade de inteiros utilizando o m\u00e9todo getBooleanProperty().
JMSCMQ1055.useraction = Utilize o m\u00e9todo do acessador definido pela especifica\u00e7\u00e3o do JMS como apto para recuperar os valores de propriedade do tipo necess\u00e1rio.
JMSCMQ1055.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1056 = O tipo de dados da propriedade ou do elemento ''{0}'' n\u00e3o \u00e9 suportado.
JMSCMQ1056.inserts = XMSC_INSERT_TYPE
JMSCMQ1056.explanation = Esse erro \u00e9 causado pela tentativa de configurar uma propriedade de uma mensagem JMS utilizando um objeto que n\u00e3o \u00e9 um dos tipos suportados ou tentativa de configurar ou receber uma mensagem cujo MQRFH2 cont\u00e9m um elemento representando uma propriedade que n\u00e3o possui um tipo v\u00e1lido associado a ele.
JMSCMQ1056.useraction = Assegure-se de utilizar um tipo de objeto JMS v\u00e1lido ao configurar as propriedades da mensagem. Se essa exce\u00e7\u00e3o ocorrer ao receber uma mensagem contendo um cabe\u00e7alho de MQRFH2 enviado por um aplicativo n\u00e3o JMS, assegure-se de que o cabe\u00e7alho de MQRFH2 esteja bem formado.
JMSCMQ1056.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1066 = Nome da propriedade n\u00e3o suportado ''{0}''.
JMSCMQ1066.inserts = XMSC_INSERT_PROPERTY
JMSCMQ1066.explanation =  Tentativa de configurar uma propriedade de mensagem utilizando um nome da propriedade que n\u00e3o \u00e9 v\u00e1lido ou o nome de uma propriedade que n\u00e3o pode ter seu valor configurado. 
JMSCMQ1066.useraction = Assegure-se que o nome da propriedade especificado est\u00e1 em conformidade com a especifica\u00e7\u00e3o do JMS. Se o nome da propriedade fornecido \u00e9 o de uma propriedade do JMS ou uma extens\u00e3o espec\u00edfica do fornecedor, assegure-se de que esta propriedade pode ser configurada. 
JMSCMQ1066.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

