# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE
#

# JMSCMQ0001 doesn't have a .inserts message because it's only used by Reason in
# a WMQException, and never in a JMSException.
JMSCMQ0001 = Chiamata a IBM MQ non riuscita con codice completamento ''{0}'' (''{1}'') motivo ''{2}'' (''{3}'').

JMSCMQ0002 = Il metodo ''{0}'' non \u00e8 riuscito.
JMSCMQ0002.explanation = Una chiamata a IBM MQ non \u00e8 riuscita.
JMSCMQ0002.useraction = Per ulteriori informazioni, vedere l'eccezione collegata.
JMSCMQ0002.inserts = XMSC_INSERT_METHOD

JMSCMQ0003 = La destinazione ''{0}'' non riconosciuta o non pi\u00f9 valida.
JMSCMQ0003.explanation = La coda o argomento potrebbe non essere pi\u00f9 disponibile, l'applicazione potrebbe utilizzare una connessione non corretta per la coda o argomento oppure la destinazione fornita non \u00e8 del tipo corretto per questo metodo.
JMSCMQ0003.useraction = Controllare che IBM MQ sia ancora in esecuzione e che il gestore code sia disponibile. Controllare che venga usata la giusta connessione per la coda o argomento.
JMSCMQ0003.inserts = XMSC_DESTINATION_NAME
JMSCMQ0003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCMQ0004 = Il valore ''{0}'' non \u00e8 valido per la propriet\u00e0 ''{1}''.
JMSCMQ0004.explanation = Il valore della propriet\u00e0 ''{1}'' non fa parte dei valori validi per questa propriet\u00e0.
JMSCMQ0004.useraction = Impostare la propriet\u00e0 con un valore valido.
JMSCMQ0004.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_PROPERTY

JMSCMQ0005 = Il nome della destinazione ''{0}'' non \u00e8 valido.
JMSCMQ0005.explanation = Il nome della destinazione specificato non \u00e8 conforme alla sintassi della destinazione pubblicata.
JMSCMQ0005.useraction = Correggere il nome della destinazione specificata e riprovare.
JMSCMQ0005.inserts = XMSC_DESTINATION_NAME
JMSCMQ0005.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCMQ0006 = La destinazione non \u00e8 una destinazione temporanea e non pu\u00f2 essere eliminata.
JMSCMQ0006.explanation = Solo le destinazioni temporanee possono essere eliminate.

JMSCMQ0007 = Una propriet\u00e0 sconosciuta ''{0}'' con valore ''{1}'' \u00e8 stata impostata sul contesto della propriet\u00e0 di destinazione.
JMSCMQ0007.explanation = La propriet\u00e0 ''{0}'' non \u00e8 stata riconosciuta - potrebbe essere una propriet\u00e0 personalizzata.
JMSCMQ0007.useraction = Assicurarsi che sia a tutti gli effetti una propriet\u00e0 personalizzata.
JMSCMQ0007.inserts = XMSC_INSERT_KEY, XMSC_INSERT_VALUE

JMSCMQ0008 = IBM MQ classes per JMS tenta di utilizzare un tipo di dati non supportato da un messaggio o tentano di leggere dati di tipo errato.
JMSCMQ0008.explanation = Tipi di dati non corretti per leggere i tipi di propriet\u00e0 del messaggio.
JMSCMQ0008.useraction = Verificare che il messaggio ricevuto e le propriet\u00e0 da leggere siano del tipo previsto.
JMSCMQ0008.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ0009 = \u00c8 stata raggiunta inaspettatamente la fine del flusso durante la lettura di un messaggio di flusso o di un messaggio di byte.
JMSCMQ0009.explanation = Il flusso di byte che viene letto \u00e8 minore del buffer fornito. Ci\u00f2 pu\u00f2 anche essere causato dalla ricezione di un messaggio di flusso o di byte danneggiato.
JMSCMQ0009.useraction = Verificare la lunghezza del buffer fornito. Controllare i log degli eventi di sistema per ulteriori informazioni dettagliate e ogni altro eventuale errore riportato.
JMSCMQ0009.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCMQ0017 = Fine del flusso.
JMSCMQ0017.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCMQ0018 = Impossibile analizzare correttamente un messaggio ricevuto.
JMSCMQ0018.explanation = Non \u00e8 stato possibile analizzare correttamente il messaggio con messageID = ''{0}'' e correlationID = ''{1}''. L''ultima lettura di dati corretta dal messaggio \u00e8 stata nella posizione ''{2}'' nel buffer ''{3}''  
JMSCMQ0018.useraction = Esaminare i dati del messaggio e assicurarsi che siano nel formato corretto perch\u00e9 il messaggio venga analizzato come messaggio MQJMS.
JMSCMQ0018.inserts = XMSC_MESSAGE_ID, XMSC_CORRELATION_ID, XMSC_MESSAGE_BUFFER_POSITION, XMSC_MESSAGE_BUFFER

JMSCMQ1000 = Creazione del messaggio JMS non riuscita.
JMSCMQ1000.explanation = Sono stati specificati il tipo o le propriet\u00e0 messaggio errati durante la creazione di un messaggio di base con messageID = ''{0}'' e correlationID = ''{1}''.
JMSCMQ1000.useraction = Per ulteriori informazioni controllare il codice motivo e di completamento dell'eccezione IBM MQ collegata e controllare il file di log per il contenuto dettagliato del messaggio.
JMSCMQ1000.inserts = XMSC_MESSAGE_ID, XMSC_CORRELATION_ID

JMSCMQ1006 = Il valore per ''{0}'':''{1}'' non \u00e8 valido.
JMSCMQ1006.explanation = Il valore ''{1}'' della propriet\u00e0 ''{0}'' non \u00e8 corretto.
JMSCMQ1006.useraction = Controllare il codice motivo e di completamento dell'eccezione IBM MQ collegata.
JMSCMQ1006.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_VALUE

JMSCMQ1044 = La stringa non \u00e8 un numero esadecimale valido: ''{0}''.
JMSCMQ1044.inserts = XMSC_INSERT_HEX_STRING
JMSCMQ1044.explanation = \u00c8 stato fatto un tentativo di specificare un ID gruppo o ID correlazione che inizia con l'ID prefisso ma non \u00e8 seguito da un valore esadecimale di formato corretto oppure \u00e8 stato fatto un tentativo di richiamare un messaggio che contiene una propriet\u00e0 MQRFH2 di tipo bin.hex che non ha un valore esadecimale di formato corretto.
JMSCMQ1044.useraction = Assicurarsi che l'ID prefisso sia sempre seguito da un valore esadecimale valido quando si impostano i valori dell'ID gruppo o ID correlazione. Assicurarsi che tutte le intestazioni MQRFH2 generate da applicazioni non JMS siano nel formato corretto.

JMSCMQ1046 = La serie di caratteri ''{0}'' non \u00e8 supportata.
JMSCMQ1046.inserts = CCSID
JMSCMQ1046.explanation = \u00c8 stato fatto un tentativo di inviare o ricevere un messaggio di associazione, di flusso o di testo il cui testo \u00e8 codificato utilizzando una serie di caratteri non supportata dalla JVM. Nel caso di messaggi di testo, questa eccezione potrebbe essere emessa quando viene eseguita una query sul testo del messaggio prima che venga ricevuto.
JMSCMQ1046.useraction = Codificare un messaggio utilizzando solo una serie di caratteri nota all'applicazione ricevente.

JMSCMQ1047 = Il messaggio di associazione ha un formato non corretto.
JMSCMQ1047.explanation = \u00c8 stato ricevuto un messaggio di associazione, ma le informazioni dell'intestazione MQRFH2 non sono formattate correttamente.
JMSCMQ1047.useraction = Assicurarsi che tutte le applicazioni non JMS creino nel formato corretto le informazioni di intestazione MQRFH2 da inserire nei messaggi di associazione.
JMSCMQ1047.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1048 = Il messaggio di flusso ha un formato non valido.
JMSCMQ1048.explanation = Un messaggio di flusso \u00e8 stato ricevuto e non \u00e8 formattato correttamente.
JMSCMQ1048.useraction = Assicurarsi che tutte le applicazioni non JMS stiano creando messaggi di flusso nel formato corretto.
JMSCMQ1048.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1049 = La serie di caratteri ''{0}'' non riesce a convertire l''intera stringa ''{1}'' o parte di essa
JMSCMQ1049.inserts = CCSID, XMSC_INSERT_VALUE
JMSCMQ1049.explanation = \u00c8 stato fatto un tentativo di inviare o ricevere dati stringa utilizzando una serie di caratteri che non \u00e8 in grado di convertire il contenuto della stringa.
JMSCMQ1049.useraction = Codificare un messaggio utilizzando solo una serie di caratteri che sia appropriata per i dati stringa da trasmettere.

JMSCMQ1050 = L'intestazione MQRFH2 ha un formato non corretto
JMSCMQ1050.explanation = Ricevuto un messaggio con un'intestazione MQRFH2 in formato non corretto.
JMSCMQ1050.useraction = Assicurarsi che tutte le applicazioni non JMS che creino messaggi con intestazioni MQRFH2, creino intestazioni MQRFH2 di formato corretto.
JMSCMQ1050.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1053 = \u00c8 stato rilevato il carattere derivato UTF-16 ''{0}'' non valido.
JMSCMQ1053.inserts = XMSC_INSERT_CHARACTER
JMSCMQ1053.explanation = \u00c8 stato rilevato un carattere derivato UTF-16 che non \u00e8 valido come parte del nome o propriet\u00e0 MQRFH2 di un argomento.
JMSCMQ1053.useraction = Assicurarsi che, quando si specifica UTF-16, i nomi o le propriet\u00e0 MQRFH2 dell'argomento siano nel formato corretto.
JMSCMQ1053.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1054 = \u00c8 stata rilevata una sequenza di escape XML ''{0}'' non corretta.
JMSCMQ1054.inserts = XMSC_INSERT_STRING
JMSCMQ1054.explanation = \u00c8 stata rilevata una sequenza di escape XML non valida nell'intestazione MQRFH2 di un messaggio ricevuto.
JMSCMQ1054.useraction = Assicurarsi di inserire solo sequenze di escape XML valide in tutte le intestazioni MQRFH2 create dalle applicazioni non JMS.
JMSCMQ1054.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1055 = La propriet\u00e0 o l''elemento nel messaggio ha un tipo di dato ''{0}'' non compatibile con il metodo utilizzato per accederlo.
JMSCMQ1055.inserts = XMSC_INSERT_TYPE
JMSCMQ1055.explanation = Il metodo di accesso utilizzato per richiamare una propriet\u00e0 da un messaggio JMS non \u00e8 compatibile con il tipo di propriet\u00e0 che viene richiamata. Ad esempio, si tenta di richiamare una propriet\u00e0 di tipo intero utilizzando il metodo getBooleanProperty().
JMSCMQ1055.useraction = Utilizzare un metodo di accesso definito dalla specifica JMS in grado di richiamare i valori della propriet\u00e0 del tipo richiesto.
JMSCMQ1055.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1056 = Tipo di dati ''{0}'' della propriet\u00e0 o dell''elemento non supportato.
JMSCMQ1056.inserts = XMSC_INSERT_TYPE
JMSCMQ1056.explanation = Questo errore \u00e8 causato dal tentativo di impostare una propriet\u00e0 di un messaggio JMS utilizzando un oggetto che non \u00e8 fra i tipi supportati o si tenta di impostare o ricevere un messaggio il cui MQRFH2 contiene un elemento che rappresenta una propriet\u00e0 che non ha associato un tipo valido.
JMSCMQ1056.useraction = Assicurarsi, quando si impostano le propriet\u00e0 del messaggio, di utilizzare un tipo di oggetto JMS valido. Se questa eccezione si verifica durante la ricezione di un messaggio che contiene un'intestazione MQRFH2 inviato da un'applicazione non JMS, assicurarsi che l'intestazione MQRFH2 sia nel formato corretto.
JMSCMQ1056.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1066 = Nome propriet\u00e0 ''{0}'' non supportato.
JMSCMQ1066.inserts = XMSC_INSERT_PROPERTY
JMSCMQ1066.explanation =  \u00c8 stato fatto un tentativo di impostare una propriet\u00e0 del messaggio utilizzando un nome propriet\u00e0 non valido oppure il nome di una propriet\u00e0 che non ha impostato il suo valore. 
JMSCMQ1066.useraction = Assicurarsi che il nome della propriet\u00e0 specificato sia conforme alla specifica JMS. Se il nome della propriet\u00e0 fornito \u00e8 quello di una propriet\u00e0 JMS o un'estensione specifica del fornitore, assicurarsi che questa propriet\u00e0 possa essere impostata. 
JMSCMQ1066.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

