# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
#

# JMSWMQ0002 is a WMQException message so no .inserts needed
JMSWMQ0002 = Diagnostics en trop fournis par MQSTAT : code ach\u00e8vement ''{0}'', motif ''{1}'', nom d''objet ''{2}'', nom d''objet r\u00e9solu ''{3}'', type d''objet ''{4}'', nom de gestionnaire de files d''attente ''{5}'', nom de gestionnaire de files d''attente r\u00e9solu ''{6}'', nombre d''incidents d''insertion ''{7}'', nombre d''insertions r\u00e9ussies ''{8}'', nombre d''avertissements d''insertion ''{9}''.

JMSWMQ0003 = Le niveau de commande ''{0}'' du gestionnaire de files d''attente ne correspondait pas \u00e0 la version de fournisseur ''{1}'' demand\u00e9e.
JMSWMQ0003.inserts = XMSC_INSERT_COMMAND_LEVEL, XMSC_WMQ_PROVIDER_VERSION

JMSWMQ0006 = IBM MQ classes for JMS tente d'utiliser un type de donn\u00e9es non pris en charge par un message ou de lire des donn\u00e9es de type incorrect.
JMSWMQ0006.explanation = Types de donn\u00e9es incorrects utilis\u00e9s pour lire les types de propri\u00e9t\u00e9s de message.
JMSWMQ0006.useraction = V\u00e9rifiez que les types du message re\u00e7u et des propri\u00e9t\u00e9s \u00e0 lire sont corrects.
JMSWMQ0006.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSWMQ0007 = IBM MQ classes for JMS tente d'utiliser un type de donn\u00e9es non pris en charge par un message ou de lire des donn\u00e9es de type incorrect.
JMSWMQ0007.explanation = Types de donn\u00e9es incorrects utilis\u00e9s pour lire les types de propri\u00e9t\u00e9s de message.
JMSWMQ0007.useraction = V\u00e9rifiez que les types du message re\u00e7u et des propri\u00e9t\u00e9s \u00e0 lire sont corrects.
JMSWMQ0007.exception = com.ibm.msg.client.jms.DetailedMessageNotReadableException

JMSWMQ0008 = IBM MQ classes for JMS tente d'utiliser un type de donn\u00e9es non pris en charge par un message ou d'\u00e9crire des donn\u00e9es de type incorrect.
JMSWMQ0008.explanation = Types de donn\u00e9es incorrects utilis\u00e9s pour enregistrer les types de propri\u00e9t\u00e9s de message.
JMSWMQ0008.useraction = V\u00e9rifiez que les types du message re\u00e7u et des propri\u00e9t\u00e9s \u00e0 enregistrer sont corrects.
JMSWMQ0008.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSWMQ0009 = IBM MQ classes for JMS ne parvient pas \u00e0 allouer les ressources requises pour une m\u00e9thode.
JMSWMQ0009.explanation = Les ressources de la machine sont peut-\u00eatre surcharg\u00e9es ; pour plus d'informations, v\u00e9rifiez l'exception associ\u00e9e.
JMSWMQ0009.useraction = V\u00e9rifiez les ressources syst\u00e8me et la charge.
JMSWMQ0009.exception = com.ibm.msg.client.jms.DetailedResourceAllocationException

JMSWMQ0010 = Impossible d''obtenir le niveau de commande du gestionnaire de files d''attente ''{0}''.
JMSWMQ0010.useraction = Reportez-vous \u00e0 l'exception associ\u00e9e pour plus d'informations.
JMSWMQ0010.inserts = XMSC_INSERT_QUEUE_MANAGER

JMSWMQ0011 = Impossible d''initialiser l''interface Java(tm) pour l''interface MQI ''{0}''.
JMSWMQ0011.useraction = Reportez-vous \u00e0 l'exception associ\u00e9e pour plus d'informations.
JMSWMQ0011.inserts = XMSC_INSERT_EXCEPTION

JMSWMQ0013 = Impossible de mettre le travail en file d'attente.
JMSWMQ0013.useraction = Reportez-vous \u00e0 l'exception associ\u00e9e pour plus d'informations.

JMSWMQ0014 = Impossible de convertir une valeur null en valeur byte, int, short ou long.
JMSWMQ0014.exception = java.lang.NumberFormatException

JMSWMQ0015 = Impossible de convertir une valeur null en valeur character, double ou float.
JMSWMQ0015.exception = java.lang.NullPointerException

JMSWMQ0016 = Echec de la s\u00e9rialisation de l'objet.
JMSWMQ0016.useraction = Reportez-vous au motif pour plus d'informations.
JMSWMQ0016.exception = java.lang.IOException

JMSWMQ0017 = Fil du flux.
JMSWMQ0017.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSWMQ0018 = Echec de la connexion au gestionnaire de files d''attente ''{0}'' \u00e0 l''aide du mode de connexion ''{1}'' et du nom d''h\u00f4te ''{2}''.
JMSWMQ0018.useraction = V\u00e9rifiez que le gestionnaire de files d'attente est d\u00e9marr\u00e9 et, s'il est ex\u00e9cut\u00e9 en mode client, v\u00e9rifiez qu'un programme d'\u00e9coute est en cours d'ex\u00e9cution. Reportez-vous \u00e0 l'exception associ\u00e9e pour plus d'informations.
JMSWMQ0018.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_HOST_NAME

JMSWMQ0019 = Echec de la d\u00e9connexion du gestionnaire de files d''attente ''{0}'' \u00e0 l''aide du mode de connexion ''{1}'' et du nom d''h\u00f4te ''{2}''.
JMSWMQ0019.useraction = Reportez-vous \u00e0 l'exception associ\u00e9e pour plus d'informations.
JMSWMQ0019.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_HOST_NAME

JMSWMQ0020 = Impossible d''enregistrer le rappel \u00e0 l''aide de MQCB pour la destination ''{0}''.
JMSWMQ0020.useraction = Reportez-vous \u00e0 l'exception associ\u00e9e pour plus d'informations.
JMSWMQ0020.inserts = XMSC_DESTINATION_NAME

JMSWMQ0021 = Impossible de d\u00e9senregistrer le rappel \u00e0 l''aide de MQCB pour la destination ''{0}''.
JMSWMQ0021.useraction = Reportez-vous \u00e0 l'exception associ\u00e9e pour plus d'informations.
JMSWMQ0021.inserts = XMSC_DESTINATION_NAME

JMSWMQ0022 = Impossible de commencer \u00e0 consommer les messages \u00e0 l''aide de MQCTL pour la destination ''{0}''.
JMSWMQ0022.useraction = Reportez-vous \u00e0 l'exception associ\u00e9e pour plus d'informations.
JMSWMQ0022.inserts = XMSC_DESTINATION_NAME

JMSWMQ0023 = Impossible de suspendre la consommation des messages \u00e0 l''aide de MQCTL pour la destination ''{0}''.
JMSWMQ0023.useraction = Reportez-vous \u00e0 l'exception associ\u00e9e pour plus d'informations.
JMSWMQ0023.inserts = XMSC_DESTINATION_NAME

JMSWMQ0024 = Impossible de reprendre la consommation des messages \u00e0 l''aide de MQCTL pour la destination ''{0}''.
JMSWMQ0024.useraction = Reportez-vous \u00e0 l'exception associ\u00e9e pour plus d'informations.
JMSWMQ0024.inserts = XMSC_DESTINATION_NAME

JMSWMQ0025 = Impossible de se d\u00e9sabonner de la rubrique ''{0}'' \u00e0 l''aide de MQCLOSE.
JMSWMQ0025.explanation = Un incident a pu se produire lors de la suppression de l'abonnement car ce dernier est utilis\u00e9 par un consommateur de message.
JMSWMQ0025.useraction = Assurez-vous que les consommateurs de message utilisant cet abonnement sont ferm\u00e9s avant de vous d\u00e9sabonner. Reportez-vous \u00e0 l'exception associ\u00e9e pour plus d'informations.
JMSWMQ0025.inserts = XMSC_DESTINATION_NAME

JMSWMQ0026 = Echec de l''abonnement \u00e0 la rubrique ''{0}'' avec le s\u00e9lecteur ''{1}'' \u00e0 l''aide de MQSUB.
JMSWMQ0026.explanation = Un incident a pu se produire lors de la cr\u00e9ation de l'abonnement car ce dernier est utilis\u00e9 par un autre consommateur de message.
JMSWMQ0026.useraction = Assurez-vous que les consommateurs de message utilisant cet abonnement sont ferm\u00e9s avant de cr\u00e9er un abonnement sous le m\u00eame nom. Reportez-vous \u00e0 l'exception associ\u00e9e pour plus d'informations.
JMSWMQ0026.inserts = XMSC_DESTINATION_NAME, XMSC_SELECTOR_STRING

# The insert for this message is CommonConstants.WMQ_ENCODING = "encoding".
# If WMQ_ENCODING is changed then this value here must also be changed.
JMSWMQ0027 = Le message contient un codage incorrect : ''{0}''.
JMSWMQ0027.explanation = Un message contenant un en-t\u00eate dont la syntaxe est incorrecte a \u00e9t\u00e9 re\u00e7u. Le codage doit \u00eatre normal ou invers\u00e9.
JMSWMQ0027.useraction = V\u00e9rifiez que les applications non JMS qui g\u00e9n\u00e8rent des messages cr\u00e9ent des en-t\u00eates syntaxiquement corrects.
JMSWMQ0027.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSWMQ0027.inserts = codage

JMSWMQ0028 = Au moins un message d'insertion asynchrone a \u00e9chou\u00e9 ou affich\u00e9 un avertissement.
JMSWMQ0028.explanation = Lorsqu'un message est ins\u00e9r\u00e9 de mani\u00e8re asynchrone, les incidents ne sont pas signal\u00e9s comme des exceptions g\u00e9n\u00e9r\u00e9es \u00e0 partir de la m\u00e9thode send(). Ils sont transmis au programme d'\u00e9coute des exceptions, si ce dernier a \u00e9t\u00e9 d\u00e9fini. Le programme d'\u00e9coute des exceptions est g\u00e9r\u00e9 au point de synchronisation pour les sessions transactionnelles ou \u00e0 chaque insertion asynchrone de SEND_CHECK_COUNT pour les sessions non transactionnelles.
JMSWMQ0028.useraction = Reportez-vous \u00e0 l'exception associ\u00e9e pour plus d'informations sur les \u00e9checs et/ou les avertissements.

JMSWMQ0029 = Impossible d''envoyer un message de rapport \u00e0 la file d''attente replyTo ''{0}''. 
JMSWMQ0029.useraction = Reportez-vous \u00e0 l'exception associ\u00e9e pour plus d'informations sur les \u00e9checs et/ou les avertissements.
JMSWMQ0029.inserts = XMSC_DESTINATION_NAME

JMSWMQ0030 = ''{0}'' a \u00e9chou\u00e9 pour la destination ''{1}'' lors du traitement d''un message empoisonn\u00e9. 
JMSWMQ0030.explanation = Lorsqu''un message empoisonn\u00e9 a \u00e9t\u00e9 remis en file d''attente, ''{0}'' a \u00e9chou\u00e9 lors de son appel pour la destination ''{1}''.  
JMSWMQ0030.useraction = Reportez-vous \u00e0 l'exception associ\u00e9e pour plus d'informations sur les \u00e9checs et/ou les avertissements.
JMSWMQ0030.inserts = XMSC_INSERT_METHOD, XMSC_DESTINATION_NAME

JMSWMQ0031 = ''{0}'' a \u00e9chou\u00e9 pour le gestionnaire de files d''attente lors du traitement d''un message empoisonn\u00e9. 
JMSWMQ0031.explanation = Lorsqu''un message empoisonn\u00e9 a \u00e9t\u00e9 remis en file d''attente, ''{0}'' a \u00e9chou\u00e9 lors de sa tentative de demande d''informations sur le gestionnaire de files d''attente.  
JMSWMQ0031.useraction = Reportez-vous \u00e0 l'exception associ\u00e9e pour plus d'informations sur les \u00e9checs et/ou les avertissements.
JMSWMQ0031.inserts = XMSC_INSERT_METHOD

JMSWMQ0032 = Aucune file d'attente de rebut n'a \u00e9t\u00e9 d\u00e9finie.
JMSWMQ0032.explanation = IBM MQ classes for JMS a tent\u00e9 d'ins\u00e9rer un message empoisonn\u00e9 dans la file d'attente de rebut \
car ce dernier ne pouvait pas \u00eatre achemin\u00e9 \u00e0 la file d'attente de nouvelle tentative d'annulation. Cette op\u00e9ration a \u00e9chou\u00e9 car aucune file d'attente de rebut n'\u00e9tait d\u00e9finie pour le gestionnaire de files d'attente. 
JMSWMQ0032.useraction = D\u00e9finissez une file d'attente de rebut.

JMSWMQ0033 = Le nom de la nouvelle mise en file d''attente d''annulation pour la destination ''{0}'' ne peut pas \u00eatre converti \u00e0 partir de l''ID jeu de caract\u00e8res cod\u00e9s ''{1}'' du gestionnaire de files d''attente.
JMSWMQ0033.useraction = V\u00e9rifiez le nom de la nouvelle mise en file d'attente d'annulation et l'ID jeu de caract\u00e8res cod\u00e9s du gestionnaire de files d'attente. 
JMSWMQ0033.inserts = XMSC_DESTINATION_NAME, CCSID

JMSWMQ0034 = Le nom de la file d''attente de rebut ne peut pas \u00eatre converti \u00e0 partir de l''ID jeu de caract\u00e8res cod\u00e9s ''{0}'' du gestionnaire de files d''attente.
JMSWMQ0034.useraction = V\u00e9rifiez le nom de la file d'attente de rebut et l'ID jeu de caract\u00e8res cod\u00e9s du gestionnaire de files d'attente.
JMSWMQ0034.inserts = CCSID

JMSWMQ0035 = impossible d''enregistrer dans la file d''attente de rebut en raison de l''exception ''{0}''.
JMSWMQ0035.explanation = IBM MQ classes for JMS n'est pas parvenu \u00e0 remettre un message dans la file d'attente de rebut.
JMSWMQ0035.inserts = XMSC_INSERT_EXCEPTION

JMSWMQ0036 = Les utilitaires du serveur d''applications ont intercept\u00e9s l''exception ''{0}''.
JMSWMQ0036.explanation = Le navigateur de connexion du produit IBM MQ classes for JMS a intercept\u00e9 une exception.
JMSWMQ0036.inserts = XMSC_INSERT_EXCEPTION

JMSWMQ0037 = Un message empoisonn\u00e9 n''a pas pu \u00eatre trait\u00e9 en raison de l''exception ''{0}''.
JMSWMQ0037.explanation = Le programme d'\u00e9coute des messages IBM MQ classes for JMS a intercept\u00e9 une exception.
JMSWMQ0037.inserts = XMSC_INSERT_EXCEPTION

JMSWMQ1006 = La valeur de ''{0}'' : ''{1}'' n''est pas valide.
JMSWMQ1006.explanation = La valeur ''{1}'' de la propri\u00e9t\u00e9 ''{0}'' n''est pas correcte.
JMSWMQ1006.useraction = V\u00e9rifiez le motif d'exception IBM MQ associ\u00e9 et le code ach\u00e8vement.
JMSWMQ1006.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_VALUE

JMSWMQ1017 = La file d''attente MQ non locale ''{0}'' est incorrecte pour la r\u00e9ception ou l''exploration.
JMSWMQ1017.explanation = Il est impossible d'ouvrir la file d'attente MQ car elle n'est pas \
locale par rapport au gestionnaire de files d'attente connect\u00e9. 
JMSWMQ1017.useraction = Connectez-vous au gestionnaire de files d'attente auquel cette file \
d'attente MQ est associ\u00e9e en mode local.
JMSWMQ1017.inserts = XMSC_DESTINATION_NAME

JMSWMQ1029 = Le nom de la propri\u00e9t\u00e9 est null.
JMSWMQ1029.explanation = La m\u00e9thode itemExists() du message de mappe a \u00e9t\u00e9 appel\u00e9e avec un nom d'\u00e9l\u00e9ment null ou une cha\u00eene de nom null a \u00e9t\u00e9 utilis\u00e9e comme argument pour une m\u00e9thode qui extrait les valeurs de propri\u00e9t\u00e9 par nom d'un message JMS.
JMSWMQ1029.useraction = V\u00e9rifiez que les cha\u00eenes de nom indiqu\u00e9es ne poss\u00e8dent pas de valeurs null.

JMSWMQ1044 = La cha\u00eene n''est pas une valeur hexad\u00e9cimale valide - ''{0}''.
JMSWMQ1044.inserts = XMSC_INSERT_HEX_STRING
JMSWMQ1044.explanation = Tentative de sp\u00e9cification d'un ID groupe ou d'un ID corr\u00e9lation commen\u00e7ant par l'ID pr\u00e9fixe, mais non suivi d'une valeur hexad\u00e9cimale syntaxiquement correcte ou tentative de r\u00e9ception d'un message contenant une propri\u00e9t\u00e9 MQRFH2 de type bin.hex ne poss\u00e9dant pas une valeur hexad\u00e9cimale syntaxiquement correcte.
JMSWMQ1044.useraction = V\u00e9rifiez qu'une valeur hexad\u00e9cimale valide suit l'ID pr\u00e9fixe lorsque vous d\u00e9finissez des ID groupe ou des ID corr\u00e9lation. V\u00e9rifiez que les en-t\u00eates MQRFH2 g\u00e9n\u00e9r\u00e9s par les applications non JMS sont syntaxiquement corrects.

JMSWMQ1046 = Le jeu de caract\u00e8res ''{0}'' n''est pas pris en charge.
JMSWMQ1046.inserts = CCSID
JMSWMQ1046.explanation = Tentative d'envoi ou de r\u00e9ception d'un message de mappe, d'un message de flux ou d'un message de texte dont le corps est cod\u00e9 \u00e0 l'aide d'un jeu de caract\u00e8res non pris en charge par la machine JVM. Dans le cas des messages de texte, cette exception peut \u00eatre g\u00e9n\u00e9r\u00e9e lorsque le corps du message est interrog\u00e9 pour la premi\u00e8re fois et non lors de la r\u00e9ception.
JMSWMQ1046.useraction = Ne codez un message qu'\u00e0 l'aide d'un jeu de caract\u00e8res accessible par l'application destinatrice.
JMSWMQ1046.exception = com.ibm.msg.client.jms.DetailedMessageFormatException


JMSWMQ1051 = D\u00e9tails du message

JMSWMQ1055 = La propri\u00e9t\u00e9 ou l''\u00e9l\u00e9ment du message poss\u00e8de un type de donn\u00e9es ''{0}'' incompatible avec la m\u00e9thode utilis\u00e9e pour y acc\u00e9der.
JMSWMQ1055.inserts = XMSC_INSERT_TYPE
JMSWMQ1055.explanation = La m\u00e9thode d'acc\u00e8s utilis\u00e9e pour extraire une propri\u00e9t\u00e9 d'un message JMS est incompatible avec le type de la propri\u00e9t\u00e9 extraite. Par exemple, tentative d'extraction d'une propri\u00e9t\u00e9 entier \u00e0 l'aide de la m\u00e9thode getBooleanProperty().
JMSWMQ1055.useraction = Utilisez une m\u00e9thode d'acc\u00e8s d\u00e9finie par la sp\u00e9cification JMS comme pouvant extraire des valeurs de propri\u00e9t\u00e9 du type requis.
JMSWMQ1055.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSWMQ1059 = Erreur fatale - Page de codes UTF-8 non prise en charge.
JMSWMQ1059.explanation = L'environnement d'ex\u00e9cution Java(tm) que vous utilisez ne prend pas en charge le codage de caract\u00e8res UTF-8. JMS requiert ce codage pour certaines op\u00e9rations.
JMSWMQ1059.useraction = Consultez la documentation ou adressez-vous au fournisseur de votre environnement d'ex\u00e9cution Java(tm) pour d\u00e9terminer comment obtenir de l'aide pour le codage des caract\u00e8res UTF-8.
JMSWMQ1059.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSWMQ1067 = D\u00e9lai d''expiration ''{0}'' non valide pour IBM MQ classes for JMS.
JMSWMQ1067.explanation = Tentative d'appel de la m\u00e9thode de r\u00e9ception dans une m\u00e9thode de r\u00e9cepteur de file d'attente ou d'abonn\u00e9 de rubrique, en sp\u00e9cifiant un d\u00e9lai d'expiration non valide.
JMSWMQ1067.useraction = V\u00e9rifiez que le d\u00e9lai d'expiration sp\u00e9cifi\u00e9 n'est pas n\u00e9gatif ou sup\u00e9rieur \u00e0 la valeur d'Integer.MAX_VALUE.
JMSWMQ1067.inserts = XMSC_INSERT_TIMEOUT

JMSWMQ1068 = Impossible d'obtenir la ressource XA.
JMSWMQ1068.explanation = IBM MQ classes for JMS n'est pas parvenu \u00e0 cr\u00e9er une ressource XA en raison d'une erreur.
JMSWMQ1068.useraction = Reportez-vous \u00e0 l'exception XA associ\u00e9e pour plus d'informations.

JMSWMQ1079 = Impossible d'\u00e9crire de message dans la file d'attente de rebut.
JMSWMQ1079.explanation = IBM MQ classes for JMS n'est pas parvenu \u00e0 remettre un message dans la file d'attente de rebut.
JMSWMQ1079.useraction = D\u00e9terminez le motif de cette erreur \u00e0 l'aide de l'exception associ\u00e9e. Si aucune exception n'est associ\u00e9e, v\u00e9rifiez qu'une file d'attente de rebut a \u00e9t\u00e9 d\u00e9finie dans le gestionnaire de files d'attente. Une fois que IBM MQ classes for JMS a envoy\u00e9 un message \u00e0 la file d'attente de rebut, le code anomalie stock\u00e9 dans le MQDLH du message peut \
\u00eatre utilis\u00e9 pour d\u00e9terminer pourquoi le message y a \u00e9t\u00e9 envoy\u00e9.

JMSWMQ1080 = Aucune file d'attente Annulation-Remise en file d'attente d\u00e9finie.

JMSWMQ1096 = Une r\u00e9f\u00e9rence de message \u00e9tait syntaxiquement incorrecte.

JMSWMQ1107 = Un incident s'est produit avec cette connexion.
JMSWMQ1107.explanation = Une erreur s'est produite lors de la connexion IBM MQ JMS.
JMSWMQ1107.useraction = D\u00e9terminez le motif de cette erreur \u00e0 l'aide de l'exception associ\u00e9e.

JMSWMQ1116 = Le message ''{0}'', se trouvant dans la file d''attente ''{1}'' a \u00e9t\u00e9 d\u00e9plac\u00e9 dans la file d''attente de rebut du gestionnaire de files d''attente ''{2}''
JMSWMQ1116.explanation = Lors de l'ex\u00e9cution en mode normal du fournisseur de messagerie IBM MQ, un message a \u00e9t\u00e9 \
d\u00e9tect\u00e9, qui n'a pas pu \u00eatre trait\u00e9. Etant donn\u00e9 que la zone de rapport de l'\u00e9l\u00e9ment MQMD pour ce message contient l'option MQRO_DEAD_LETTER_Q, le message a \u00e9t\u00e9 d\u00e9plac\u00e9 dans la file d'attente de rebut. 
JMSWMQ1116.useraction = Consultez l'en-t\u00eate du message dans la file d'attente de rebut afin de d\u00e9terminer pourquoi le message n'a pas pu \u00eatre trait\u00e9. 
JMSWMQ1116.inserts = XMSC_INSERT_MESSAGE_ID, XMSC_INSERT_DESTINATION_NAME, XMSC_INSERT_QUEUE_MANAGER_NAME 

JMSWMQ1117 = Le message ''{0}'', se trouvant dans la file d''attente ''{1}'' du gestionnaire de files d''attente ''{2}'', ne peut pas \u00eatre trait\u00e9 car un en-t\u00eate MQRFH2 n''est pas valide. Le message a \u00e9t\u00e9 supprim\u00e9.
JMSWMQ1117.explanation = Lors de l'ex\u00e9cution en mode normal du fournisseur de messagerie IBM MQ, un message a \u00e9t\u00e9 d\u00e9tect\u00e9, \
qui n'a pas pu \u00eatre trait\u00e9. Etant donn\u00e9 que la zone de rapport de l'\u00e9l\u00e9ment MQMD pour ce message contient l'option MQRO_DISCARD_MSG, le message a \u00e9t\u00e9 supprim\u00e9. 
JMSWMQ1117.useraction = Modifiez les applications qui placent les messages dans la file d'attente sp\u00e9cifi\u00e9e de telle sorte que la zone de rapport de l'\u00e9l\u00e9ment MQMD pour le message contienne l'option MQRO_DEAD_LETTER_Q. Ainsi, tous les messages suivants ne pouvant pas \u00eatre trait\u00e9s seront d\u00e9plac\u00e9s dans la file d'attente de rebut au lieu d'\u00eatre supprim\u00e9s. Les messages de cette file d'attente ont un en-t\u00eate de rebut, contenant des informations indiquant pourquoi le message n'a pas pu \u00eatre trait\u00e9.
JMSWMQ1117.inserts = XMSC_INSERT_MESSAGE_ID, XMSC_INSERT_DESTINATION_NAME, XMSC_INSERT_QUEUE_MANAGER_NAME 

JMSWMQ1118 = La file d''attente ''{0}'' qui n''\u00e9tait pas autoris\u00e9e \u00e0 traiter les demandes GET a retrouv\u00e9 cette autorisation car le \
gestionnaire de files d''attente IBM MQ a r\u00e9pondu avec le code anomalie ''2494'' (''MQRC_GET_ENABLED'')
JMSWMQ1118.explanation = Une file d'attente \u00e0 laquelle un utilisateur est connect\u00e9 est d\u00e9sormais disponible pour la r\u00e9ception d'un message.
JMSWMQ1118.useraction = Aucune. Ce message s'affiche uniquement \u00e0 titre d'information.
JMSWMQ1118.inserts = XMSC_INSERT_DESTINATION_NAME

JMSWMQ1119 = La file d''attente ''{0}'' est actuellement inhib\u00e9e pour l''extraction des requ\u00eates ; le gestionnaire de files d''attente \
IBM MQ a r\u00e9pondu avec le code anomalie ''2016'' (''MQRC_GET_INHIBITED'').
JMSWMQ1119.explanation = Une file d'attente \u00e0 laquelle un utilisateur est connect\u00e9 n'est plus autoris\u00e9e \u00e0 traiter les demandes MQGET.
JMSWMQ1119.useraction = Attendez que l'administrateur IBM MQ ait r\u00e9activ\u00e9 la file d'attente pour les requ\u00eates MQGET. 
JMSWMQ1119.inserts = XMSC_INSERT_DESTINATION_NAME

# Same as JMSWMQ2003: queue variant.
JMSWMQ2000 = Impossible de fermer la file d''attente ''{0}''.
JMSWMQ2000.explanation = JMS a essay\u00e9 de fermer une destination IBM MQ, mais a rencontr\u00e9 une erreur. La destination est peut-\u00eatre d\u00e9j\u00e0 ferm\u00e9e ou une autre unit\u00e9 d'ex\u00e9cution effectue une op\u00e9ration MQGET alors que la m\u00e9thode close() est appel\u00e9e.
JMSWMQ2000.useraction = D\u00e9terminez le motif de cette erreur \u00e0 l'aide de l'exception associ\u00e9e. Vous pourrez certainement ex\u00e9cuter la m\u00e9thode close() ult\u00e9rieurement.
JMSWMQ2000.inserts = XMSC_DESTINATION_NAME

JMSWMQ2001 = Impossible de fermer la destination ''{0}'', \u00e0 l''aide de r\u00e8gles de fermeture de lecture anticip\u00e9e.
JMSWMQ2001.explanation = IBM MQ classes for JMS a essay\u00e9 de fermer une destination IBM MQ, mais a \
rencontr\u00e9 une erreur. L'appel de fermeture est arriv\u00e9 \u00e0 expiration lors de la tentative de distribution de tous les messages de la file d'attente de lecture anticip\u00e9e.
JMSWMQ2001.useraction = V\u00e9rifiez que votre programme d'\u00e9coute des messages ne boucle pas. Vous pourrez certainement ex\u00e9cuter la m\u00e9thode close() ult\u00e9rieurement.
JMSWMQ2001.inserts = XMSC_DESTINATION_NAME

JMSWMQ2002 = Impossible d''obtenir un message de la destination ''{0}''.
JMSWMQ2002.explanation = IBM MQ classes for JMS a tent\u00e9 d'effectuer une op\u00e9ration MQGET, mais IBM MQ a signal\u00e9 une erreur.
JMSWMQ2002.useraction = D\u00e9terminez le motif de cette erreur \u00e0 l'aide de l'exception associ\u00e9e.
JMSWMQ2002.inserts = XMSC_DESTINATION_NAME

# Same as JMSWMQ2000: topic variant.
JMSWMQ2003 = Impossible de fermer la rubrique ''{0}''.
JMSWMQ2003.explanation = JMS a essay\u00e9 de fermer une destination IBM MQ, mais a rencontr\u00e9 une erreur. La destination est peut-\u00eatre d\u00e9j\u00e0 ferm\u00e9e ou une autre unit\u00e9 d'ex\u00e9cution effectue une op\u00e9ration MQGET alors que la m\u00e9thode close() est appel\u00e9e.
JMSWMQ2003.useraction = D\u00e9terminez le motif de cette erreur \u00e0 l'aide de l'exception associ\u00e9e. Vous pourrez certainement ex\u00e9cuter la m\u00e9thode close() ult\u00e9rieurement.
JMSWMQ2003.inserts = XMSC_DESTINATION_NAME

# Same as JMSWMQ2008: topic variant.
JMSWMQ2006 = Impossible d''ouvrir la rubrique MQ ''{0}''.
JMSWMQ2006.explanation = JMS a tent\u00e9 d'effectuer une op\u00e9ration MQOPEN, mais IBM MQ a signal\u00e9 une erreur.
JMSWMQ2006.useraction = D\u00e9terminez le motif de cette erreur \u00e0 l'aide de l'exception associ\u00e9e. V\u00e9rifiez que la rubrique et le gestionnaire de files d'attente sp\u00e9cifi\u00e9s sont correctement d\u00e9finis.
JMSWMQ2006.inserts = XMSC_DESTINATION_NAME

JMSWMQ2007 = Impossible d''envoyer un message \u00e0 la destination ''{0}''.
JMSWMQ2007.explanation = JMS a tent\u00e9 d'effectuer une op\u00e9ration MQPUT ou MQPUT1, mais IBM MQ a signal\u00e9 une erreur.
JMSWMQ2007.useraction = D\u00e9terminez le motif de cette erreur \u00e0 l'aide de l'exception associ\u00e9e.
JMSWMQ2007.inserts = XMSC_DESTINATION_NAME

# Same as JMSWMQ2006: queue variant.
JMSWMQ2008 = Impossible d''ouvrir la file d''attente MQ ''{0}''.
JMSWMQ2008.explanation = JMS a tent\u00e9 d'effectuer une op\u00e9ration MQOPEN, mais IBM MQ a signal\u00e9 une erreur.
JMSWMQ2008.useraction = D\u00e9terminez le motif de cette erreur \u00e0 l'aide de l'exception associ\u00e9e. V\u00e9rifiez que la file d'attente et le gestionnaire de files d'attente sp\u00e9cifi\u00e9s sont correctement d\u00e9finis.
JMSWMQ2008.inserts = XMSC_DESTINATION_NAME

JMSWMQ2010 = La destination de la messagerie persistante NPMCLASS HIGH ''{0}'' n''\u00e9tait pas valide.
JMSWMQ2010.explanation = La destination sp\u00e9cifi\u00e9e ne prend pas en charge la messagerie persistante NPMCLASS HIGH.
JMSWMQ2010.useraction = Utilisez l'outil d'administration de JMS pour activer la messagerie persistante NPMCLASS HIGH pour cette destination.
JMSWMQ2010.inserts = XMSC_DESTINATION_NAME
JMSWMQ2010.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSWMQ2011 = Impossible d''ouvrir l''abonnement durable ''{0}'' pour la destination ''{1}''.
JMSWMQ2011.explanation = Jms a tent\u00e9 de cr\u00e9er un abonnement durable, mais le nom d'abonnement choisi \u00e9tait d\u00e9j\u00e0 en cours d'utilisation dans la machine JVM.
JMSWMQ2011.useraction = Utilisez un autre nom d'abonnement pour cet abonn\u00e9 durable ou ex\u00e9cutez cet abonn\u00e9 sur une autre machine JVM.
JMSWMQ2011.inserts = XMSC_INSERT_OBJECT, XMSC_DESTINATION_NAME
JMSWMQ2011.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSWMQ2012 = Echec de XACLOSE.
JMSWMQ2012.explanation = La fermeture de la ressource XA a \u00e9chou\u00e9 lors de la fermeture de la session XA.
JMSWMQ2012.useraction = Reportez-vous \u00e0 l'exception XA associ\u00e9e pour plus de d\u00e9tails.

JMSWMQ2013 = L''authentification de la s\u00e9curit\u00e9 fournie pour le gestionnaire de files d''attente ''{0}'' \u00e0 l''aide du mode de connexion ''{1}'' et du nom d''h\u00f4te ''{2}'' n''\u00e9tait pas valide.
JMSWMQ2013.useraction = V\u00e9rifiez si le nom d'utilisateur et le mot de passe fournis sont corrects dans le gestionnaire de files d'attente auquel vous vous connectez.
JMSWMQ2013.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_HOST_NAME

JMSWMQ2014 = MQ a distribu\u00e9 un \u00e9v\u00e9nement asynchrone avec le code ach\u00e8vement ''{0}'' et le motif ''{1}''.

JMSWMQ2016 = Impossible d'enregistrer ExceptionListener pour la connexion.
JMSWMQ2016.explanation = L'appel MQCB permettant d'enregistrer ce programme d'\u00e9coute des exceptions a \u00e9chou\u00e9.
JMSWMQ2016.useraction = D\u00e9terminez le motif de cette erreur \u00e0 l'aide de l'exception associ\u00e9e.

JMSWMQ2017 = Impossible de d\u00e9senregistrer ExceptionListener pour la connexion.
JMSWMQ2017.explanation = L'appel MQCB permettant de d\u00e9senregistrer ce programme d'\u00e9coute des exceptions a \u00e9chou\u00e9.
JMSWMQ2017.useraction = D\u00e9terminez le motif de cette erreur \u00e0 l'aide de l'exception associ\u00e9e.

# Log message
JMSWMQ2018 = Exception ignor\u00e9e car aucun programme d''\u00e9coute des exceptions n''est enregistr\u00e9 : ''{0}''.
JMSWMQ2018.explanation = Tentative de distribution d'une exception au programme d'\u00e9coute des exception de connexion alors qu'aucun programme d'\u00e9coute n'a \u00e9t\u00e9 enregistr\u00e9.
JMSWMQ2018.useraction = Un programme d'\u00e9coute des exceptions doit \u00eatre enregistr\u00e9 avec la connexion pour recevoir ses exceptions.
JMSWMQ2018.inserts = XMSC_INSERT_EXCEPTION

#Log message
JMSWMQ2019 = Code ach\u00e8vement ''{0}'' inattendu, Motif ''{1}'' renvoy\u00e9 par la m\u00e9thode ''{2}''.
JMSWMQ2019.explanation = Le motif n'\u00e9tait pas attendu, mais il n'a pas \u00e9t\u00e9 renvoy\u00e9 \u00e0 l'application.
JMSWMQ2019.useraction = Si des incidents se sont produits dans l'application, le motif consign\u00e9 doit \u00eatre examin\u00e9 pour obtenir des informations suppl\u00e9mentaires sur les incidents.
JMSWMQ2019.inserts = XMSC_INSERT_COMP_CODE, XMSC_INSERT_REASON, XMSC_INSERT_METHOD

JMSWMQ2020 = Echec de la connexion au gestionnaire de files d''attente ''{0}'' \u00e0 l''aide du mode de connexion ''{1}'' et de l''URL CCDT fournie ''{2}''. Pour plus d''informations, voir l''exception associ\u00e9e.
JMSWMQ2020.useraction = V\u00e9rifiez que le gestionnaire de files d'attente est d\u00e9marr\u00e9 et, s'il est ex\u00e9cut\u00e9 en mode client, v\u00e9rifiez qu'un programme d'\u00e9coute est en cours d'ex\u00e9cution. Reportez-vous \u00e0 l'exception associ\u00e9e pour plus d'informations.
JMSWMQ2020.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_CCDTURL

JMSWMQ2021 = L''authentification de la s\u00e9curit\u00e9 fournie pour le gestionnaire de files d''attente ''{0}'' \u00e0 l''aide du mode de connexion ''{1}'' et de l''URL CCDT fournie ''{2}'' n''\u00e9tait pas valide. Pour plus d''informations, voir l''exception associ\u00e9e.
JMSWMQ2021.useraction = V\u00e9rifiez si le nom d'utilisateur et le mot de passe fournis sont corrects dans le gestionnaire de files d'attente auquel vous vous connectez.
JMSWMQ2021.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_CCDTURL


JMSWMQ2022 = Impossible de cr\u00e9er un fournisseur de messages ou un consommateur de messages avec la file d''attente mod\u00e8le ''{0}'', comme destination.
JMSWMQ2022.explanation = Le fournisseur de messages ou consommateur de messages n'a pas \u00e9t\u00e9 en mesure d'ouvrir la destination car il s'agissait d'une file d'attente mod\u00e8le.
JMSWMQ2022.useraction = Modifiez la configuration de mani\u00e8re que le fournisseur ou le consommateur utilise une autre file d'attente de destination qu'une file d'attente mod\u00e8le.
JMSWMQ2022.inserts = XMSC_DESTINATION_NAME

JMSWMQ2023 = Erreur de traitement du message ''{0}'' avec exception ''{1}'' avec MQMD ''{2}''
JMSWMQ2023.inserts = XMSC_MSG_DATA,XMSC_INSERT_EXCEPTION,XMSC_DATA

JMSWMQ2024 = Impossible d''envoyer un message \u00e0 la destination ''{0}''.
JMSWMQ2024.explanation = JMS a tent\u00e9 d'effectuer une op\u00e9ration MQPUT ou MQPUT1, mais IBM MQ a signal\u00e9 une erreur. \n\
Un d\u00e9lai de distribution ayant \u00e9t\u00e9 d\u00e9fini, le probl\u00e8me peut \u00eatre li\u00e9 \u00e0 la file d'attente sp\u00e9cifi\u00e9e par l'application \n\
ou \u00e0 la file d'attente de transfert du d\u00e9lai de distribution, 'SYSTEM.DDELAY.LOCAL.QUEUE'.
JMSWMQ2024.useraction = D\u00e9terminez le motif de cette erreur \u00e0 l'aide de l'exception associ\u00e9e.
JMSWMQ2024.inserts = XMSC_DESTINATION_NAME

JMSWMQ2025 = Echec de l''abonnement \u00e0 la rubrique ''{0}'' avec le nom d''abonnement ''{1}''.
JMSWMQ2025.explanation = Une tentative d'ouverture d'un abonnement partag\u00e9 de fa\u00e7on non partag\u00e9e ou d'ouverture d'un \
abonnement non partag\u00e9 de fa\u00e7on partag\u00e9e a \u00e9t\u00e9 effectu\u00e9e.
JMSWMQ2025.useraction = V\u00e9rifiez qu'aucun abonnement d'un type partag\u00e9 diff\u00e9rent n'existe avant de tenter de cr\u00e9er un abonnement du m\u00eame \
nom.
JMSWMQ2025.inserts = XMSC_DESTINATION_NAME,XMSC_SUBSCRIPTION_NAME
