# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
#

# JMSWMQ0002 is a WMQException message so no .inserts needed
JMSWMQ0002 = Diagn\u00f3sticos extras fornecidos pelo MQSTAT: compcode ''{0}'' raz\u00e3o ''{1}'' nome do objeto ''{2}'' nome do objeto resolvido ''{3}'' tipo de objeto ''{4}'' nome do gerenciador de filas ''{5}'' nome do gerenciador de filas resolvido ''{6}'' contagem das falhas de coloca\u00e7\u00e3o ''{7}'' contagem de sucesso de coloca\u00e7\u00e3o ''{8}'' contagem de avisos de coloca\u00e7\u00e3o ''{9}''.

JMSWMQ0003 = O n\u00edvel do comando do gerenciador de filas ''{0}'' n\u00e3o correspondeu \u00e0 vers\u00e3o do fornecedor solicitada ''{1}''.
JMSWMQ0003.inserts = XMSC_INSERT_COMMAND_LEVEL, XMSC_WMQ_PROVIDER_VERSION

JMSWMQ0006 = O IBM MQ classes for JMS tenta usar um tipo de dados n\u00e3o suportado por uma mensagem ou ler dados no tipo errado.
JMSWMQ0006.explanation = Os tipos de dados incorretos foram utilizados para ler os tipos de propriedades de mensagem.
JMSWMQ0006.useraction = Verifique se a mensagem recebida e as propriedades a serem lidas s\u00e3o do tipo esperado.
JMSWMQ0006.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSWMQ0007 = O IBM MQ classes for JMS tenta usar um tipo de dados n\u00e3o suportado por uma mensagem ou ler dados no tipo \
errado.
JMSWMQ0007.explanation = Os tipos de dados incorretos foram utilizados para ler os tipos de propriedades de mensagem.
JMSWMQ0007.useraction = Verifique se a mensagem recebida e as propriedades a serem lidas s\u00e3o do tipo esperado.
JMSWMQ0007.exception = com.ibm.msg.client.jms.DetailedMessageNotReadableException

JMSWMQ0008 = O IBM MQ classes for JMS tenta usar um tipo de dados n\u00e3o suportado por uma mensagem ou tenta gravar \
dados no tipo errado.
JMSWMQ0008.explanation = Os tipos de dados incorretos foram utilizados para gravar os tipos de propriedades de mensagem.
JMSWMQ0008.useraction = Verifique se a mensagem recebida e as propriedades a serem gravadas s\u00e3o do tipo esperado.
JMSWMQ0008.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSWMQ0009 = O IBM MQ classes for JMS n\u00e3o pode alocar os recursos necess\u00e1rios para um m\u00e9todo.
JMSWMQ0009.explanation = Os recursos da m\u00e1quina podem estar sobrecarregados, a exce\u00e7\u00e3o vinculada pode fornecer informa\u00e7\u00f5es adicionais.
JMSWMQ0009.useraction = Verifique os recursos do sistema e carregue.
JMSWMQ0009.exception = com.ibm.msg.client.jms.DetailedResourceAllocationException

JMSWMQ0010 = Falha ao obter o n\u00edvel de comando do gerenciador de filas ''{0}''.
JMSWMQ0010.useraction = Consulte a exce\u00e7\u00e3o vinculada para obter mais informa\u00e7\u00f5es.
JMSWMQ0010.inserts = XMSC_INSERT_QUEUE_MANAGER

JMSWMQ0011 = Falha ao inicializar a interface Java(tm) para MQI ''{0}''.
JMSWMQ0011.useraction = Consulte a exce\u00e7\u00e3o vinculada para obter mais informa\u00e7\u00f5es.
JMSWMQ0011.inserts = XMSC_INSERT_EXCEPTION

JMSWMQ0013 = Falha ao enfileirar a tarefa.
JMSWMQ0013.useraction = Consulte a exce\u00e7\u00e3o vinculada para obter mais informa\u00e7\u00f5es.

JMSWMQ0014 = N\u00e3o \u00e9 poss\u00edvel converter um valor nulo em um byte, int, breve ou longo.
JMSWMQ0014.exception = java.lang.NumberFormatException

JMSWMQ0015 = N\u00e3o \u00e9 poss\u00edvel converter um valor nulo em um caractere, int, duplo ou de flutua\u00e7\u00e3o.
JMSWMQ0015.exception = java.lang.NullPointerException

JMSWMQ0016 = Falha da serializa\u00e7\u00e3o do objeto.
JMSWMQ0016.useraction = Consulte a causa para obter mais informa\u00e7\u00f5es.
JMSWMQ0016.exception = java.lang.IOException

JMSWMQ0017 = Fim do fluxo.
JMSWMQ0017.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSWMQ0018 = Falha ao conectar o gerenciador de filas ''{0}'' com o modo de conex\u00e3o ''{1}'' e o nome do host ''{2}''.
JMSWMQ0018.useraction = Verifique se o gerenciador de filas est\u00e1 iniciado e se est\u00e1 em execu\u00e7\u00e3o no modo do cliente; verifique se h\u00e1 um listener em execu\u00e7\u00e3o. Consulte a exce\u00e7\u00e3o vinculada para obter mais informa\u00e7\u00f5es.
JMSWMQ0018.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_HOST_NAME

JMSWMQ0019 = Falha ao desconectar do gerenciador de filas ''{0}'' utilizando o modo de conex\u00e3o ''{1}'' e o nome do host ''{2}''.
JMSWMQ0019.useraction = Consulte a exce\u00e7\u00e3o vinculada para obter mais informa\u00e7\u00f5es.
JMSWMQ0019.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_HOST_NAME

JMSWMQ0020 = Falha ao registrar o retorno de chamada utilizando MQCB para o destino ''{0}''.
JMSWMQ0020.useraction = Consulte a exce\u00e7\u00e3o vinculada para obter mais informa\u00e7\u00f5es.
JMSWMQ0020.inserts = XMSC_DESTINATION_NAME

JMSWMQ0021 = Falha ao remover registro do retorno de chamada utilizando MQCB para o destino ''{0}''.
JMSWMQ0021.useraction = Consulte a exce\u00e7\u00e3o vinculada para obter mais informa\u00e7\u00f5es.
JMSWMQ0021.inserts = XMSC_DESTINATION_NAME

JMSWMQ0022 = Falha ao iniciar o consumo das mensagens utilizando o MQCTL para o destino ''{0}''.
JMSWMQ0022.useraction = Consulte a exce\u00e7\u00e3o vinculada para obter mais informa\u00e7\u00f5es.
JMSWMQ0022.inserts = XMSC_DESTINATION_NAME

JMSWMQ0023 = Falha ao suspender o consumo das mensagens utilizando o MQCTL para o destino ''{0}''.
JMSWMQ0023.useraction = Consulte a exce\u00e7\u00e3o vinculada para obter mais informa\u00e7\u00f5es.
JMSWMQ0023.inserts = XMSC_DESTINATION_NAME

JMSWMQ0024 = Falha ao continuar o consumo das mensagens utilizando o MQCTL para o destino ''{0}''.
JMSWMQ0024.useraction = Consulte a exce\u00e7\u00e3o vinculada para obter mais informa\u00e7\u00f5es.
JMSWMQ0024.inserts = XMSC_DESTINATION_NAME

JMSWMQ0025 = Falha ao remover assinatura do t\u00f3pico ''{0}'' utilizando MQCLOSE.
JMSWMQ0025.explanation = Pode haver um problema ao remover a assinatura, por que ela est\u00e1 sendo utilizada por um consumidor de mensagem.
JMSWMQ0025.useraction = Assegure-se de que qualquer consumidor da mensagem utilizando esta assinatura seja fechado antes de remover assinatura. Consulte a exce\u00e7\u00e3o vinculada para obter mais informa\u00e7\u00f5es.
JMSWMQ0025.inserts = XMSC_DESTINATION_NAME

JMSWMQ0026 = Falha ao assinar o t\u00f3pico ''{0}'' com o seletor ''{1}'' usando o MQSUB.
JMSWMQ0026.explanation = Pode haver um problema ao criar a assinatura, devido a ela ser utilizada por outro consumidor de mensagem.
JMSWMQ0026.useraction = Assegure-se de que qualquer consumidor da mensagem utilizando esta assinatura seja fechado antes de tentar criar uma nova assinatura com o mesmo nome. Consulte a exce\u00e7\u00e3o vinculada para obter mais informa\u00e7\u00f5es.
JMSWMQ0026.inserts = XMSC_DESTINATION_NAME, XMSC_SELECTOR_STRING

# The insert for this message is CommonConstants.WMQ_ENCODING = "encoding".
# If WMQ_ENCODING is changed then this value here must also be changed.
JMSWMQ0027 = A mensagem cont\u00e9m uma codifica\u00e7\u00e3o inv\u00e1lida ''{0}''.
JMSWMQ0027.explanation = Uma mensagem com um cabe\u00e7alho mal formado foi recebida. A codifica\u00e7\u00e3o deve ser normal ou reversa.
JMSWMQ0027.useraction = Assegure-se de que qualquer aplicativo n\u00e3o JMS que esteja construindo mensagens crie cabe\u00e7alhos bem formados.
JMSWMQ0027.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSWMQ0027.inserts = codifica\u00e7\u00e3o

JMSWMQ0028 = Pelo menos, uma mensagem de coloca\u00e7\u00e3o ass\u00edncrona falhou ou forneceu um aviso.
JMSWMQ0028.explanation = Quando uma mensagem \u00e9 colocada de modo ass\u00edncrono, nenhum problema \u00e9 relatado como exce\u00e7\u00e3o emitida do m\u00e9todo send(). Em vez disso, os problemas s\u00e3o colocados no listener de exce\u00e7\u00e3o, se um estiver definido. O listener de exce\u00e7\u00e3o \u00e9 orientado no ponto de sincroniza\u00e7\u00e3o para as sess\u00f5es transacionadas ou todas as coloca\u00e7\u00f5es ass\u00edncronas SEND_CHECK_COUNT para sess\u00f5es n\u00e3o transacionadas.
JMSWMQ0028.useraction = Consulte a exce\u00e7\u00e3o vinculada para obter mais informa\u00e7\u00f5es sobre as falhas e/ou avisos.

JMSWMQ0029 = Falha ao enviar uma mensagem de relat\u00f3rio \u00e0 fila replyTo ''{0}''. 
JMSWMQ0029.useraction = Consulte a exce\u00e7\u00e3o vinculada para obter mais informa\u00e7\u00f5es sobre as falhas e/ou avisos.
JMSWMQ0029.inserts = XMSC_DESTINATION_NAME

JMSWMQ0030 = ''{0}'' falhou para o destino ''{1}'' ao manipular uma mensagem infectada. 
JMSWMQ0030.explanation = Ao reenfileirar uma mensagem infectada, ''{0}'' falhou ao chamar o destino ''{1}''.  
JMSWMQ0030.useraction = Consulte a exce\u00e7\u00e3o vinculada para obter mais informa\u00e7\u00f5es sobre as falhas e/ou avisos.
JMSWMQ0030.inserts = XMSC_INSERT_METHOD, XMSC_DESTINATION_NAME

JMSWMQ0031 = ''{0}'' falhou para o gerenciador de filas ao manipular uma mensagem infectada. 
JMSWMQ0031.explanation = Ao reenfileirar uma mensagem infectada, ''{0}'' falhou ao consultar sobre o gerenciador de filas.  
JMSWMQ0031.useraction = Consulte a exce\u00e7\u00e3o vinculada para obter mais informa\u00e7\u00f5es sobre as falhas e/ou avisos.
JMSWMQ0031.inserts = XMSC_INSERT_METHOD

JMSWMQ0032 = N\u00e3o h\u00e1 uma fila de devolu\u00e7\u00f5es definida.
JMSWMQ0032.explanation = O IBM MQ classes for JMS tentou colocar uma mensagem infectada na fila de mensagens n\u00e3o \
entregues porque ela n\u00e3o p\u00f4de ser encaminhada para a fila de nova tentativa de restaura\u00e7\u00e3o. Isso falhou por que n\u00e3o h\u00e1 uma fila de devolu\u00e7\u00f5es definida para o gerenciador de filas. 
JMSWMQ0032.useraction = Defina uma fila de devolu\u00e7\u00f5es.

JMSWMQ0033 = O nome do reenfileiramento de restaura\u00e7\u00e3o para o destino ''{0}'' n\u00e3o pode ser convertido do ID do conjunto de caracteres codificado do gerenciador de filas ''{1}''.
JMSWMQ0033.useraction = Verifique o nome do reenfileiramento de restaura\u00e7\u00e3o e o ID do conjunto de caracteres codificado do gerenciador de filas. 
JMSWMQ0033.inserts = XMSC_DESTINATION_NAME, CCSID

JMSWMQ0034 = O nome da fila de devolu\u00e7\u00f5es n\u00e3o pode ser convertido do ID do conjunto de caracteres codificado do gerenciador de filas ''{0}''.
JMSWMQ0034.useraction = Verifique o nome da fila de devolu\u00e7\u00f5es e o ID do conjunto de caracteres codificado do gerenciador de filas.
JMSWMQ0034.inserts = CCSID

JMSWMQ0035 = A fila de devolu\u00e7\u00f5es n\u00e3o p\u00f4de ser gravada devido \u00e0 exce\u00e7\u00e3o ''{0}''.
JMSWMQ0035.explanation = O IBM MQ classes for JMS falhou ao enfileirar novamente uma mensagem na fila de mensagens n\u00e3o entregues.
JMSWMQ0035.inserts = XMSC_INSERT_EXCEPTION

JMSWMQ0036 = Application Server Facilities capturou uma exce\u00e7\u00e3o ''{0}''.
JMSWMQ0036.explanation = O navegador de conex\u00e3o do IBM MQ classes for JMS capturou uma exce\u00e7\u00e3o.
JMSWMQ0036.inserts = XMSC_INSERT_EXCEPTION

JMSWMQ0037 = Uma mensagem infectada n\u00e3o p\u00f4de ser manipulada devido a uma exce\u00e7\u00e3o ''{0}''.
JMSWMQ0037.explanation = O listener de mensagem do IBM MQ classes for JMS capturou uma exce\u00e7\u00e3o.
JMSWMQ0037.inserts = XMSC_INSERT_EXCEPTION

JMSWMQ1006 = O valor para ''{0}'':''{1}'' n\u00e3o \u00e9 v\u00e1lido.
JMSWMQ1006.explanation = O valor ''{1}'' para a propriedade ''{0}'' n\u00e3o \u00e9 correto.
JMSWMQ1006.useraction = Verifique o motivo da exce\u00e7\u00e3o do IBM MQ vinculado e o c\u00f3digo de conclus\u00e3o.
JMSWMQ1006.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_VALUE

JMSWMQ1017 = fila MQ n\u00e3o-local ''{0}'' inv\u00e1lida para recebimento ou navega\u00e7\u00e3o.
JMSWMQ1017.explanation = A fila MQ n\u00e3o pode ser aberta, uma vez que ela n\u00e3o \u00e9 local no Gerenciador de Filas conectado. 
JMSWMQ1017.useraction = Conecte-se ao Gerenciador de Filas no qual essa Fila MQ reside localmente.
JMSWMQ1017.inserts = XMSC_DESTINATION_NAME

JMSWMQ1029 = O nome da propriedade \u00e9 nulo.
JMSWMQ1029.explanation = O m\u00e9todo itemExists() da mensagem de mapeamento foi chamado com um nome de item nulo ou uma cadeia de nome nula foi utilizada como um argumento para um m\u00e9todo que recupera valores de propriedade por nome de uma mensagem JMS.
JMSWMQ1029.useraction = Assegure-se de que as cadeias de nomes indicadas n\u00e3o possuem valores nulos.

JMSWMQ1044 = A cadeia n\u00e3o \u00e9 um n\u00famero hexadecimal v\u00e1lido - ''{0}''.
JMSWMQ1044.inserts = XMSC_INSERT_HEX_STRING
JMSWMQ1044.explanation = Foi feita uma tentativa de especificar um ID de grupo ou ID de correla\u00e7\u00e3o, que inicia com o ID de prefixo, mas n\u00e3o \u00e9 seguido por um valor hexadecimal bem formado, ou foi feita uma tentativa de receber uma mensagem que cont\u00e9m uma propriedade MQRFH2 do tipo bin.hex, que n\u00e3o possui um valor hexadecimal bem formado.
JMSWMQ1044.useraction = Assegure-se de que um valor hexadecimal v\u00e1lido sempre siga o prefixo de ID ao configurar o ID do grupo ou os valores de ID de correla\u00e7\u00e3o. Assegure-se de que qualquer cabe\u00e7alho MQRFH2, gerado por aplicativos n\u00e3o JMS, seja bem formado.

JMSWMQ1046 = O conjunto de caracteres ''{0}'' n\u00e3o \u00e9 suportado.
JMSWMQ1046.inserts = CCSID
JMSWMQ1046.explanation = Foi feita uma tentativa de enviar ou receber uma mensagem de mapeamento, mensagem de fluxo ou mensagem de texto, cujo corpo est\u00e1 codificado utilizando um conjunto de caracteres n\u00e3o suportado pela JVM. No caso de mensagem de texto, esta exce\u00e7\u00e3o pode ser emitida quando o corpo da mensagem \u00e9 consultado primeiro, em vez de no tempo de recebimento.
JMSWMQ1046.useraction = Codifique uma mensagem utilizando apenas um conjunto de caracteres conhecido, dispon\u00edvel no aplicativo de recep\u00e7\u00e3o.
JMSWMQ1046.exception = com.ibm.msg.client.jms.DetailedMessageFormatException


JMSWMQ1051 = Detalhes da Mensagem

JMSWMQ1055 = A propriedade ou elemento na mensagem possui um tipo de dados ''{0}'' incompat\u00edvel com o m\u00e9todo utilizado para acess\u00e1-lo.
JMSWMQ1055.inserts = XMSC_INSERT_TYPE
JMSWMQ1055.explanation = O m\u00e9todo do acessador utilizado para recuperar uma propriedade de uma mensagem JMS \u00e9 incompat\u00edvel com o tipo de propriedade que est\u00e1 sendo recuperada. Por exemplo, uma tentativa de recuperar uma propriedade de inteiros utilizando o m\u00e9todo getBooleanProperty().
JMSWMQ1055.useraction = Utilize o m\u00e9todo do acessador definido pela especifica\u00e7\u00e3o do JMS como apto para recuperar os valores de propriedade do tipo necess\u00e1rio.
JMSWMQ1055.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSWMQ1059 = Erro fatal - UTF-8 n\u00e3o suportado.
JMSWMQ1059.explanation = O ambiente de tempo de execu\u00e7\u00e3o Java(tm) que est\u00e1 sendo utilizado n\u00e3o suporta a codifica\u00e7\u00e3o de caracteres UTF-8. O JMS requer suporte para esta codifica\u00e7\u00e3o para desempenhar algumas opera\u00e7\u00f5es.
JMSWMQ1059.useraction = Consulte a documenta\u00e7\u00e3o e/ou o provedor do ambiente de tempo de execu\u00e7\u00e3o Java(tm) para determinar como obter suporte para a codifica\u00e7\u00e3o de caracteres UTF-8.
JMSWMQ1059.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSWMQ1067 = O tempo limite ''{0}'' n\u00e3o \u00e9 v\u00e1lido para o IBM MQ classes for JMS.
JMSWMQ1067.explanation = Foi feita uma tentativa de chamar o m\u00e9todo de recep\u00e7\u00e3o em um receptor de filas ou m\u00e9todo de assinante de t\u00f3picos, especificando um valor de tempo limite longo, que n\u00e3o \u00e9 v\u00e1lido.
JMSWMQ1067.useraction = Assegure-se de que o valor de tempo limite especificado n\u00e3o \u00e9 negativo e nem maior que o valor de Integer.MAX_VALUE.
JMSWMQ1067.inserts = XMSC_INSERT_TIMEOUT

JMSWMQ1068 = Falha ao obter o recurso XA.
JMSWMQ1068.explanation = O IBM MQ classes for JMS falhou ao criar um recurso XA devido a um erro.
JMSWMQ1068.useraction = Consulte a XAException vinculada para obter mais informa\u00e7\u00f5es.

JMSWMQ1079 = Imposs\u00edvel gravar uma mensagem na fila de devolu\u00e7\u00f5es.
JMSWMQ1079.explanation = O IBM MQ classes for JMS falhou ao enfileirar novamente uma mensagem na fila de mensagens n\u00e3o \
entregues.
JMSWMQ1079.useraction = Utilize a exce\u00e7\u00e3o vinculada para determinar a causa deste erro. Se n\u00e3o houver uma exce\u00e7\u00e3o vinculada, verifique se o gerenciador de filas definiu uma fila de devolu\u00e7\u00f5es. Uma \
vez que o IBM MQ classes for JMS enviou uma mensagem para a fila de mensagens n\u00e3o entregues, o c\u00f3digo de raz\u00e3o armazenado no MQDLH da \
mensagem pode ser usado para determinar por que a mensagem foi enviada l\u00e1.

JMSWMQ1080 = Nenhuma fila de Restaura\u00e7\u00e3o-Reenfileiramento definida.

JMSWMQ1096 = Uma refer\u00eancia de mensagem foi formada incorretamente.

JMSWMQ1107 = Ocorreu um problema com esta conex\u00e3o.
JMSWMQ1107.explanation = Ocorreu um erro com a conex\u00e3o do IBM MQ JMS.
JMSWMQ1107.useraction = Utilize a exce\u00e7\u00e3o vinculada para determinar a causa deste erro.

JMSWMQ1116 = A mensagem ''{0}'', que estava na fila ''{1}'' foi movida para a fila de devolu\u00e7\u00f5es no gerenciador de filas ''{2}''
JMSWMQ1116.explanation = Ao executar no modo normal do provedor de sistemas de mensagens do IBM MQ, foi detectada uma mensagem que n\u00e3o p\u00f4de ser processada. Como o campo Relat\u00f3rio no MQMD para esta mensagem continha a op\u00e7\u00e3o MQRO_DEAD_LETTER_Q, a mensagem foi movida para a fila de devolu\u00e7\u00f5es. 
JMSWMQ1116.useraction = Consulte o cabe\u00e7alho de devolu\u00e7\u00f5es na mensagem da fila de devolu\u00e7\u00f5es para determinar por que a mensagem n\u00e3o p\u00f4de ser processada. 
JMSWMQ1116.inserts = XMSC_INSERT_MESSAGE_ID, XMSC_INSERT_DESTINATION_NAME, XMSC_INSERT_QUEUE_MANAGER_NAME 

JMSWMQ1117 = A mensagem ''{0}'', que estava na fila ''{1}'' no gerenciador de filas ''{2}'', n\u00e3o pode ser processada e foi descartada.
JMSWMQ1117.explanation = Ao executar no modo normal do provedor de sistemas de mensagens do IBM MQ, foi detectada \
uma mensagem que n\u00e3o p\u00f4de ser processada. Como o campo Relat\u00f3rio no MQMD para essa mensagem continha a op\u00e7\u00e3o MQRO_DISCARD_MSG, a mensagem foi descartada. 
JMSWMQ1117.useraction = Modifique os aplicativos que est\u00e3o colocando mensagens na fila especificada, para que o campo Relat\u00f3rio no MQMD para a mensagem contenha a op\u00e7\u00e3o MQRO_DEAD_LETTER_Q. Isso assegurar\u00e1 que as mensagens subsequentes que n\u00e3o podem ser processadas ser\u00e3o movidas para a fila de devolu\u00e7\u00f5es, em vez de serem descartadas. As mensagens na fila de devolu\u00e7\u00f5es ter\u00e3o um cabe\u00e7alho de devolu\u00e7\u00f5es, que cont\u00eam informa\u00e7\u00f5es sobre o motivo pelo qual a mensagem n\u00e3o p\u00f4de ser processada.
JMSWMQ1117.inserts = XMSC_INSERT_MESSAGE_ID, XMSC_INSERT_DESTINATION_NAME, XMSC_INSERT_QUEUE_MANAGER_NAME 

JMSWMQ1118 = A fila ''{0}'' que foi inibida anteriormente para obten\u00e7\u00e3o foi reativada para obten\u00e7\u00e3o, pois o gerenciador de \
filas do IBM MQ respondeu com o c\u00f3digo de raz\u00e3o ''2494'' (''MQRC_GET_ENABLED'')
JMSWMQ1118.explanation = Uma fila \u00e0 qual um consumidor est\u00e1 conectado agora foi disponibilizada para obten\u00e7\u00e3o de uma mensagem.
JMSWMQ1118.useraction = Nenhum. Esta mensagem \u00e9 apenas informativa.
JMSWMQ1118.inserts = XMSC_INSERT_DESTINATION_NAME

JMSWMQ1119 = A fila ''{0}'' est\u00e1 atualmente inibida para solicita\u00e7\u00f5es de obten\u00e7\u00e3o, pois o gerenciador de filas do IBM MQ respondeu com o c\u00f3digo de raz\u00e3o ''2016'' (''MQRC_GET_INHIBITED'').
JMSWMQ1119.explanation = Uma fila \u00e0 qual um consumidor est\u00e1 conectado agora est\u00e1 inibida de quaisquer solicita\u00e7\u00f5es MQGET.
JMSWMQ1119.useraction = Aguarde at\u00e9 que o IBM MQ Administrator tenha reativado a fila para solicita\u00e7\u00f5es MQGET. 
JMSWMQ1119.inserts = XMSC_INSERT_DESTINATION_NAME

# Same as JMSWMQ2003: queue variant.
JMSWMQ2000 = Falha ao fechar a fila ''{0}''.
JMSWMQ2000.explanation = O JMS tentou fechar um destino do IBM MQ, mas encontrou um erro. O destino pode j\u00e1 estar fechado ou outro encadeamento pode estar desempenhando um MQGET enquanto close() \u00e9 chamado.
JMSWMQ2000.useraction = Utilize a exce\u00e7\u00e3o vinculada para determinar a causa deste erro. Voc\u00ea poder\u00e1 desempenhar close() posteriormente.
JMSWMQ2000.inserts = XMSC_DESTINATION_NAME

JMSWMQ2001 = Falha ao fechar o destino ''{0}'' utilizando uma pol\u00edtica de fechamento da leitura antecipada.
JMSWMQ2001.explanation = O IBM MQ classes for JMS tentou fechar um destino do IBM MQ, mas encontrou um erro. A chamada de fechamento chegou ao tempo limite ao tentar entregar todas as mensagens da fila de leitura antecipada.
JMSWMQ2001.useraction = Verifique se o listener de mensagem n\u00e3o est\u00e1 em loop. Voc\u00ea poder\u00e1 desempenhar close() posteriormente.
JMSWMQ2001.inserts = XMSC_DESTINATION_NAME

JMSWMQ2002 = Falha ao obter uma mensagem do destino ''{0}''.
JMSWMQ2002.explanation = O IBM MQ classes for JMS tentou executar um MQGET; no entanto, o IBM MQ relatou \
um erro.
JMSWMQ2002.useraction = Utilize a exce\u00e7\u00e3o vinculada para determinar a causa deste erro.
JMSWMQ2002.inserts = XMSC_DESTINATION_NAME

# Same as JMSWMQ2000: topic variant.
JMSWMQ2003 = Falha ao fechar o t\u00f3pico ''{0}''.
JMSWMQ2003.explanation = O JMS tentou fechar um destino do IBM MQ, mas encontrou um erro. O destino pode j\u00e1 estar fechado ou outro encadeamento pode estar desempenhando um MQGET enquanto close() \u00e9 chamado.
JMSWMQ2003.useraction = Utilize a exce\u00e7\u00e3o vinculada para determinar a causa deste erro. Voc\u00ea poder\u00e1 desempenhar close() posteriormente.
JMSWMQ2003.inserts = XMSC_DESTINATION_NAME

# Same as JMSWMQ2008: topic variant.
JMSWMQ2006 = Falha ao abrir o t\u00f3pico MQ ''{0}''.
JMSWMQ2006.explanation = O JMS tentou executar um MQOPEN, mas o IBM MQ relatou um erro.
JMSWMQ2006.useraction = Utilize a exce\u00e7\u00e3o vinculada para determinar a causa deste erro. Verifique se o t\u00f3pico e o gerenciador de filas especificados est\u00e3o definidos corretamente.
JMSWMQ2006.inserts = XMSC_DESTINATION_NAME

JMSWMQ2007 = Falha ao enviar uma mensagem ao destino ''{0}''.
JMSWMQ2007.explanation = O JMS tentou executar um MQPUT ou MQPUT1; no entanto, IBM MQ relatou um erro.
JMSWMQ2007.useraction = Utilize a exce\u00e7\u00e3o vinculada para determinar a causa deste erro.
JMSWMQ2007.inserts = XMSC_DESTINATION_NAME

# Same as JMSWMQ2006: queue variant.
JMSWMQ2008 = Falha ao abrir a fila do MQ ''{0}''.
JMSWMQ2008.explanation = O JMS tentou executar um MQOPEN, mas o IBM MQ relatou um erro.
JMSWMQ2008.useraction = Utilize a exce\u00e7\u00e3o vinculada para determinar a causa deste erro. Verifique se a fila especificada e o gerenciador de filas est\u00e3o definidos corretamente.
JMSWMQ2008.inserts = XMSC_DESTINATION_NAME

JMSWMQ2010 = O destino para o sistema de mensagens persistentes NPMCLASS HIGH ''{0}'' n\u00e3o era v\u00e1lido.
JMSWMQ2010.explanation = O destino especificado n\u00e3o suporta o sistema de mensagens persistentes NPMCLASS HIGH.
JMSWMQ2010.useraction = Utilize a ferramenta de administra\u00e7\u00e3o do JMS para ativar o sistema de mensagens persistentes NPMCLASS HIGH para este destino.
JMSWMQ2010.inserts = XMSC_DESTINATION_NAME
JMSWMQ2010.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSWMQ2011 = Falha ao abrir a assinatura dur\u00e1vel ''{0}'' para o destino ''{1}''.
JMSWMQ2011.explanation = O Jms tentou criar uma assinatura dur\u00e1vel, mas o nome da assinatura escolhido j\u00e1 estava em uso na JVM.
JMSWMQ2011.useraction = Utilize um nome de assinatura diferente para o assinante dur\u00e1vel ou execute o assinante em outra JVM.
JMSWMQ2011.inserts = XMSC_INSERT_OBJECT, XMSC_DESTINATION_NAME
JMSWMQ2011.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSWMQ2012 = Falha de XACLOSE.
JMSWMQ2012.explanation = Falha ao fechar o recurso XA, ao fechar a sess\u00e3o de XA.
JMSWMQ2012.useraction = Consulte XAException vinculada para obter mais detalhes.

JMSWMQ2013 = A autentica\u00e7\u00e3o de seguran\u00e7a fornecida para QueueManager ''{0}'' com o modo de conex\u00e3o ''{1}'' e o nome do host ''{2}'' n\u00e3o era v\u00e1lida.
JMSWMQ2013.useraction = Verifique se o nome de usu\u00e1rio e a senha fornecidos est\u00e3o corretos no QueueManager ao qual est\u00e1 se conectando.
JMSWMQ2013.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_HOST_NAME

JMSWMQ2014 = MQ entregou um evento ass\u00edncrono com o c\u00f3digo de conclus\u00e3o ''{0}'' e raz\u00e3o ''{1}''.

JMSWMQ2016 = Falha ao registrar ExceptionListener para a Conex\u00e3o.
JMSWMQ2016.explanation = A chamada MQCB para registrar este ExceptionListener falhou.
JMSWMQ2016.useraction = Utilize a exce\u00e7\u00e3o vinculada para determinar a causa deste erro.

JMSWMQ2017 = Falha ao remover registro de ExceptionListener para a Conex\u00e3o.
JMSWMQ2017.explanation = A chamada MQCB para remover registro deste ExceptionListener falhou.
JMSWMQ2017.useraction = Utilize a exce\u00e7\u00e3o vinculada para determinar a causa deste erro.

# Log message
JMSWMQ2018 = A exce\u00e7\u00e3o \u00e9 ignorada, visto que nenhum listener de exce\u00e7\u00e3o est\u00e1 registrado: ''{0}''.
JMSWMQ2018.explanation = Uma tentativa de entregar uma exce\u00e7\u00e3o ao listener de exce\u00e7\u00e3o da conex\u00e3o foi feita, mas um listener n\u00e3o foi registrado.
JMSWMQ2018.useraction = Um listener de exce\u00e7\u00e3o deve ser registrado com a conex\u00e3o, para receber as exce\u00e7\u00f5es.
JMSWMQ2018.inserts = XMSC_INSERT_EXCEPTION

#Log message
JMSWMQ2019 = C\u00f3digo de conclus\u00e3o ''{0}'' inesperado, c\u00f3digo de raz\u00e3o ''{1}'' retornado do m\u00e9todo ''{2}''.
JMSWMQ2019.explanation = N\u00e3o era esperado o c\u00f3digo de raz\u00e3o, mas n\u00e3o foi retornado para o aplicativo.
JMSWMQ2019.useraction = Se o aplicativo estiver com falhas, o c\u00f3digo de raz\u00e3o registrado em log deve ser examinado como um meio de fornecer informa\u00e7\u00f5es adicionais para as falhas.
JMSWMQ2019.inserts = XMSC_INSERT_COMP_CODE, XMSC_INSERT_REASON, XMSC_INSERT_METHOD

JMSWMQ2020 = Falha ao conectar com o gerenciador de filas ''{0}'' com o modo de conex\u00e3o ''{1}'' e a URL do CCDT fornecida ''{2}''; consulte a exce\u00e7\u00e3o vinculada para obter informa\u00e7\u00f5es adicionais.
JMSWMQ2020.useraction = Verifique se o gerenciador de filas est\u00e1 iniciado e se est\u00e1 em execu\u00e7\u00e3o no modo do cliente; verifique se h\u00e1 um listener em execu\u00e7\u00e3o. Consulte a exce\u00e7\u00e3o vinculada para obter mais informa\u00e7\u00f5es.
JMSWMQ2020.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_CCDTURL

JMSWMQ2021 = A autentica\u00e7\u00e3o de seguran\u00e7a fornecida para o QueueManager ''{0}'' com o modo de conex\u00e3o ''{1}'' e a URL do CCDT fornecida ''{2}'' n\u00e3o era v\u00e1lida; consulte a exce\u00e7\u00e3o vinculada para obter informa\u00e7\u00f5es adicionais.
JMSWMQ2021.useraction = Verifique se o nome de usu\u00e1rio e a senha fornecidos est\u00e3o corretos no QueueManager ao qual est\u00e1 se conectando.
JMSWMQ2021.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_CCDTURL


JMSWMQ2022 = N\u00e3o \u00e9 poss\u00edvel criar um Produtor de Mensagem ou Consumidor de Mensagem com uma Fila Modelo ''{0}'' como um Destino.
JMSWMQ2022.explanation = O Produtor de Mensagem ou Consumidor de Mensagem n\u00e3o foi capaz de abrir o Destino uma vez que era uma Fila Modelo.
JMSWMQ2022.useraction = Altere o Produtor de Mensagem ou Consumidor de Mensagem para usar um nome de Fila de Destino diferente que n\u00e3o seja uma Fila Modelo.
JMSWMQ2022.inserts = XMSC_DESTINATION_NAME

JMSWMQ2023 = Erro ao processar a mensagem ''{0}'' com a exce\u00e7\u00e3o ''{1}'' com o MQMD ''{2}''
JMSWMQ2023.inserts = XMSC_MSG_DATA,XMSC_INSERT_EXCEPTION,XMSC_DATA

JMSWMQ2024 = Falha ao enviar uma mensagem ao destino ''{0}''.
JMSWMQ2024.explanation = O JMS tentou executar um MQPUT ou MQPUT1; no entanto, IBM MQ relatou um erro. \n\
Como o atraso de entrega foi configurado, o problema pode estar relacionado \u00e0 fila especificada pelo aplicativo \n                   ou pela fila tempor\u00e1ria de atraso de entrega 'SYSTEM.DDELAY.LOCAL.QUEUE'.
JMSWMQ2024.useraction = Utilize a exce\u00e7\u00e3o vinculada para determinar a causa deste erro.
JMSWMQ2024.inserts = XMSC_DESTINATION_NAME

JMSWMQ2025 = Falha ao assinar o t\u00f3pico ''{0}'' com o nome de assinatura ''{1}''.
JMSWMQ2025.explanation = Foi feita uma tentativa de abrir uma assinatura compartilhada de uma maneira n\u00e3o compartilhada ou de abrir uma assinatura n\u00e3o compartilhada de uma maneira compartilhada.
JMSWMQ2025.useraction = Assegure-se de que n\u00e3o haja assinaturas de um tipo compartilhado diferente antes de tentar criar uma nova assinatura com o mesmo nome.
JMSWMQ2025.inserts = XMSC_DESTINATION_NAME,XMSC_SUBSCRIPTION_NAME
