# %Z% %W% %I% %E% %U%
#
#   <copyright 
#   notice="oco-source" 
#   pids="5724-H72" 
#   years="2008,2017" 
#   crc="775383328" > 
#   IBM Confidential 
#    
#   OCO Source Materials 
#    
#   5724-H72,5655-R36,5655-L82,5724-L26, 
#    
#   (C) Copyright IBM Corp. 2008, 2017 
#    
#   The source code for the program is not published 
#   or otherwise divested of its trade secrets, 
#   irrespective of what has been deposited with the 
#   U.S. Copyright Office. 
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR

JMSCC0001 = Ocorreu um erro interno. N\u00e3o foi poss\u00edvel instanciar uma classe necess\u00e1ria: ''{0}''.
JMSCC0001.useraction = Salve quaisquer arquivos de sa\u00edda gerados e use o site de Suporte do MQ: \
http://www.ibm.com/software/integration/wmq/support/ ou o IBM Support Assistant (ISA): http://www.ibm.com/software/support/isa/, para ver se uma \
solu\u00e7\u00e3o j\u00e1 est\u00e1 dispon\u00edvel.  Se n\u00e3o for poss\u00edvel localizar uma correspond\u00eancia, entre em contato com o centro de suporte da IBM.
JMSCC0001.inserts = XMSC_INSERT_EXCEPTION

JMSCC0002 = O IBM MQ classes for JMS tentou configurar um ID do cliente inv\u00e1lido em uma conex\u00e3o.
JMSCC0002.explanation = Um aplicativo tentou configurar a propriedade do ID de cliente de uma conex\u00e3o v\u00e1lida como nula ou tentou configurar a propriedade clientId de uma conex\u00e3o inv\u00e1lida.
JMSCC0002.useraction = A propriedade clientId em uma conex\u00e3o pode ser configurada apenas uma vez, apenas para um valor n\u00e3o nulo e apenas antes da conex\u00e3o ser utilizada. Assegure-se de que a conex\u00e3o \u00e9 v\u00e1lida e que o ID de cliente n\u00e3o \u00e9 nulo.
JMSCC0002.exception = com.ibm.msg.client.jms.DetailedInvalidClientIDException

JMSCC0003 = O valor especificado ''{1}'' n\u00e3o \u00e9 permitido para ''{0}''.
JMSCC0003.explanation = O valor fornecido n\u00e3o tem permiss\u00e3o para a propriedade especificada.
JMSCC0003.useraction = Mude para um valor da propriedade que seja suportado.
JMSCC0003.inserts = XMSC_INSERT_NAME, XMSC_INSERT_VALUE
JMSCC0003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0004 = O recebimento de chamadas n\u00e3o retornar\u00e1 uma mensagem para uma conex\u00e3o que est\u00e1 parada.
JMSCC0004.explanation = A especifica\u00e7\u00e3o do JMS afirma que o m\u00e9todo receive() n\u00e3o deve retornar uma mensagem, se a conex\u00e3o estiver parada. Chamar receiveNoWait ou receber com um tempo limite retornar\u00e1 nulo quando o tempo limite expira. O recebimento de chamadas sem tempo limite n\u00e3o retornar\u00e1 at\u00e9 que a conex\u00e3o seja iniciada, fechada ou o aplicativo finalizar.
JMSCC0004.useraction = Inicie a conex\u00e3o, chamando javax.jms.Connection.start(). 

# JMSCC0005 is the same as JMSCC0003 except that JMSCC0003 throws a InvalidDestinationException
# whereas JMSCC0005 throws an JMSException.
JMSCC0005 = O valor especificado ''{1}'' n\u00e3o \u00e9 permitido para ''{0}''.
JMSCC0005.explanation = O valor fornecido n\u00e3o tem permiss\u00e3o para a propriedade especificada.
JMSCC0005.useraction = Mude para um valor da propriedade que seja suportado.
JMSCC0005.inserts = XMSC_INSERT_NAME, XMSC_INSERT_VALUE

JMSCC0007 = Foi recebida uma exce\u00e7\u00e3o durante a chamada ao m\u00e9todo ''{1}'': ''{0}''.
JMSCC0007.explanation = Uma exce\u00e7\u00e3o foi emitida por outro componente, durante a execu\u00e7\u00e3o do m\u00e9todo especificado.
JMSCC0007.useraction = Veja a exce\u00e7\u00e3o vinculada para obter informa\u00e7\u00f5es adicionais.
JMSCC0007.inserts = XMSC_INSERT_EXCEPTION, XMSC_INSERT_METHOD

JMSCC0008 = Esta conex\u00e3o est\u00e1 fechada.
JMSCC0008.explanation = Um aplicativo chamou um m\u00e9todo que n\u00e3o deve ser utilizado depois que a conex\u00e3o for fechada.
JMSCC0008.useraction = Assegure-se de que a conex\u00e3o n\u00e3o esteja fechada antes de chamar o m\u00e9todo.
JMSCC0008.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0011 = O m\u00e9todo ''{0}'' n\u00e3o \u00e9 permitido neste cont\u00eainer.
JMSCC0011.explanation = Um m\u00e9todo n\u00e3o permitido no cont\u00eainer atual foi chamado.
JMSCC0011.useraction = Remova a chamada para o m\u00e9todo.
JMSCC0011.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0011.inserts = XMSC_INSERT_METHOD

JMSCC0012 = O m\u00e9todo ''{0}'' n\u00e3o pode ser chamado a partir de um Listener {1}.
JMSCC0012.explanation = Foi chamado um m\u00e9todo n\u00e3o permitida no contexto atual.
JMSCC0012.useraction = Remova a chamada para o m\u00e9todo.
JMSCC0012.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0012.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_NAME

JMSCC0014 = N\u00e3o \u00e9 v\u00e1lido chamar o m\u00e9todo ''{0}'' em uma sess\u00e3o n\u00e3o transacionada.
JMSCC0014.explanation = O aplicativo chamou um m\u00e9todo que n\u00e3o deve ser chamado em uma sess\u00e3o n\u00e3o transacionada.
JMSCC0014.useraction = Altere o programa aplicativo para remover esse comportamento.
JMSCC0014.inserts = XMSC_INSERT_METHOD
JMSCC0014.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0020 = Essa sess\u00e3o foi fechada.
JMSCC0020.explanation = Um aplicativo chamou um m\u00e9todo que n\u00e3o deve ser utilizado depois que a sess\u00e3o for fechada.
JMSCC0020.useraction = Assegure-se de que a sess\u00e3o n\u00e3o seja encerrada antes de chamar o m\u00e9todo.
JMSCC0020.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0021 = N\u00e3o \u00e9 v\u00e1lido chamar o m\u00e9todo ''{0}'' em uma sess\u00e3o transacionada.
JMSCC0021.explanation = O aplicativo chamou um m\u00e9todo que n\u00e3o deve ser chamado em uma sess\u00e3o transacionada.
JMSCC0021.useraction = Altere o programa aplicativo para remover esse comportamento.
JMSCC0021.inserts = XMSC_INSERT_METHOD
JMSCC0021.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0026 = Este produtor de mensagens est\u00e1 fechado.
JMSCC0026.explanation = Um aplicativo chamou um m\u00e9todo que n\u00e3o deve ser utilizado depois que o produtor de mensagens estiver fechado.
JMSCC0026.useraction = Assegure-se de que o produtor de mensagens n\u00e3o esteja fechado antes de chamar o m\u00e9todo.
JMSCC0026.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0029 = Deve ser especificado um destino ao enviar a partir desse produtor.
JMSCC0029.explanation = O produtor foi criado com um destino nulo e n\u00e3o foi fornecido um destino no m\u00e9todo de envio.
JMSCC0029.useraction = Altere o aplicativo para que seja utilizado um m\u00e9todo send() que especifique um destino ou especifique um destino ao criar o produtor.
JMSCC0029.exception = java.lang.UnsupportedOperationException

JMSCC0030 = N\u00e3o \u00e9 v\u00e1lido especificar um destino ao enviar a partir desse produtor.
JMSCC0030.explanation = O produtor foi criado com um destino especificado; n\u00e3o \u00e9 v\u00e1lido especificar um destino novo ao enviar uma mensagem.
JMSCC0030.useraction = Altere o aplicativo de modo a utilizar um m\u00e9todo de envio que n\u00e3o especifique um destino, ou especifique um destino nulo ao criar o produtor.
JMSCC0030.exception = java.lang.UnsupportedOperationException

JMSCC0031 = N\u00e3o \u00e9 v\u00e1lido especificar um listener de conclus\u00e3o nulo.
JMSCC0031.explanation = A chamada para o m\u00e9todo de envio incluiu um listener de conclus\u00e3o, mas o ouvinte foi nulo.
JMSCC0031.useraction = Altere o aplicativo para que um m\u00e9todo de envio que n\u00e3o especifica um listener de conclus\u00e3o seja usado, ou especifique um listener de conclus\u00e3o n\u00e3o nulo ao fazer a chamada de envio.
JMSCC0031.exception = java.lang.IllegalArgumentException

JMSCC0032 = Esse consumidor de mensagens est\u00e1 fechado.
JMSCC0032.explanation = Um aplicativo chamou um m\u00e9todo que n\u00e3o deve ser utilizado depois que o consumidor de mensagens for fechado.
JMSCC0032.useraction = Antes de chamar o m\u00e9todo assegure-se de que o consumidor de mensagens n\u00e3o esteja fechado.
JMSCC0032.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0033 = Uma chamada de m\u00e9todo s\u00edncrona n\u00e3o \u00e9 permitida quando uma sess\u00e3o est\u00e1 sendo utilizada de forma ass\u00edncrona: ''{0}''.
JMSCC0033.explanation = A especifica\u00e7\u00e3o JMS n\u00e3o permite o uso de uma sess\u00e3o para os m\u00e9todos s\u00edncronos quando a entrega da mensagem ass\u00edncrona est\u00e1 em execu\u00e7\u00e3o.
JMSCC0033.useraction = Crie uma sess\u00e3o separada, se desejar utilizar os m\u00e9todos s\u00edncronos e a entrega ass\u00edncrona simultaneamente.
JMSCC0033.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0033.inserts = XMSC_INSERT_METHOD

JMSCC0034 = O mecanismo de entrega ass\u00edncrono est\u00e1 em um estado inconsistente no m\u00e9todo: ''{0}''.
JMSCC0034.explanation = Uma sequ\u00eancia inesperada de eventos foi detectada durante a entrega de menagens para um bean acionado por mensagens (MDB). Isso pode ter sido provocado por erros de aplicativo de programa\u00e7\u00e3o do cliente.
JMSCC0034.useraction = Verifique os arquivos da log do servidor de aplicativos para obter informa\u00e7\u00f5es sobre outros problemas associados com o bean acionado por mensagens. Salve qualquer arquivo de sa\u00edda gerado e utilize o site de Suporte do WMQ: http://www.ibm.com/software/integration/wmq/support/, ou o ISA (IBM Support Assistant): http://www.ibm.com/software/support/isa/, para consultar se uma solu\u00e7\u00e3o j\u00e1 est\u00e1 dispon\u00edvel.  Se n\u00e3o for poss\u00edvel localizar uma correspond\u00eancia, entre em contato com o centro de suporte da IBM.
JMSCC0034.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0034.inserts = XMSC_INSERT_METHOD

JMSCC0037 = Uma exce\u00e7\u00e3o do tempo de execu\u00e7\u00e3o foi emitida pelo m\u00e9todo MessageListener.onMessage().
JMSCC0037.explanation = Um consumidor de mensagem com um listener de mensagem registrado recebeu uma exce\u00e7\u00e3o do m\u00e9todo onMessage().
JMSCC0037.useraction = O m\u00e9todo onMessage() deve ser alterado para evitar a emiss\u00e3o de exce\u00e7\u00f5es.

JMSCC0038 = O usu\u00e1rio n\u00e3o possui autoriza\u00e7\u00e3o para realizar esta opera\u00e7\u00e3o. Consulte a exce\u00e7\u00e3o vinculada para obter detalhes.
JMSCC0038.explanation = A exce\u00e7\u00e3o vinculada cont\u00e9m detalhes da autoridade, que s\u00e3o necess\u00e1rios para realizar esta opera\u00e7\u00e3o.
JMSCC0038.useraction = O administrador deve conceder a autoridade necess\u00e1ria para o usu\u00e1rio relevante.

JMSCC0039 = O tipo ''{0}'' n\u00e3o \u00e9 v\u00e1lido para o uso como propriedade de objeto ''{1}''.
JMSCC0039.explanation = Um aplicativo tentou configurar uma propriedade de objeto utilizando um tipo de objeto que n\u00e3o \u00e9 permitido pela especifica\u00e7\u00e3o do JMS.
JMSCC0039.useraction = Utilize um tipo de objeto permitido. As classes do wrapper primitivo e os objetos da cadeia s\u00e3o tipos de objetos permitidos.
JMSCC0039.inserts = XMSC_INSERT_TYPE, XMSC_INSERT_PROPERTY
JMSCC0039.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0040 = Ocorreu uma exce\u00e7\u00e3o ao receber uma mensagem: ''{0}''.
JMSCC0040.explanation = Ao receber uma mensagem, foi emitida uma exce\u00e7\u00e3o que causou a falha da opera\u00e7\u00e3o.
JMSCC0040.useraction = Examine a exce\u00e7\u00e3o especificada e o objeto da exce\u00e7\u00e3o vinculada para obter informa\u00e7\u00f5es adicionais.
JMSCC0040.inserts = XMSC_INSERT_EXCEPTION
JMSCC0040.exception = com.ibm.msg.client.jms.internal.JmsQueueBrowserImpl.MessageConversionFailed

JMSCC0041 = A convers\u00e3o do item ''{0}'' do tipo ''{1}'' ao tipo ''{2}'' n\u00e3o \u00e9 permitida.
JMSCC0041.explanation = A convers\u00e3o entre os dois tipos de dados especificados n\u00e3o \u00e9 permitida pela especifica\u00e7\u00e3o do JMS.
JMSCC0041.useraction = Recupere o item nomeado utilizando uma das convers\u00f5es permitidas.
JMSCC0041.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE

JMSCC0042 = O campo da mensagem ''{0}'' n\u00e3o foi configurado.
JMSCC0042.explanation = Um aplicativo tentou recuperar o valor de um campo que n\u00e3o foi configurado.
JMSCC0042.useraction = Configure o valor do campo antes de recupera-lo.
JMSCC0042.inserts = XMSC_INSERT_FIELD

JMSCC0043 = Um campo de cadeia nula ou vazia n\u00e3o \u00e9 permitido.
JMSCC0043.explanation = Um aplicativo de usu\u00e1rio tentou configurar um campo utilizando um nome que n\u00e3o \u00e9 v\u00e1lido, por exemplo, Cadeia nula ou vazia.
JMSCC0043.useraction = Utilize um nome de campo v\u00e1lido.
JMSCC0043.exception = java.lang.IllegalArgumentException

JMSCC0044 = N\u00e3o \u00e9 permitido chamar o m\u00e9todo ''{0}'' na mensagem, por que o corpo de mensagem \u00e9 de leitura.
JMSCC0044.explanation = Um aplicativo de usu\u00e1rio tentou configurar um corpo de mensagem de leitura.
JMSCC0044.useraction = Altere o programa aplicativo para remover este comportamento ou chame o m\u00e9todo clearBody() primeiro.
JMSCC0044.inserts = XMSC_INSERT_METHOD
JMSCC0044.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSCC0045 = N\u00e3o \u00e9 permitido chamar o m\u00e9todo ''{0}'' na mensagem, por que as propriedades de mensagem s\u00e3o de leitura.
JMSCC0045.explanation = Um aplicativo de usu\u00e1rio tentou configurar uma propriedade de mensagem de leitura.
JMSCC0045.useraction = Altere o programa aplicativo para remover este comportamento ou chame o m\u00e9todo clearProperties() primeiro.
JMSCC0045.inserts = XMSC_INSERT_METHOD
JMSCC0045.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSCC0046 = N\u00e3o \u00e9 permitido chamar o m\u00e9todo ''{0}'' na mensagem, por que o corpo de mensagem \u00e9 de grava\u00e7\u00e3o.
JMSCC0046.explanation = Um aplicativo de usu\u00e1rio tentou ler um corpo de mensagem de grava\u00e7\u00e3o.
JMSCC0046.useraction = Altere o programa aplicativo para remover este comportamento ou chame o m\u00e9todo reset() primeiro.
JMSCC0046.inserts = XMSC_INSERT_METHOD
JMSCC0046.exception = com.ibm.msg.client.jms.DetailedMessageNotReadableException

JMSCC0048 = Ocorreu um erro ao tentar criar a mensagem. Consulte a exce\u00e7\u00e3o vinculada para obter mais detalhes.
JMSCC0048.explanation = N\u00e3o foi poss\u00edvel criar a mensagem devido a um erro.
JMSCC0048.useraction = Examine a exce\u00e7\u00e3o vinculada para obter detalhes do erro.

JMSCC0049 = O nome da propriedade ''{0}'' n\u00e3o \u00e9 um identificador Java(tm) v\u00e1lido.
JMSCC0049.explanation = O nome fornecido da propriedade n\u00e3o est\u00e1 em conformidade com o formato permitido descrito na especifica\u00e7\u00e3o JMS.
JMSCC0049.useraction = Verifique os caracteres utilizados no nome da propriedade e modifique, conforme necess\u00e1rio.
JMSCC0049.inserts = XMSC_INSERT_PROPERTY
JMSCC0049.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0050 = O nome da propriedade ''{0}'' est\u00e1 reservado e n\u00e3o pode ser configurado.
JMSCC0050.explanation = O nome fornecido da propriedade come\u00e7a com o prefixo JMS, mas n\u00e3o \u00e9 uma das propriedades configur\u00e1veis suportadas.
JMSCC0050.useraction = Verifique o nome da propriedade e corrija os erros.
JMSCC0050.inserts = XMSC_INSERT_PROPERTY
JMSCC0050.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0051 = A propriedade ''{0}'' deve ser configurada utilizando o tipo ''{1}'', n\u00e3o ''{2}''.
JMSCC0051.explanation = As propriedades JMS_IBM podem ser configuradas apenas com um tipo de vari\u00e1vel espec\u00edfica.
JMSCC0051.useraction = Corrija o c\u00f3digo de aplicativo para utilizar o tipo de vari\u00e1vel requerido ao configurar essa propriedade JMS_IBM.
JMSCC0051.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE
JMSCC0051.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0052 = Ocorreu uma exce\u00e7\u00e3o ao serializar o objeto: ''{0}''.
JMSCC0052.explanation = N\u00e3o foi poss\u00edvel serializar o objeto por causa da exce\u00e7\u00e3o.
JMSCC0052.useraction = Examine a exce\u00e7\u00e3o vinculada para obter detalhes do erro.
JMSCC0052.inserts = XMSC_INSERT_EXCEPTION
JMSCC0052.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0053 = Ocorreu uma exce\u00e7\u00e3o desserializar uma mensagem, exce\u00e7\u00e3o: ''{0}''.
JMSCC0053.explanation = N\u00e3o foi poss\u00edvel desserializar a mensagem devido \u00e0 exce\u00e7\u00e3o mostrada.
JMSCC0053.useraction = Examine a exce\u00e7\u00e3o vinculada para obter detalhes do erro.
JMSCC0053.inserts = XMSC_INSERT_EXCEPTION
JMSCC0053.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0054 = O navegador de filas n\u00e3o possui mensagens dispon\u00edveis.
JMSCC0054.explanation = Um aplicativo de usu\u00e1rio solicitou uma mensagem de um navegador de filas quando nenhuma estava dispon\u00edvel.
JMSCC0054.useraction = Assegure-se de que o aplicativo n\u00e3o chame esse m\u00e9todo quando n\u00e3o houver mensagens dispon\u00edveis, ou que manipule essa exce\u00e7\u00e3o.
JMSCC0054.exception = java.util.NoSuchElementException

JMSCC0055 = Esse navegador de fila est\u00e1 fechado.
JMSCC0055.explanation = Um aplicativo chamou um m\u00e9todo que n\u00e3o deve ser utilizado depois que o navegador de filas for fechado.
JMSCC0055.useraction = Assegure-se de que o navegador de filas n\u00e3o esteja fechado antes de chamar o m\u00e9todo.
JMSCC0055.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0059 = O buffer de leitura \u00e9 nulo.
JMSCC0059.explanation = Uma refer\u00eancia nula foi transmitida ao m\u00e9todo StreamMessage.readBytes(), ent\u00e3o, nenhum dado p\u00f4de ser retornado.
JMSCC0059.useraction = Transmita um buffer de tamanho adequado no m\u00e9todo readBytes().
JMSCC0059.exception = java.lang.NullPointerException

JMSCC0060 = O final do fluxo de mensagens foi alcan\u00e7ado.
JMSCC0060.explanation = O final do conte\u00fado da mensagem foi alcan\u00e7ado. Isso \u00e9 normal, se o aplicativo de leitura n\u00e3o souber quantos dados devem ser esperados.
JMSCC0060.useraction = Nenhuma a\u00e7\u00e3o \u00e9 necess\u00e1ria.
JMSCC0060.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCC0061 = A matriz de byte StreamMessage n\u00e3o foi lida completamente.
JMSCC0061.explanation = Foi feita uma tentativa de ler o pr\u00f3ximo campo do fluxo, enquanto uma matriz de byte era lida parcialmente.
JMSCC0061.useraction = Assegure-se de que o c\u00f3digo do usu\u00e1rio conclua a leitura de qualquer matriz de byte antes de tentar ler o pr\u00f3ximo campo.
JMSCC0061.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0062 = N\u00e3o \u00e9 poss\u00edvel retornar nulo como um caractere.
JMSCC0062.explanation = Foi feita uma tentativa de leitura de um campo StreamMessage contendo nulo, utilizando o m\u00e9todo readChar().
JMSCC0062.useraction = Evite a leitura de nulos utilizando o m\u00e9todo readChar().
JMSCC0062.exception = java.lang.NullPointerException

JMSCC0063 = A codifica\u00e7\u00e3o n\u00e3o \u00e9 v\u00e1lida para a cadeia ''{0}''.
JMSCC0063.explanation = O valor fornecido n\u00e3o possui uma codifica\u00e7\u00e3o conhecida.
JMSCC0063.useraction = Assegure-se de que o aplicativo forne\u00e7a um valor da lista de codifica\u00e7\u00f5es configurada.
JMSCC0063.inserts = JMS_IBM_Encoding

JMSCC0064 = Ocorreu um erro interno ao gravar para o fluxo de dados.
JMSCC0064.explanation = Ocorreu um problema com os fluxos de dados utilizados para a convers\u00e3o de formato de valores flutuantes e dobrados.
JMSCC0064.useraction = Salve qualquer arquivo de sa\u00edda gerado e utilize o site de Suporte do WMQ: http://www.ibm.com/software/integration/wmq/support/, ou o ISA (IBM Support Assistant): http://www.ibm.com/software/support/isa/, para consultar se uma solu\u00e7\u00e3o j\u00e1 est\u00e1 dispon\u00edvel.  Se n\u00e3o for poss\u00edvel localizar uma correspond\u00eancia, entre em contato com o centro de suporte da IBM.

JMSCC0065 = Foi feita uma tentativa de leitura al\u00e9m do final da mensagem.
JMSCC0065.explanation = Foi feita uma tentativa de leitura al\u00e9m do final da mensagem. Essa pode ser uma condi\u00e7\u00e3o normal, se um aplicativo tiver sido codificado para ler os dados de comprimento vari\u00e1vel utilizando a especifica\u00e7\u00e3o JMS 1.0.2.
JMSCC0065.useraction = Se necess\u00e1rio, recodifique o aplicativo para utilizar o novo m\u00e9todo getBodyLength().
JMSCC0065.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCC0066 = A convers\u00e3o UTF-8 falhou.
JMSCC0066.explanation = Houve um problema durante a leitura ou grava\u00e7\u00e3o de uma cadeia UTF-8. O problema mais comum ocorre na tentativa de gravar uma cadeia com mais de 65535 caracteres.
JMSCC0066.useraction = Consulte a exce\u00e7\u00e3o vinculada para obter informa\u00e7\u00f5es adicionais.
JMSCC0066.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0067 = Ocorreu um erro interno. H\u00e1 um problema na grava\u00e7\u00e3o para a mensagem.
JMSCC0067.explanation = Foi encontrado um erro ao tentar gravar um item para a mensagem.
JMSCC0067.useraction = Salve qualquer arquivo de sa\u00edda gerado e utilize o site de Suporte do WMQ: http://www.ibm.com/software/integration/wmq/support/, ou o ISA (IBM Support Assistant): http://www.ibm.com/software/support/isa/, para consultar se uma solu\u00e7\u00e3o j\u00e1 est\u00e1 dispon\u00edvel.  Se n\u00e3o for poss\u00edvel localizar uma correspond\u00eancia, entre em contato com o centro de suporte da IBM.
JMSCC0067.exception = com.ibm.msg.client.jms.DetailedResourceAllocationException

JMSCC0068 = A propriedade ''{0}'' deve ser configurada usando um valor de tipo ''{1}'' ou um tipo convert\u00edvel para esse tipo conforme a Especifica\u00e7\u00e3o JMS. N\u00e3o \u00e9 poss\u00edvel converter a partir do tipo especificado ''{2}''. 
JMSCC0068.explanation = A convers\u00e3o entre os dois tipos de dados especificados n\u00e3o \u00e9 permitida pela especifica\u00e7\u00e3o do JMS.
JMSCC0068.useraction = Configure a propriedade nomeada usando uma das convers\u00f5es permitidas.
JMSCC0068.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC0068.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE

JMSCC0069 = A propriedade ''{0}'' deve ser configurada usando um valor de tipo ''{1}''. N\u00e3o \u00e9 poss\u00edvel converter do tipo especificado ''{2}'' com valor ''{3}''. 
JMSCC0069.explanation = Um erro foi encontrado ao tentar configurar uma propriedade de mensagem.
JMSCC0069.useraction = Configure a propriedade nomeada usando uma das convers\u00f5es permitidas com um valor apropriado.
JMSCC0069.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC0069.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE, XMSC_INSERT_VALUE

JMSCC0070 = Ocorreu um erro interno. Houve um problema ao configurar a propriedade de mensagem JMS ''{0}'', tipo esperado ''{1}'', usando um objeto de tipo ''{2}''.
JMSCC0070.explanation = Um erro foi encontrado ao tentar configurar uma propriedade de mensagem.
JMSCC0070.useraction = Salve qualquer arquivo de sa\u00edda gerado e utilize o site de Suporte do WMQ: http://www.ibm.com/software/integration/wmq/support/, ou o ISA (IBM Support Assistant): http://www.ibm.com/software/support/isa/, para consultar se uma solu\u00e7\u00e3o j\u00e1 est\u00e1 dispon\u00edvel.  Se n\u00e3o for poss\u00edvel localizar uma correspond\u00eancia, entre em contato com o centro de suporte da IBM.
JMSCC0070.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC0070.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE

JMSCC0083 = Um objeto incorreto do tipo ''{0}'' foi fornecido.
JMSCC0083.explanation = Foi fornecido um objeto ao m\u00e9todo writeObject() que n\u00e3o era um tipo de wrapper primitivo Java(tm).
JMSCC0083.useraction = Corrija o aplicativo para assegurar-se de que apenas os objetos dos tipos permitidos sejam transmitidos como par\u00e2metros ao m\u00e9todo writeObject().
JMSCC0083.inserts = XMSC_INSERT_OBJECT
JMSCC0083.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0084 = Uma propriedade de nome ''{0}'' n\u00e3o estava configurada.
JMSCC0084.inserts = XMSC_INSERT_PROPERTY

JMSCC0085 = Um destino n\u00e3o foi especificado.
JMSCC0085.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0086 = O tamanho do lote ''{0}'' estava incorreto.
JMSCC0086.inserts = XMSC_INSERT_BATCH_SIZE

JMSCC0087 = Um conjunto de sess\u00f5es do servidor n\u00e3o foi especificado.

JMSCC0088 = N\u00e3o foi poss\u00edvel obter a sess\u00e3o do conjunto de sess\u00f5es do servidor especificado.

JMSCC0089 = A sess\u00e3o ''{0}'' n\u00e3o era v\u00e1lida.
JMSCC0089.inserts = XMSC_INSERT_SESSION

JMSCC0091 = O provider factory para o tipo de conex\u00e3o ''{0}'' n\u00e3o p\u00f4de ser carregado.
JMSCC0091.inserts = XMSC_CONNECTION_TYPE

JMSCC0092 = O tipo de conex\u00e3o deveria ser ''{0}'', mas, em realidade, era ''{1}''.
JMSCC0092.inserts = XMSC_CONNECTION_TYPE_NAME, XMSC_CONNECTION_TYPE
JMSCC0092.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0093 = O destino n\u00e3o era v\u00e1lido. A assinatura dur\u00e1vel em um destino tempor\u00e1rio com o tipo ''{0}'' e o nome ''{1}'' n\u00e3o pode ser criada.
JMSCC0093.inserts = XMSC_INSERT_TYPE, XMSC_DESTINATION_NAME
JMSCC0093.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0094 = Este navegador de conex\u00e3o est\u00e1 fechado.
JMSCC0094.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0095 = O nome do destino ''{0}'' n\u00e3o \u00e9 v\u00e1lido.
JMSCC0095.explanation = O nome de destino especificado n\u00e3o est\u00e1 em conformidade com a sintaxe do destino publicado.
JMSCC0095.useraction = Corrija o nome do destino especificado e tente novamente.
JMSCC0095.inserts = XMSC_DESTINATION_NAME
JMSCC0095.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0097 = Modo de confirma\u00e7\u00e3o inv\u00e1lido ''{0}''. Connection.createSession() foi solicitada a criar uma sess\u00e3o n\u00e3o transacional (transacional era falsa), mas o modo de confirma\u00e7\u00e3o n\u00e3o era AUTO_ACKNOWLEDGE, DUPS_OK_ACKNOWLEDGE ou CLIENT_ACKNOWLEDGE.
JMSCC0097.inserts = XMSC_ACKNOWLEDGE_MODE

JMSCC0098 = A mensagem n\u00e3o pode ser nula.
JMSCC0098.useraction = Especifique uma mensagem n\u00e3o nula.
JMSCC0098.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0099 = O destino ''{0}'' n\u00e3o \u00e9 uma inst\u00e2ncia de com.ibm.msg.client.jms.JmsDestination.
JMSCC0099.useraction = Especifique uma inst\u00e2ncia de com.ibm.msg.client.jms.JmsDestination.
JMSCC0099.inserts = XMSC_DESTINATION_NAME
JMSCC0099.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0100 = O nome da assinatura n\u00e3o pode ser nulo.
JMSCC0100.useraction = Especifique um nome de assinatura n\u00e3o nulo.
JMSCC0100.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0101 = O ID do cliente n\u00e3o pode ser nulo.
JMSCC0101.useraction = Especifique um ID de cliente n\u00e3o nulo.
JMSCC0101.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0102 = O nome da propriedade ''{0}'' na mensagem n\u00e3o \u00e9 um identificador Java(tm) v\u00e1lido.
JMSCC0102.explanation = O nome fornecido da propriedade n\u00e3o est\u00e1 em conformidade com o formato permitido descrito na especifica\u00e7\u00e3o JMS.
JMSCC0102.useraction = Verifique os caracteres utilizados no nome da propriedade e modifique, conforme necess\u00e1rio.
JMSCC0102.inserts = XMSC_INSERT_PROPERTY
JMSCC0102.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0103 = Um objeto nulo foi fornecido.
JMSCC0103.explanation = Foi fornecido um objeto ao m\u00e9todo writeObject() que era nulo.
JMSCC0103.useraction = Corrija o aplicativo para assegurar-se de que apenas os objetos n\u00e3o nulos sejam transmitidos como par\u00e2metros ao m\u00e9todo writeObject().
JMSCC0103.exception = java.lang.NullPointerException

JMSCC0105 = A convers\u00e3o do item ''{0}'' do tipo ''{1}'' ao tipo ''{2}'' n\u00e3o \u00e9 permitida.
JMSCC0105.explanation = A convers\u00e3o entre os dois tipos de dados especificados n\u00e3o \u00e9 permitida pela especifica\u00e7\u00e3o do JMS.
JMSCC0105.useraction = Recupere o item nomeado utilizando uma das convers\u00f5es permitidas.
JMSCC0105.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE
JMSCC0105.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0106 = Falha ao obter um recurso XA. ''{0}''.
JMSCC0106.useraction = Consulte a causa para obter informa\u00e7\u00f5es adicionais.
JMSCC0106.inserts = XMSC_INSERT_EXCEPTION
JMSCC0106.exception = java.lang.RuntimeException

JMSCC0107 = Tempo limite inv\u00e1lido ''{0}''.
JMSCC0107.explanation = O tempo limite deve ser positivo ou zero, medido em milissegundos.
JMSCC0107.useraction = N\u00e3o transmita um tempo limite negativo.
JMSCC0107.inserts = XMSC_INSERT_TIMEOUT

# Message changed for APAR IT16300
JMSCC0108 = O IBM MQ classes for JMS detectou uma mensagem pronta para a entrega ass\u00edncrona para um aplicativo. Quando se tentou fazer a entrega, a mensagem n\u00e3o estava mais dispon\u00edvel. Consulte o t\u00f3pico "Solucionando problemas das mensagens JMSCC0108" na se\u00e7\u00e3o IBM MQ V9.0 do IBM Knowledge Center para obter as causas e as a\u00e7\u00f5es poss\u00edveis.
JMSCC0108.explanation = Um encadeamento interno no IBM MQ classes for JMS detectou uma mensagem e solicitou que outro encadeamento interno obtivesse a mensagem e a entregasse a um aplicativo para processamento. Quando esse encadeamento tentou obter a mensagem, ela n\u00e3o estava mais dispon\u00edvel.
JMSCC0108.useraction = Consulte o t\u00f3pico "Solucionando problemas das mensagens JMSCC0108" na se\u00e7\u00e3o IBM MQ V9.0 do IBM Knowledge Center para obter mais informa\u00e7\u00f5es.

JMSCC0109 = Um bean orientado \u00e0 mensagem emitiu uma exce\u00e7\u00e3o de tempo de execu\u00e7\u00e3o ''{0}''.
JMSCC0109.explanation = Isso pode indicar um problema no listener da mensagem.
JMSCC0109.useraction = Se a exce\u00e7\u00e3o de tempo de execu\u00e7\u00e3o foi lan\u00e7ada sem inten\u00e7\u00e3o pelo listener da mensagem, utilize a exce\u00e7\u00e3o vinculada para determinar a causa do problema.
JMSCC0109.inserts = XMSC_INSERT_EXCEPTION
JMSCC0109.exception = java.lang.RuntimeException

JMSCC0110 = Uma exce\u00e7\u00e3o ''{0}'' foi capturada ao processar uma mensagem para entrega a um bean orientado \u00e0 mensagem.
JMSCC0110.useraction = Examine a exce\u00e7\u00e3o vinculada para obter mais informa\u00e7\u00f5es.
JMSCC0110.inserts = XMSC_INSERT_EXCEPTION
JMSCC0110.exception = java.lang.RuntimeException

JMSCC0111 = O IBM MQ classes for JMS tentou configurar um ID do cliente pr\u00e9-existente em um Connection ou JMSContext.
JMSCC0111.explanation = Um aplicativo tentou configurar a propriedade do ID de cliente de um Connection ou JMSContext v\u00e1lido para o valor ''{0}'', mas esse valor j\u00e1 est\u00e1 em uso.\n\
O clientId j\u00e1 havia sido configurado para {1}.
JMSCC0111.useraction = Certifique-se de que a conex\u00e3o seja v\u00e1lida e que o ID do cliente seja exclusivo.
JMSCC0111.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_STRING
JMSCC0111.exception = com.ibm.msg.client.jms.DetailedInvalidClientIDException

JMSCC0112 = O Atraso de Entrega n\u00e3o \u00e9 suportado por este provedor
JMSCC0112.explanation = Um aplicativo tentou configurar um atraso de entrega, mas o provedor JMS n\u00e3o suporta isto

JMSCC0113 = O Atraso de Entrega deve ser menos que o tempo real
JMSCC0113.explanation = Um aplicativo tentou configurar um atraso na entrega, mas o tempo real n\u00e3o era maior do que este atraso

JMSCC0114 = O Atraso de Entrega n\u00e3o \u00e9 suportado para publica\u00e7\u00f5es retidas
JMSCC0114.explanation = Um aplicativo tentou configurar um atraso de entrega em uma mensagem retida; isto n\u00e3o \u00e9 suportado

JMSCC0115 = Atraso na entrega n\u00e3o pode ser usado com agrupamento
JMSCC0115.explanation = Um aplicativo tentou configurar um atraso na entrega em uma mensagem que tamb\u00e9m possui um ID de grupo e/ou um n\u00famero de sequ\u00eancia de grupo configurado; isso n\u00e3o \u00e9 suportado

# Message for FFST - additional fields not required
JMSCC1026 = Uma exce\u00e7\u00e3o foi emitida enquanto o listener de exce\u00e7\u00e3o do usu\u00e1rio estava em execu\u00e7\u00e3o.

# Message for FFST - additional fields not required
JMSCC1027 = Falha do listener de exce\u00e7\u00e3o ao executar.

JMSCC1069 = A opera\u00e7\u00e3o para uma sess\u00e3o transacionada XA n\u00e3o era v\u00e1lida.
JMSCC1069.explanation = O modo de confirma\u00e7\u00e3o para uma sess\u00e3o transacionada n\u00e3o era v\u00e1lido. Commit(), rollback(), acknowledge() e recover() n\u00e3o s\u00e3o opera\u00e7\u00f5es v\u00e1lidas nas sess\u00f5es transacionadas.
JMSCC1069.useraction = N\u00e3o chame este m\u00e9todo ao utilizar XA.
JMSCC1069.exception = com.ibm.msg.client.jms.DetailedTransactionInProgressException

JMSCC1083 = Tamanho do lote de mensagens incorreto (deve ser maior que zero).
JMSCC1083.explanation = Um par\u00e2metro de tamanho de lote incorreto foi transmitido a createConnectionConsumer() ou createDurableConnectionConsumer().
JMSCC1083.useraction = Configure o tamanho do lote para maior que zero. Em um servidor de aplicativos que est\u00e1 em concord\u00e2ncia com o JEE, isso pode representar um erro no servidor de aplicativos. Consulte a documenta\u00e7\u00e3o do servidor de aplicativos.

JMSCC1084 = Um conjunto de sess\u00f5es do servidor nulo foi fornecido.
JMSCC1084.explanation = O conjunto de sess\u00f5es do servidor especificado em createConnectionConsumer() ou createDurableConnectionConsumer() era nulo.
JMSCC1084.useraction = Configure um ServerSessionPool apropriado. Em um servidor de aplicativos que est\u00e1 em concord\u00e2ncia com o JEE, isso pode representar um erro no servidor de aplicativos. Consulte a documenta\u00e7\u00e3o do servidor de aplicativos.

JMSCC1093 = Um par\u00e2metro nulo foi fornecido.
JMSCC1093.explanation = Um objeto necess\u00e1rio a este m\u00e9todo n\u00e3o foi inicializado corretamente.
JMSCC1093.useraction = Assegure-se de que todos os par\u00e2metros fornecidos ao m\u00e9todo sejam inicializados corretamente.

JMSCC1094 = QuantityHint n\u00e3o \u00e9 v\u00e1lido.
JMSCC1094.explanation = Foi feita uma tentativa de criar um navegador da conex\u00e3o com uma sugest\u00e3o de quantidade de dados incorreta.
JMSCC1094.useraction = Especifique NO_DATA, HEADER_DATA ou FULL_DATA.
JMSCC1094.exception = java.lang.IllegalArgumentException

JMSCC1096 = A refer\u00eancia da mensagem n\u00e3o \u00e9 v\u00e1lida.
JMSCC1096.explanation = Uma refer\u00eancia de mensagem incorretamente formada foi transmitida a este m\u00e9todo. A refer\u00eancia da mensagem deve ser uma inst\u00e2ncia de JmsMessageReference.
JMSCC1096.useraction = Assegure-se de utilizar as refer\u00eancias de mensagem corretas.

JMSCC1112 = A opera\u00e7\u00e3o para um objeto espec\u00edfico do dom\u00ednio n\u00e3o era v\u00e1lida. A opera\u00e7\u00e3o ''{0}'' n\u00e3o \u00e9 v\u00e1lida para o tipo ''{1}''.
JMSCC1112.explanation = Um aplicativo JMS tentou desempenhar uma opera\u00e7\u00e3o em um objeto espec\u00edfico do dom\u00ednio, mas a opera\u00e7\u00e3o \u00e9 v\u00e1lida apenas para outro dom\u00ednio do sistema de mensagens.
JMSCC1112.useraction = Certifique-se de que os objetos ou opera\u00e7\u00f5es do JMS utilizados pelo aplicativo s\u00e3o relevantes ao dom\u00ednio do sistema de mensagens necess\u00e1rio. Se seu aplicativo utiliza ambos os dom\u00ednios do sistema de mensagens, considere o uso de objetos independentes de dom\u00ednio no aplicativo.
JMSCC1112.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_TYPE
JMSCC1112.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC1113 = A opera\u00e7\u00e3o para um objeto espec\u00edfico do dom\u00ednio n\u00e3o era v\u00e1lida. A opera\u00e7\u00e3o ''{0}'' n\u00e3o \u00e9 v\u00e1lida para o tipo ''{1}'', \
pois a sess\u00e3o \u00e9 do tipo ''{2}''.
JMSCC1113.explanation = Um aplicativo JMS tentou desempenhar uma opera\u00e7\u00e3o em um objeto espec\u00edfico do dom\u00ednio, mas a opera\u00e7\u00e3o \u00e9 v\u00e1lida apenas para outro dom\u00ednio do sistema de mensagens.
JMSCC1113.useraction = Assegure-se de que os objetos do JMS, opera\u00e7\u00f5es e Connection Factories usados pelo seu aplicativo sejam relevantes para o dom\u00ednio do sistema de mensagens necess\u00e1rio. Se seu aplicativo utiliza ambos os dom\u00ednios do sistema de mensagens, considere o uso de objetos independentes de dom\u00ednio no aplicativo.
JMSCC1113.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_TYPE,XMSC_INSERT_SESSION
JMSCC1113.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC3002 = O destino de fila tempor\u00e1rio ''{0}'' n\u00e3o pode ser exclu\u00eddo, visto que ainda est\u00e1 em uso.
JMSCC3002.explanation = Foi feita uma tentativa de excluir um destino tempor\u00e1rio, quando ele ainda est\u00e1 em uso por um consumidor ou navegador.
JMSCC3002.useraction = Feche todos os consumidores e navegadores que s\u00e3o dependentes do destino antes de exclu\u00ed-lo.
JMSCC3002.inserts = XMSC_DESTINATION_NAME

JMSCC3003 = Uso incorreto de destino tempor\u00e1rio ''{0}'' .
JMSCC3003.explanation = O uso de destinos tempor\u00e1rios pelos consumidores e navegadores das mensagens \u00e9 restrito \u00e0queles criados utilizando a mesma conex\u00e3o.
JMSCC3003.useraction = Modifique o aplicativo para utilizar um destino tempor\u00e1rio criado pela mesma conex\u00e3o e tente novamente.
JMSCC3003.inserts = XMSC_DESTINATION_NAME
JMSCC3003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException


JMSCC3019 = O destino tempor\u00e1rio j\u00e1 foi exclu\u00eddo ''{0}'' .
JMSCC3019.explanation = O destino tempor\u00e1rio j\u00e1 foi exclu\u00eddo ao fazer uma tentativa de utiliz\u00e1-lo.
JMSCC3019.useraction = Modifique o aplicativo evitando fechar o destino tempor\u00e1rio ou utilize um destino diferente.
JMSCC3019.inserts = XMSC_DESTINATION_NAME
JMSCC3019.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC3025 = O destino de t\u00f3pico tempor\u00e1rio ''{0}'' n\u00e3o pode ser exclu\u00eddo, visto que ainda est\u00e1 em uso.
JMSCC3025.explanation = Foi feita uma tentativa de excluir um destino tempor\u00e1rio, quando ele ainda est\u00e1 em uso por um consumidor ou navegador.
JMSCC3025.useraction = Feche todos os consumidores e navegadores que s\u00e3o dependentes do destino antes de exclu\u00ed-lo.
JMSCC3025.inserts = XMSC_DESTINATION_NAME

JMSCC3031 = N\u00e3o \u00e9 poss\u00edvel configurar o ID do cliente ap\u00f3s utilizar a conex\u00e3o.
JMSCC3031.explanation = O ID de cliente de uma conex\u00e3o pode ser configurado apenas uma vez e apenas antes da conex\u00e3o ser utilizada.
JMSCC3031.useraction = Configure o ID do cliente antes de utilizar a conex\u00e3o.
JMSCC3031.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC3032 = A reconfigura\u00e7\u00e3o do ID do cliente n\u00e3o \u00e9 permitida.
JMSCC3032.explanation = O ID de cliente de uma conex\u00e3o pode ser configurado apenas uma vez e apenas antes da conex\u00e3o ser utilizada.
JMSCC3032.useraction = Configure o ID do cliente antes de utilizar a conex\u00e3o.
JMSCC3032.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC3033 = A chamada close() no listener da mensagem possui conflito.
JMSCC3033.explanation = O m\u00e9todo close() foi chamado de um listener de mensagem. A chamada close() n\u00e3o \u00e9 permitida a retornar enquanto o listener de mensagem est\u00e1 em execu\u00e7\u00e3o e, portanto, estar\u00e1 em conflito.
JMSCC3033.useraction = Altere o aplicativo para n\u00e3o chamar nenhum m\u00e9todo close() de dentro de um listener de mensagem.
JMSCC3033.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

# Log message
JMSCC3034 = A exce\u00e7\u00e3o \u00e9 ignorada, visto que nenhum listener de exce\u00e7\u00e3o est\u00e1 registrado: ''{0}''.
JMSCC3034.explanation = Uma tentativa de entregar uma exce\u00e7\u00e3o ao listener de exce\u00e7\u00e3o da conex\u00e3o foi feita, mas um listener n\u00e3o foi registrado.
JMSCC3034.useraction = Um listener de exce\u00e7\u00e3o deve ser registrado com a conex\u00e3o, para receber as exce\u00e7\u00f5es.
JMSCC3034.inserts = XMSC_INSERT_EXCEPTION

# Log message
JMSCC3035 = A exce\u00e7\u00e3o \u00e9 ignorada, visto que o tipo est\u00e1 fora dos escolhidos para o listener de exce\u00e7\u00e3o: ''{0}''.
JMSCC3035.explanation = A exce\u00e7\u00e3o n\u00e3o cai nos tipos escolhidos para a entrega ao listener de exce\u00e7\u00e3o da conex\u00e3o e foi ignorada.
JMSCC3035.useraction = Revise a configura\u00e7\u00e3o de conex\u00e3o ASYNC_EXCEPTIONS para assegurar-se de que a filtragem de exce\u00e7\u00f5es est\u00e1 configurada como deveria.
JMSCC3035.inserts = XMSC_INSERT_EXCEPTION

# Log message
JMSCC3036 = Foi entregue uma exce\u00e7\u00e3o ao listener de exce\u00e7\u00e3o da conex\u00e3o: ''{0}''.
JMSCC3036.useraction = Revise os detalhes da exce\u00e7\u00e3o para obter informa\u00e7\u00f5es adicionais.
JMSCC3036.inserts = XMSC_INSERT_EXCEPTION

JMSCC3039 = O nome da assinatura era nulo ou uma cadeia vazia.
JMSCC3039.explanation = Os consumidores das conex\u00f5es dur\u00e1veis devem ter um nome de assinatura n\u00e3o nulo e que n\u00e3o seja uma cadeia vazia.
JMSCC3039.useraction = Transmita um nome de assinatura que n\u00e3o seja nulo, nem uma cadeia vazia.

JMSCC3040 = A tentativa de modifica\u00e7\u00e3o dos Metadados de Conex\u00e3o foi ignorada. 
JMSCC3040.explanation = Os Metadados de Conex\u00e3o s\u00e3o para leitura, n\u00e3o \u00e9 poss\u00edvel modificar suas propriedades.
JMSCC3040.useraction = Modifique o aplicativo para que ele n\u00e3o tente modificar os Metadados de Conex\u00e3o.

JMSCC3041 = Ocorreu uma falha na tentativa de configurar v\u00e1rias propriedades de uma s\u00f3 vez. Propriedades: ''{0}''.
JMSCC3041.explanation = Ocorreu uma falha na valida\u00e7\u00e3o de uma ou mais propriedades; nenhuma altera\u00e7\u00e3o foi feita.
JMSCC3041.useraction = Verifique se a combina\u00e7\u00e3o das propriedades possui valores v\u00e1lidos. 
JMSCC3041.inserts = XMSC_INSERT_PROPERTY

# XA unavailable. An attempt was made to perform and action that requires XA when XA is not supported.
JMSCC4001 = As transa\u00e7\u00f5es distribu\u00eddas n\u00e3o est\u00e3o dispon\u00edveis.
JMSCC4001.explanation = Foi feita uma tentativa de utilizar transa\u00e7\u00f5es distribu\u00eddas em um ambiente, onde n\u00e3o est\u00e3o dispon\u00edveis.


JMSCC5001 = N\u00e3o \u00e9 poss\u00edvel obter o corpo, pois a mensagem \u00e9 StreamMessage
JMSCC5001.explanation = N\u00e3o foi poss\u00edvel obter o corpo, pois a mensagem \u00e9 StreamMessage e isso n\u00e3o \u00e9 permitido pela Especifica\u00e7\u00e3o do JMS
JMSCC5001.useraction = O aplicativo ou tipo de mensagem enviado precisar\u00e1 ser alterado
JMSCC5001.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC5002 = A mensagem do tipo {0} n\u00e3o pode ter seu corpo designado a {1}
JMSCC5002.explanation = A Especifica\u00e7\u00e3o do JMS n\u00e3o permite uma designa\u00e7\u00e3o deste tipo
JMSCC5002.useraction = O aplicativo ou tipo de mensagem enviado precisar\u00e1 ser alterado
JMSCC5002.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC5002.inserts = XMSC_INSERT_MESSAGE_TYPE, XMSC_INSERT_BODY_TYPE

JMSCC5003 = Ocorreu uma exce\u00e7\u00e3o desserializar uma mensagem, exce\u00e7\u00e3o: ''{0}''.
JMSCC5003.explanation = N\u00e3o foi poss\u00edvel desserializar a mensagem devido \u00e0 exce\u00e7\u00e3o mostrada.
JMSCC5003.useraction = Examine a exce\u00e7\u00e3o vinculada para obter detalhes do erro.
JMSCC5003.inserts = XMSC_INSERT_EXCEPTION
JMSCC5003.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC5004 = A mensagem n\u00e3o tem corpo
JMSCC5004.explanation = A mensagem n\u00e3o tem corpo, portanto, n\u00e3o pode ser convertida para o tipo especificado
JMSCC5004.useraction = O aplicativo ou tipo de mensagem enviado precisar\u00e1 ser alterado
JMSCC5004.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC5005 = N\u00e3o \u00e9 permitido enviar esta mensagem, porque o corpo da mensagem \u00e9 somente leitura e uma chamada JmsProducer.setProperty foi feita
JMSCC5005.explanation = Um aplicativo de usu\u00e1rio tentou definir um corpo de mensagem somente leitura, por meio de uma chamada JmsProducer.setProperty.
JMSCC5005.useraction = Altere o programa aplicativo para remover este comportamento ou chame o m\u00e9todo clearBody() primeiro.
JMSCC5005.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSCC5006 = N\u00e3o \u00e9 permitido enviar essa mensagem porque o buffer de envio ass\u00edncrono do lado do cliente est\u00e1 cheio
JMSCC5006.explanation = Um aplicativo de usu\u00e1rio tentou enviar de modo ass\u00edncrono uma mensagem  JMS e j\u00e1 existe uma lista n\u00e3o processada de mensagens ass\u00edncronas no cliente.
JMSCC5006.useraction = Altere o programa de aplicativo para chamar m\u00e9todos de envio ass\u00edncronos com menos frequ\u00eancia ou consulte sua documenta\u00e7\u00e3o para obter op\u00e7\u00f5es de configura\u00e7\u00e3o.

JMSCC5007 = O uso da API ''{0}'' do JMS2.0 n\u00e3o \u00e9 suportado com essa inst\u00e2ncia desta conex\u00e3o
JMSCC5007.explanation = Apenas conex\u00f5es com um tipo correto de conex\u00e3o podem suportar o uso da API do JMS2.0
JMSCC5007.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC5007.inserts =XMSC_INSERT_METHOD

JMSCC5008 = O uso da Fun\u00e7\u00e3o ''{0}'' do JMS2.0 n\u00e3o \u00e9 suportado com essa inst\u00e2ncia desta conex\u00e3o
JMSCC5008.explanation = O uso da funcionalidade JMS2.0 mencionada na mensagem \u00e9 suportado somente ao se \
conectar a um gerenciador de filas do IBM MQ V8 usando o modo V8 do provedor do sistema de mensagens do IBM MQ.
JMSCC5008.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC5008.inserts =XMSC_INSERT_METHOD

JMSCC5009 = Nenhuma resposta do encadeamento de envio. A mensagem pode n\u00e3o ter sido enviada
JMSCC5009.explanation = O encadeamento de envio ass\u00edncrono n\u00e3o est\u00e1 respondendo. O encadeamento pode ter terminado inesperadamente.

JMSCC5010 = Substituindo propriedades ConnectionFactory do PropertyStore:\n\
{0}
JMSCC5010.inserts = XMSC_INSERT_PROPERTY_OVERRIDE_LIST

JMSCC5011 = Substituindo a propriedade {0}:\n\
\tValor original = {1}\n\
\tNovo valor     = {2}
JMSCC5011.inserts = XMSC_OVERRIDDEN_PROPERTY, XMSC_ORIGINAL__PROPERTY_VALUE, XMSC_NEW_PROPERTY_VALUE

#CICS related messages. JMSCC6 used to prevent issues when back porting.
#The first two exceptions have the same text but different exception types
JMSCC6001 = O m\u00e9todo ''{0}'' n\u00e3o \u00e9 suportado ao executar em um ambiente CICS.
JMSCC6001.explanation = O m\u00e9todo especificado n\u00e3o pode ser usado com uma conex\u00e3o no modo de liga\u00e7\u00f5es para o MQ em um ambiente CICS.
JMSCC6001.useraction = Modifique o aplicativo para que n\u00e3o chame o m\u00e9todo especificado.
JMSCC6001.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6001.inserts = XMSC_INSERT_METHOD
 
JMSCC6002 = O m\u00e9todo ''{0}'' n\u00e3o \u00e9 suportado ao executar em um ambiente CICS.
JMSCC6002.explanation = O m\u00e9todo especificado n\u00e3o pode ser usado com uma conex\u00e3o no modo de liga\u00e7\u00f5es para o MQ em um ambiente CICS.
JMSCC6002.useraction = Modifique o aplicativo para que n\u00e3o chame o m\u00e9todo especificado.
JMSCC6002.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC6002.inserts = XMSC_INSERT_METHOD
 
JMSCC6003 = Somente uma inst\u00e2ncia de sess\u00e3o por conex\u00e3o pode estar ativa por vez ao executar em um ambiente CICS.
JMSCC6003.explanation = Somente uma inst\u00e2ncia de sess\u00e3o \u00fanica por conex\u00e3o no modo de liga\u00e7\u00f5es para o MQ pode estar ativa por vez em um ambiente CICS.
JMSCC6003.useraction = Modifique o aplicativo para que crie uma sess\u00e3o a partir de uma conex\u00e3o diferente ou feche a sess\u00e3o existente que usa a conex\u00e3o atual.
JMSCC6003.exception = com.ibm.msg.client.jms.DetailedJMSException
 
JMSCC6004 = A cria\u00e7\u00e3o de uma conex\u00e3o ou contexto JMS com um ID do usu\u00e1rio ou senha n\u00e3o \u00e9 suportada ao executar em um ambiente CICS.
JMSCC6004.explanation = O gerenciador de filas n\u00e3o suporta autentica\u00e7\u00e3o ou autoriza\u00e7\u00e3o com um ID do usu\u00e1rio e senha fornecidos ao criar uma conex\u00e3o no modo de liga\u00e7\u00f5es ou contexto JMS em um ambiente CICS. Em vez disso, o ID do usu\u00e1rio associado ao espa\u00e7o de endere\u00e7o, ou transa\u00e7\u00e3o, do CICS \u00e9 usado.
JMSCC6004.useraction = Modifique o aplicativo para que n\u00e3o especifique um ID do usu\u00e1rio ou senha.
JMSCC6004.exception = com.ibm.msg.client.jms.DetailedJMSException

#The first two exceptions have the same text but different exception types
JMSCC6011 = O m\u00e9todo ''{0}'' n\u00e3o \u00e9 suportado ao executar em um ambiente IMS.
JMSCC6011.explanation = O m\u00e9todo especificado n\u00e3o pode ser usado com uma conex\u00e3o no modo de liga\u00e7\u00f5es para o MQ em um ambiente IMS.
JMSCC6011.useraction = Modifique o aplicativo para que n\u00e3o chame o m\u00e9todo especificado.
JMSCC6011.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6011.inserts = XMSC_INSERT_METHOD
 
JMSCC6012 = O m\u00e9todo ''{0}'' n\u00e3o \u00e9 suportado ao executar em um ambiente IMS.
JMSCC6012.explanation = O m\u00e9todo especificado n\u00e3o pode ser usado com uma conex\u00e3o no modo de liga\u00e7\u00f5es para o MQ em um ambiente IMS.
JMSCC6012.useraction = Modifique o aplicativo para que n\u00e3o chame o m\u00e9todo especificado.
JMSCC6012.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC6012.inserts = XMSC_INSERT_METHOD
 
JMSCC6013 = Somente uma inst\u00e2ncia de sess\u00e3o por conex\u00e3o pode estar ativa por vez ao executar em um ambiente IMS.
JMSCC6013.explanation = Somente uma inst\u00e2ncia de sess\u00e3o \u00fanica por conex\u00e3o no modo de liga\u00e7\u00f5es para o MQ pode estar ativa por vez em um ambiente IMS.
JMSCC6013.useraction = Modifique o aplicativo para que crie uma sess\u00e3o a partir de uma conex\u00e3o diferente ou feche a sess\u00e3o existente que usa a conex\u00e3o atual.
JMSCC6013.exception = com.ibm.msg.client.jms.DetailedJMSException
 
JMSCC6014 = A cria\u00e7\u00e3o de uma conex\u00e3o ou contexto JMS com um ID do usu\u00e1rio ou senha n\u00e3o \u00e9 suportada ao executar em um ambiente IMS.
JMSCC6014.explanation = O gerenciador de filas n\u00e3o suporta autentica\u00e7\u00e3o ou autoriza\u00e7\u00e3o com um ID do usu\u00e1rio e senha fornecidos ao criar uma conex\u00e3o no modo de liga\u00e7\u00f5es ou contexto JMS em um ambiente IMS. Em vez disso, o ID do usu\u00e1rio associado ao espa\u00e7o de endere\u00e7o do IMS, transa\u00e7\u00e3o, nome LTERM ou PSBNAME \u00e9 usado.
JMSCC6014.useraction = Modifique o aplicativo para que n\u00e3o especifique um ID do usu\u00e1rio ou senha.
JMSCC6014.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSCC6015 = O m\u00e9todo ''{0}'' n\u00e3o tem suporte ao ser executado em um servi\u00e7o de aplicativos
JMSCC6015.explanation = O m\u00e9todo especificado n\u00e3o deve ser usado em um Java EE EJB ou cont\u00eainer da web.
JMSCC6015.useraction = Modifique o aplicativo para que n\u00e3o chame o m\u00e9todo especificado.
JMSCC6015.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6015.inserts = XMSC_INSERT_METHOD

JMSCC6016 = O tempo limite foi atingido ao esperar que o Servidor de aplicativos obtivesse uma sess\u00e3o do servidor. O tempo limite est\u00e1 configurado como ''{0}''
JMSCC6016.explanation = Ap\u00f3s o valor de tempo limite expirar, o MQ Resource Adapter ter\u00e1 que interromper a espera por uma sess\u00e3o do servidor.
JMSCC6016.useraction = Considere aumentar esse tempo limite com a propriedade de configura\u00e7\u00e3o JMS 'com.ibm.msg.client.wmq.getServerSessionTimeout'.
JMSCC6016.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6016.inserts = XMSC_INSERT_TIMEOUT
 
