# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE
#

# JMSCMQ0001 doesn't have a .inserts message because it's only used by Reason in
# a WMQException, and never in a JMSException.
JMSCMQ0001 = IBM MQ \ud638\ucd9c\uc5d0 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4. \uc644\ub8cc \ucf54\ub4dc ''{0}''(''{1}''), \uc774\uc720 ''{2}''(''{3}'')

JMSCMQ0002 = \uba54\uc18c\ub4dc ''{0}''\uc5d0 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4.
JMSCMQ0002.explanation = IBM MQ \ud638\ucd9c\uc5d0 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4.
JMSCMQ0002.useraction = \uc790\uc138\ud55c \uc815\ubcf4\ub294 \ub9c1\ud06c\ub41c \uc608\uc678\ub97c \ucc38\uc870\ud558\uc2ed\uc2dc\uc624.
JMSCMQ0002.inserts = XMSC_INSERT_METHOD

JMSCMQ0003 = \ubaa9\uc801\uc9c0 ''{0}''\uc744(\ub97c) \uc54c \uc218 \uc5c6\uac70\ub098 \ub354 \uc774\uc0c1 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
JMSCMQ0003.explanation = \ud050 \ub610\ub294 \ud1a0\ud53d\uc744 \uc0ac\uc6a9\ud560 \uc218 \uc5c6\uac8c \ub418\uac70\ub098, \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc774 \ud050 \ub610\ub294 \ud1a0\ud53d\uc5d0 \uc62c\ubc14\ub974\uc9c0 \uc54a\uc740 \uc5f0\uacb0\uc744 \uc0ac\uc6a9\ud558\uac70\ub098, \uc81c\uacf5\ub41c \ubaa9\uc801\uc9c0 \uc720\ud615\uc774 \uc774 \uba54\uc18c\ub4dc\uc5d0 \uc62c\ubc14\ub974\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
JMSCMQ0003.useraction = IBM MQ\uc774(\uac00) \uacc4\uc18d \uc2e4\ud589 \uc911\uc778\uc9c0, \ud050 \uad00\ub9ac\uc790\ub97c \uc0ac\uc6a9\ud560 \uc218 \uc788\ub294\uc9c0 \uc810\uac80\ud558\uc2ed\uc2dc\uc624. \ud050 \ub610\ub294 \ud1a0\ud53d\uc5d0 \uc0ac\uc6a9 \uc911\uc778 \uc5f0\uacb0\uc774 \uc62c\ubc14\ub978\uc9c0 \uc810\uac80\ud558\uc2ed\uc2dc\uc624.
JMSCMQ0003.inserts = XMSC_DESTINATION_NAME
JMSCMQ0003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCMQ0004 = \uac12 ''{0}''\uc774(\uac00) \ud2b9\uc131 ''{1}''\uc5d0 \uc62c\ubc14\ub974\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
JMSCMQ0004.explanation = \ud2b9\uc131 ''{1}''\uc758 \uac12\uc774 \uc774 \ud2b9\uc131\uc5d0 \uc62c\ubc14\ub978 \uac12\uc774 \uc544\ub2d9\ub2c8\ub2e4.
JMSCMQ0004.useraction = \uc62c\ubc14\ub978 \uac12\uc73c\ub85c \ud2b9\uc131\uc744 \uc124\uc815\ud558\uc2ed\uc2dc\uc624.
JMSCMQ0004.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_PROPERTY

JMSCMQ0005 = \ubaa9\uc801\uc9c0 \uc774\ub984 ''{0}''\uc774(\uac00) \uc62c\ubc14\ub974\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
JMSCMQ0005.explanation = \uc9c0\uc815\ud55c \ubaa9\uc801\uc9c0 \uc774\ub984\uc774 \ubc1c\ud589\ub41c \ubaa9\uc801\uc9c0 \uad6c\ubb38\uc744 \uc900\uc218\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
JMSCMQ0005.useraction = \uc9c0\uc815\ud55c \ubaa9\uc801\uc9c0 \uc774\ub984\uc744 \uc218\uc815\ud55c \ud6c4 \ub2e4\uc2dc \uc2dc\ub3c4\ud558\uc2ed\uc2dc\uc624.
JMSCMQ0005.inserts = XMSC_DESTINATION_NAME
JMSCMQ0005.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCMQ0006 = \uc784\uc2dc \ubaa9\uc801\uc9c0\uac00 \uc544\ub2cc \ubaa9\uc801\uc9c0\ub294 \uc0ad\uc81c\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
JMSCMQ0006.explanation = \uc784\uc2dc \ubaa9\uc801\uc9c0\ub9cc \uc0ad\uc81c\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4.

JMSCMQ0007 = \ubaa9\uc801\uc9c0 \ud2b9\uc131\uc5d0 \uc54c \uc218 \uc5c6\ub294 \ud2b9\uc131 ''{0}''(\uac12: ''{1}'')\uc774(\uac00) \uc9c0\uc815\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
JMSCMQ0007.explanation = \ud2b9\uc131 ''{0}''\uc744(\ub97c) \uc778\uc2dd\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \uc0ac\uc6a9\uc790 \uc815\uc758 \ud2b9\uc131 \uac12\uc785\ub2c8\ub2e4.
JMSCMQ0007.useraction = \uc62c\ubc14\ub978 \uc0ac\uc6a9\uc790 \uc815\uc758 \ud2b9\uc131 \uac12\uc744 \uc9c0\uc815\ud558\uc2ed\uc2dc\uc624.
JMSCMQ0007.inserts = XMSC_INSERT_KEY, XMSC_INSERT_VALUE

JMSCMQ0008 = JMS\uc6a9 IBM MQ \ud074\ub798\uc2a4\uac00 \uba54\uc2dc\uc9c0\uc5d0\uc11c \uc9c0\uc6d0\ub418\uc9c0 \uc54a\ub294 \ub370\uc774\ud130 \uc720\ud615\uc744 \uc0ac\uc6a9\ud558\uac70\ub098, \uc798\ubabb\ub41c \uc720\ud615\uc758 \ub370\uc774\ud130\ub97c \uc77d\uc73c\ub824\uace0 \ud588\uc2b5\ub2c8\ub2e4.
JMSCMQ0008.explanation = \uba54\uc2dc\uc9c0 \ud2b9\uc131 \uc720\ud615\uc744 \uc77d\ub294 \ub370 \uc798\ubabb\ub41c \ub370\uc774\ud130 \uc720\ud615\uc744 \uc0ac\uc6a9\ud588\uc2b5\ub2c8\ub2e4.
JMSCMQ0008.useraction = \uc218\uc2e0\ub41c \uba54\uc2dc\uc9c0 \ubc0f \uc77d\uc744 \ud2b9\uc131\uc774 \uc608\uce21\ub41c \uc720\ud615\uc778\uc9c0 \uc810\uac80\ud558\uc2ed\uc2dc\uc624.
JMSCMQ0008.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ0009 = \uc2a4\ud2b8\ub9bc \uba54\uc2dc\uc9c0 \ub610\ub294 \ubc14\uc774\ud2b8 \uba54\uc2dc\uc9c0\ub97c \uc77d\ub294 \uc911 \uc608\uc0c1\uce58 \ubabb\ud558\uac8c \uc2a4\ud2b8\ub9bc \ub05d\uc5d0 \uc774\ub974\ub800\uc2b5\ub2c8\ub2e4.
JMSCMQ0009.explanation = \uc77d\uace0 \uc788\ub294 \ubc14\uc774\ud2b8 \uc2a4\ud2b8\ub9bc\uc774 \uc81c\uacf5\ub41c \ubc84\ud37c\ubcf4\ub2e4 \uc9e7\uc2b5\ub2c8\ub2e4. \uc774\ub294 \uc190\uc0c1\ub41c \uc2a4\ud2b8\ub9bc \uba54\uc2dc\uc9c0 \ub610\ub294 \ubc14\uc774\ud2b8 \uba54\uc2dc\uc9c0\ub97c \uc218\uc2e0\ud55c \uacbd\uc6b0 \ubc1c\uc0dd\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4.
JMSCMQ0009.useraction = \uc81c\uacf5\ub41c \ubc84\ud37c \uae38\uc774\ub97c \uc810\uac80\ud558\uc2ed\uc2dc\uc624. \uc790\uc138\ud55c \uc815\ubcf4 \ubc0f \uae30\ud0c0 \ubcf4\uace0\ub41c \uc2e4\ud328\ub97c \ubcf4\ub824\uba74 \uc2dc\uc2a4\ud15c \uc774\ubca4\ud2b8 \ub85c\uadf8\ub97c \ud655\uc778\ud558\uc2ed\uc2dc\uc624.
JMSCMQ0009.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCMQ0017 = \uc2a4\ud2b8\ub9bc\uc758 \ub05d\uc785\ub2c8\ub2e4.
JMSCMQ0017.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCMQ0018 = \uc218\uc2e0\ub41c \uba54\uc2dc\uc9c0\ub97c \uc62c\ubc14\ub974\uac8c \uad6c\ubb38 \ubd84\uc11d\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
JMSCMQ0018.explanation = messageID = ''{0}''\uc774\uace0 correlationID = ''{1}''\uc778 \uba54\uc2dc\uc9c0\ub97c \uc62c\ubc14\ub974\uac8c \uad6c\ubb38 \ubd84\uc11d\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \uba54\uc2dc\uc9c0\uc5d0\uc11c \uc77d\uc740 \ub9c8\uc9c0\ub9c9\uc73c\ub85c \uc131\uacf5\ud55c \ub370\uc774\ud130\uac00 ''{3}'' \ubc84\ud37c\uc758 ''{2}'' \uc704\uce58\uc5d0 \uc788\uc2b5\ub2c8\ub2e4. 
JMSCMQ0018.useraction = \uba54\uc2dc\uc9c0 \ub370\uc774\ud130\ub97c \uc870\uc0ac\ud558\uc5ec MQJMS \uba54\uc2dc\uc9c0\ub85c \uad6c\ubb38 \ubd84\uc11d\ub420 \uc218 \uc788\ub294 \uc62c\ubc14\ub978 \ud615\uc2dd\uc73c\ub85c \ub418\uc5b4 \uc788\ub294\uc9c0 \ud655\uc778\ud558\uc2ed\uc2dc\uc624.
JMSCMQ0018.inserts = XMSC_MESSAGE_ID, XMSC_CORRELATION_ID, XMSC_MESSAGE_BUFFER_POSITION, XMSC_MESSAGE_BUFFER

JMSCMQ1000 = JMS \uba54\uc2dc\uc9c0\ub97c \uc791\uc131\ud558\ub294 \ub370 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4.
JMSCMQ1000.explanation = messageID = ''{0}''\uc774\uace0 correlationID = ''{1}''\uc778 \uae30\ubcf8 \uba54\uc2dc\uc9c0\ub97c \uc791\uc131\ud558\ub294 \uc911\uc5d0 \uc798\ubabb\ub41c \uba54\uc2dc\uc9c0 \uc720\ud615 \ub610\ub294 \ud2b9\uc131\uc774 \uc9c0\uc815\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
JMSCMQ1000.useraction = \uc790\uc138\ud55c \uc815\ubcf4\ub294 \ub9c1\ud06c\ub41c IBM MQ \uc608\uc678 \uc774\uc720 \ubc0f \uc644\ub8cc \ucf54\ub4dc\ub97c \uc810\uac80\ud558\uace0 \uc138\ubd80\uc801\uc778 \uba54\uc2dc\uc9c0 \ucee8\ud150\uce20\ub294 \ub85c\uadf8 \ud30c\uc77c\uc744 \ud655\uc778\ud558\uc2ed\uc2dc\uc624.
JMSCMQ1000.inserts = XMSC_MESSAGE_ID, XMSC_CORRELATION_ID

JMSCMQ1006 = ''{0}''\uc5d0 \ub300\ud55c \uac12: ''{1}''\uc774(\uac00) \uc62c\ubc14\ub974\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
JMSCMQ1006.explanation = \ud2b9\uc131 ''{0}''\uc5d0 \ub300\ud55c \uac12 ''{1}''\uc774(\uac00) \uc62c\ubc14\ub974\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
JMSCMQ1006.useraction = \ub9c1\ud06c\ub41c IBM MQ \uc608\uc678 \uc774\uc720 \ubc0f \uc644\ub8cc \ucf54\ub4dc\ub97c \uc810\uac80\ud558\uc2ed\uc2dc\uc624.
JMSCMQ1006.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_VALUE

JMSCMQ1044 = \ubb38\uc790\uc5f4\uc774 \uc62c\ubc14\ub978 16\uc9c4 \uc22b\uc790\uac00 \uc544\ub2d9\ub2c8\ub2e4 - ''{0}''.
JMSCMQ1044.inserts = XMSC_INSERT_HEX_STRING
JMSCMQ1044.explanation = \uc811\ub450\ubd80 ID\ub85c \uc2dc\uc791\ud558\uc9c0\ub9cc \uc62c\ubc14\ub974\uac8c \uc0dd\uc131\ub41c 16\uc9c4 \uac12\uc744 \ub530\ub974\uc9c0 \uc54a\ub294 \uadf8\ub8f9 ID \ub610\ub294 \uc0c1\uad00 ID\ub97c \uc9c0\uc815\ud558\ub824\uace0 \ud558\uac70\ub098, \uc62c\ubc14\ub974\uac8c \uc791\uc131\ub41c 16\uc9c4 \uac12\uc774 \uc5c6\ub294 bin.hex \uc720\ud615\uc758 MQRFH2 \ud2b9\uc131\uc774 \ud3ec\ud568\ub41c \uba54\uc2dc\uc9c0\ub97c \uc218\uc2e0\ud558\ub824\uace0 \ud588\uc2b5\ub2c8\ub2e4.
JMSCMQ1044.useraction = \uadf8\ub8f9 ID \ub610\ub294 \uc0c1\uad00 ID \uac12\uc744 \uc124\uc815\ud560 \ub54c \uc62c\ubc14\ub978 16\uc9c4 \uac12\uc774 ID \uc811\ub450\ubd80\ub97c \ud56d\uc0c1 \ub530\ub974\ub294\uc9c0 \ud655\uc778\ud558\uc2ed\uc2dc\uc624. \ube44JMS \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc5d0\uc11c \uc0dd\uc131\ub41c MQRFH2 \ud5e4\ub354\uac00 \uc62c\ubc14\ub974\uac8c \uc0dd\uc131\ub418\uc5c8\ub294\uc9c0 \ud655\uc778\ud558\uc2ed\uc2dc\uc624. 
JMSCMQ1046 = \ubb38\uc790 \uc138\ud2b8 ''{0}''\uc740(\ub294) \uc9c0\uc6d0\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
JMSCMQ1046.inserts = CCSID
JMSCMQ1046.explanation = JVM\uc5d0\uc11c \uc9c0\uc6d0\ub418\uc9c0 \uc54a\ub294 \ubb38\uc790 \uc138\ud2b8\ub97c \uc0ac\uc6a9\ud558\uc5ec \ubcf8\ubb38\uc774 \uc778\ucf54\ub529\ub41c \ub9f5 \uba54\uc2dc\uc9c0, \uc2a4\ud2b8\ub9bc \uba54\uc2dc\uc9c0 \ub610\ub294 \ud14d\uc2a4\ud2b8 \uba54\uc2dc\uc9c0\ub97c \ubcf4\ub0b4\uac70\ub098 \uc218\uc2e0\ud558\ub824\uace0 \ud588\uc2b5\ub2c8\ub2e4. \ud14d\uc2a4\ud2b8 \uba54\uc2dc\uc9c0\uc758 \uacbd\uc6b0, \uc774\ub7ec\ud55c \uc608\uc678\ub294 \uc218\uc2e0 \uc2dc\uac04\uc774 \uc544\ub2cc \uba54\uc2dc\uc9c0 \ubcf8\ubb38\uc774 \ucc98\uc74c\uc73c\ub85c \uc870\ud68c\ub420 \ub54c \uc804\ub2ec\ub420 \uc218 \uc788\uc2b5\ub2c8\ub2e4.
JMSCMQ1046.useraction = \uc218\uc2e0 \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc5d0 \uc0ac\uc6a9 \uac00\ub2a5\ud55c \ubb38\uc790 \uc138\ud2b8\ub9cc \uc0ac\uc6a9\ud558\uc5ec \uba54\uc2dc\uc9c0\ub97c \uc778\ucf54\ub529\ud558\uc2ed\uc2dc\uc624.

JMSCMQ1047 = \ub9f5 \uba54\uc2dc\uc9c0 \ud615\uc2dd\uc774 \uc62c\ubc14\ub974\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
JMSCMQ1047.explanation = \ub9f5 \uba54\uc2dc\uc9c0\uac00 \uc218\uc2e0\ub418\uc5c8\uc73c\ub098 MQRFH2 \ud5e4\ub354 \uc815\ubcf4\uac00 \uc798\ubabb \ud615\uc2dd\ud654\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
JMSCMQ1047.useraction = \ube44JMS \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc774 \ub9f5 \uba54\uc2dc\uc9c0\uc5d0 \ud3ec\ud568\ud558\uae30 \uc704\ud574 \uc62c\ubc14\ub974\uac8c \uc0dd\uc131\ub41c MQRFH2 \ud5e4\ub354 \uc815\ubcf4\ub97c \ube4c\ub4dc\ud558\ub294\uc9c0 \ud655\uc778\ud558\uc2ed\uc2dc\uc624.
JMSCMQ1047.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1048 = \uc2a4\ud2b8\ub9bc \uba54\uc2dc\uc9c0 \ud615\uc2dd\uc774 \uc62c\ubc14\ub974\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
JMSCMQ1048.explanation = \uc2a4\ud2b8\ub9bc \uba54\uc2dc\uc9c0\ub97c \uc218\uc2e0\ud558\uc600\uc73c\ub098 \ud615\uc2dd\ud654\uac00 \uc798\ubabb\ub418\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
JMSCMQ1048.useraction = \ube44JMS \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc774 \uc81c\ub300\ub85c \ub41c \ud615\ud0dc\uc758 \uc2a4\ud2b8\ub9bc \uba54\uc2dc\uc9c0\ub97c \ube4c\ub4dc\ud558\uace0 \uc788\ub294\uc9c0 \ud655\uc778\ud558\uc2ed\uc2dc\uc624.
JMSCMQ1048.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1049 = \ubb38\uc790 \uc138\ud2b8 ''{0}''\uc774(\uac00) \ubb38\uc790\uc5f4 ''{1}''\uc758 \uc77c\ubd80 \ub610\ub294 \uc804\uccb4\ub97c \ubcc0\ud658\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
JMSCMQ1049.inserts = CCSID, XMSC_INSERT_VALUE
JMSCMQ1049.explanation = \ubb38\uc790\uc5f4\uc758 \ucee8\ud150\uce20\ub97c \ubcc0\ud658\ud560 \uc218 \uc5c6\ub294 \ubb38\uc790 \uc138\ud2b8\ub97c \uc0ac\uc6a9\ud558\uc5ec \ubb38\uc790\uc5f4 \ub370\uc774\ud130\ub97c \uc1a1\uc2e0\ud558\uac70\ub098 \uc218\uc2e0\ud558\ub824\uace0 \ud588\uc2b5\ub2c8\ub2e4.
JMSCMQ1049.useraction = \uc804\uc1a1\ub418\ub294 \ubb38\uc790\uc5f4 \ub370\uc774\ud130\uc5d0 \uc801\uc808\ud55c \uac83\uc73c\ub85c \uc54c\ub824\uc9c4 \ubb38\uc790 \uc138\ud2b8\ub9cc \uc0ac\uc6a9\ud558\uc5ec \uba54\uc2dc\uc9c0\ub97c \uc778\ucf54\ub529\ud558\uc2ed\uc2dc\uc624.

JMSCMQ1050 = MQRFH2 \ud5e4\ub354 \ud615\uc2dd\uc774 \uc62c\ubc14\ub974\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
JMSCMQ1050.explanation = MQRFH2 \ud5e4\ub354\uac00 \uc798\ubabb \uc0dd\uc131\ub41c \uba54\uc2dc\uc9c0\ub97c \uc218\uc2e0\ud588\uc2b5\ub2c8\ub2e4.
JMSCMQ1050.useraction = MQRFH2 \ud5e4\ub354\ub85c \uba54\uc2dc\uc9c0\ub97c \ube4c\ub4dc\ud558\ub294 \ube44JMS \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc774 \uc62c\ubc14\ub974\uac8c \ud615\uc131\ub41c MQRFH2 \ud5e4\ub354\ub97c \uc791\uc131\ud558\ub294\uc9c0 \ud655\uc778\ud558\uc2ed\uc2dc\uc624.
JMSCMQ1050.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1053 = \uc798\ubabb\ub41c UTF-16 \ub300\ub9ac \ubb38\uc790 ''{0}''\uc774(\uac00) \uac10\uc9c0\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
JMSCMQ1053.inserts = XMSC_INSERT_CHARACTER
JMSCMQ1053.explanation = \ud1a0\ud53d \uc774\ub984 \ub610\ub294 MQRFH2 \ud2b9\uc131\uc758 \uc77c\ubd80\ub85c \uc62c\ubc14\ub974\uc9c0 \uc54a\uc740 UTF-16 \ub300\ub9ac \ubb38\uc790\uac00 \ubc1c\uacac\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
JMSCMQ1053.useraction = UTF-16\uc744 \uc9c0\uc815\ud560 \ub54c \ud1a0\ud53d \uc774\ub984 \ub610\ub294 MQRFH2 \ud2b9\uc131\uc774 \uc62c\ubc14\ub974\uac8c \uc0dd\uc131\ub418\uc5c8\ub294\uc9c0 \ud655\uc778\ud558\uc2ed\uc2dc\uc624.
JMSCMQ1053.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1054 = \uc798\ubabb\ub41c XML \uc774\uc2a4\ucf00\uc774\ud504 \uc21c\uc11c ''{0}''\uc774(\uac00) \uac10\uc9c0\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
JMSCMQ1054.inserts = XMSC_INSERT_STRING
JMSCMQ1054.explanation = \uc218\uc2e0\ud55c \uba54\uc2dc\uc9c0\uc758 MQRFH2 \ud5e4\ub354\uc5d0 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc740 XML \uc774\uc2a4\ucf00\uc774\ud504 \uc21c\uc11c\uac00 \ubc1c\uacac\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
JMSCMQ1054.useraction = \uc62c\ubc14\ub978 XML \uc774\uc2a4\ucf00\uc774\ud504 \uc21c\uc11c\ub9cc \ube44JMS \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc5d0\uc11c \ube4c\ub4dc\ub41c MQRFH2 \ud5e4\ub354\uc5d0 \uc9c0\uc815\ub418\ub294\uc9c0 \ud655\uc778\ud558\uc2ed\uc2dc\uc624.
JMSCMQ1054.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1055 = \uba54\uc2dc\uc9c0\uc758 \ud2b9\uc131 \ub610\ub294 \uc694\uc18c\uc5d0 \uc561\uc138\uc2a4\ud558\ub294 \ub370 \uc0ac\uc6a9\ub41c \uba54\uc18c\ub4dc\uc640 \ud638\ud658\ub418\uc9c0 \uc54a\ub294 \ub370\uc774\ud130 \uc720\ud615 ''{0}''\uc774(\uac00) \uc788\uc2b5\ub2c8\ub2e4.
JMSCMQ1055.inserts = XMSC_INSERT_TYPE
JMSCMQ1055.explanation = JMS \uba54\uc2dc\uc9c0\uc5d0\uc11c \ud2b9\uc131\uc744 \uac80\uc0c9\ud558\ub294 \ub370 \uc0ac\uc6a9\ub41c \uc561\uc138\uc11c \uba54\uc18c\ub4dc\uac00 \uac80\uc0c9 \uc911\uc778 \ud2b9\uc131 \uc720\ud615\uacfc \ud638\ud658\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \uc608\ub97c \ub4e4\uba74 getBooleanProperty() \uba54\uc18c\ub4dc\ub97c \uc0ac\uc6a9\ud558\uc5ec \uc815\uc218 \ud2b9\uc131\uc744 \uac80\uc0c9\ud569\ub2c8\ub2e4.
JMSCMQ1055.useraction = \ud544\uc218 \uc720\ud615\uc758 \ud2b9\uc131 \uac12\uc744 \uac80\uc0c9\ud560 \ub54c JMS \uc2a4\ud399\uc5d0 \uc815\uc758\ub41c \uc561\uc138\uc11c \uba54\uc18c\ub4dc\ub97c \uc0ac\uc6a9\ud558\uc2ed\uc2dc\uc624.
JMSCMQ1055.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1056 = \uc694\uc18c \ub370\uc774\ud130 \uc720\ud615 ''{0}''\uc758 \ud2b9\uc131\uc740 \uc9c0\uc6d0\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
JMSCMQ1056.inserts = XMSC_INSERT_TYPE
JMSCMQ1056.explanation = \uc774 \uc624\ub958\ub294 \uc9c0\uc6d0\ub418\ub294 \uc720\ud615\uc774 \uc544\ub2cc \uc624\ube0c\uc81d\ud2b8\ub97c \uc0ac\uc6a9\ud558\uc5ec JMS \uba54\uc2dc\uc9c0\uc758 \ud2b9\uc131\uc744 \uc124\uc815\ud558\uac70\ub098, \uc62c\ubc14\ub978 \uc720\ud615\uc774 \uc5f0\uad00\ub418\uc9c0 \uc54a\uc740 \ud2b9\uc131\uc744 \ud45c\uc2dc\ud558\ub294 \uc694\uc18c\uac00 \ud3ec\ud568\ub41c MQRFH2\uc758 \uba54\uc2dc\uc9c0\ub97c \uc124\uc815 \ub610\ub294 \uc218\uc2e0\ud558\ub824\uace0 \ud560 \ub54c \ubc1c\uc0dd\ud569\ub2c8\ub2e4.
JMSCMQ1056.useraction = \uba54\uc2dc\uc9c0 \ud2b9\uc131\uc744 \uc124\uc815\ud560 \ub54c \uc62c\ubc14\ub978 JMS \uc624\ube0c\uc81d\ud2b8 \uc720\ud615\uc744 \uc0ac\uc6a9\ud558\ub294\uc9c0 \ud655\uc778\ud558\uc2ed\uc2dc\uc624. \ube44JMS \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc5d0\uc11c \ubcf4\ub0b8 MQRFH2 \ud5e4\ub354\uac00 \ud3ec\ud568\ub41c \uba54\uc2dc\uc9c0\ub97c \uc218\uc2e0\ud560 \ub54c \uc774 \uc608\uc678\uac00 \ubc1c\uc0dd\ud55c \uacbd\uc6b0\uc5d0\ub294 MQRFH2 \ud5e4\ub354\uac00 \uc62c\ubc14\ub974\uac8c \uc0dd\uc131\ub418\uc5c8\ub294\uc9c0 \ud655\uc778\ud558\uc2ed\uc2dc\uc624.
JMSCMQ1056.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1066 = \ud2b9\uc131 \uc774\ub984 ''{0}''\uc740(\ub294) \uc9c0\uc6d0\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
JMSCMQ1066.inserts = XMSC_INSERT_PROPERTY
JMSCMQ1066.explanation =  \uc62c\ubc14\ub974\uc9c0 \uc54a\uc740 \ud2b9\uc131 \uc774\ub984 \ub610\ub294 \uac12 \uc138\ud2b8\uac00 \uc5c6\uc5b4\uc57c \ud558\ub294 \ud2b9\uc131 \uc774\ub984\uc744 \uc0ac\uc6a9\ud558\uc5ec \uba54\uc2dc\uc9c0 \ud2b9\uc131\uc744 \uc124\uc815\ud558\ub824\uace0 \ud588\uc2b5\ub2c8\ub2e4. 
JMSCMQ1066.useraction = \uc9c0\uc815\ud55c \ud2b9\uc131 \uc774\ub984\uc774 JMS \uc2a4\ud399\uc744 \uc900\uc218\ud558\ub294\uc9c0 \ud655\uc778\ud558\uc2ed\uc2dc\uc624. \uc81c\uacf5\ub41c \ud2b9\uc131 \uc774\ub984\uc774 JMS \ud2b9\uc131 \uc774\ub984\uc774\uac70\ub098 \ubca4\ub354 \uace0\uc720\uc758 \ud655\uc7a5\uc778 \uacbd\uc6b0\uc5d0\ub294 \uc774 \ud2b9\uc131\uc744 \uc124\uc815\ud560 \uc218 \uc788\ub294\uc9c0 \ud655\uc778\ud558\uc2ed\uc2dc\uc624. 
JMSCMQ1066.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

