# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE
#

# JMSCMQ0001 doesn't have a .inserts message because it's only used by Reason in
# a WMQException, and never in a JMSException.
JMSCMQ0001 = IBM MQ \u547c\u3073\u51fa\u3057\u306f\u5b8c\u4e86\u30b3\u30fc\u30c9 ''{0}'' (''{1}'')\u3001\u7406\u7531 ''{2}'' (''{3}'') \u3067\u5931\u6557\u3057\u307e\u3057\u305f\u3002

JMSCMQ0002 = \u30e1\u30bd\u30c3\u30c9 ''{0}'' \u306f\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSCMQ0002.explanation = IBM MQ \u547c\u3073\u51fa\u3057\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSCMQ0002.useraction = \u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCMQ0002.inserts = XMSC_INSERT_METHOD

JMSCMQ0003 = \u5b9b\u5148 ''{0}'' \u304c\u4e0d\u660e\u307e\u305f\u306f\u7121\u52b9\u3067\u3059\u3002
JMSCMQ0003.explanation = \u30ad\u30e5\u30fc\u307e\u305f\u306f\u30c8\u30d4\u30c3\u30af\u304c\u4f7f\u7528\u4e0d\u53ef\u306b\u306a\u3063\u305f\u304b\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u30ad\u30e5\u30fc\u307e\u305f\u306f\u30c8\u30d4\u30c3\u30af\u7528\u306b\u4e0d\u6b63\u306a\u63a5\u7d9a\u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u304b\u3001\u307e\u305f\u306f\u63d0\u4f9b\u3055\u308c\u305f\u5b9b\u5148\u304c\u3053\u306e\u30e1\u30bd\u30c3\u30c9\u306b\u5bfe\u3057\u3066\u6b63\u3057\u3044\u30bf\u30a4\u30d7\u306e\u3082\u306e\u3067\u306f\u306a\u3044\u304b\u306e\u3044\u305a\u308c\u304b\u306e\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
JMSCMQ0003.useraction = IBM MQ \u304c\u307e\u3060\u5b9f\u884c\u3057\u3066\u3044\u308b\u3053\u3068\u3001\u304a\u3088\u3073\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u4f7f\u7528\u53ef\u80fd\u306a\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u30ad\u30e5\u30fc\u307e\u305f\u306f\u30c8\u30d4\u30c3\u30af\u306b\u5bfe\u3057\u3066\u6b63\u3057\u3044\u63a5\u7d9a\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCMQ0003.inserts = XMSC_DESTINATION_NAME
JMSCMQ0003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCMQ0004 = \u5024 ''{0}'' \u306f\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc ''{1}'' \u306b\u306f\u7121\u52b9\u3067\u3057\u305f\u3002
JMSCMQ0004.explanation = \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc ''{1}'' \u306e\u5024\u306f\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u6709\u52b9\u306a\u5024\u306e\u3044\u305a\u308c\u304b 1 \u3064\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
JMSCMQ0004.useraction = \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u6709\u52b9\u306a\u5024\u306b\u8a2d\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCMQ0004.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_PROPERTY

JMSCMQ0005 = \u5b9b\u5148\u540d ''{0}'' \u306f\u7121\u52b9\u3067\u3057\u305f\u3002
JMSCMQ0005.explanation = \u6307\u5b9a\u3055\u308c\u305f\u5b9b\u5148\u540d\u306f\u3001\u516c\u958b\u3055\u308c\u305f\u5b9b\u5148\u69cb\u6587\u306b\u6e96\u62e0\u3057\u3066\u3044\u307e\u305b\u3093\u3002
JMSCMQ0005.useraction = \u6307\u5b9a\u3057\u305f\u5b9b\u5148\u540d\u3092\u8a02\u6b63\u3057\u3066\u3001\u518d\u8a66\u884c\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCMQ0005.inserts = XMSC_DESTINATION_NAME
JMSCMQ0005.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCMQ0006 = \u5b9b\u5148\u306f\u4e00\u6642\u7684\u306a\u5b9b\u5148\u3067\u306f\u306a\u3044\u305f\u3081\u306b\u524a\u9664\u3067\u304d\u307e\u305b\u3093\u3002
JMSCMQ0006.explanation = \u4e00\u6642\u7684\u306a\u5b9b\u5148\u3060\u3051\u304c\u524a\u9664\u3067\u304d\u307e\u3059\u3002

JMSCMQ0007 = \u5024\u304c ''{1}'' \u306e\u4e0d\u660e\u306a\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc ''{0}'' \u304c\u5b9b\u5148\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u30fb\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306b\u8a2d\u5b9a\u3055\u308c\u307e\u3057\u305f\u3002
JMSCMQ0007.explanation = \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc ''{0}'' \u306f\u8a8d\u8b58\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u3053\u308c\u306f\u30ab\u30b9\u30bf\u30e0\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3067\u3042\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
JMSCMQ0007.useraction = \u3053\u308c\u304c\u30ab\u30b9\u30bf\u30e0\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u7528\u3067\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCMQ0007.inserts = XMSC_INSERT_KEY, XMSC_INSERT_VALUE

JMSCMQ0008 = IBM MQ \u30af\u30e9\u30b9 (JMS \u7528) \u304c\u30e1\u30c3\u30bb\u30fc\u30b8\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u30c7\u30fc\u30bf\u30fb\u30bf\u30a4\u30d7\u3092\u4f7f\u7528\u3057\u3088\u3046\u3068\u3057\u305f\u304b\u3001\u307e\u305f\u306f\u9593\u9055\u3063\u305f\u30bf\u30a4\u30d7\u306e\u30c7\u30fc\u30bf\u3092\u8aad\u307f\u53d6\u308d\u3046\u3068\u3057\u307e\u3057\u305f\u3002
JMSCMQ0008.explanation = \u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u30fb\u30bf\u30a4\u30d7\u306e\u8aad\u307f\u53d6\u308a\u306b\u4f7f\u7528\u3055\u308c\u305f\u30c7\u30fc\u30bf\u30fb\u30bf\u30a4\u30d7\u304c\u9593\u9055\u3063\u3066\u3044\u307e\u3059\u3002
JMSCMQ0008.useraction = \u53d7\u3051\u53d6\u308b\u30e1\u30c3\u30bb\u30fc\u30b8\u304a\u3088\u3073\u8aad\u307f\u53d6\u308b\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u30bf\u30a4\u30d7\u304c\u9069\u5207\u3067\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCMQ0008.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ0009 = \u30b9\u30c8\u30ea\u30fc\u30e0\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u307e\u305f\u306f\u30d0\u30a4\u30c8\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u8aad\u307f\u53d6\u308a\u6642\u306b\u3001\u30b9\u30c8\u30ea\u30fc\u30e0\u306e\u7d42\u308f\u308a\u306b\u4e88\u671f\u305b\u305a\u306b\u9054\u3057\u307e\u3057\u305f\u3002
JMSCMQ0009.explanation = \u8aad\u307f\u53d6\u3089\u308c\u308b\u30d0\u30a4\u30c8\u30fb\u30b9\u30c8\u30ea\u30fc\u30e0\u306f\u63d0\u4f9b\u3055\u308c\u305f\u30d0\u30c3\u30d5\u30a1\u30fc\u3088\u308a\u77ed\u3044\u3082\u306e\u306b\u306a\u3063\u3066\u3044\u307e\u3059\u3002 \u3053\u306e\u539f\u56e0\u3068\u3057\u3066\u3001\u7834\u640d\u3057\u305f\u30b9\u30c8\u30ea\u30fc\u30e0\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u307e\u305f\u306f\u30d0\u30a4\u30c8\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u53d7\u3051\u53d6\u3063\u305f\u3053\u3068\u304c\u8003\u3048\u3089\u308c\u307e\u3059\u3002
JMSCMQ0009.useraction = \u63d0\u4f9b\u3055\u308c\u308b\u30d0\u30c3\u30d5\u30a1\u30fc\u306e\u9577\u3055\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u8a73\u7d30\u60c5\u5831\u304a\u3088\u3073\u5831\u544a\u3055\u308c\u3066\u3044\u308b\u305d\u306e\u4ed6\u306e\u969c\u5bb3\u306b\u3064\u3044\u3066\u306f\u3001\u30b7\u30b9\u30c6\u30e0\u30fb\u30a4\u30d9\u30f3\u30c8\u30fb\u30ed\u30b0\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCMQ0009.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCMQ0017 = \u30b9\u30c8\u30ea\u30fc\u30e0\u306e\u7d42\u4e86\u3002
JMSCMQ0017.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCMQ0018 = \u53d7\u4fe1\u3057\u305f\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u6b63\u5e38\u306b\u89e3\u6790\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
JMSCMQ0018.explanation = messageID \u304c ''{0}'' \u3067\u3001correlationID \u304c ''{1}'' \u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u6b63\u5e38\u306b\u89e3\u6790\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u6b63\u5e38\u306a\u30c7\u30fc\u30bf\u8aad\u307f\u53d6\u308a\u306f\u3001\u30d0\u30c3\u30d5\u30a1\u30fc ''{3}'' \u5185\u306e\u30dd\u30b8\u30b7\u30e7\u30f3 ''{2}'' \u304c\u6700\u5f8c\u3067\u3059\u3002  
JMSCMQ0018.useraction = \u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30c7\u30fc\u30bf\u3092\u8abf\u67fb\u3057\u3001MQJMS \u30e1\u30c3\u30bb\u30fc\u30b8\u3068\u3057\u3066\u89e3\u6790\u3067\u304d\u308b\u6b63\u3057\u3044\u5f62\u5f0f\u304b\u3092\u78ba\u8a8d\u3057\u307e\u3059\u3002
JMSCMQ0018.inserts = XMSC_MESSAGE_ID\u3001XMSC_CORRELATION_ID\u3001XMSC_MESSAGE_BUFFER_POSITION\u3001XMSC_MESSAGE_BUFFER

JMSCMQ1000 = JMS \u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u4f5c\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
JMSCMQ1000.explanation = messageID \u304c ''{0}'' \u3067 correlationID \u304c ''{1}'' \u306e\u57fa\u672c\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u4f5c\u6210\u3059\u308b\u969b\u306b\u3001\u4e0d\u6b63\u306a\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30bf\u30a4\u30d7\u307e\u305f\u306f\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u6307\u5b9a\u3055\u308c\u307e\u3057\u305f\u3002
JMSCMQ1000.useraction = \u8a73\u3057\u304f\u306f\u3001\u30ea\u30f3\u30af\u3055\u308c\u305f IBM MQ \u4f8b\u5916\u306e\u7406\u7531\u304a\u3088\u3073\u5b8c\u4e86\u30b3\u30fc\u30c9\u3092\u78ba\u8a8d\u3057\u3001\u8a73\u3057\u3044\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u5185\u5bb9\u306b\u3064\u3044\u3066\u306f\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCMQ1000.inserts = XMSC_MESSAGE_ID\u3001XMSC_CORRELATION_ID

JMSCMQ1006 = ''{0}'':''{1}'' \u306e\u5024\u304c\u7121\u52b9\u3067\u3059\u3002
JMSCMQ1006.explanation = \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc ''{0}'' \u306e\u5024 ''{1}'' \u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002
JMSCMQ1006.useraction = \u30ea\u30f3\u30af\u3055\u308c\u305f IBM MQ \u4f8b\u5916\u306e\u7406\u7531\u304a\u3088\u3073\u5b8c\u4e86\u30b3\u30fc\u30c9\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCMQ1006.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_VALUE

JMSCMQ1044 = \u30b9\u30c8\u30ea\u30f3\u30b0\u306f\u6709\u52b9\u306a 16 \u9032\u6570\u3067\u306f\u3042\u308a\u307e\u305b\u3093 - ''{0}''\u3002
JMSCMQ1044.inserts = XMSC_INSERT_HEX_STRING
JMSCMQ1044.explanation = \u6307\u5b9a\u3057\u3088\u3046\u3068\u3057\u305f\u30b0\u30eb\u30fc\u30d7 ID \u307e\u305f\u306f\u76f8\u95a2 ID \u304c\u3001\u5148\u982d\u306f\u63a5\u982d\u90e8 ID \u3067\u3042\u308b\u306e\u306b\u3001\u305d\u306e\u5f8c\u306b\u6b63\u3057\u3044\u5f62\u5f0f\u306e 16 \u9032\u5024\u304c\u7d9a\u3044\u3066\u3044\u306a\u3044\u304b\u3001\u53d7\u3051\u53d6\u308d\u3046\u3068\u3057\u305f\u30e1\u30c3\u30bb\u30fc\u30b8\u306b\u542b\u307e\u308c\u3066\u3044\u308b\u30bf\u30a4\u30d7 bin.hex \u306e MQRFH2 \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u5024\u304c\u3001\u6b63\u3057\u3044\u5f62\u5f0f\u306e 16 \u9032\u6570\u3067\u306f\u306a\u3044\u304b\u306e\u3044\u305a\u308c\u304b\u3067\u3059\u3002
JMSCMQ1044.useraction = \u30b0\u30eb\u30fc\u30d7 ID \u307e\u305f\u306f\u76f8\u95a2 ID \u306e\u5024\u3092\u8a2d\u5b9a\u3059\u308b\u3068\u304d\u306b\u3001\u5fc5\u305a\u6709\u52b9\u306a 16 \u9032\u5024\u304c ID \u63a5\u982d\u90e8\u306e\u5f8c\u306b\u7d9a\u304f\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u975e JMS \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u3088\u308a\u751f\u6210\u3055\u308c\u305f\u3059\u3079\u3066\u306e MQRFH2 \u30d8\u30c3\u30c0\u30fc\u304c\u6b63\u3057\u3044\u5f62\u5f0f\u306b\u306a\u308b\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSCMQ1046 = \u6587\u5b57\u30bb\u30c3\u30c8 ''{0}'' \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSCMQ1046.inserts = CCSID
JMSCMQ1046.explanation = JVM \u306b\u3088\u3063\u3066\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u306a\u3044\u6587\u5b57\u30bb\u30c3\u30c8\u3092\u4f7f\u7528\u3057\u3066\u672c\u6587\u304c\u30a8\u30f3\u30b3\u30fc\u30c9\u3055\u308c\u3066\u3044\u308b\u30de\u30c3\u30d7\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u3001\u30b9\u30c8\u30ea\u30fc\u30e0\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u3001\u307e\u305f\u306f\u30c6\u30ad\u30b9\u30c8\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u9001\u4fe1\u307e\u305f\u306f\u53d7\u4fe1\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002 \u30c6\u30ad\u30b9\u30c8\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u5834\u5408\u3001\u3053\u306e\u4f8b\u5916\u306f\u53d7\u4fe1\u6642\u3067\u306f\u306a\u304f\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u672c\u6587\u304c\u6700\u521d\u306b\u7167\u4f1a\u3055\u308c\u305f\u3068\u304d\u306b\u30b9\u30ed\u30fc\u3055\u308c\u308b\u3053\u3068\u304c\u3042\u308a\u307e\u3059\u3002
JMSCMQ1046.useraction = \u53d7\u4fe1\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3067\u4f7f\u7528\u53ef\u80fd\u3067\u3042\u308b\u3053\u3068\u304c\u5206\u304b\u3063\u3066\u3044\u308b\u6587\u5b57\u30bb\u30c3\u30c8\u3060\u3051\u3092\u4f7f\u7528\u3057\u3066\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u30a8\u30f3\u30b3\u30fc\u30c9\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSCMQ1047 = \u30de\u30c3\u30d7\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u5f62\u5f0f\u304c\u4e0d\u6b63\u3067\u3059\u3002
JMSCMQ1047.explanation = \u30de\u30c3\u30d7\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u53d7\u3051\u53d6\u308a\u307e\u3057\u305f\u304c\u3001\u305d\u306e MQRFH2 \u30d8\u30c3\u30c0\u30fc\u60c5\u5831\u306f\u5f62\u5f0f\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002
JMSCMQ1047.useraction = \u975e JMS \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u3001\u30de\u30c3\u30d7\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u306b\u7d44\u307f\u8fbc\u3080 MQRFH2 \u30d8\u30c3\u30c0\u30fc\u60c5\u5831\u3092\u6b63\u3057\u3044\u5f62\u5f0f\u3067\u4f5c\u6210\u3057\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCMQ1047.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1048 = \u30b9\u30c8\u30ea\u30fc\u30e0\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u5f62\u5f0f\u304c\u4e0d\u6b63\u3067\u3059\u3002
JMSCMQ1048.explanation = \u30b9\u30c8\u30ea\u30fc\u30e0\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u53d7\u3051\u53d6\u308a\u307e\u3057\u305f\u304c\u3001\u6b63\u3057\u3044\u5f62\u5f0f\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
JMSCMQ1048.useraction = \u3059\u3079\u3066\u306e\u975e JMS \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u5fc5\u305a\u3001\u6b63\u3057\u3044\u5f62\u5f0f\u306e\u30b9\u30c8\u30ea\u30fc\u30e0\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u4f5c\u6210\u3059\u308b\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCMQ1048.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1049 = \u6587\u5b57\u30bb\u30c3\u30c8 ''{0}'' \u306f\u30b9\u30c8\u30ea\u30f3\u30b0 ''{1}'' \u306e\u4e00\u90e8\u307e\u305f\u306f\u5168\u90e8\u3092\u5909\u63db\u3067\u304d\u307e\u305b\u3093
JMSCMQ1049.inserts = CCSID, XMSC_INSERT_VALUE
JMSCMQ1049.explanation = \u30b9\u30c8\u30ea\u30f3\u30b0\u306e\u5185\u5bb9\u306e\u5909\u63db\u306b\u5bfe\u5fdc\u3057\u3066\u3044\u306a\u3044\u6587\u5b57\u30bb\u30c3\u30c8\u3092\u4f7f\u7528\u3057\u3066\u3001\u30b9\u30c8\u30ea\u30f3\u30b0\u30fb\u30c7\u30fc\u30bf\u3092\u9001\u4fe1\u307e\u305f\u306f\u53d7\u4fe1\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002
JMSCMQ1049.useraction = \u4f1d\u9001\u3055\u308c\u308b\u30b9\u30c8\u30ea\u30f3\u30b0\u30fb\u30c7\u30fc\u30bf\u306b\u9069\u5207\u3067\u3042\u308b\u3053\u3068\u304c\u5206\u304b\u3063\u3066\u3044\u308b\u6587\u5b57\u30bb\u30c3\u30c8\u3060\u3051\u3092\u4f7f\u7528\u3057\u3066\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u30a8\u30f3\u30b3\u30fc\u30c9\u3057\u3066\u304f\u3060\u3055\u3044\u3002

JMSCMQ1050 = MQRFH2 \u30d8\u30c3\u30c0\u30fc\u306e\u5f62\u5f0f\u304c\u4e0d\u6b63\u3067\u3059\u3002
JMSCMQ1050.explanation = \u6b63\u3057\u304f\u306a\u3044\u5f62\u5f0f\u306e MQRFH2 \u30d8\u30c3\u30c0\u30fc\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u53d7\u3051\u53d6\u308a\u307e\u3057\u305f\u3002
JMSCMQ1050.useraction = MQRFH2 \u30d8\u30c3\u30c0\u30fc\u3092\u542b\u3080\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u4f5c\u6210\u3059\u308b\u975e JMS \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u3001\u6b63\u3057\u3044\u5f62\u5f0f\u306e MQRFH2 \u30d8\u30c3\u30c0\u30fc\u3092\u4f5c\u6210\u3059\u308b\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCMQ1050.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1053 = \u6b63\u3057\u304f\u306a\u3044 UTF-16 \u30b5\u30ed\u30b2\u30fc\u30c8\u6587\u5b57 ''{0}'' \u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
JMSCMQ1053.inserts = XMSC_INSERT_CHARACTER
JMSCMQ1053.explanation = \u30c8\u30d4\u30c3\u30af\u540d\u307e\u305f\u306f MQRFH2 \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u4e00\u90e8\u3068\u3057\u3066\u7121\u52b9\u306a UTF-16 \u30b5\u30ed\u30b2\u30fc\u30c8\u6587\u5b57\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
JMSCMQ1053.useraction = UTF-16 \u3092\u6307\u5b9a\u3059\u308b\u3068\u304d\u306b\u3001\u30c8\u30d4\u30c3\u30af\u540d\u307e\u305f\u306f MQRFH2 \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u5f62\u5f0f\u304c\u9069\u5207\u3067\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCMQ1053.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1054 = \u6b63\u3057\u304f\u306a\u3044 XML \u30a8\u30b9\u30b1\u30fc\u30d7\u30fb\u30b7\u30fc\u30b1\u30f3\u30b9 ''{0}'' \u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
JMSCMQ1054.inserts = XMSC_INSERT_STRING
JMSCMQ1054.explanation = \u53d7\u3051\u53d6\u3063\u305f\u30e1\u30c3\u30bb\u30fc\u30b8\u306e MQRFH2 \u30d8\u30c3\u30c0\u30fc\u5185\u3067\u7121\u52b9\u306a XML \u30a8\u30b9\u30b1\u30fc\u30d7\u30fb\u30b7\u30fc\u30b1\u30f3\u30b9\u3092\u691c\u51fa\u3057\u307e\u3057\u305f\u3002
JMSCMQ1054.useraction = \u6709\u52b9\u306a XML \u30a8\u30b9\u30b1\u30fc\u30d7\u30fb\u30b7\u30fc\u30b1\u30f3\u30b9\u3060\u3051\u304c\u975e JMS \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u3088\u308a\u4f5c\u6210\u3055\u308c\u305f MQRFH2 \u30d8\u30c3\u30c0\u30fc\u306b\u7f6e\u304b\u308c\u308b\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCMQ1054.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1055 = \u30e1\u30c3\u30bb\u30fc\u30b8\u5185\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u307e\u305f\u306f\u30a8\u30ec\u30e1\u30f3\u30c8\u306b\u3001\u305d\u308c\u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u30e1\u30bd\u30c3\u30c9\u3068\u975e\u4e92\u63db\u306e\u30c7\u30fc\u30bf\u30fb\u30bf\u30a4\u30d7 ''{0}'' \u304c\u3042\u308a\u307e\u3059\u3002
JMSCMQ1055.inserts = XMSC_INSERT_TYPE
JMSCMQ1055.explanation = JMS \u30e1\u30c3\u30bb\u30fc\u30b8\u304b\u3089\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u53d6\u5f97\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b accessor \u30e1\u30bd\u30c3\u30c9\u306f\u3001\u53d6\u5f97\u3055\u308c\u308b\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u30bf\u30a4\u30d7\u3068\u306f\u975e\u4e92\u63db\u3067\u3059\u3002 \u4f8b\u3048\u3070\u3001getBooleanProperty() \u30e1\u30bd\u30c3\u30c9\u3092\u4f7f\u7528\u3057\u3066\u6574\u6570\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u53d6\u308a\u51fa\u305d\u3046\u3068\u3057\u3066\u3044\u307e\u3059\u3002
JMSCMQ1055.useraction = \u5fc5\u9808\u30bf\u30a4\u30d7\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u5024\u3092\u53d6\u5f97\u3067\u304d\u308b\u3082\u306e\u3068\u3057\u3066 JMS \u306e\u4ed5\u69d8\u3067\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b accessor \u30e1\u30bd\u30c3\u30c9\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCMQ1055.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1056 = \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u307e\u305f\u306f\u30a8\u30ec\u30e1\u30f3\u30c8\u30fb\u30c7\u30fc\u30bf\u30fb\u30bf\u30a4\u30d7 ''{0}'' \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
JMSCMQ1056.inserts = XMSC_INSERT_TYPE
JMSCMQ1056.explanation = \u3053\u306e\u30a8\u30e9\u30fc\u306e\u539f\u56e0\u306f\u3001\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u30bf\u30a4\u30d7\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u4f7f\u7528\u3059\u308b JMS \u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u8a2d\u5b9a\u3057\u3088\u3046\u3068\u3057\u305f\u305f\u3081\u3001\u307e\u305f\u306f\u95a2\u9023\u4ed8\u3051\u3089\u308c\u305f\u6709\u52b9\u306a\u30bf\u30a4\u30d7\u3092\u6301\u305f\u306a\u3044\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u8868\u3059\u30a8\u30ec\u30e1\u30f3\u30c8\u304c MQRFH2 \u306b\u542b\u307e\u308c\u308b\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u8a2d\u5b9a\u3057\u3088\u3046\u3068\u3057\u305f\u304b\u53d7\u3051\u53d6\u308d\u3046\u3068\u3057\u305f\u305f\u3081\u3001\u306e\u3044\u305a\u308c\u304b\u3067\u3059\u3002
JMSCMQ1056.useraction = \u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u8a2d\u5b9a\u6642\u306b\u306f\u3001\u6709\u52b9\u306a JMS \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30fb\u30bf\u30a4\u30d7\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u975e JMS \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u3088\u3063\u3066\u9001\u3089\u308c\u308b MQRFH2 \u30d8\u30c3\u30c0\u30fc\u3092\u542b\u3080\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u53d7\u4fe1\u4e2d\u306b\u3053\u306e\u4f8b\u5916\u304c\u767a\u751f\u3057\u305f\u5834\u5408\u3001\u305d\u306e MQRFH2 \u30d8\u30c3\u30c0\u30fc\u306e\u5f62\u5f0f\u304c\u9069\u5207\u3067\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
JMSCMQ1056.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCMQ1066 = \u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u540d ''{0}''\u3002
JMSCMQ1066.inserts = XMSC_INSERT_PROPERTY
JMSCMQ1066.explanation =  \u7121\u52b9\u306a\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u540d\u3001\u307e\u305f\u306f\u5024\u3092\u8a2d\u5b9a\u3067\u304d\u306a\u3044\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u540d\u524d\u3092\u4f7f\u7528\u3057\u3066\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u8a2d\u5b9a\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002 
JMSCMQ1066.useraction = \u6307\u5b9a\u3055\u308c\u305f\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u540d\u304c JMS \u306e\u4ed5\u69d8\u306b\u6e96\u62e0\u3057\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u6307\u5b9a\u3055\u308c\u305f\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u540d\u304c JMS \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u3082\u306e\u3067\u3042\u308b\u304b\u307e\u305f\u306f\u30d9\u30f3\u30c0\u30fc\u56fa\u6709\u306e\u62e1\u5f35\u3067\u3042\u308b\u5834\u5408\u306f\u3001\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u8a2d\u5b9a\u53ef\u80fd\u3067\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002 
JMSCMQ1066.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

