# %Z% %W% %I% %E% %U%
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
#

# JMSWMQ0002 is a WMQException message so no .inserts needed
JMSWMQ0002 = Wyniki dodatkowej procedury diagnostycznej przeprowadzonej przez narz\u0119dzie MQSTAT: Kod zako\u0144czenia: {0}. Przyczyna: {1}. Nazwa obiektu: {2}. Rozpoznana nazwa obiektu: {3}. Typ obiektu: {4}. Nazwa mened\u017cera kolejek: {5}. Rozpoznana nazwa mened\u017cera kolejek: {6}. Liczba niepomy\u015blnych operacji umieszczania (put): {7}. Liczba pomy\u015blnych operacji umieszczania (put): {8}. Liczba ostrze\u017ce\u0144 dotycz\u0105cych operacji umieszczania (put): {9}.

JMSWMQ0003 = Poziom komend {0} mened\u017cera kolejek nie by\u0142 zgodny z \u017c\u0105dan\u0105 wersj\u0105 dostawcy {1}.
JMSWMQ0003.inserts = XMSC_INSERT_COMMAND_LEVEL, XMSC_WMQ_PROVIDER_VERSION

JMSWMQ0006 = Produkt IBM MQ classes for JMS podejmuje \
pr\u00f3b\u0119 u\u017cycia typu danych, kt\u00f3ry nie jest obs\u0142ugiwany przez komunikat, lub pr\u00f3b\u0119 \
odczytania danych niew\u0142a\u015bciwego typu.
JMSWMQ0006.explanation = U\u017cyto niew\u0142a\u015bciwych typ\u00f3w danych w celu odczytania typ\u00f3w w\u0142a\u015bciwo\u015bci komunikatu.
JMSWMQ0006.useraction = Sprawd\u017a, czy odebrane komunikaty i w\u0142a\u015bciwo\u015bci do odczytania maj\u0105 oczekiwany typ.
JMSWMQ0006.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSWMQ0007 = Produkt IBM MQ classes for JMS podejmuje \
pr\u00f3b\u0119 u\u017cycia typu danych, kt\u00f3ry nie jest obs\u0142ugiwany przez komunikat, lub pr\u00f3b\u0119 \
odczytania danych niew\u0142a\u015bciwego typu.
JMSWMQ0007.explanation = U\u017cyto niew\u0142a\u015bciwych typ\u00f3w danych w celu odczytania typ\u00f3w w\u0142a\u015bciwo\u015bci komunikatu.
JMSWMQ0007.useraction = Sprawd\u017a, czy odebrane komunikaty i w\u0142a\u015bciwo\u015bci do odczytania maj\u0105 oczekiwany typ.
JMSWMQ0007.exception = com.ibm.msg.client.jms.DetailedMessageNotReadableException

JMSWMQ0008 = Produkt IBM MQ classes for JMS podejmuje \
pr\u00f3b\u0119 u\u017cycia typu danych, kt\u00f3ry nie jest obs\u0142ugiwany przez komunikat, lub pr\u00f3b\u0119 \
zapisania danych niew\u0142a\u015bciwego typu.
JMSWMQ0008.explanation = U\u017cyto niew\u0142a\u015bciwych typ\u00f3w danych w celu zapisania typ\u00f3w w\u0142a\u015bciwo\u015bci komunikatu.
JMSWMQ0008.useraction = Sprawd\u017a, czy odebrane komunikaty i w\u0142a\u015bciwo\u015bci do odczytania maj\u0105 oczekiwany typ.
JMSWMQ0008.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSWMQ0009 = Produkt IBM MQ classes for JMS nie mo\u017ce \
przydzieli\u0107 zasob\u00f3w wymaganych dla metody.
JMSWMQ0009.explanation = Zasoby komputera mog\u0105 by\u0107 przeci\u0105\u017cone. Dodatkowe informacje mo\u017ce zawiera\u0107 do\u0142\u0105czony wyj\u0105tek.
JMSWMQ0009.useraction = Sprawd\u017a zasoby i obci\u0105\u017cenie systemu.
JMSWMQ0009.exception = com.ibm.msg.client.jms.DetailedResourceAllocationException

JMSWMQ0010 = Pobieranie poziomu komend mened\u017cera kolejek {0} nie powiod\u0142o si\u0119.
JMSWMQ0010.useraction = Wi\u0119cej informacji na ten temat zawiera do\u0142\u0105czony wyj\u0105tek.
JMSWMQ0010.inserts = XMSC_INSERT_QUEUE_MANAGER

JMSWMQ0011 = Nie mo\u017cna zainicjowa\u0107 interfejsu Java(tm) dla interfejsu MQI {0}.
JMSWMQ0011.useraction = Wi\u0119cej informacji na ten temat zawiera do\u0142\u0105czony wyj\u0105tek.
JMSWMQ0011.inserts = XMSC_INSERT_EXCEPTION

JMSWMQ0013 = Wpisywanie zadania do kolejki nie powiod\u0142o si\u0119.
JMSWMQ0013.useraction = Wi\u0119cej informacji na ten temat zawiera do\u0142\u0105czony wyj\u0105tek.

JMSWMQ0014 = Nie mo\u017cna przekszta\u0142ci\u0107 warto\u015bci NULL w warto\u015b\u0107 typu byte, int, short lub long.
JMSWMQ0014.exception = java.lang.NumberFormatException

JMSWMQ0015 = Nie mo\u017cna przekszta\u0142ci\u0107 warto\u015bci NULL w znak, warto\u015b\u0107 typu double lub warto\u015b\u0107 typu float.
JMSWMQ0015.exception = java.lang.NullPointerException

JMSWMQ0016 = Pr\u00f3ba przekszta\u0142cenia obiektu do postaci szeregowej nie powiod\u0142a si\u0119.
JMSWMQ0016.useraction = Wi\u0119cej informacji na ten temat zawiera opis przyczyny.
JMSWMQ0016.exception = java.lang.IOException

JMSWMQ0017 = Koniec strumienia.
JMSWMQ0017.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSWMQ0018 = Nie mo\u017cna nawi\u0105za\u0107 po\u0142\u0105czenia z mened\u017cerem kolejek {0}, u\u017cywaj\u0105c trybu po\u0142\u0105czenia {1} i nazwy hosta {2}.
JMSWMQ0018.useraction = Sprawd\u017a, czy jest uruchomiony mened\u017cer kolejek oraz (w przypadku pracy w trybie klienta) obiekt nas\u0142uchiwania. Wi\u0119cej informacji na ten temat zawiera do\u0142\u0105czony wyj\u0105tek.
JMSWMQ0018.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_HOST_NAME

JMSWMQ0019 = Nie mo\u017cna przerwa\u0107 po\u0142\u0105czenia z mened\u017cerem kolejek {0}, u\u017cywaj\u0105c trybu po\u0142\u0105czenia {1} i nazwy hosta {2}.
JMSWMQ0019.useraction = Wi\u0119cej informacji na ten temat zawiera do\u0142\u0105czony wyj\u0105tek.
JMSWMQ0019.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_HOST_NAME

JMSWMQ0020 = Rejestrowanie wywo\u0142ania zwrotnego za pomoc\u0105 obiektu MQCB dla miejsca docelowego {0} nie powiod\u0142o si\u0119.
JMSWMQ0020.useraction = Wi\u0119cej informacji na ten temat zawiera do\u0142\u0105czony wyj\u0105tek.
JMSWMQ0020.inserts = XMSC_DESTINATION_NAME

JMSWMQ0021 = Wyrejestrowywanie wywo\u0142ania zwrotnego za pomoc\u0105 obiektu MQCB dla miejsca docelowego {0} nie powiod\u0142o si\u0119.
JMSWMQ0021.useraction = Wi\u0119cej informacji na ten temat zawiera do\u0142\u0105czony wyj\u0105tek.
JMSWMQ0021.inserts = XMSC_DESTINATION_NAME

JMSWMQ0022 = Rozpocz\u0119cie odbierania komunikat\u00f3w za pomoc\u0105 obiektu MQCTL dla miejsca docelowego {0} nie powiod\u0142o si\u0119.
JMSWMQ0022.useraction = Wi\u0119cej informacji na ten temat zawiera do\u0142\u0105czony wyj\u0105tek.
JMSWMQ0022.inserts = XMSC_DESTINATION_NAME

JMSWMQ0023 = Zawieszenie odbierania komunikat\u00f3w za pomoc\u0105 obiektu MQCTL dla miejsca docelowego {0} nie powiod\u0142o si\u0119.
JMSWMQ0023.useraction = Wi\u0119cej informacji na ten temat zawiera do\u0142\u0105czony wyj\u0105tek.
JMSWMQ0023.inserts = XMSC_DESTINATION_NAME

JMSWMQ0024 = Wznowienie odbierania komunikat\u00f3w za pomoc\u0105 obiektu MQCTL dla miejsca docelowego {0} nie powiod\u0142o si\u0119.
JMSWMQ0024.useraction = Wi\u0119cej informacji na ten temat zawiera do\u0142\u0105czony wyj\u0105tek.
JMSWMQ0024.inserts = XMSC_DESTINATION_NAME

JMSWMQ0025 = Anulowanie subskrypcji tematu {0} za pomoc\u0105 obiektu MQCLOSE nie powiod\u0142o si\u0119.
JMSWMQ0025.explanation = Podczas usuwania subskrypcji m\u00f3g\u0142 wyst\u0105pi\u0107 problem, poniewa\u017c jest ona u\u017cywana przez odbiorc\u0119 komunikat\u00f3w.
JMSWMQ0025.useraction = Przed anulowaniem subskrypcji sprawd\u017a, czy zamkni\u0119to wszystkich odbiorc\u00f3w komunikat\u00f3w u\u017cywaj\u0105cych tej subskrypcji. Wi\u0119cej informacji na ten temat zawiera do\u0142\u0105czony wyj\u0105tek.
JMSWMQ0025.inserts = XMSC_DESTINATION_NAME

JMSWMQ0026 = Subskrybowanie tematu {0} z selektorem {1} za pomoc\u0105 obiektu MQSUB nie powiod\u0142o si\u0119.
JMSWMQ0026.explanation = Podczas tworzenia subskrypcji m\u00f3g\u0142 wyst\u0105pi\u0107 problem, poniewa\u017c jest ona u\u017cywana przez innego odbiorc\u0119 komunikat\u00f3w.
JMSWMQ0026.useraction = Przed podj\u0119ciem pr\u00f3by utworzenia nowej subskrypcji o tej samej nazwie sprawd\u017a, czy zamkni\u0119to wszystkich odbiorc\u00f3w komunikat\u00f3w u\u017cywaj\u0105cych tej subskrypcji. Wi\u0119cej informacji na ten temat zawiera do\u0142\u0105czony wyj\u0105tek.
JMSWMQ0026.inserts = XMSC_DESTINATION_NAME, XMSC_SELECTOR_STRING

# The insert for this message is CommonConstants.WMQ_ENCODING = "encoding".
# If WMQ_ENCODING is changed then this value here must also be changed.
JMSWMQ0027 = Komunikat zawiera b\u0142\u0119dne kodowanie: {0}.
JMSWMQ0027.explanation = Odebrano komunikat o niepoprawnie sformatowanym nag\u0142\u00f3wku. Kodowanie musi by\u0107 normalne lub odwrotne.
JMSWMQ0027.useraction = Sprawd\u017a, czy wszystkie aplikacje inne ni\u017c JMS, kt\u00f3re s\u0142u\u017c\u0105 do tworzenia komunikat\u00f3w, tworz\u0105 nag\u0142\u00f3wki w poprawnym formacie.
JMSWMQ0027.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSWMQ0027.inserts = encoding

JMSWMQ0028 = Wyst\u0105pi\u0142o niepowodzenie lub ostrze\u017cenie w przypadku przynajmniej jednego komunikatu umieszczanego asynchronicznie.
JMSWMQ0028.explanation = Je\u015bli komunikat jest umieszczany asynchronicznie, problemy nie s\u0105 zg\u0142aszane jako wyj\u0105tki zg\u0142oszone przez metod\u0119 send(). Zamiast tego s\u0105 one przekazywane do obiektu nas\u0142uchiwania wyj\u0105tk\u00f3w, je\u015bli jest zdefiniowany. Obiekt nas\u0142uchiwania wyj\u0105tk\u00f3w jest sterowany w punkcie synchronizacji w przypadku sesji z transakcj\u0105 lub przez ka\u017cdorazow\u0105 asynchroniczn\u0105 operacj\u0119 umieszczania SEND_CHECK_COUNT w przypadku sesji bez transakcji.
JMSWMQ0028.useraction = Wi\u0119cej informacji na temat niepowodze\u0144 i/lub ostrze\u017ce\u0144 zawiera do\u0142\u0105czony wyj\u0105tek.

JMSWMQ0029 = Nie powiod\u0142o si\u0119 wysy\u0142anie komunikatu (raportu) do kolejki zwrotnej (replyTo) {0}. 
JMSWMQ0029.useraction = Wi\u0119cej informacji na temat niepowodze\u0144 i/lub ostrze\u017ce\u0144 zawiera do\u0142\u0105czony wyj\u0105tek.
JMSWMQ0029.inserts = XMSC_DESTINATION_NAME

JMSWMQ0030 = Wykonanie metody {0} dla miejsca docelowego {1} podczas obs\u0142ugi komunikatu nieprzetwarzalnego nie powiod\u0142o si\u0119. 
JMSWMQ0030.explanation = Podczas ponownego umieszczania komunikatu nieprzetwarzalnego w kolejce wykonanie metody {0} nie powiod\u0142o si\u0119 przy jej wywo\u0142aniu dla miejsca docelowego {1}.  
JMSWMQ0030.useraction = Wi\u0119cej informacji na temat niepowodze\u0144 i/lub ostrze\u017ce\u0144 zawiera do\u0142\u0105czony wyj\u0105tek.
JMSWMQ0030.inserts = XMSC_INSERT_METHOD, XMSC_DESTINATION_NAME

JMSWMQ0031 = Wykonanie metody {0} dla mened\u017cera kolejek podczas obs\u0142ugi komunikatu nieprzetwarzalnego nie powiod\u0142o si\u0119. 
JMSWMQ0031.explanation = Podczas ponownego umieszczania komunikatu nieprzetwarzalnego w kolejce wykonanie metody {0} nie powiod\u0142o si\u0119 przy pr\u00f3bie wys\u0142ania zapytania o mened\u017cer kolejek.  
JMSWMQ0031.useraction = Wi\u0119cej informacji na temat niepowodze\u0144 i/lub ostrze\u017ce\u0144 zawiera do\u0142\u0105czony wyj\u0105tek.
JMSWMQ0031.inserts = XMSC_INSERT_METHOD

JMSWMQ0032 = Nie zdefiniowano kolejki wygas\u0142ej poczty.
JMSWMQ0032.explanation = Produkt IBM MQ classes for JMS \
podj\u0105\u0142 pr\u00f3b\u0119 umieszczenia komunikatu nieprzetwarzalnego w kolejce \
niedostarczonych komunikat\u00f3w, poniewa\u017c nie mo\u017cna by\u0142o przekierowa\u0107 tego \
komunikatu do kolejki ponawiania wycofania. Ta operacja zako\u0144czy\u0142a si\u0119 niepowodzeniem, poniewa\u017c dla mened\u017cera kolejek nie zdefiniowano kolejki wygas\u0142ej poczty. 
JMSWMQ0032.useraction = Zdefiniuj kolejk\u0119 niedostarczonych komunikat\u00f3w.

JMSWMQ0033 = Nazwa kolejki wycofanych komunikat\u00f3w dla miejsca docelowego {0} nie mo\u017ce zosta\u0107 przekszta\u0142cona z identyfikatora kodowanego zestawu znak\u00f3w {1} mened\u017cera kolejek.
JMSWMQ0033.useraction = Sprawd\u017a nazw\u0119 kolejki wycofanych komunikat\u00f3w i identyfikator kodowanego zestawu znak\u00f3w mened\u017cera kolejek. 
JMSWMQ0033.inserts = XMSC_DESTINATION_NAME, CCSID

JMSWMQ0034 = Nazwa kolejki wygas\u0142ej poczty nie mo\u017ce zosta\u0107 przekszta\u0142cona z identyfikatora kodowanego zestawu znak\u00f3w {0} mened\u017cera kolejek.
JMSWMQ0034.useraction = Sprawd\u017a nazw\u0119 kolejki wygas\u0142ej poczty i identyfikator kodowanego zestawu znak\u00f3w mened\u017cera kolejek.
JMSWMQ0034.inserts = CCSID

JMSWMQ0035 = Nie mo\u017cna wykona\u0107 operacji zapisu w kolejce wygas\u0142ej poczty z powodu nast\u0119puj\u0105cego wyj\u0105tku: {0}.
JMSWMQ0035.explanation = Pr\u00f3ba ponownego umieszczenia \
komunikatu w kolejce niedostarczonych komunikat\u00f3w przez produkt IBM MQ \
classes for JMS nie powiod\u0142a si\u0119.
JMSWMQ0035.inserts = XMSC_INSERT_EXCEPTION

JMSWMQ0036 = Narz\u0119dzia serwera aplikacji wychwyci\u0142y nast\u0119puj\u0105cy wyj\u0105tek: {0}.
JMSWMQ0036.explanation = Przegl\u0105darka po\u0142\u0105cze\u0144 produktu IBM MQ classes for JMS wychwyci\u0142a wyj\u0105tek.
JMSWMQ0036.inserts = XMSC_INSERT_EXCEPTION

JMSWMQ0037 = Nie mo\u017cna obs\u0142u\u017cy\u0107 komunikatu nieprzetwarzalnego z powodu nast\u0119puj\u0105cego wyj\u0105tku: {0}.
JMSWMQ0037.explanation = Proces nas\u0142uchuj\u0105cy \
komunikat\u00f3w produktu IBM MQ classes for JMS wychwyci\u0142 wyj\u0105tek.
JMSWMQ0037.inserts = XMSC_INSERT_EXCEPTION

JMSWMQ1006 = Niepoprawna warto\u015b\u0107 dla w\u0142a\u015bciwo\u015bci {0}: {1}.
JMSWMQ1006.explanation = Warto\u015b\u0107 {1} dla w\u0142a\u015bciwo\u015bci {0} jest niepoprawna.
JMSWMQ1006.useraction = Sprawd\u017a do\u0142\u0105czony kod \
zako\u0144czenia oraz opis przyczyny wyj\u0105tku produktu IBM MQ.
JMSWMQ1006.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_VALUE

JMSWMQ1017 = kolejka {0}, kt\u00f3ra nie jest kolejk\u0105 lokaln\u0105 MQ, jest niepoprawna w przypadku odbierania lub przegl\u0105dania.
JMSWMQ1017.explanation = Nie mo\u017cna otworzy\u0107 tej kolejki MQ, poniewa\u017c nie jest ona kolejk\u0105 lokaln\u0105 wzgl\u0119dem pod\u0142\u0105czonego mened\u017cera kolejek. 
JMSWMQ1017.useraction = Po\u0142\u0105cz si\u0119 z mened\u017cerem kolejek, dla kt\u00f3rego ta kolejka MQ jest lokalna.
JMSWMQ1017.inserts = XMSC_DESTINATION_NAME

JMSWMQ1029 = Nazwa w\u0142a\u015bciwo\u015bci ma warto\u015b\u0107 NULL.
JMSWMQ1029.explanation = Metoda itemExists() komunikatu odwzorowania zosta\u0142a wywo\u0142ana za pomoc\u0105 elementu, kt\u00f3rego nazwa ma warto\u015b\u0107 NULL, lub argumentem u\u017cytym w przypadku metody, kt\u00f3ra pobiera warto\u015bci w\u0142a\u015bciwo\u015bci z komunikatu JMS wed\u0142ug nazwy, by\u0142 \u0142a\u0144cuch nazwy o warto\u015bci NULL.
JMSWMQ1029.useraction = Sprawd\u017a, czy wskazane \u0142a\u0144cuchy nazw nie maj\u0105 warto\u015bci NULL.

JMSWMQ1044 = \u0141a\u0144cuch nie jest poprawn\u0105 liczb\u0105 szesnastkow\u0105 - {0}.
JMSWMQ1044.inserts = XMSC_INSERT_HEX_STRING
JMSWMQ1044.explanation = Podj\u0119to pr\u00f3b\u0119 okre\u015blenia identyfikatora grupy lub identyfikatora korelacji rozpoczynaj\u0105cego si\u0119 od identyfikatora przedrostkowego, po kt\u00f3rym nie nast\u0119puje jednak poprawnie sformatowana warto\u015b\u0107 szesnastkowa, lub pr\u00f3b\u0119 odebrania komunikatu zawieraj\u0105cego w\u0142a\u015bciwo\u015b\u0107 struktury MQRFH2 typu bin.hex, kt\u00f3ra nie ma poprawnie sformatowanej warto\u015bci szesnastkowej.
JMSWMQ1044.useraction = Podczas ustawiania warto\u015bci identyfikatora grupy lub identyfikatora korelacji sprawd\u017a, czy po identyfikatorze przedrostkowym zawsze nast\u0119puje poprawna warto\u015b\u0107 szesnastkowa. Sprawd\u017a, czy wszystkie nag\u0142\u00f3wki MQRFH2 generowane przez aplikacje inne ni\u017c JMS s\u0105 poprawnie sformatowane.

JMSWMQ1046 = Zestaw znak\u00f3w {0} nie jest obs\u0142ugiwany.
JMSWMQ1046.inserts = CCSID
JMSWMQ1046.explanation = Podj\u0119to pr\u00f3b\u0119 wys\u0142ania lub odebrania komunikatu odwzorowania, komunikatu strumienia lub komunikatu tekstowego, kt\u00f3rego tre\u015b\u0107 jest zakodowana za pomoc\u0105 zestawu znak\u00f3w nieobs\u0142ugiwanego przez maszyn\u0119 JVM. W przypadku komunikat\u00f3w tekstowych ten wyj\u0105tek mo\u017ce zosta\u0107 zg\u0142oszony, je\u015bli tre\u015b\u0107 wiadomo\u015bci komunikatu jest odpytywana w pierwszej kolejno\u015bci, a nie podczas odbierania.
JMSWMQ1046.useraction = Koduj komunikaty wy\u0142\u0105cznie za pomoc\u0105 zestaw\u00f3w znak\u00f3w dost\u0119pnych dla aplikacji odbieraj\u0105cej.
JMSWMQ1046.exception = com.ibm.msg.client.jms.DetailedMessageFormatException


JMSWMQ1051 = Szczeg\u00f3\u0142y komunikatu

JMSWMQ1055 = Typ danych {0} w\u0142a\u015bciwo\u015bci lub elementu komunikatu jest niezgodny z metod\u0105 s\u0142u\u017c\u0105c\u0105 do uzyskiwania dost\u0119pu do niego.
JMSWMQ1055.inserts = XMSC_INSERT_TYPE
JMSWMQ1055.explanation = Metoda obiektu korzystaj\u0105cego s\u0142u\u017c\u0105ca do pobierania w\u0142a\u015bciwo\u015bci z komunikatu JMS jest niezgodna z pobieranym typem w\u0142a\u015bciwo\u015bci. Przyk\u0142ad: Podj\u0119to pr\u00f3b\u0119 pobrania w\u0142a\u015bciwo\u015bci typu integer przy u\u017cyciu metody getBooleanProperty().
JMSWMQ1055.useraction = U\u017cyj metody obiektu korzystaj\u0105cego zdefiniowanej przez specyfikacj\u0119 JMS jako metoda, kt\u00f3ra mo\u017ce pobra\u0107 warto\u015bci w\u0142a\u015bciwo\u015bci wymaganego typu.
JMSWMQ1055.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSWMQ1059 = B\u0142\u0105d krytyczny - kodowanie UTF-8 nie jest obs\u0142ugiwane.
JMSWMQ1059.explanation = U\u017cywane \u015brodowisko wykonawcze Java(tm) nie obs\u0142uguje kodowania znak\u00f3w UTF-8. W przypadku us\u0142ugi JMS wymagana jest obs\u0142uga tego kodowania, aby mo\u017cliwe by\u0142o wykonanie niekt\u00f3rych operacji.
JMSWMQ1059.useraction = Aby dowiedzie\u0107 si\u0119, w jaki spos\u00f3b uzyska\u0107 wsparcie dotycz\u0105ce kodowania znak\u00f3w UTF-8, zapoznaj si\u0119 z dokumentacj\u0105 i/lub skonsultuj si\u0119 z dostawc\u0105 \u015brodowiska wykonawczego Java(tm).
JMSWMQ1059.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSWMQ1067 = Limit czasu {0} nie jest poprawny w \
przypadku produktu IBM MQ classes for JMS.
JMSWMQ1067.explanation = Podj\u0119to pr\u00f3b\u0119 wywo\u0142ania metody receive w odbiorniku kolejek lub metodzie subskrybenta temat\u00f3w z okre\u015bleniem niepoprawnej warto\u015bci d\u0142ugiego limitu czasu.
JMSWMQ1067.useraction = Sprawd\u017a, czy okre\u015blona warto\u015b\u0107 limitu czasu nie jest ujemna i nie jest wi\u0119ksza ni\u017c warto\u015b\u0107 elementu Integer.MAX_VALUE.
JMSWMQ1067.inserts = XMSC_INSERT_TIMEOUT

JMSWMQ1068 = Nie powiod\u0142a si\u0119 pr\u00f3ba uzyskania zasobu XA.
JMSWMQ1068.explanation = Pr\u00f3ba utworzenia zasobu XA przez \
produkt IBM MQ classes for JMS nie powiod\u0142a si\u0119 z powodu b\u0142\u0119du.
JMSWMQ1068.useraction = Wi\u0119cej informacji na ten temat zawiera do\u0142\u0105czony wyj\u0105tek XAException.

JMSWMQ1079 = Nie mo\u017cna zapisa\u0107 komunikatu w kolejce wygas\u0142ej poczty.
JMSWMQ1079.explanation = Pr\u00f3ba ponownego umieszczenia \
komunikatu w kolejce niedostarczonych komunikat\u00f3w przez produkt IBM MQ \
classes for JMS nie powiod\u0142a si\u0119.
JMSWMQ1079.useraction = U\u017cyj do\u0142\u0105czonego wyj\u0105tku, aby ustali\u0107 przyczyn\u0119 b\u0142\u0119du. Je\u015bli nie do\u0142\u0105czono wyj\u0105tku, sprawd\u017a, czy dla mened\u017cera kolejek jest zdefiniowana kolejka wygas\u0142ej poczty. Gdy komunikat zostanie wys\u0142any do kolejki niedostarczonych komunikat\u00f3w przez \
produkt IBM MQ classes for JMS, mo\u017cna ustali\u0107 przyczyn\u0119 jego wys\u0142ania do \
tej kolejki, u\u017cywaj\u0105c kodu przyczyny zapisanego w nag\u0142\u00f3wku MQDLH komunikatu.

JMSWMQ1080 = Nie zdefiniowano kolejki wycofanych komunikat\u00f3w.

JMSWMQ1096 = Odwo\u0142anie komunikatu zosta\u0142o niepoprawnie sformatowane.

JMSWMQ1107 = Wyst\u0105pi\u0142 problem dotycz\u0105cy tego po\u0142\u0105czenia.
JMSWMQ1107.explanation = Wyst\u0105pi\u0142 b\u0142\u0105d w po\u0142\u0105czeniu JMS \
produktu IBM MQ.
JMSWMQ1107.useraction = U\u017cyj do\u0142\u0105czonego wyj\u0105tku, aby ustali\u0107 przyczyn\u0119 b\u0142\u0119du.

JMSWMQ1116 = Komunikat {0}, kt\u00f3ry znajdowa\u0142 si\u0119 w \
kolejce {1}, zosta\u0142 przeniesiony do kolejki niedostarczonych komunikat\u00f3w w \
mened\u017cerze kolejek {2}.
JMSWMQ1116.explanation = Podczas dzia\u0142ania w trybie \
normalnym dostawcy przesy\u0142ania komunikat\u00f3w produktu IBM MQ wykryto \
komunikat, kt\u00f3rego nie mo\u017cna przetworzy\u0107. Komunikat zosta\u0142 przeniesiony \
do kolejki niedostarczonych komunikat\u00f3w, poniewa\u017c pole Report (Raport) w \
deskryptorze MQMD tego komunikatu zawiera\u0142o opcj\u0119 MQRO_DEAD_LETTER_Q. 
JMSWMQ1116.useraction = Przejrzyj nag\u0142\u00f3wek niedostarczonego \
komunikatu znajduj\u0105cego si\u0119 w kolejce niedostarczonych komunikat\u00f3w, aby \
sprawdzi\u0107, dlaczego ten komunikat nie zosta\u0142 przetworzony. 
JMSWMQ1116.inserts = XMSC_INSERT_MESSAGE_ID, XMSC_INSERT_DESTINATION_NAME, XMSC_INSERT_QUEUE_MANAGER_NAME 

JMSWMQ1117 = Nie mo\u017cna przetworzy\u0107 komunikatu {0}, kt\u00f3ry \
znajdowa\u0142 si\u0119 w kolejce {1} mened\u017cera kolejek {2}, wi\u0119c zosta\u0142 on odrzucony.
JMSWMQ1117.explanation = Podczas dzia\u0142ania w trybie \
normalnym dostawcy przesy\u0142ania komunikat\u00f3w produktu IBM MQ wykryto \
komunikat, kt\u00f3rego nie mo\u017cna przetworzy\u0107. Komunikat zosta\u0142 odrzucony, \
poniewa\u017c pole Report (Raport) w deskryptorze MQMD tego komunikatu zawiera\u0142o \
opcj\u0119 MQRO_DISCARD_MSG. 
JMSWMQ1117.useraction = Zmodyfikuj aplikacje, kt\u00f3re \
umieszczaj\u0105 komunikaty w podanej kolejce, w taki spos\u00f3b, aby pole Report \
(Raport) w deskryptorze MQMD komunikatu zawiera\u0142o opcj\u0119 MQRO_DEAD_LETTER_Q. Dzi\u0119ki temu wszystkie nast\u0119pne komunikaty, kt\u00f3rych nie b\u0119dzie mo\u017cna \
przetworzy\u0107, b\u0119d\u0105 przenoszone do kolejki niedostarczonych komunikat\u00f3w zamiast \
odrzucane. Komunikaty znajduj\u0105ce si\u0119 w kolejce niedostarczonych komunikat\u00f3w \
b\u0119d\u0105 mia\u0142y nag\u0142\u00f3wek niedostarczonego komunikatu, kt\u00f3ry b\u0119dzie zawiera\u0107 \
informacje o tym, dlaczego nie mog\u0142y zosta\u0107 przetworzone.
JMSWMQ1117.inserts = XMSC_INSERT_MESSAGE_ID, XMSC_INSERT_DESTINATION_NAME, XMSC_INSERT_QUEUE_MANAGER_NAME 

JMSWMQ1118 = Kolejka {0}, kt\u00f3ra wcze\u015bniej zosta\u0142a \
zablokowana dla operacji pobierania, zosta\u0142a ponownie w\u0142\u0105czona dla operacji \
pobierania, poniewa\u017c mened\u017cer kolejek produktu IBM MQ odpowiedzia\u0142, \
zwracaj\u0105c kod przyczyny 2494 (MQRC_GET_ENABLED).
JMSWMQ1118.explanation = Kolejka, z kt\u00f3r\u0105 konsument ma \
nawi\u0105zane po\u0142\u0105czenie, zosta\u0142a udost\u0119pniona do pobierania komunikat\u00f3w.
JMSWMQ1118.useraction = Brak. Ten komunikat ma charakter wy\u0142\u0105cznie informacyjny.
JMSWMQ1118.inserts = XMSC_INSERT_DESTINATION_NAME

JMSWMQ1119 = Kolejka {0} jest obecnie zablokowana dla \
\u017c\u0105da\u0144 pobierania, poniewa\u017c mened\u017cer kolejek produktu IBM MQ \
odpowiedzia\u0142, zwracaj\u0105c kod przyczyny 2016 (MQRC_GET_INHIBITED).
JMSWMQ1119.explanation = W kolejce, z kt\u00f3r\u0105 konsument \
ma nawi\u0105zane po\u0142\u0105czenie, obecnie s\u0105 zablokowane wszystkie \u017c\u0105dania MQGET.
JMSWMQ1119.useraction = Zaczekaj na ponowne w\u0142\u0105czenie kolejki \
dla \u017c\u0105da\u0144 MQGET przez administratora produktu IBM MQ. 
JMSWMQ1119.inserts = XMSC_INSERT_DESTINATION_NAME

# Same as JMSWMQ2003: queue variant.
JMSWMQ2000 = Pr\u00f3ba zamkni\u0119cia kolejki {0} nie powiod\u0142a si\u0119.
JMSWMQ2000.explanation = Us\u0142uga JMS podj\u0119\u0142a pr\u00f3b\u0119 \
zamkni\u0119cia miejsca docelowego produktu IBM MQ, ale napotka\u0142a b\u0142\u0105d. Miejsce docelowe mog\u0142o ju\u017c zosta\u0107 zamkni\u0119te lub inny w\u0105tek wykonuje operacj\u0119 MQGET w momencie wywo\u0142ania metody close().
JMSWMQ2000.useraction = U\u017cyj do\u0142\u0105czonego wyj\u0105tku, aby ustali\u0107 przyczyn\u0119 b\u0142\u0119du. Wykonanie metody close() mo\u017ce by\u0107 mo\u017cliwe p\u00f3\u017aniej.
JMSWMQ2000.inserts = XMSC_DESTINATION_NAME

JMSWMQ2001 = Pr\u00f3ba zamkni\u0119cia miejsca docelowego {0} przy u\u017cyciu strategii zamykania z zastosowaniem odczytu z wyprzedzeniem nie powiod\u0142a si\u0119.
JMSWMQ2001.explanation = Produkt IBM MQ classes \
for JMS podj\u0105\u0142 pr\u00f3b\u0119 zamkni\u0119cia miejsca docelowego produktu IBM MQ, ale \
napotka\u0142 b\u0142\u0105d. Up\u0142yn\u0105\u0142 limit czasu wywo\u0142ania metody close przy pr\u00f3bie dostarczenia wszystkich komunikat\u00f3w do kolejki odczytu z wyprzedzeniem.
JMSWMQ2001.useraction = Sprawd\u017a, czy obiekt nas\u0142uchiwania komunikat\u00f3w nie jest zap\u0119tlony. Wykonanie metody close() mo\u017ce by\u0107 mo\u017cliwe p\u00f3\u017aniej.
JMSWMQ2001.inserts = XMSC_DESTINATION_NAME

JMSWMQ2002 = Pobieranie komunikatu z miejsca docelowego {0} nie powiod\u0142o si\u0119.
JMSWMQ2002.explanation = Produkt IBM MQ classes \
for JMS podj\u0105\u0142 pr\u00f3b\u0119 wykonania operacji MQGET, ale produkt IBM MQ \
zg\u0142osi\u0142 b\u0142\u0105d.
JMSWMQ2002.useraction = U\u017cyj do\u0142\u0105czonego wyj\u0105tku, aby ustali\u0107 przyczyn\u0119 b\u0142\u0119du.
JMSWMQ2002.inserts = XMSC_DESTINATION_NAME

# Same as JMSWMQ2000: topic variant.
JMSWMQ2003 = Pr\u00f3ba zamkni\u0119cia tematu {0} nie powiod\u0142a si\u0119.
JMSWMQ2003.explanation = Us\u0142uga JMS podj\u0119\u0142a pr\u00f3b\u0119 \
zamkni\u0119cia miejsca docelowego produktu IBM MQ, ale napotka\u0142a b\u0142\u0105d. Miejsce docelowe mog\u0142o ju\u017c zosta\u0107 zamkni\u0119te lub inny w\u0105tek wykonuje operacj\u0119 MQGET w momencie wywo\u0142ania metody close().
JMSWMQ2003.useraction = U\u017cyj do\u0142\u0105czonego wyj\u0105tku, aby ustali\u0107 przyczyn\u0119 b\u0142\u0119du. Wykonanie metody close() mo\u017ce by\u0107 mo\u017cliwe p\u00f3\u017aniej.
JMSWMQ2003.inserts = XMSC_DESTINATION_NAME

# Same as JMSWMQ2008: topic variant.
JMSWMQ2006 = Pr\u00f3ba otwarcia tematu MQ {0} nie powiod\u0142a si\u0119.
JMSWMQ2006.explanation = Us\u0142uga JMS podj\u0119\u0142a pr\u00f3b\u0119 \
wykonania operacji MQOPEN, ale produkt IBM MQ zg\u0142osi\u0142 b\u0142\u0105d.
JMSWMQ2006.useraction = U\u017cyj do\u0142\u0105czonego wyj\u0105tku, aby ustali\u0107 przyczyn\u0119 b\u0142\u0119du. Sprawd\u017a, czy okre\u015blony temat i mened\u017cer kolejek s\u0105 poprawnie zdefiniowane.
JMSWMQ2006.inserts = XMSC_DESTINATION_NAME

JMSWMQ2007 = Wysy\u0142anie komunikatu do miejsca docelowego {0} nie powiod\u0142o si\u0119.
JMSWMQ2007.explanation = Us\u0142uga JMS podj\u0119\u0142a pr\u00f3b\u0119 \
wykonania operacji MQPUT lub MQPUT1, ale produkt IBM MQ zg\u0142osi\u0142 b\u0142\u0105d.
JMSWMQ2007.useraction = U\u017cyj do\u0142\u0105czonego wyj\u0105tku, aby ustali\u0107 przyczyn\u0119 b\u0142\u0119du.
JMSWMQ2007.inserts = XMSC_DESTINATION_NAME

# Same as JMSWMQ2006: queue variant.
JMSWMQ2008 = Pr\u00f3ba otwarcia kolejki MQ {0} nie powiod\u0142a si\u0119.
JMSWMQ2008.explanation = Us\u0142uga JMS podj\u0119\u0142a pr\u00f3b\u0119 \
wykonania operacji MQOPEN, ale produkt IBM MQ zg\u0142osi\u0142 b\u0142\u0105d.
JMSWMQ2008.useraction = U\u017cyj do\u0142\u0105czonego wyj\u0105tku, aby ustali\u0107 przyczyn\u0119 b\u0142\u0119du. Sprawd\u017a, czy okre\u015blona kolejka i mened\u017cer kolejek s\u0105 poprawnie zdefiniowane.
JMSWMQ2008.inserts = XMSC_DESTINATION_NAME

JMSWMQ2010 = Miejsce docelowe dla przesy\u0142ania komunikat\u00f3w trwa\u0142ych {0} z ustawieniem NPMCLASS HIGH nie by\u0142o poprawne.
JMSWMQ2010.explanation = Okre\u015blone miejsce docelowe nie obs\u0142uguje wysy\u0142ania komunikat\u00f3w trwa\u0142ych z ustawieniem NPMCLASS HIGH.
JMSWMQ2010.useraction = U\u017cyj narz\u0119dzia administracyjnego us\u0142ugi JMS, aby w\u0142\u0105czy\u0107 wysy\u0142anie komunikat\u00f3w trwa\u0142ych z ustawieniem NPMCLASS HIGH dla tego miejsca docelowego.
JMSWMQ2010.inserts = XMSC_DESTINATION_NAME
JMSWMQ2010.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSWMQ2011 = Pr\u00f3ba otwarcia sta\u0142ej subskrypcji {0} dla miejsca docelowego {1} nie powiod\u0142a si\u0119.
JMSWMQ2011.explanation = Us\u0142uga JMS podj\u0119\u0142a pr\u00f3b\u0119 utworzenia sta\u0142ej subskrypcji, ale wybrana nazwa subskrypcji by\u0142a ju\u017c u\u017cywana w maszynie JVM.
JMSWMQ2011.useraction = U\u017cyj innej nazwy subskrypcji dla tego sta\u0142ego subskrybenta lub uruchom ten subskrybent w innej maszynie JVM.
JMSWMQ2011.inserts = XMSC_INSERT_OBJECT, XMSC_DESTINATION_NAME
JMSWMQ2011.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSWMQ2012 = Operacja XACLOSE nie powiod\u0142a si\u0119.
JMSWMQ2012.explanation = Zamykanie zasobu XA podczas zamykania sesji XA nie powiod\u0142o si\u0119.
JMSWMQ2012.useraction = Wi\u0119cej szczeg\u00f3\u0142owych informacji zawiera do\u0142\u0105czony wyj\u0105tek XAException.

JMSWMQ2013 = Ustawienia uwierzytelniania zabezpiecze\u0144 podane dla mened\u017cera kolejek {0} z trybem po\u0142\u0105czenia {1} i nazw\u0105 hosta {2} nie by\u0142y poprawne.
JMSWMQ2013.useraction = Sprawd\u017a, czy podana nazwa u\u017cytkownika oraz has\u0142o \
s\u0105 poprawne w przypadku mened\u017cera kolejek, z kt\u00f3rym jest nawi\u0105zywane po\u0142\u0105czenie.
JMSWMQ2013.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_HOST_NAME

JMSWMQ2014 = Produkt MQ dostarczy\u0142 zdarzenie asynchroniczne z kodem zako\u0144czenia {0} i nast\u0119puj\u0105c\u0105 przyczyn\u0105: {1}.

JMSWMQ2016 = Nie powiod\u0142a si\u0119 pr\u00f3ba rejestracji obiektu nas\u0142uchiwania wyj\u0105tk\u00f3w (ExceptionListener) dla po\u0142\u0105czenia (Connection).
JMSWMQ2016.explanation = Wywo\u0142anie obiektu MQCB w celu rejestracji tego obiektu nas\u0142uchiwania wyj\u0105tk\u00f3w nie powiod\u0142o si\u0119.
JMSWMQ2016.useraction = U\u017cyj do\u0142\u0105czonego wyj\u0105tku, aby ustali\u0107 przyczyn\u0119 b\u0142\u0119du.

JMSWMQ2017 = Nie powiod\u0142a si\u0119 pr\u00f3ba wyrejestrowania obiektu nas\u0142uchiwania wyj\u0105tk\u00f3w (ExceptionListener) dla po\u0142\u0105czenia (Connection).
JMSWMQ2017.explanation = Wywo\u0142anie obiektu MQCB w celu wyrejestrowania tego obiektu nas\u0142uchiwania wyj\u0105tk\u00f3w nie powiod\u0142o si\u0119.
JMSWMQ2017.useraction = U\u017cyj do\u0142\u0105czonego wyj\u0105tku, aby ustali\u0107 przyczyn\u0119 b\u0142\u0119du.

# Log message
JMSWMQ2018 = Wyj\u0105tek zosta\u0142 zignorowany, poniewa\u017c nie jest zarejestrowany \u017caden obiekt nas\u0142uchiwania wyj\u0105tk\u00f3w: {0}.
JMSWMQ2018.explanation = Zosta\u0142a podj\u0119ta pr\u00f3ba dostarczenia wyj\u0105tku do obiektu nas\u0142uchiwania wyj\u0105tk\u00f3w po\u0142\u0105czenia, ale obiekt nas\u0142uchiwania nie jest zarejestrowany.
JMSWMQ2018.useraction = Obiekt nas\u0142uchiwania wyj\u0105tk\u00f3w musi by\u0107 zarejestrowany z po\u0142\u0105czeniem, aby mo\u017cliwe by\u0142o odbieranie przez niego wyj\u0105tk\u00f3w tego po\u0142\u0105czenia.
JMSWMQ2018.inserts = XMSC_INSERT_EXCEPTION

#Log message
JMSWMQ2019 = Metoda {2} zwr\u00f3ci\u0142a nieoczekiwany kod zako\u0144czenia {0} i kod przyczyny {1}.
JMSWMQ2019.explanation = Ten kod przyczyny nie by\u0142 oczekiwany, jednak nie zosta\u0142 zwr\u00f3cony do aplikacji.
JMSWMQ2019.useraction = Je\u015bli wyst\u0119puj\u0105 awarie aplikacji, nale\u017cy przeanalizowa\u0107 kod przyczyny, aby uzyska\u0107 wi\u0119cej informacji o tych awariach.
JMSWMQ2019.inserts = XMSC_INSERT_COMP_CODE, XMSC_INSERT_REASON, XMSC_INSERT_METHOD

JMSWMQ2020 = Nie mo\u017cna nawi\u0105za\u0107 po\u0142\u0105czenia z mened\u017cerem kolejek {0}, u\u017cywaj\u0105c trybu po\u0142\u0105czenia {1} i podanego adresu URL CCDT {2}. Wi\u0119cej informacji mo\u017cna znale\u017a\u0107 w do\u0142\u0105czonym wyj\u0105tku.
JMSWMQ2020.useraction = Sprawd\u017a, czy jest uruchomiony mened\u017cer kolejek oraz (w przypadku pracy w trybie klienta) obiekt nas\u0142uchiwania. Wi\u0119cej informacji na ten temat zawiera do\u0142\u0105czony wyj\u0105tek.
JMSWMQ2020.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_CCDTURL

JMSWMQ2021 = Ustawienia uwierzytelniania zabezpiecze\u0144 podane dla mened\u017cera kolejek {0} z trybem po\u0142\u0105czenia {1} i podanym adresem URL CCDT {2} nie by\u0142y poprawne. Wi\u0119cej informacji mo\u017cna znale\u017a\u0107 w do\u0142\u0105czonym wyj\u0105tku.
JMSWMQ2021.useraction = Sprawd\u017a, czy podana nazwa u\u017cytkownika oraz has\u0142o \
s\u0105 poprawne w przypadku mened\u017cera kolejek, z kt\u00f3rym jest nawi\u0105zywane po\u0142\u0105czenie.
JMSWMQ2021.inserts = XMSC_INSERT_QUEUE_MANAGER, XMSC_WMQ_CONNECTION_MODE, XMSC_WMQ_CCDTURL


JMSWMQ2022 = Nie mo\u017cna utworzy\u0107 producenta komunikat\u00f3w lub konsumenta \
komunikat\u00f3w z miejscem docelowym w postaci kolejki modelowej {0}.
JMSWMQ2022.explanation = Producent komunikat\u00f3w lub konsument komunikat\u00f3w nie m\u00f3g\u0142 otworzy\u0107 miejsca docelowego, poniewa\u017c by\u0142a to kolejka modelowa.
JMSWMQ2022.useraction = Zmie\u0144 producenta komunikat\u00f3w lub konsumenta \
komunikat\u00f3w, aby u\u017cy\u0107 innej nazwy kolejki docelowej r\u00f3\u017cnej do kolejki modelowej.
JMSWMQ2022.inserts = XMSC_DESTINATION_NAME

JMSWMQ2023 = Wyst\u0105pi\u0142 b\u0142\u0105d podczas przetwarzania \
komunikatu {0}. Wyj\u0105tek: {1}, deskryptor MQMD: {2}.
JMSWMQ2023.inserts = XMSC_MSG_DATA,XMSC_INSERT_EXCEPTION,XMSC_DATA

JMSWMQ2024 = Wysy\u0142anie komunikatu do miejsca docelowego {0} nie powiod\u0142o si\u0119.
JMSWMQ2024.explanation = Us\u0142uga JMS podj\u0119\u0142a pr\u00f3b\u0119 \
wykonania operacji MQPUT lub MQPUT1, ale produkt IBM MQ zg\u0142osi\u0142 b\u0142\u0105d. \
\n\
Poniewa\u017c ustawiono op\u00f3\u017anienie dostawy, problem mo\u017ce dotyczy\u0107 \
kolejki okre\u015blonej przez aplikacj\u0119 lub \n\
kolejki przemieszczania op\u00f3\u017anienia dostawy SYSTEM.DDELAY.LOCAL.QUEUE.
JMSWMQ2024.useraction = U\u017cyj do\u0142\u0105czonego wyj\u0105tku, aby ustali\u0107 przyczyn\u0119 b\u0142\u0119du.
JMSWMQ2024.inserts = XMSC_DESTINATION_NAME

JMSWMQ2025 = Subskrybowanie tematu {0} z nazw\u0105 subskrypcji {1} nie powiod\u0142o si\u0119.
JMSWMQ2025.explanation = Podj\u0119to pr\u00f3b\u0119 otwarcia \
subskrypcji wsp\u00f3\u0142u\u017cytkowanej w spos\u00f3b niewsp\u00f3\u0142u\u017cytkowany lub otwarcia subskrypcji niewsp\u00f3\u0142u\u017cytkowanej w spos\u00f3b wsp\u00f3\u0142u\u017cytkowany.
JMSWMQ2025.useraction = Przed podj\u0119ciem pr\u00f3by utworzenia nowej \
subskrypcji o tej samej nazwie upewnij si\u0119, \u017ce nie istniej\u0105 subskrypcje o r\u00f3\u017cnych typach wsp\u00f3\u0142u\u017cytkowania.
JMSWMQ2025.inserts = NAZWA_DOCELOWA_XMSC,NAZWA_SUBSKRYPCJI_XMSC
