#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE
# %Z% %W% %I% %E% %U%

# Note to translators: the comments for the JMSMQxxxx.documentation properties in
# this file do NOT need to be translated, they are used at build time to create
# untranslated Javadoc documentation. 

#MQJMSIVT messages
JMSMQ0000 = Metoda {0} byla vol\u00e1na v nep\u0159\u00edpustn\u00e9m nebo v nevhodn\u00e9m okam\u017eiku nebo se poskytovatel nenach\u00e1z\u00ed v odpov\u00eddaj\u00edc\u00edm stavu pro po\u017eadovanou operaci. 
JMSMQ0000.explanation = Obvyklou p\u0159\u00ed\u010dinou t\u00e9to v\u00fdjimky je fakt, \u017ee \u00falo\u017ei\u0161t\u011b certifik\u00e1t\u016f SSL nebylo definov\u00e1no. \
''{0}'' identifikuje metodu, kter\u00e1 probl\u00e9m zp\u016fsobila.
JMSMQ0000.inserts = XMSC_INSERT_NAME

JMSMQ1046 = Znakov\u00e1 sada {0} nen\u00ed podporov\u00e1na.
JMSMQ1046.documentation = Znakov\u00e1 sada {0} nen\u00ed podporov\u00e1na. \
<br> <b>Vysv\u011btlen\u00ed:</b> Prob\u011bhl pokus o odesl\u00e1n\u00ed nebo p\u0159ijet\u00ed mapov\u00e9 zpr\u00e1vy, zpr\u00e1vy s proudem hodnot nebo textov\u00e9 zpr\u00e1vy, jej\u00ed\u017e t\u011blo je k\u00f3dov\u00e1no s pou\u017eit\u00edm znakov\u00e9 sady nepodporovan\u00e9 v prost\u0159ed\u00ed JVM. \
V p\u0159\u00edpad\u011b textov\u00fdch zpr\u00e1v m\u016f\u017ee b\u00fdt tato v\u00fdjimka vygenerov\u00e1na a\u017e p\u0159i prvn\u00edm dotazu na t\u011blo zpr\u00e1vy a nikoli hned p\u0159i p\u0159ijet\u00ed. \
<br> <b>Odezva u\u017eivatele:</b> Ke k\u00f3dov\u00e1n\u00ed zpr\u00e1v pou\u017e\u00edvejte pouze znakov\u00e9 sady, kter\u00e9 jsou k dispozici v c\u00edlov\u00e9 aplikaci.

JMSMQ1002 = IBM MQ classes for Java(tm) Message Service 
JMSMQ3043 = Neplatn\u00e1 \u00farove\u0148 pro opakov\u00e1n\u00ed operace vy\u010di\u0161t\u011bn\u00ed.
JMSMQ3043.documentation = \u00darove\u0148 pro opakov\u00e1n\u00ed vy\u010di\u0161t\u011bn\u00ed nen\u00ed platn\u00e1. \
<br> <b>Odezva u\u017eivatele:</b> Nastavte vlastnost cleanupLevel na p\u0159\u00edslu\u0161nou hodnotu. 

JMSMQ5032 = Prob\u00edh\u00e1 ukon\u010den\u00ed p\u0159ipojen\u00ed.
JMSMQ5010 = Prob\u00edh\u00e1 vytv\u00e1\u0159en\u00ed p\u0159ipojen\u00ed.
JMSMQ5034 = Byla zaznamen\u00e1na v\u00fdjimka.
JMSMQ5021 = Op\u011btn\u00e9 z\u00edsk\u00e1n\u00ed zpr\u00e1vy se nezda\u0159ilo.
JMSMQ5002 = P\u0159\u00edznak -icf je ignorov\u00e1n; nen\u00ed zad\u00e1na \u017e\u00e1dn\u00e1 hodnota.
JMSMQ5003 = Nezn\u00e1m\u00fd p\u0159\u00edznak {0} je ignorov\u00e1n.
JMSMQ5001 = P\u0159\u00edznak -url je ignorov\u00e1n; nen\u00ed zad\u00e1na \u017e\u00e1dn\u00e1 hodnota.
JMSMQ5006 = Nelze vytvo\u0159it po\u010d\u00e1te\u010dn\u00ed kontext InitialContext. Zkontrolujte nastaven\u00ed rozhran\u00ed JNDI.
JMSMQ5035 = Zpracov\u00e1n\u00ed p\u0159\u00edkazu IVT bylo dokon\u010deno.
JMSMQ5000 = Ov\u011b\u0159ovac\u00ed test instalace
JMSMQ5033 = Zpracov\u00e1n\u00ed p\u0159\u00edkazu IVT bylo \u00fasp\u011b\u0161n\u011b dokon\u010deno.
JMSMQ5017 = Prob\u00edh\u00e1 vytv\u00e1\u0159en\u00ed objektu TextMessage.
JMSMQ5024 = Do\u0161lo k chyb\u011b. \u0158et\u011bzec odpov\u011bdi se li\u0161\u00ed od p\u016fvodn\u00edho \u0159et\u011bzce.
JMSMQ5023 = \u0158et\u011bzec odpov\u011bdi je shodn\u00fd s p\u016fvodn\u00edm \u0159et\u011bzcem.
JMSMQ5020 = Pokus o op\u011btn\u00e9 na\u010dten\u00ed zpr\u00e1vy se nezda\u0159il, proto\u017ee zpr\u00e1va z\u0159ejm\u011b nen\u00ed k dispozici.
JMSMQ5019 = Op\u011btn\u00e9 na\u010d\u00edt\u00e1n\u00ed zpr\u00e1vy
JMSMQ5022 = Byla z\u00edsk\u00e1na zpr\u00e1va.
JMSMQ5027 = Zpr\u00e1va odpov\u011bdi nebyla typu TextMessage.
JMSMQ5025 = P\u016fvodn\u00ed \u0159et\u011bzec
JMSMQ5026 = \u0158et\u011bzec odpov\u011bdi
JMSMQ5018 = Odes\u00edl\u00e1n\u00ed zpr\u00e1vy do {0}
JMSMQ5028 = Byla na\u010dtena zpr\u00e1va chybn\u00e9ho typu.
JMSMQ5037 = Nezda\u0159ilo se naj\u00edt soubor JAR nebo t\u0159\u00eddu ''{0}''. Pravd\u011bpodobn\u011b chyb\u00ed v cest\u011b ke t\u0159\u00edd\u00e1m.
JMSMQ5038 = Nezda\u0159ilo se naj\u00edt t\u0159\u00eddu ''{0}''. Pravd\u011bpodobn\u011b poskytovatel rozhran\u00ed JNDI chyb\u00ed v cest\u011b ke t\u0159\u00edd\u00e1m.
JMSMQ5036 = Volba {0} je ignorov\u00e1na; nen\u00ed zad\u00e1na \u017e\u00e1dn\u00e1 hodnota.
JMSMQ5064 = Pro parametr -port mus\u00ed b\u00fdt zad\u00e1na \u010d\u00edseln\u00e1 hodnota.
JMSMQ5058 = propojen\u00e1 v\u00fdjimka
JMSMQ5007 = Prob\u00edh\u00e1 vytv\u00e1\u0159en\u00ed objektu QueueConnectionFactory.
JMSMQ5009 = Nelze na\u010d\u00edst objekt QCF z rozhran\u00ed JNDI.
JMSMQ5008 = Prob\u00edh\u00e1 na\u010d\u00edt\u00e1n\u00ed objektu QueueConnectionFactory z rozhran\u00ed JNDI.
JMSMQ5012 = Prob\u00edh\u00e1 vytv\u00e1\u0159en\u00ed fronty.
JMSMQ5014 = Nelze na\u010d\u00edst objekt Q z rozhran\u00ed JNDI.
JMSMQ5013 = Prob\u00edh\u00e1 na\u010d\u00edt\u00e1n\u00ed fronty z rozhran\u00ed JNDI.
JMSMQ5029 = Prob\u00edh\u00e1 ukon\u010den\u00ed \u010dinnosti objektu QueueReceiver.
JMSMQ5016 = Prob\u00edh\u00e1 vytv\u00e1\u0159en\u00ed objektu QueueReceiver.
JMSMQ5030 = Prob\u00edh\u00e1 ukon\u010den\u00ed \u010dinnosti objektu QueueSender.
JMSMQ5015 = Prob\u00edh\u00e1 vytv\u00e1\u0159en\u00ed objektu QueueSender.
JMSMQ5031 = Prob\u00edh\u00e1 ukon\u010den\u00ed \u010dinnosti relace.
JMSMQ5011 = Prob\u00edh\u00e1 vytv\u00e1\u0159en\u00ed relace.
JMSMQ5004 = Je nutn\u00e9 zadat parametr providerURL -url.
JMSMQ5065 = Pou\u017eit\u00ed:
JMSMQ5066 = IVTRun -url adresaURLposkytovatele [-icf po\u010d\u00e1te\u010dn\u00edTov\u00e1rnaKontextu] [-t]
JMSMQ5067 = IVTRun -nojndi [-m spr_fr] [-t] [-v verze_poskytov]
JMSMQ5068 = IVTRun -nojndi -client -m spr_fr -host n\u00e1z_host [-port port] [-channel kan\u00e1l] [-ccsid ccsid] [-t] [-v verze_poskytov]
JMSMQ5005 = P\u0159i pou\u017eit\u00ed spravovan\u00fdch objekt\u016f ov\u011b\u0159te jejich dostupnost.
JMSMQ5100 = Zpr\u00e1va
JMSMQ5101 = T\u0159\u00edda
JMSMQ5102 = Z\u00e1sobn\u00edk
JMSMQ5103 = Zp\u016fsobil: {0} --> Zpr\u00e1va
JMSMQ5104 = K\u00f3d chyby
JMSMQ5105 = Vysv\u011btlen\u00ed
JMSMQ5106 = Akce u\u017eivatele
JMSMQ5107 = K\u00f3d dokon\u010den\u00ed
JMSMQ5108 = K\u00f3d p\u0159\u00ed\u010diny
JMSMQ5109 = Protokol - zpr\u00e1va
JMSMQ5110 = Protokol - vysv\u011btlen\u00ed
JMSMQ5111 = Protokol - z\u00e1va\u017enost
JMSMQ5112 = Souhrn protokolu
JMSMQ5113 = Akce u\u017eivatele
JMSMQ5114 = Prob\u00edh\u00e1 spou\u0161t\u011bn\u00ed modulu {0} z um\u00edst\u011bn\u00ed {1}
JMSMQ5115 = Nastaven\u00ed vlastnost\u00ed tov\u00e1rny p\u0159ipojen\u00ed typu Fronta se nezda\u0159ilo.


#MQJMSPSIVT messages
JMSMQ5039 = Ov\u011b\u0159ovac\u00ed test instalace slu\u017eby publikov\u00e1n\u00ed/odb\u011bru
JMSMQ5040 = Prob\u00edh\u00e1 na\u010d\u00edt\u00e1n\u00ed objektu TopicConnectionFactory z rozhran\u00ed JNDI.
JMSMQ5041 = Nelze na\u010d\u00edst objekt TopicConnectionFactory z rozhran\u00ed JNDI.
JMSMQ5042 = Prob\u00edh\u00e1 na\u010d\u00edt\u00e1n\u00ed objektu Topic z rozhran\u00ed JNDI.
JMSMQ5043 = Nelze na\u010d\u00edst objekt Topic z rozhran\u00ed JNDI.
JMSMQ5044 = Prob\u00edh\u00e1 vytv\u00e1\u0159en\u00ed objektu TopicConnectionFactory.
JMSMQ5045 = Nelze vytvo\u0159it objekt TopicConnectionFactory.
JMSMQ5046 = Prob\u00edh\u00e1 vytv\u00e1\u0159en\u00ed objektu Topic.
JMSMQ5047 = Nelze vytvo\u0159it objekt Topic pomoc\u00ed jin\u00fdch metod ne\u017e metod rozhran\u00ed JNDI.
JMSMQ5048 = Prob\u00edh\u00e1 vytv\u00e1\u0159en\u00ed objektu TopicPublisher.
JMSMQ5049 = Prob\u00edh\u00e1 vytv\u00e1\u0159en\u00ed objektu TopicSubscriber.
JMSMQ5050 = P\u0159id\u00e1n\u00ed textu
JMSMQ5051 = Zpr\u00e1va je publikov\u00e1na v {0}
JMSMQ5052 = \u010cek\u00e1n\u00ed na p\u0159\u00edchod zpr\u00e1vy [maxim\u00e1ln\u00ed doba 5 sekund]...
JMSMQ5053 = *** Nebyla zaznamen\u00e1na \u017e\u00e1dn\u00e1 odezva zprost\u0159edkovatele. Ov\u011b\u0159te, zda je zprost\u0159edkovatel spu\u0161t\u011bn. Pou\u017e\u00edv\u00e1te-li zprost\u0159edkovatele IBM MQ, ov\u011b\u0159te, zda je pro parametr brokerVersion nastavena hodnota V1. ***
JMSMQ5053.documentation = Nebyla zaznamen\u00e1na \u017e\u00e1dn\u00e1 odezva zprost\u0159edkovatele. \
<br> <b>Vysv\u011btlen\u00ed:</b> Mo\u017en\u00e9 p\u0159\u00ed\u010diny: <sl> <li>Zprost\u0159edkovatel nen\u00ed spu\u0161t\u011bn. \
<li>V r\u00e1mci tov\u00e1rny p\u0159ipojen\u00ed typu T\u00e9ma pou\u017e\u00edv\u00e1te nastaven\u00ed BrokerVersion=V2 pro zprost\u0159edkovatele publikov\u00e1n\u00ed/odb\u011bru produktu IBM MQ, co \u017e nen\u00ed podporov\u00e1no. \
<li>Zprost\u0159edkovatel odm\u00edtl publikov\u00e1n\u00ed nebo odb\u011br a um\u00edstil jej do fronty SYSTEM.DEAD.LETTER.QUEUE </sl> <br> <b>Odezva u\u017eivatele:</b> Zkontrolujte, zda je zprost\u0159edkovatel spu\u0161t\u011bn. \
V protokolu syst\u00e9mov\u00fdch ud\u00e1lost\u00ed zkontrolujte chybov\u00e9 zpr\u00e1vy zprost\u0159edkovatele. \
Zkontrolujte, zda zprost\u0159edkovatel podporuje pou\u017eit\u00e9 nastaven\u00ed BrokerVersion. \
Zkontrolujte odm\u00edtnut\u00e9 zpr\u00e1vy ve front\u011b SYSTEM.DEAD.LETTER.QUEUE.

JMSMQ5054 = Zprost\u0159edkovatel je pravd\u011bpodobn\u011b spu\u0161t\u011bn, av\u0161ak zpr\u00e1va nebyla doru\u010dena.
JMSMQ5054.documentation = Zprost\u0159edkovatel je pravd\u011bpodobn\u011b spu\u0161t\u011bn, av\u0161ak zpr\u00e1va nebyla doru\u010dena. \
<br> <b>Vysv\u011btlen\u00ed:</b> Zpr\u00e1va je generov\u00e1na ov\u011b\u0159ovac\u00edm testem instalace, pokud dojde k selh\u00e1n\u00ed odb\u011bratele p\u0159i p\u0159\u00edjmu publikovan\u00e9 zpr\u00e1vy. \
<br> <b>Odezva u\u017eivatele:</b> Zkontrolujte, \u017ee je zprost\u0159edkovatel spr\u00e1vn\u011b nastaven. \
V protokolech syst\u00e9mov\u00fdch ud\u00e1lost\u00ed zkontrolujte chybov\u00e9 zpr\u00e1vy zprost\u0159edkovatele. \
Zkontrolujte zpr\u00e1vy odm\u00edtnut\u00e9 zprost\u0159edkovatelem ve front\u011b SYSTEM.DEAD.LETTER.QUEUE.

JMSMQ5055 = P\u0159\u00edkaz PSIVT se nezda\u0159il.
JMSMQ5056 = Prob\u00edh\u00e1 zav\u0159en\u00ed objektu TopicSubscriber.
JMSMQ5057 = Prob\u00edh\u00e1 zav\u0159en\u00ed objektu TopicPublisher.
JMSMQ5059 = Zpracov\u00e1n\u00ed p\u0159\u00edkazu PSIVT bylo dokon\u010deno.
JMSMQ5060 = Nelze se p\u0159ipojit ke spr\u00e1vci front.
JMSMQ5060.documentation = Nelze se p\u0159ipojit ke spr\u00e1vci front. \
<br> <b>Vysv\u011btlen\u00ed:</b> Zpr\u00e1va je generov\u00e1na ov\u011b\u0159ovac\u00edm testem instalace. \
<br> <b>Odezva u\u017eivatele:</b> Zkontrolujte, zda je spr\u00e1vce front spu\u0161t\u011bn a \u017ee je jeho n\u00e1zev v parametrech IVTTest uveden spr\u00e1vn\u011b.

JMSMQ5061 = Nelze z\u00edskat p\u0159\u00edstup k front\u011b \u0159\u00edzen\u00ed zprost\u0159edkovatele ve spr\u00e1vci front.
JMSMQ5061.documentation = Nelze z\u00edskat p\u0159\u00edstup k front\u011b \u0159\u00edzen\u00ed zprost\u0159edkovatele ve spr\u00e1vci front. \
<br> <b>Odezva u\u017eivatele:</b> Ov\u011b\u0159te, zda fronta \u0159\u00edzen\u00ed existuje. \
V\u00fdchoz\u00ed n\u00e1zev je SYSTEM.BROKER.CONTROL.QUEUE.

JMSMQ5062 = Ov\u011b\u0159te, zda je zprost\u0159edkovatel v tomto spr\u00e1vci front nainstalov\u00e1n.
JMSMQ5063 = Vyskytla se v\u00fdjimka v procesu 'brokerIsRunning'.
JMSMQ5069 = Pou\u017eit\u00ed:
JMSMQ5070 = PSIVTRun -url adresaURLposkytovatele [-icf po\u010d\u00e1te\u010dn\u00edTov\u00e1rnaKontextu] [-t]
JMSMQ5071 = PSIVTRun -nojndi [-m spr_fr] [-bqm zprost\u0159edkovatel] [-t] [-v verze_poskytov]
JMSMQ5072 = PSIVTRun -nojndi -client -m spr_fr -host n\u00e1z_host [-port port] [-channel kan\u00e1l] [-bqm zprost\u0159edkovatel] [-ccsid ccsid] [-t] [-v verze_poskytov]
JMSMQ5073 = Prob\u00edh\u00e1 vytv\u00e1\u0159en\u00ed synchronn\u00ed relace.
JMSMQ5074 = Prob\u00edh\u00e1 vytv\u00e1\u0159en\u00ed asynchronn\u00ed relace.
JMSMQ5075 = Prob\u00edh\u00e1 spu\u0161t\u011bn\u00ed p\u0159ipojen\u00ed.
JMSMQ5076 = Byl spu\u0161t\u011bn modul listener pro zpr\u00e1vy.
JMSMQ5077 = Byl nastaven modul listener pro zpr\u00e1vy.
JMSMQ5078 = Parametry hostitele, portu ani kan\u00e1lu nelze nastavit bez p\u0159ipojen\u00ed klienta.
JMSMQ5079 = Obslu\u017en\u00fd program vy\u010di\u0161t\u011bn\u00ed publikov\u00e1n\u00ed/odb\u011bru
JMSMQ5080 = Pou\u017eit\u00ed:
JMSMQ5081 = Cleanup [-m spr\u00e1vceFront] [-r interval] [SAFE | STRONG | FORCE | NONDUR] [-t]
JMSMQ5082 = Cleanup -client [-m spr\u00e1vceFront] -host n\u00e1zevHostitele [-port port] [-channel kan\u00e1l]
JMSMQ5083 =         -r interval [SAFE | STRONG | FORCE | NONDUR] [-t]
JMSMQ5084 = Vy\u010di\u0161t\u011bn\u00ed je dokon\u010deno.
JMSMQ5085 = P\u0159i operaci vy\u010di\u0161t\u011bn\u00ed byla zaznamen\u00e1na v\u00fdjimka:
JMSMQ5086 = Propojen\u00e1 v\u00fdjimka:
JMSMQ5090 = Je nutn\u00e9 zadat jednu z hodnot SAFE, STRONG, FORCE nebo NONDUR.
JMSMQ5091 = P\u0159i pou\u017eit\u00ed p\u0159ipojen\u00ed klienta je nutn\u00e9 zadat n\u00e1zev hostitele.
JMSMQ5092 = Za polo\u017ekou {0} n\u00e1sleduje jin\u00e1 ne\u017e \u010d\u00edseln\u00e1 hodnota.
JMSMQ5093 = Nerozpoznan\u00fd parametr {0}.
JMSMQ5094 = Za polo\u017ekou {0} je o\u010dek\u00e1v\u00e1n argument.
JMSMQ5095 = IVT se nezda\u0159ilo, dal\u0161\u00ed informace naleznete v p\u0159edch\u00e1zej\u00edc\u00ed chybov\u00e9 zpr\u00e1v\u011b.

#MQJMS messages
JMSMQ0003 = M\u00edsto ur\u010den\u00ed nen\u00ed rozpozn\u00e1no nebo ji\u017e nen\u00ed platn\u00e9.
JMSMQ0003.explanation = Je mo\u017en\u00e9, \u017ee fronta \u010di t\u00e9ma ji\u017e nen\u00ed k dispozici, aplikace pou\u017e\u00edv\u00e1 nespr\u00e1vn\u00e9 p\u0159ipojen\u00ed pro p\u0159\u00edslu\u0161nou frontu \u010di t\u00e9ma nebo typ zadan\u00e9ho um\u00edst\u011bn\u00ed nen\u00ed pro tuto metodu spr\u00e1vn\u00fd.
JMSMQ0003.useraction = Zkontrolujte, \u017ee je produkt IBM MQ st\u00e1le spu\u0161t\u011bn a spr\u00e1vce front je k dispozici. Zkontrolujte, \u017ee se pro frontu \u010di t\u00e9ma pou\u017e\u00edv\u00e1 spr\u00e1vn\u00e9 p\u0159ipojen\u00ed.
JMSMQ0003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException
JMSMQ0003.documentation = M\u00edsto ur\u010den\u00ed nen\u00ed rozpozn\u00e1no nebo ji\u017e nen\u00ed platn\u00e9. \
<br> <b>Vysv\u011btlen\u00ed:</b> Je mo\u017en\u00e9, \u017ee fronta \u010di t\u00e9ma ji\u017e nen\u00ed k dispozici, aplikace pou\u017e\u00edv\u00e1 nespr\u00e1vn\u00e9 p\u0159ipojen\u00ed pro p\u0159\u00edslu\u0161nou frontu \u010di t\u00e9ma nebo typ zadan\u00e9ho um\u00edst\u011bn\u00ed nen\u00ed pro tuto metodu spr\u00e1vn\u00fd. \
<br> <b>Odezva u\u017eivatele:</b> Zkontrolujte, \u017ee je produkt IBM MQ st\u00e1le spu\u0161t\u011bn a spr\u00e1vce front je k dispozici. \
Zkontrolujte, \u017ee se pro frontu \u010di t\u00e9ma pou\u017e\u00edv\u00e1 spr\u00e1vn\u00e9 p\u0159ipojen\u00ed.

JMSMQ1006 = Nespr\u00e1vn\u00e1 hodnota pro vlastnost {0}: {1}.
JMSMQ1006.explanation = Hodnota zadan\u00e1 pro vlastnost le\u017e\u00ed mimo rozsah platn\u00fdch hodnot.
JMSMQ1006.useraction = Zkontrolujte zadanou hodnotu.
JMSMQ1006.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_VALUE
JMSMQ1006.documentation = Hodnota {1} vlastnosti {0} nen\u00ed platn\u00e1. \
<br> <b>Vysv\u011btlen\u00ed:</b> Hodnota {1} vlastnosti {0} nen\u00ed spr\u00e1vn\u00e1. \
<br> <b>Odezva u\u017eivatele:</b> Ov\u011b\u0159te zadanou hodnotu. 

JMSMQ0012 = Po vytvo\u0159en\u00ed tov\u00e1rny p\u0159ipojen\u00ed nebo m\u00edsta ur\u010den\u00ed ji\u017e nelze zm\u011bnit verzi.
JMSMQ0012.useraction = Zadejte spr\u00e1vnou verzi p\u0159i vytvo\u0159en\u00ed tov\u00e1rny p\u0159ipojen\u00ed nebo m\u00edsta ur\u010den\u00ed.
JMSMQ0012.documentation = Po vytvo\u0159en\u00ed tov\u00e1rny p\u0159ipojen\u00ed ji\u017e nelze zm\u011bnit verzi.

JMSMQ1096 = Chybn\u00fd odkaz na zpr\u00e1vu.
JMSMQ1096.explanation = T\u00e9to metod\u011b byl p\u0159ed\u00e1n nespr\u00e1vn\u011b utvo\u0159en\u00fd odkaz na zpr\u00e1vu. Odkaz na zpr\u00e1vu mus\u00ed b\u00fdt instanc\u00ed t\u0159\u00eddy MQMessageReference.
JMSMQ1096.useraction = Zajist\u011bte pou\u017eit\u00ed spr\u00e1vn\u00fdch odkaz\u016f na zpr\u00e1vy.
JMSMQ1096.documentation = Neplatn\u00fd odkaz na zpr\u00e1vu.

JMSMQ1112 = Operace pro objekt specifick\u00fd pro konkr\u00e9tn\u00ed dom\u00e9nu byla neplatn\u00e1. Operace {0} je pro typ {1} neplatn\u00e1.
JMSMQ1112.explanation = Aplikace syst\u00e9mu JMS se pokusila o proveden\u00ed operace s objektem specifick\u00fdm pro konkr\u00e9tn\u00ed dom\u00e9nu, operace je v\u0161ak platn\u00e1 pouze pro zb\u00fdvaj\u00edc\u00ed dom\u00e9nu syst\u00e9mu zpr\u00e1v.
JMSMQ1112.useraction = Ov\u011b\u0159te, \u017ee jsou objekty syst\u00e9mu JMS a operace pou\u017e\u00edvan\u00e9 aplikac\u00ed relevantn\u00ed pro po\u017eadovanou dom\u00e9nu syst\u00e9mu zpr\u00e1v. Pokud aplikace pou\u017e\u00edv\u00e1 ob\u011b dom\u00e9ny syst\u00e9mu zpr\u00e1v, uva\u017eujte o pou\u017eit\u00ed objekt\u016f nez\u00e1visl\u00fdch na dom\u00e9n\u011b v cel\u00e9 aplikaci.
JMSMQ1112.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_TYPE
JMSMQ1112.documentation = Operace pro objekt specifick\u00fd pro konkr\u00e9tn\u00ed dom\u00e9nu byla neplatn\u00e1. \
<br> <b>Vysv\u011btlen\u00ed:</b> Aplikace syst\u00e9mu JMS se pokusila o proveden\u00ed operace s objektem specifick\u00fdm pro konkr\u00e9tn\u00ed dom\u00e9nu, operace je v\u0161ak platn\u00e1 pouze pro zb\u00fdvaj\u00edc\u00ed dom\u00e9nu syst\u00e9mu zpr\u00e1v. \
<br> <b>Odezva u\u017eivatele:</b> Ov\u011b\u0159te, \u017ee jsou objekty syst\u00e9mu JMS pou\u017e\u00edvan\u00e9 aplikac\u00ed relevantn\u00ed pro po\u017eadovanou dom\u00e9nu syst\u00e9mu zpr\u00e1v. \
Pokud aplikace pou\u017e\u00edv\u00e1 ob\u011b dom\u00e9ny syst\u00e9mu zpr\u00e1v, uva\u017eujte o pou\u017eit\u00ed objekt\u016f nez\u00e1visl\u00fdch na dom\u00e9n\u011b v cel\u00e9 aplikaci.

JMSMQ1113 = Nen\u00ed nastaven n\u00e1zev m\u00edsta ur\u010den\u00ed.
JMSMQ1113.explanation = Prob\u011bhl pokus o pou\u017eit\u00ed objektu MQQueue nebo MQTopic vytvo\u0159en\u00e9ho pomoc\u00ed v\u00fdchoz\u00edho konstruktoru. Pot\u00e9 m\u011bl b\u00fdt p\u0159ed pou\u017eit\u00edm fronty nejprve nastaven n\u00e1zev.
JMSMQ1113.useraction = Po vytvo\u0159en\u00ed objektu MQQueue nebo MQTopic nastavte jeho n\u00e1zev.
JMSMQ1113.documentation = Nen\u00ed nastaven n\u00e1zev m\u00edsta ur\u010den\u00ed. \
<br> <b>Vysv\u011btlen\u00ed:</b> Prob\u011bhl pokus o pou\u017eit\u00ed objektu MQQueue nebo MQTopic vytvo\u0159en\u00e9ho pomoc\u00ed v\u00fdchoz\u00edho konstruktoru. P\u0159ed pou\u017eit\u00edm fronty je t\u0159eba nastavit n\u00e1zev. \
<br> <b>Odezva u\u017eivatele:</b> Po vytvo\u0159en\u00ed objektu MQQueue nebo MQTopic nastavte jeho n\u00e1zev.

JMSMQ1114 = Metoda {0} je intern\u00ed a nesm\u00ed b\u00fdt vol\u00e1na.
JMSMQ1114.explanation = Prob\u011bhl pokus o pou\u017eit\u00ed metody, kter\u00e1 je ur\u010dena jen k intern\u00edmu pou\u017eit\u00ed. Tato metoda nen\u00ed sou\u010d\u00e1st\u00ed publikovan\u00e9ho rozhran\u00ed API a nesm\u00ed se pou\u017e\u00edvat.
JMSMQ1114.useraction = Odeberte z aplikace vol\u00e1n\u00ed uveden\u00e9 metody. Dal\u0161\u00ed informace v\u00e1m poskytnou pracovn\u00edci servisu IBM.
JMSMQ1114.inserts = XMSC_INSERT_METHOD
JMSMQ1114.documentation = Ur\u010den\u00e1 metoda je intern\u00ed a nesm\u00ed b\u00fdt vol\u00e1na. \
<br> <b>Vysv\u011btlen\u00ed:</b> Prob\u011bhl pokus o pou\u017eit\u00ed metody, kter\u00e1 je ur\u010dena jen k intern\u00edmu pou\u017eit\u00ed. \
Tato metoda nen\u00ed sou\u010d\u00e1st\u00ed publikovan\u00e9ho rozhran\u00ed API a nesm\u00ed se pou\u017e\u00edvat. \
<br> <b>Odezva u\u017eivatele:</b> Odeberte z aplikace vol\u00e1n\u00ed uveden\u00e9 metody. \
Dal\u0161\u00ed informace v\u00e1m poskytnou pracovn\u00edci servisu IBM.

JMSMQ1115 = Nebyly nalezeny \u017e\u00e1dn\u00e9 komponenty.
JMSMQ1115.explanation = Spr\u00e1vce komponent nenalezl \u017e\u00e1dn\u00e9 komponenty.
JMSMQ1115.useraction = Ov\u011b\u0159te spr\u00e1vnost instalace a nastaven\u00ed prom\u011bnn\u00e9 CLASSPATH.
JMSMQ1115.documentation = Nebyly nalezeny \u017e\u00e1dn\u00e9 komponenty. \
<br> <b>Vysv\u011btlen\u00ed:</b> Spr\u00e1vce komponent nenalezl \u017e\u00e1dn\u00e9 komponenty. \
<br> <b>Odezva u\u017eivatele:</b> Ov\u011b\u0159te spr\u00e1vnost instalace a nastaven\u00ed prom\u011bnn\u00e9 CLASSPATH.

JMSMQ1120 = Funkce Cleanup nen\u00ed podporov\u00e1na u po\u017eadovan\u00e9 verze poskytovatele ''{0}''.
JMSMQ1120.explanation = Operace vykonan\u00e9 funkc\u00ed Cleanup nejsou vy\u017eadov\u00e1ny pro po\u017eadovanou verzi poskytovatele.
JMSMQ1120.useraction = Zkontrolujte, \u017ee je verze dodan\u00e9ho poskytovatele spr\u00e1vn\u00e1.
JMSMQ1120.inserts = XMSC_WMQ_PROVIDER_VERSION
JMSMQ1120.documentation = Funkce Cleanup nen\u00ed podporov\u00e1na u po\u017eadovan\u00e9 verze poskytovatele. \
<br> <b>Vysv\u011btlen\u00ed:</b> Operace vykonan\u00e9 funkc\u00ed Cleanup nejsou vy\u017eadov\u00e1ny pro po\u017eadovanou verzi poskytovatele. <br> <b>Odezva u\u017eivatele:</b> Zkontrolujte, \u017ee je verze dodan\u00e9ho poskytovatele spr\u00e1vn\u00e1.

JMSMQ1121 = Objekt ConnectionMetaData byl vytvo\u0159en pomoc\u00ed konstruktoru, nikoli z\u00edsk\u00e1n z p\u0159ipojen\u00ed.
JMSMQ1121.explanation = Objekty ConnectionMetaData by m\u011bly b\u00fdt z\u00edsk\u00e1ny z p\u0159ipojen\u00ed, nikoli p\u0159\u00edmo vytvo\u0159eny. \
Vr\u00e1cen\u00e9 informace o verzi pak mohou b\u00fdt nep\u0159esn\u00e9.
JMSMQ1121.useraction = Z\u00edskejte objekt ConnectionMetaData z p\u0159ipojen\u00ed nebo pou\u017eijte verzi rozhran\u00ed API k z\u00edsk\u00e1n\u00ed statick\u00fdch informac\u00ed o verzi.

JMSMQ1122 = Do\u0161lo k pokusu o nastaven\u00ed vlastnosti nebo dotaz na vlastnost, kter\u00e1 byla zam\u00edtnuta a ji\u017e nen\u00ed podporov\u00e1na.
JMSMQ1122.explanation = Klient JMS ji\u017e tuto vlastnost nepou\u017e\u00edv\u00e1, tak\u017ee by nem\u011bly b\u00fdt vol\u00e1ny metody pro jej\u00ed nastaven\u00ed \u010di dotazov\u00e1n\u00ed na ni.

JMSMQ1123 = P\u0159edpokl\u00e1d\u00e1 se, \u017ee instalace klienta jako knihovny JNI nebyla nalezena. 

