#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR

JMSADM1003 = Materia\u0142y licencjonowane - w\u0142asno\u015b\u0107 firmy IBM\n5724-H72, 5655-R36, 5724-L26, 5655-L82\n(c) Copyright IBM Corp. 2008, 2016 Wszelkie prawa zastrze\u017cone.\nZastrze\u017cone prawa instytucji rz\u0105dowych USA - Korzystanie,\npowielanie lub ujawnianie zastrze\u017cone kontraktem GSA ADP Schedule Contract\nz firm\u0105 IBM Corp.
JMSADM1016 = Wyst\u0105pi\u0142 b\u0142\u0105d wewn\u0119trzny. Szczeg\u00f3\u0142y: {0}. Wi\u0119cej informacji zawiera do\u0142\u0105czony kod zako\u0144czenia oraz opis przyczyny wyj\u0105tku produktu IBM MQ.
JMSADM1016.useraction = Zapisz wszystkie wygenerowane pliki wyj\u015bciowe i skorzystaj z serwisu dzia\u0142u wsparcia dla produktu WMQ (http://www.ibm.com/software/integration/wmq/support/) lub programu IBM Support Assistant (ISA) (http://www.ibm.com/software/support/isa/) w celu sprawdzenia, czy rozwi\u0105zanie jest ju\u017c dost\u0119pne.  Je\u015bli znalezienie zgodnego przypadku nie jest mo\u017cliwe, skontaktuj si\u0119 z dzia\u0142em wsparcia IBM.
JMSADM1059 = B\u0142\u0105d krytyczny - kodowanie UTF-8 nie jest obs\u0142ugiwane. 
JMSADM1059.explanation = U\u017cywane \u015brodowisko wykonawcze Java(tm) nie obs\u0142uguje kodowania znak\u00f3w UTF-8. W przypadku produktu IBM MQ classes for JMS wymagana jest obs\u0142uga tego kodowania w celu wykonania niekt\u00f3rych operacji. 
JMSADM1059.useraction = Aby dowiedzie\u0107 si\u0119, w jaki spos\u00f3b uzyska\u0107 wsparcie dotycz\u0105ce kodowania znak\u00f3w UTF-8, zapoznaj si\u0119 z dokumentacj\u0105 i/lub skonsultuj si\u0119 z dostawc\u0105 \u015brodowiska wykonawczego Java(tm).
JMSADM4000 = Uruchamianie narz\u0119dzia administracyjnego produktu IBM MQ classes for Java(tm) Message Service
JMSADM4001 = Zatrzymywanie narz\u0119dzia administracyjnego produktu IBM MQ classes for Java(tm) Message Service
JMSADM4002 = Inicjowanie kontekstu JNDI...
JMSADM4003 = Gotowe.
JMSADM4007 = InitCtx
JMSADM4008 = B\u0142\u0105d
JMSADM4009 = Kontekst nie jest pusty
JMSADM4053 = Typ transportu
JMSADM4085 = Witamy w interfejsie wiersza komend narz\u0119dzia administracyjnego produktu IBM MQ JMS
JMSADM4086 = B\u0142\u0105d odczytu komendy
JMSADM4087 = Nieznana komenda
JMSADM4089 = {0} - tre\u015b\u0107
JMSADM4094 = INITIAL_CONTEXT_FACTORY
JMSADM4095 = PROVIDER_URL
JMSADM4096 = Nie mo\u017cna odnale\u017a\u0107 powi\u0105zania lub nie mo\u017cna nim administrowa\u0107
JMSADM4097 = Kontekstu nie odnaleziono
JMSADM4098 = Obiekt(y)
JMSADM4099 = Kontekst(y)
JMSADM4100 = Powi\u0105zanie(a)
JMSADM4101 = Administrowany
JMSADM4104 = Obiekt nie jest aktywny, zatem nie mo\u017cna wykona\u0107 dzia\u0142a\u0144 na katalogach
JMSADM4105 = Brak w\u0142a\u015bciwo\u015bci konfiguracji
JMSADM4106 = Obiekt nie jest obiektem administrowanym produktu IBM MQ classes for JMS
JMSADM4110 = Inicjowanie interfejsu JNDI nie powiod\u0142o si\u0119. Sprawd\u017a us\u0142ug\u0119 JNDI i jej ustawienia.
JMSADM4111 = Nie mo\u017cna utworzy\u0107 kontekstu
JMSADM4112 = Nie mo\u017cna utworzy\u0107 poprawnego obiektu; sprawd\u017a udost\u0119pnione parametry
JMSADM4113 = Nie mo\u017cna po\u0142\u0105czy\u0107 z obiektem
JMSADM4115 = Podano niepoprawn\u0105 nazw\u0119
JMSADM4116 = Aby uzyska\u0107 dodatkowe informacje na temat przyczyny problemu, wykonaj komend\u0119 z argumentem -v
JMSADM4117 = Nie mo\u017cna rozstrzygn\u0105\u0107 nazwy {0}
JMSADM4120 = B\u0142\u0105d sk\u0142adniowy
JMSADM4121 = Nie mo\u017cna otworzy\u0107 pliku konfiguracyjnego
JMSADM4122 = Nie mo\u017cna wykona\u0107 polecenia MOVE; w zamian wykonano polecenie COPY
JMSADM4123 = B\u0142\u0105d leksykalny
JMSADM4124 = W\u0142a\u015bciwo\u015b\u0107 dla {0} ma warto\u015b\u0107 NULL
JMSADM4125 = Niepoprawna w\u0142a\u015bciwo\u015b\u0107 dla {0}: {1}
JMSADM4127 = Niepoprawna w\u0142a\u015bciwo\u015b\u0107 w tym kontek\u015bcie
JMSADM4128 = {0} - niepoprawna warto\u015b\u0107 dla w\u0142a\u015bciwo\u015bci: ''{1}''
JMSADM4129 = Nieznana w\u0142a\u015bciwo\u015b\u0107: {0}
JMSADM4130 = Nie odnaleziono kontekstu lub nie mo\u017ce on zosta\u0107 usuni\u0119ty
JMSADM4131 = Oczekiwany typ obiektu nie jest zgodny z rzeczywistym typem obiektu
JMSADM4132 = Rozbie\u017cno\u015b\u0107 atrybut\u00f3w powi\u0105za\u0144 klienckich
JMSADM4133 = Udost\u0119pniono \u0142a\u0144cuch ExitInit bez \u0142a\u0144cucha Exit
JMSADM4134 = Nazwa wyr\u00f3\u017cniaj\u0105ca u\u017cytkownika
JMSADM4135 = Has\u0142o u\u017cytkownika
JMSADM4137 = Nie mo\u017cna utworzy\u0107 okre\u015blonej klasy serwera aplikacji WebSphere. Klasy mog\u0142y nie zosta\u0107 zainstalowane lub dodane do \u015bcie\u017cki klasy.
JMSADM4139 = Podano niepoprawny typ uwierzytelnienia. Zostanie u\u017cyta warto\u015b\u0107 none (brak).
JMSADM4140 = UWAGA: Przekszta\u0142canie obiektu CipherSpec {0} w obiekt CipherSuite {1}
JMSADM4142 = Klasa okre\u015blona we w\u0142a\u015bciwo\u015bci INITIAL_CONTEXT_FACTORY nie zosta\u0142a znaleziona we w\u0142a\u015bciwo\u015bci CLASSPATH
JMSADM5003 = Ignorowanie nieznanej flagi
