#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR

JMSADM1003 = Material bajo licencia - Propiedad de IBM\n5724-H72, 5655-R36, 5724-L26, 5655-L82\n(c) Copyright IBM Corp. 2008, 2016 Reservados todos los derechos.\nDerechos restringidos de los usuarios del Gobierno de los EE.UU.\n- Utilizaci\u00f3n, duplicaci\u00f3n o divulgaci\u00f3n restringida por el GSA\nADP Schedule Contract con IBM Corp.
JMSADM1016 = Se ha producido un error interno. Detalle: ''{0}''. Consulte el c\u00f3digo de raz\u00f3n y el c\u00f3digo de terminaci\u00f3n de la excepci\u00f3n enlazada de IBM MQ para obtener m\u00e1s informaci\u00f3n.
JMSADM1016.useraction = Guarde todos los archivos de salida generados y utilice el sitio de Soporte de WMQ: http://www.ibm.com/software/integration/wmq/support/, o IBM Support Assistant (ISA): http://www.ibm.com/software/support/isa/, para ver si ya hay una soluci\u00f3n disponible.  Si no puede encontrar una soluci\u00f3n, p\u00f3ngase en contacto con el centro de soporte de IBM.
JMSADM1059 = Error muy grave - UTF-8 no est\u00e1 soportada. 
JMSADM1059.explanation = El entorno de ejecuci\u00f3n Java(tm) que est\u00e1 utilizando no da soporte a la codificaci\u00f3n de caracteres UTF-8.  IBM MQ classes for JMS requiere soporte para esta codificaci\u00f3n para realizar algunas operaciones. 
JMSADM1059.useraction = Consulte la documentaci\u00f3n y/o el proveedor de su entorno de ejecuci\u00f3n Java(tm) para determinar c\u00f3mo obtener soporte para la codificaci\u00f3n de caracteres UTF-8.
JMSADM4000 = Iniciando la administraci\u00f3n del servicio de mensajes de IBM MQ classes for Java(tm)
JMSADM4001 = Deteniendo la administraci\u00f3n del servicio de mensajes de IBM MQ classes for Java(tm)
JMSADM4002 = Inicializando el contexto JNDI...
JMSADM4003 = Terminado.
JMSADM4007 = InitCtx
JMSADM4008 = Error
JMSADM4009 = El contexto no est\u00e1 vac\u00edo
JMSADM4053 = Tipo de transporte
JMSADM4085 = Bienvenido a la interfaz de l\u00ednea de mandatos de la herramienta de administraci\u00f3n de JMS de IBM MQ
JMSADM4086 = Error de lectura del mandato
JMSADM4087 = Mandato desconocido
JMSADM4089 = Contenido de ''{0}''
JMSADM4094 = INITIAL_CONTEXT_FACTORY
JMSADM4095 = PROVIDER_URL
JMSADM4096 = Enlace no administrable o no encontrado
JMSADM4097 = Contexto no encontrado
JMSADM4098 = Objeto(s)
JMSADM4099 = Contexto(s)
JMSADM4100 = Enlace(s)
JMSADM4101 = Administrado
JMSADM4104 = El objeto est\u00e1 inactivo, por lo que no se pueden realizar operaciones de directorio
JMSADM4105 = Faltan propiedades de configuraci\u00f3n
JMSADM4106 = El objeto no es un objeto administrado de IBM MQ classes for JMS
JMSADM4110 = La inicializaci\u00f3n de JNDI ha fallado; por favor compruebe los valores de JNDI y el servicio.
JMSADM4111 = No se ha podido crear el contexto
JMSADM4112 = No se ha podido crear un objeto v\u00e1lido, compruebe los par\u00e1metros suministrados
JMSADM4113 = No se puede enlazar el objeto
JMSADM4115 = Se ha suministrado un nombre incorrecto
JMSADM4116 = Para obtener informaci\u00f3n adicional sobre la raz\u00f3n de este problema, ejec\u00fatelo con el argumento -v
JMSADM4117 = El nombre ''{0}'' no se puede resolver.
JMSADM4120 = Error de sintaxis
JMSADM4121 = No se puede abrir el archivo de configuraci\u00f3n
JMSADM4122 = No se ha podido completar la acci\u00f3n MOVE; en su lugar se ha realizado una acci\u00f3n COPY
JMSADM4123 = Error l\u00e9xico
JMSADM4124 = El valor de propiedad para ''{0}'' es nulo
JMSADM4125 = Propiedad incorrecta para ''{0}'': ''{1}''
JMSADM4127 = Propiedad incorrecta en este contexto
JMSADM4128 = Valor incorrecto para la propiedad ''{0}'': ''{1}''
JMSADM4129 = Propiedad desconocida: ''{0}''
JMSADM4130 = No se ha encontrado el contexto o no se puede eliminar
JMSADM4131 = Los tipos de objeto previsto y real no coinciden
JMSADM4132 = Conflicto de atributos de enlaces de cliente
JMSADM4133 = Se ha suministrado una serie ExitInit sin la serie Exit
JMSADM4134 = DN de usuario
JMSADM4135 = Contrase\u00f1a de usuario
JMSADM4137 = No se puede crear una clase espec\u00edfica de WebSphere Application Server. Es posible que las clases no se hayan instalado o no se hayan a\u00f1adido a la v\u00eda de acceso de clases.
JMSADM4139 = Se ha suministrado un tipo de autenticaci\u00f3n incorrecto - se utiliza 'ninguno'
JMSADM4140 = AVISO: Convirtiendo CipherSpec ''{0}'' a CipherSuite ''{1}''
JMSADM4142 = La clase especificada por INITIAL_CONTEXT_FACTORY no se ha encontrado en CLASSPATH
JMSADM5003 = Se omite el distintivo desconocido
