#
#  <copyright
#   notice="lm-source-program"
#   pids="5724-H72"
#   years="2008,2017"
#   crc="2248028677" >
#   Licensed Materials - Property of IBM
#                                          
#   5724-H72                           
#                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.
#                                                      
#   US Government Users Restricted Rights - Use, duplication or
#   disclosure restricted by GSA ADP Schedule Contract with
#   IBM Corp.                                           
#   </copyright>   
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
SEVERITY=10
PROGNOTE=5724-H72 (C) Copyright IBM Corp. 1994 All rights reserved
MSG=Echec du chargement de la biblioth\u00e8que JNI native &MQ_long : \'&3\'.
XPL=La biblioth\u00e8que JNI native \'&3\' n'a pas pu \u00eatre charg\u00e9e, car elle est introuvable. \
&p &p La machine virtuelle Java a tent\u00e9 de charger la biblioth\u00e8que native de la plateforme \'&3\',&p qui \u00e9tait mapp\u00e9e au nom de fichier : \'&2\'.&p &p \
Lors de la tentative de chargement de la biblioth\u00e8que, la machine virtuelle Java a signal\u00e9 le message&p d'erreur :&p &1&p &p La taille en bits de la JVM \
est : \'&4\'&p &p Le \
chemin qui a \u00e9t\u00e9 utilis\u00e9 pour localiser cette biblioth\u00e8que \u00e9tait :&p &5&p &p V\u00e9rifiez que la taille en bits de la machine virtuelle Java correspond \u00e0 \
celle du premier&p \
fichier de biblioth\u00e8que native situ\u00e9 dans cette liste de&p r\u00e9pertoires java.library.path.&p &p La biblioth\u00e8que native \'&3\' est utilis\u00e9e par &MQ_long \
classes for &p Java et &MQ_long classes for JMS lors de la cr\u00e9ation d'une connexion au &p gestionnaire de files d'attente \u00e0 l'aide \
d'une connexion en mode liaisons.  \
Une connexion en mode &p liaisons utilise la m\u00e9moire du syst\u00e8me pour&p communiquer avec le gestionnaire de files d'attente, contrairement \u00e0 une connexion \
en mode client&p qui utilise un connecteur TCP/IP.&p &p Les communications avec un gestionnaire de files d'attente \u00e0 l'aide d'une connexion en mode &p \
liaisons est possible si le gestionnaire est situ\u00e9 sur le m\u00eame syst\u00e8me que &p &MQ_long classes for Java/JMS.  \
Si ce n'est pas le cas dans&p votre environnement, envisagez de reconfigurer l'application pour utiliser&p les connexions en mode client.p& 
URESP=V\u00e9rifiez que le chemin d'acc\u00e8s de la biblioth\u00e8que java pointe vers l'emplacement de la biblioth\u00e8que JNI.
# THIS FILE MUST BE MAINTAINED CONSISTENTLY WITH THE EQUIVALENT '.MSG' FILE IN THE mqdist_nls COMPONENT
