#
#  <copyright
#   notice="lm-source-program"
#   pids="5724-H72"
#   years="2008,2017"
#   crc="2248028677" >
#   Licensed Materials - Property of IBM
#                                          
#   5724-H72                           
#                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.
#                                                      
#   US Government Users Restricted Rights - Use, duplication or
#   disclosure restricted by GSA ADP Schedule Contract with
#   IBM Corp.                                           
#   </copyright>   
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
SEVERITY=30
PROGNOTE=5724-H72 (C) Copyright IBM Corp. 2006, 2009 V\u0161echna pr\u00e1va vyhrazena.
MSG=Chybn\u00fd certifik\u00e1t SSL pro kan\u00e1l \'&3\'.
XPL=Certifik\u00e1t zji\u0161t\u011bn\u00fd v pr\u016fb\u011bhu nav\u00e1z\u00e1n\u00ed komunikace SSL v\u00fdm\u011bnou potvrzen\u00ed je z jednoho z n\u00e1sleduj\u00edc\u00edch d\u016fvod\u016f pova\u017eov\u00e1n za chybn\u00fd: &B (a) byl nespr\u00e1vn\u011b form\u00e1tov\u00e1n a nebylo mo\u017en\u00e9 jej ov\u011b\u0159it; &B (b) byl form\u00e1tov\u00e1n spr\u00e1vn\u011b, ale selhalo ov\u011b\u0159en\u00ed proti ko\u0159eni certifika\u010dn\u00ed autority (CA) a dal\u0161\u00edm certifik\u00e1t\u016fm v lok\u00e1ln\u00edm syst\u00e9mu; &B (c) byl nalezen v seznamu odvolan\u00fdch certifik\u00e1t\u016f (CRL) na serveru LDAP; &B (d) seznam odvolan\u00fdch certifik\u00e1t\u016f (CRL) byl ur\u010den, ale nebyl nalezen na serveru LDAP; &B (e) odpov\u00eddac\u00ed modul protokolu OCSP indikuje, \u017ee byl odvol\u00e1n; &P N\u00e1zev kan\u00e1lu je \'&3\'. V n\u011bkter\u00fdch p\u0159\u00edpadech n\u00e1zev nelze ur\u010dit a zobraz\u00ed se jako \'????\'. Vzd\u00e1len\u00fd hostitel je \'&5\'. Kan\u00e1l nebyl spu\u0161t\u011bn.
URESP=Zkontrolujte, kter\u00e1 z mo\u017en\u00fdch p\u0159\u00ed\u010din se vztahuje na v\u00e1\u0161 syst\u00e9m. Opravte chybu a spus\u0165te kan\u00e1l znovu.
# THIS FILE MUST BE MAINTAINED CONSISTENTLY WITH THE EQUIVALENT '.MSG' FILE IN THE mqdist_nls COMPONENT
