# ===========================================================================
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2017"                                              
#   crc="2248028677" >                                             
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2017 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# ===========================================================================
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR
# %Z% %W% %I% %E% %U%

# ---------------------------------------------------------------------------------
#
# Component JMS Standard Exceptions Message Identifiers
# Group prefix '0'
#
# ---------------------------------------------------------------------------------
MQJMS0000 = Soit la m\u00e9thode ''{0}'' a \u00e9t\u00e9 appel\u00e9e \u00e0 un moment interdit ou inappropri\u00e9, soit le fournisseur ne se trouve pas dans l''\u00e9tat appropri\u00e9 pour l''op\u00e9ration demand\u00e9e.
MQJMS0000.inserts = XMSC_INSERT_NAME

MQJMS0002 = IBM MQ classes for JMS a tent\u00e9 de d\u00e9finir un ID client de connexion non valide.
MQJMS0003 = La destination n'est pas reconnue ou elle n'est plus valide.
MQJMS0004 = IBM MQ classes for JMS a envoy\u00e9 au fournisseur JMS un s\u00e9lecteur de messages dont la syntaxe est incorrecte.
MQJMS0005 = Une fin de flot inattendue a \u00e9t\u00e9 atteinte lors de la lecture de StreamMessage ou BytesMessage.
MQJMS0006 = IBM MQ classes for JMS tente d'utiliser un type de donn\u00e9es non pris en charge par un message ou de lire des donn\u00e9es de type incorrect.
MQJMS0007 = IBM MQ classes for JMS tente de lire un message accessible en \u00e9criture seule.
MQJMS0008 = IBM MQ classes for JMS tente d'\u00e9crire un message accessible en lecture seule.
MQJMS0009 = IBM MQ classes for JMS ne parvient pas \u00e0 allouer les ressources requises pour une m\u00e9thode.
MQJMS0010 = L'op\u00e9ration n'est pas valide car une transaction est en cours.
MQJMS0011 = L'appel Session.commit a provoqu\u00e9 l'invalidation de la transaction en cours.
MQJMS0012 = Le format de l'URI n'est pas correct : file-d'attente://NomGestFileAttente/nomFileAttente [paires valeur-nom].

# ---------------------------------------------------------------------------------
#
# Component Common - group prefix '1'
#
# ---------------------------------------------------------------------------------

MQJMS1000 = Impossible de cr\u00e9er le message JMS.
MQJMS1001 = Mode d''accus\u00e9 de r\u00e9ception ''{0}'' inconnu.
MQJMS1004 = Connexion ferm\u00e9e.
MQJMS1005 = Transition d''\u00e9tat de ''{0}'' \u00e0 ''{1}'' non g\u00e9r\u00e9e.
MQJMS1006 = valeur non valide pour ''{0}'' : ''{1}''.
MQJMS1006.inserts = XMSC_INSERT_NAME, XMSC_INSERT_VALUE

MQJMS1007 = impossible de cr\u00e9er l''instance de classe d''exit ''{0}''.
MQJMS1008 = valeur de transportType inconnue : ''{0}''.
MQJMS1009 = pas de constructeur avec argument de type cha\u00eene.
MQJMS1010 = non impl\u00e9ment\u00e9.
MQJMS1011 = indication d'accr\u00e9ditations de s\u00e9curit\u00e9 incompatible avec l'utilisation de MQ Bindings.
MQJMS1012 = pas de programme d'\u00e9coute des messages.
MQJMS1013 = op\u00e9ration non valide tant que la session utilise la distribution asynchrone.
MQJMS1014 = op\u00e9ration non valide pour le producteur identifi\u00e9.
MQJMS1015 = valeur non valide pour le client cible : ''{0}''.
MQJMS1016 = une erreur interne s''est produite. Faites appel \u00e0 l''administrateur syst\u00e8me. D\u00e9tail : ''{0}''.
MQJMS1017 = file d'attente MQ non locale non valide pour la r\u00e9ception ou l'affichage.
MQJMS1018 = aucune connexion valide n'est disponible.
MQJMS1019 = op\u00e9ration non valide pour une session non transactionnelle.
MQJMS1020 = op\u00e9ration non valide pour une session transactionnelle.
MQJMS1021 = \u00e9chec de la reprise : Impossible de redistribuer un message sans accus\u00e9 de r\u00e9ception.
MQJMS1022 = impossible de r\u00e9acheminer le message.
MQJMS1023 = \u00e9chec de l'annulation.
MQJMS1024 = session ferm\u00e9e.
MQJMS1025 = impossible de lire le message.
MQJMS1026 = ExceptionListener a g\u00e9n\u00e9r\u00e9 l''erreur : ''{0}''.
MQJMS1027 = impossible de reconstituer la destination \u00e0 partir de ''{0}''.
MQJMS1028 = nom d'\u00e9l\u00e9ment null.
MQJMS1029 = nom de propri\u00e9t\u00e9 null.
MQJMS1030 = la taille de la m\u00e9moire tampon fournie par l'application est insuffisante.
MQJMS1031 = une erreur interne s'est produite. Faites appel \u00e0 l'administrateur syst\u00e8me.
MQJMS1032 = \u00e9chec de close(). Cause : ''{0}''.
MQJMS1033 = \u00e9chec de start(). Cause : ''{0}''.
MQJMS1034 = MessageListener a g\u00e9n\u00e9r\u00e9 : ''{0}''.
MQJMS1042 = mode de distribution non valide.
MQJMS1044 = La cha\u00eene n''est pas une valeur hexad\u00e9cimale valide - ''{0}''.
MQJMS1045 = Valeur hors plage pour virgule flottante S/390 \u00e0 double pr\u00e9cision ''{0}''.
MQJMS1046 = Le jeu de caract\u00e8res ''{0}'' n''est pas pris en charge.
MQJMS1047 = Le format du message de mappe est incorrect.
MQJMS1048 = Le format du message de flot est incorrect.
MQJMS1049 = IBM MQ classes for JMS a tent\u00e9 de convertir un tableau d'octets en cha\u00eene.
MQJMS1050 = Le format de l'en-t\u00eate MQRFH2 est incorrect.
MQJMS1051 = Classe de message JMS.
MQJMS1052 = Classe de message JMS inconnue.
MQJMS1053 = Substitut UTF-16 non valide d\u00e9tect\u00e9 ''{0}''.
MQJMS1054 = S\u00e9quence d''\u00e9chappement XML non valide d\u00e9tect\u00e9e ''{0}''.
MQJMS1055 = Type de donn\u00e9es incompatible pour la propri\u00e9t\u00e9 ou l''\u00e9l\u00e9ment du message : ''{0}''.
MQJMS1056 = Type de donn\u00e9es de propri\u00e9t\u00e9 ou d''\u00e9l\u00e9ment incorrect : ''{0}''.
MQJMS1057 = Aucune session n'est associ\u00e9e au message.
MQJMS1058 = Nom de propri\u00e9t\u00e9 de message incorrect : ''{0}''.
MQJMS1059 = Erreur fatale - Page de codes UTF8 non prise en charge.
MQJMS1060 = Impossible de s\u00e9rialiser l'objet.
MQJMS1061 = Impossible d'annuler la s\u00e9rialisation de l'objet.
MQJMS1062 = Exception lors de la lecture du corps du message : ''{0}''.
MQJMS1063 = ''{0}'' caract\u00e8re(s) suppl\u00e9mentaire(s) omis.
MQJMS1064 = Codage entier : ''{0}'', codage en virgule flottante ''{1}''.
MQJMS1065 = Exception lors de l'\u00e9criture du corps du message.
MQJMS1066 = Nom d''\u00e9l\u00e9ment de message incorrect : ''{0}''.
MQJMS1067 = d\u00e9lai d'attente incorrect pour MQ.
MQJMS1068 = impossible d'acc\u00e9der \u00e0 XAResource.
MQJMS1069 = Non autoris\u00e9 avec XASession.
MQJMS1072 = Demande du nom de Gestionnaire de files d'attente impossible.
MQJMS1073 = La file d'attente MQ indiqu\u00e9e n'est ni une file QLOCAL ni une file QALIAS.
MQJMS1074 = Impossible de traiter un message null.
MQJMS1075 = Erreur d'\u00e9criture de l'en-t\u00eate d'une file d'attente de rebut.
MQJMS1076 = Erreur de lecture de l'en-t\u00eate d'une file d'attente de rebut.
MQJMS1077 = Connexion/Destination incompatibles.
MQJMS1078 = Objet session non valide.
MQJMS1079 = Impossible d'\u00e9crire le message dans la file d'attente de rebut.
MQJMS1080 = Aucune file d'attente Annulation-Remise en file d'attente d\u00e9finie.
MQJMS1081 = Echec de la remise en file d'attente du message.
MQJMS1082 = Echec de suppression du message.
MQJMS1085 = Erreur d'\u00e9criture de RFH.
MQJMS1086 = Erreur de lecture de RFH.
MQJMS1087 = Contenu RFH non reconnu ou incorrect.
MQJMS1088 = Les clients de plusieurs domaines ne sont pas autoris\u00e9s \u00e0 intervenir sur la m\u00eame entr\u00e9e.
MQJMS1089 = Exception lors de la lecture du corps du message : ''{0}''.
MQJMS1091 = op\u00e9ration non valide pour le producteur non identifi\u00e9.
MQJMS1093 = Un param\u00e8tre Null a \u00e9t\u00e9 indiqu\u00e9 pour le constructeur : ''{0}''.
MQJMS1094 = quantityHint non valide.
MQJMS1096 = MessageReference non valide.
MQJMS1098 = Version MessageReference non valide.
MQJMS1099 = Version MQQueueAgentThread non valide.

# ---------------------------------------------------------------------------------
#
# Component Common - group prefix '1' - multicast exceptions
#
# ---------------------------------------------------------------------------------

MQJMS1102 = La connexion de multidiffusion ne peut pas \u00eatre \u00e9tablie.
MQJMS1103 = ''{0}'' message(s) perdu(s) en mode multidiffusion fiable.
MQJMS1104 = La connexion de multidiffusion a \u00e9t\u00e9 interrompue en raison du d\u00e9lai d'attente.
MQJMS1105 = Impossible de se connecter \u00e0 un port local sp\u00e9cifique pour une multidiffusion disthub.
MQJMS1106 = Impossible de charger la biblioth\u00e8que native requise pour PGM/IP.
MQJMS1107 = Incident avec la connexion.

# ---------------------------------------------------------------------------------
#
# Component Common - group prefix '1' - JMS1.1 additional messages
#
# ---------------------------------------------------------------------------------

MQJMS1110 = JMS1.1 Op\u00e9ration non prise en charge par ce type.
MQJMS1111 = JMS1.1 Les services de publication/abonnement de file d'attente ne sont pas configur\u00e9s.
MQJMS1112 = JMS1.1 Op\u00e9ration incorrecte pour l'objet sp\u00e9cifique au domaine.
MQJMS1113 = JMS1.1 Op\u00e9ration incorrecte pour l'objet inter-domaine.

MQJMS1115 = Echec de l''interrogation des propri\u00e9t\u00e9s de la file d''attente de base ''{0}'' de la file d''attente alias'' {1}'' ; le seuil d''annulation prend la valeur ''{2}'' par d\u00e9faut. Code ach\u00e8vement ''{3}'' Code anomalie ''{4}''
MQJMS1115.explanation = La file d'attente trait\u00e9e est une file d'attente alias ; un incident est survenu lors de l'interrogation des propri\u00e9t\u00e9s backoutQueue et backoutThreshold de la file d'attente de base.
MQJMS1115.useraction = Consultez les codes d'ach\u00e8vement et d'anomalie pour d\u00e9terminer la cause de l'incident. Si le code anomalie concerne les droits requis, v\u00e9rifiez que l'utilisateur connect\u00e9 dispose du droit d'interrogation pour la file d'attente de base r\u00e9f\u00e9renc\u00e9e par la file d'attente alias. Pour arr\u00eater l'interrogation de la file d'attente de base, utiliser la valeur de seuil d'annulation par d\u00e9faut mentionn\u00e9e pr\u00e9c\u00e9demment et replacer les messages atteignant ce seuil dans la file d'attente de rebut, d\u00e9finissez la propri\u00e9t\u00e9 de machine virtuelle Java com.ibm.mq.jms.useDefaultBOValues=true.
MQJMS1115.inserts = XMSC_INSERT_DESTINATION_NAME, XMSC_INSERT_STRING, XMSC_INSERT_VALUE, XMSC_INSERT_COMP_CODE, XMSC_INSERT_REASON

MQJMS1116 = Le message ''{0}'', d\u00e9tect\u00e9 dans la file d''attente ''{1}'' du gestionnaire de files d''attente ''{2}'', ne peut pas \u00eatre trait\u00e9 car un en-t\u00eate MQRFH2 n''est pas valide. Le message a \u00e9t\u00e9 d\u00e9plac\u00e9 dans la file d''attente de rebut ''{3}''.
MQJMS1116.explanation = Lors de l'ex\u00e9cution avec le mode de migration du fournisseur de messagerie IBM MQ, un port d'\u00e9coute ConnectionConsumer, Activation Specification ou WebSphere Application Server a d\u00e9tect\u00e9 un message qui contenait un en-t\u00eate MQRFH2 non valide. Etant donn\u00e9 que la zone de rapport de l'\u00e9l\u00e9ment MQMD pour ce message contient l'option MQRO_DEAD_LETTER_Q, le message a \u00e9t\u00e9 d\u00e9plac\u00e9 dans la file d'attente de rebut. 
MQJMS1116.useraction = Consultez le message dans la file d'attente de rebut afin de d\u00e9terminer pourquoi l'en-t\u00eate MQRFH2 n'est pas valide et modifiez l'application qui a g\u00e9n\u00e9r\u00e9 le message afin de garantir que l'en-t\u00eate MQRFH2 est valide.
MQJMS1116.inserts = XMSC_INSERT_MESSAGE_ID, XMSC_INSERT_DESTINATION_NAME, XMSC_INSERT_QUEUE_MANAGER_NAME, XMSC_INSERT_STRING 

MQJMS1117 = Le message ''{0}'', d\u00e9tect\u00e9 dans la file d''attente ''{1}'' du gestionnaire de files d''attente ''{2}'', ne peut pas \u00eatre trait\u00e9 car un en-t\u00eate MQRFH2 n''est pas valide. Le message a \u00e9t\u00e9 supprim\u00e9.
MQJMS1117.explanation = Lors de l'ex\u00e9cution avec le mode de migration du fournisseur de messagerie IBM MQ, un port d'\u00e9coute ConnectionConsumer, Activation Specification ou WebSphere Application Server a d\u00e9tect\u00e9 un message qui contenait un en-t\u00eate MQRFH2 non valide. Etant donn\u00e9 que la zone de rapport de l'\u00e9l\u00e9ment MQMD pour ce message contient l'option MQRO_DISCARD_MSG, le message a \u00e9t\u00e9 supprim\u00e9. 
MQJMS1117.useraction = Modifiez l'application charg\u00e9e de g\u00e9n\u00e9rer le message de telle sorte qu'elle g\u00e9n\u00e8re des messages contenant des en-t\u00eates MQRFH2 valides.
MQJMS1117.inserts = XMSC_INSERT_MESSAGE_ID, XMSC_INSERT_DESTINATION_NAME, XMSC_INSERT_QUEUE_MANAGER_NAME 

# ---------------------------------------------------------------------------------
#
# Component BaseMQ - group prefix '2'
#
# ---------------------------------------------------------------------------------

MQJMS2000 = impossible de fermer la file d'attente MQ.
MQJMS2001 = R\u00e9f\u00e9rence de file d'attente MQ nulle.
MQJMS2002 = impossible d'obtenir un message \u00e0 partir de la file d'attente MQ.
MQJMS2003 = impossible de d\u00e9connecter le gestionnaire de files d'attente.
MQJMS2004 = R\u00e9f\u00e9rence MQQueueManager null.
MQJMS2005 = Impossible de cr\u00e9er MQQueueManager pour ''{0}''.
MQJMS2006 = Incident MQ : ''{0}''.
MQJMS2007 = impossible de transmettre un message \u00e0 la file d'attente MQ.
MQJMS2008 = impossible d''ouvrir la file d''attente MQ ''{0}''.
MQJMS2009 = Echec de MQQueueManager.commit().
MQJMS2010 = valeur de definitionType inconnue pour la file d''attente MQ : ''{0}''.
MQJMS2011 = \u00e9chec de la demande de la longueur de file d'attente MQ.
MQJMS2012 = Echec de XACLOSE.
MQJMS2013 = l'authentification de s\u00e9curit\u00e9 fournie pour MQQueueManager n'est pas valide.
MQJMS2014 = Le gestionnaire de file d'attente a rejet\u00e9 la connexion client XA.

# ---------------------------------------------------------------------------------
#
# Component Domain - group prefix '3'
#
# ---------------------------------------------------------------------------------

MQJMS3000 = impossible de cr\u00e9er une file d''attente temporaire \u00e0 partir de ''{0}''.
MQJMS3001 = file d'attente temporaire d\u00e9j\u00e0 ferm\u00e9e ou supprim\u00e9e.
MQJMS3002 = file d'attente temporaire en cours d'utilisation.
MQJMS3003 = impossible de supprimer une file d'attente statique.
MQJMS3004 = impossible de supprimer la file d'attente temporaire.
MQJMS3005 = Echec de publication/abonnement pour le motif suivant : ''{0}''.
MQJMS3006 = R\u00e9f\u00e9rence de rubrique null.
MQJMS3008 = Impossible de cr\u00e9er la commande ''{0}''.
MQJMS3009 = Impossible de publier la commande sur la file d'attente MQ.
MQJMS3010 = Impossible de cr\u00e9er le message de publication.
MQJMS3011 = Impossible de publier le message sur la file d'attente MQ.
MQJMS3013 = Impossible de stocker l'entr\u00e9e d'administration.
MQJMS3014 = Impossible d''ouvrir la file d''attente de l''abonn\u00e9 (''{0}'').
MQJMS3017 = Impossible de supprimer la file d''attente de l''abonn\u00e9 (''{0}'').
MQJMS3018 = Abonnement durable ''{0}'' inconnu.
MQJMS3019 = TemporaryTopic est d\u00e9j\u00e0 supprim\u00e9.
MQJMS3020 = TemporaryTopic hors limites.
MQJMS3021 = Pr\u00e9fixe de la file d''attente de l''abonn\u00e9 non valide : ''{0}''.
MQJMS3022 = Une r\u00e9abonnement durable doit utiliser la m\u00eame file d''attente d''abonn\u00e9 ; file indiqu\u00e9e : ''{0}'', file d''origine :''{1}''.
MQJMS3023 = L'abonnement a un TopicSubscriber actif.
MQJMS3024 = Utilisation incorrecte d'un ID client non initialis\u00e9.
MQJMS3025 = Rubrique temporaire utilis\u00e9e.
MQJMS3026 = QueueSender ferm\u00e9.
MQJMS3028 = TopicPublisher ferm\u00e9.
MQJMS3031 = Impossible de d\u00e9finir l'ID client apr\u00e8s l'utilisation de la connexion.
MQJMS3032 = Red\u00e9finition de l'ID client non admise.
MQJMS3033 = QueueReceiver ferm\u00e9.
MQJMS3034 = TopicSubscriber ferm\u00e9.
MQJMS3037 = Diffuseur de messages ferm\u00e9.
MQJMS3038 = Consommateur de message ferm\u00e9.
MQJMS3039 = Utilisation non conforme du nom null.
MQJMS3040 = Contenu du message de contr\u00f4le du courtier non valide : ''{0}''.
MQJMS3041 = Zone ''{0}'' d\u00e9j\u00e0 d\u00e9finie.
MQJMS3042 = Message du courtier de publication/abonnement non reconnu.
MQJMS3043 = Niveau non valide pour la r\u00e9p\u00e9tition du nettoyage.
MQJMS3044 = Niveau de nettoyage NONE requis.
MQJMS3045 = Impossible d''ouvrir ''{0}'' : un nettoyage de niveau FORCE ou NONDUR est peut-\u00eatre en cours d''ex\u00e9cution.
MQJMS3046 =  Impossible d''ouvrir ''{0}'' : une autre application JMS est peut-\u00eatre en train d''utiliser la file d''attente publication/abonnement avec ce gestionnaire de files d''attente.
MQJMS3047 = Type de sauvegarde d'abonnement non pris en charge par le gestionnaire de files d'attente.
MQJMS3048 = Type de sauvegarde d'abonnement incorrect.
MQJMS3049 = MQJMS_Messages.MQJMS_PS_WRONG_SUBSCRIPTION_TYPE = Type d'abonnement incorrect pour ce magasin d'abonnements.
MQJMS3050 = L'abonnement est d\u00e9j\u00e0 en cours d'utilisation et ne peut pas \u00eatre mis \u00e0 jour.
MQJMS3051 = Nom d'abonnement non valide.

MQJMS3052 = Le nettoyage a d\u00e9marr\u00e9 \u00e0 ''{0}'' le ''{1}''.
MQJMS3052.explanation = Le script de nettoyage IBM MQ classes for JMS est en cours d'ex\u00e9cution et a commenc\u00e9 une op\u00e9ration de nettoyage aux date et heure indiqu\u00e9es. L'heure est au format HHMMSSTH, et la date au format AAAAMMJJ. 
MQJMS3052.useraction = Aucun(e). 
MQJMS3052.inserts = XMSC_INSERT_TIMESTAMP, XMSC_INSERT_DATESTAMP

MQJMS3053 = Le nettoyage s''''est termin\u00e9 \u00e0 ''{0}'' le ''{1}''.
MQJMS3053.explanation = Le script de nettoyage IBM MQ classes for JMS est en cours d'ex\u00e9cution et a termin\u00e9 une op\u00e9ration de nettoyage aux date et heure indiqu\u00e9es. L'heure est au format HHMMSSTH, et la date au format AAAAMMJJ. 
MQJMS3053.useraction = Aucun(e). 
MQJMS3053.inserts = XMSC_INSERT_TIMESTAMP, XMSC_INSERT_DATESTAMP

MQJMS3054 = Temps restant avant la prochaine op\u00e9ration de nettoyage : ''{0}'' minutes.
MQJMS3054.explanation = Le script de nettoyage IBM MQ classes for JMS est en cours d'ex\u00e9cution et attend d\u00e9sormais le nombre de minutes indiqu\u00e9 dans le message avant de commencer la prochaine op\u00e9ration de nettoyage. Le nombre de minutes indiqu\u00e9 dans le message est arrondi \u00e0 la minute inf\u00e9rieure la plus proche.
MQJMS3054.useraction = Aucun(e). 
MQJMS3054.inserts = XMSC_INSERT_STRING

# ---------------------------------------------------------------------------------
#
# Admin Domain - group prefix '4'
#
# ---------------------------------------------------------------------------------

MQJMS4124 = La valeur de propri\u00e9t\u00e9 de ''{0}'' est null.
MQJMS4125 = Propri\u00e9t\u00e9 non valide pour un ''{0}'' : ''{1}''
MQJMS4131 = Les types d'objet attendus et obtenus ne correspondent pas.

# ---------------------------------------------------------------------------------
#
# Util Domain (IVT, sample etc.) - group prefix '5'
#
# ---------------------------------------------------------------------------------

MQJMS5053 = *** Aucune r\u00e9ponse du courtier. V\u00e9rifiez que le courtier est actif. Si vous utilisez le courtier IBM MQ, v\u00e9rifiez que la version du courtier est V1. ***
MQJMS5087 = Erreur inattendue ''{1}'' lors de l''acc\u00e8s \u00e0 la file d''attente interne ''{0}''.

# ---------------------------------------------------------------------------------
#
# Gryphon - group prefix '6'
#
# ---------------------------------------------------------------------------------

MQJMS6040 = Nom de famille de sockets non valide : ''{0}''.
MQJMS6041 = Une erreur est survenue lors de la tentative de chargement de la classe de fabrique de sockets ''{0}'', erreur : <''{1}''>.
MQJMS6056 = Impossible de modifier le param\u00e8tre ''{0}'' car aucune autre modification des param\u00e8tres BaseConfig n''est autoris\u00e9e.
MQJMS6057 = Impossible d''affecter au param\u00e8tre ''{0}'' la valeur ''{1}''.
MQJMS6058 = Une erreur est survenue lors du chargement du param\u00e8tre BaseConfig ''{0}''.
MQJMS6059 = Une erreur est survenue lors du chargement de la mise en oeuvre de la s\u00e9curit\u00e9 de client minimal.
MQJMS6060 = Une erreur est survenue sur le client minima : ''{0}''.
MQJMS6061 = La rubrique ''{0}'' sp\u00e9cifi\u00e9e est syntaxiquement incorrecte.
MQJMS6062 = Une fin de flux EOF a \u00e9t\u00e9 atteinte pendant la r\u00e9ception des donn\u00e9es sur le client minimal.
MQJMS6063 = Le courtier a signal\u00e9 une erreur sur la connexion au client minimal.
MQJMS6064 = La fonction Connector.send a \u00e9t\u00e9 appel\u00e9e avec une valeur de message incorrecte.
MQJMS6065 = Une valeur incorrecte a \u00e9t\u00e9 d\u00e9tect\u00e9e dans un champ : ''{0}''.
MQJMS6066 = Une erreur interne inattendue est survenue sur le client minimal.
MQJMS6067 = Une op\u00e9ration pour message en octets a \u00e9t\u00e9 demand\u00e9e sur un \u00e9l\u00e9ment qui n'est pas un message en octets.
MQJMS6068 = Une op\u00e9ration pour message de texte a \u00e9t\u00e9 demand\u00e9e sur un \u00e9l\u00e9ment qui n'est pas un message de texte.
MQJMS6069 = Une op\u00e9ration pour message de flux a \u00e9t\u00e9 demand\u00e9e sur un \u00e9l\u00e9ment qui n'est pas un message de flux.
MQJMS6070 = Une op\u00e9ration pour message de mappe a \u00e9t\u00e9 demand\u00e9e sur un \u00e9l\u00e9ment qui n'est pas un message de mappe.
MQJMS6071 = Le courtier a transmis un message non valide durant l'authentification.
MQJMS6072 = Le courtier a demand\u00e9 un protocole indisponible durant l'authentification.
MQJMS6073 = Connexion au client minimal rejet\u00e9e en raison de l'\u00e9chec de l'authentification.
MQJMS6074 = Aucune qualit\u00e9 de protection (QOP) n'est disponible sur le client minimal.
MQJMS6079 = Une erreur est survenue lors de la tentative de chargement de la gestion de groupes d''unit\u00e9s d''ex\u00e9cution, ''{0}''.
MQJMS6081 = Une tentative de lire un message Stream a \u00e9t\u00e9 effectu\u00e9e avant qu'une lecture pr\u00e9c\u00e9dente ne soit achev\u00e9e.
MQJMS6083 = Une erreur est survenue lors de l''initialisation d''une instance de groupe d''unit\u00e9s d''ex\u00e9cution, ''{0}''.
MQJMS6085 = Aucun ExceptionListener n'a \u00e9t\u00e9 d\u00e9fini.
MQJMS6088 = Arr\u00eat en cours du moniteur de connexion c\u00f4t\u00e9 client.
MQJMS6090 = Tentative de r\u00e9ception synchronis\u00e9e sur un MessageConsumer pour lequel un programme d'\u00e9coute est actif.
MQJMS6091 = Une erreur d''E-S est survenue lors du d\u00e9marrage ou de l''arr\u00eat de la transmission sur la connexion, ''{0}''.
MQJMS6093 = Une erreur est survenue lors de la r\u00e9ception synchrone, ''{0}''.
MQJMS6096 = Le niveau de priorit\u00e9 JMSPriority ''{0}'' est en dehors de la plage sp\u00e9cifi\u00e9e dans JMS.
MQJMS6097 = L''identifiant JMSMessageID indiqu\u00e9, ''{0}'', n''est pas valide.
MQJMS6105 = Plus aucune modification des param\u00e8tres client n'est autoris\u00e9e.
MQJMS6106 = Une erreur est survenue lors de l''initialisation du param\u00e8tre ''{0}'', exception ''{1}''.
MQJMS6115 = Une erreur est survenue lors de la cr\u00e9ation de TopicConnection, ''{0}''.
MQJMS6116 = Cette op\u00e9ration n'est pas permise sur une entit\u00e9 qui est ferm\u00e9e.
MQJMS6117 = La mise en oeuvre ''{0}'' de l''objet Topic n''est pas prise en charge.
MQJMS6118 = La rubrique ''{0}'' contient un caract\u00e8re g\u00e9n\u00e9rique, non valide pour la publication.
MQJMS6119 = Une erreur d''E-S est survenue lors de la publication, ''{0}''.
MQJMS6120 = Tentative d'utilisation d'une rubrique temporaire non cr\u00e9\u00e9e sur la connexion actuelle.
MQJMS6121 = Une erreur d''E-S est survenue lors de l''abonnement, ''{0}''.
MQJMS6232 = Lors de la cr\u00e9ation d''un abonn\u00e9 TopicSubscriber, la tentative d''ajout du souscripteur au moteur correspondant a provoqu\u00e9 l''erreur suivante : ''{0}''.
MQJMS6233 = Une erreur a \u00e9t\u00e9 d\u00e9tect\u00e9e dans le moteur correspondant : ''{0}''.
MQJMS6234 = Une tentative a \u00e9t\u00e9 effectu\u00e9e de supprimer un objet dont la rubrique est ''{0}'' dans un moteur vide correspondant : ''{1}''.
MQJMS6235 = Une tentative a \u00e9t\u00e9 effectu\u00e9e de supprimer un objet dont la rubrique est ''{0}'' dans le moteur correspondant, mais il n''avait pas d''entr\u00e9e en cache : ''{1}''.
MQJMS6236 = Un type de v\u00e9rification inconnu de classe ''{0}'' a \u00e9t\u00e9 d\u00e9tect\u00e9 dans un algorithme d''appariement sp\u00e9cifique \u00e0 un type.
MQJMS6237 = Une tentative d''acc\u00e9der \u00e0 une zone inconnue nomm\u00e9e ''{0}'' a \u00e9t\u00e9 effectu\u00e9e.
MQJMS6238 = Lors de la tentative d''acc\u00e8s \u00e0 une zone de message, l''erreur suivante est survenue : ''{0}''.
MQJMS6239 = Une op\u00e9ration d'extraction ou d'insertion EvalCache a eu lieu alors que la m\u00e9moire cache n'\u00e9tait pas charg\u00e9e.
MQJMS6240 = Une op\u00e9ration d'extraction ou d'insertion EvalCache a sp\u00e9cifi\u00e9 un identifiant non valide.
MQJMS6241 = Le nombre d'attributs de contenu sp\u00e9cifi\u00e9 est trop \u00e9lev\u00e9.
MQJMS6242 = Un doublon de cible MatchTarget a \u00e9t\u00e9 d\u00e9tect\u00e9 dans l'espace MatchSpace.
MQJMS6243 = Une tentative de supprimer la cible MatchTarget ''{0}'' de l''espace MatchSpace a eu lieu, mais elle n''a pas de cl\u00e9 (rubrique).
MQJMS6244 = La cible MatchTarget ''{1}'' dont la cl\u00e9 (la rubrique) est ''{0}'' n''a pu \u00eatre supprim\u00e9e de l''espace MatchSpace car elle est introuvable.
MQJMS6245 = Une tentative d'ajouter une cible MatchTarget sans cl\u00e9 (rubrique) \u00e0 l'espace MatchSpace a eu lieu.
MQJMS6246 = Une utilisation incorrecte du caract\u00e8re g\u00e9n\u00e9rique ''{0}'' du sujet a \u00e9t\u00e9 d\u00e9tect\u00e9e.
MQJMS6247 = Le s\u00e9parateur de segment ''{0}'' de la rubrique appara\u00eet \u00e0 une position incorrecte.
MQJMS6248 = Une erreur est survenue lors de la tentative de charger ou d'invoquer l'analyseur de s\u00e9lecteur d'abonnement.
MQJMS6249 = L''erreur suivante est survenue durant l''analyse d''un s\u00e9lecteur d''abonnement : ''{0}''.
MQJMS6250 = Le caract\u00e8re d''\u00e9chappement a \u00e9t\u00e9 utilis\u00e9 pour clore le sch\u00e9ma suivant : ''{0}''.
MQJMS6251 = Le caract\u00e8re d''\u00e9chappement ''{0}'' transmis \u00e0 l''outil de sch\u00e9ma fait plus d''un seul caract\u00e8re.
MQJMS6252 = Une zone de message qui aurait d\u00fb contenir une valeur de type ''{0}'' en contenait une de type ''{1}''.
MQJMS6228 = L''authentification du client minimal a \u00e9chou\u00e9 en raison de l''erreur ''{0}''.
MQJMS6229 = Une qualit\u00e9 de protection (QOP) est n\u00e9cessaire, mais elle est d\u00e9sactiv\u00e9e pour ce client minimal.
MQJMS6311 = Le type de transport 'DIRECT' dans une transaction n'est pas g\u00e9r\u00e9.
MQJMS6312 = Abonnement non autoris\u00e9 \u00e0 la rubrique ''{0}''.
MQJMS6350 = Une op\u00e9ration pour message d'objet a \u00e9t\u00e9 demand\u00e9e sur un \u00e9l\u00e9ment qui n'est pas un message d'objet.
MQJMS6351 = Une exception s''est produite lors de la cr\u00e9ation de l''abonnement \u00e0 <''{0}'',''{1}''>, ''{2}''.
MQJMS6401 = Messages persistants non pris en charge pour le type de transport 'DIRECT'.
MQJMS6402 = Dur\u00e9e de vie > 0 non prise en charge pour le type de transport 'DIRECT'.
MQJMS6403 = Expiration de la rubrique > 0 non prise en charge pour le type de transport 'DIRECT'.
MQJMS6404 = Accus\u00e9 de r\u00e9ception client non pris en charge pour le type de transport 'DIRECT'.
MQJMS6405 = La fonctionnalit\u00e9 JMS 2.0 n'est pas prise en charge avec ProviderVersion 6.
MQJMS6406 = Le mode de migration de fournisseur de messagerie IBM MQ n'est pas pris en charge dans un environnement CICS.
MQJMS6407 = Le mode de migration de fournisseur de messagerie IBM MQ n'est pas pris en charge dans un environnement IMS.
