# %Z% %W% %I% %E% %U%
#
#   <copyright 
#   notice="oco-source" 
#   pids="5724-H72" 
#   years="2008,2017" 
#   crc="775383328" > 
#   IBM Confidential 
#    
#   OCO Source Materials 
#    
#   5724-H72,5655-R36,5655-L82,5724-L26, 
#    
#   (C) Copyright IBM Corp. 2008, 2017 
#    
#   The source code for the program is not published 
#   or otherwise divested of its trade secrets, 
#   irrespective of what has been deposited with the 
#   U.S. Copyright Office. 
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR

JMSCC0001 = Ein interner Fehler ist aufgetreten. Es konnte keine Instanz f\u00fcr eine erforderliche Klasse erstellt werden: ''{0}''.
JMSCC0001.useraction = Sichern Sie alle generierten Ausgabedateien. Ob bereits eine L\u00f6sung zur Verf\u00fcgung steht, erfahren Sie entweder \u00fcber die MQ-Unterst\u00fctzungssite http://www.ibm.com/software/integration/wmq/support/ oder \u00fcber den IBM Support Assistant (ISA) unter http://www.ibm.com/software/support/isa/.  Wenn Sie keine passende L\u00f6sung finden, wenden Sie sich an Ihr IBM Support Center.
JMSCC0001.inserts = XMSC_INSERT_EXCEPTION

JMSCC0002 = Von IBM MQ Classes for JMS wurde eine ung\u00fcltige Client-ID f\u00fcr eine Verbindung angegeben.
JMSCC0002.explanation = Von einer Anwendung wurde f\u00fcr die Client-ID einer g\u00fcltigen Verbindung ein Nullwert angegeben, oder es wurde versucht, die Eigenschaft 'clientId' einer unzul\u00e4ssigen Verbindung festzulegen.
JMSCC0002.useraction = Die Eigenschaft 'clientId' kann f\u00fcr eine Verbindung nur einmal, nur auf einen Wert ungleich Null und nur vor Verwendung der Verbindung festgelegt werden. Stellen Sie sicher, dass die Verbindung zul\u00e4ssig ist und die Client-ID keinen Nullwert enth\u00e4lt.
JMSCC0002.exception = com.ibm.msg.client.jms.DetailedInvalidClientIDException

JMSCC0003 = Der angegebene Wert ''{1}'' ist f\u00fcr ''{0}'' nicht zul\u00e4ssig.
JMSCC0003.explanation = Der festgelegte Wert ist f\u00fcr die angegebene Eigenschaft nicht zul\u00e4ssig.
JMSCC0003.useraction = \u00c4ndern Sie den Wert in einen f\u00fcr die Eigenschaft unterst\u00fctzten Wert.
JMSCC0003.inserts = XMSC_INSERT_NAME, XMSC_INSERT_VALUE
JMSCC0003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0004 = Durch Aufrufen der Methode 'receive' wird keine Nachricht f\u00fcr eine Verbindung angezeigt, die gestoppt wurde.
JMSCC0004.explanation = In der JMS-Spezifikation ist vorgegeben, dass durch Aufrufen der Methode 'receive()' keine Nachricht angezeigt werden darf, wenn die Verbindung gestoppt wurde. Nach Aufrufen von 'receiveNoWait' oder 'receive' unter Angabe eines Zeitlimits wird ein Nullwert angezeigt, wenn das Zeitlimit abgelaufen ist. Durch Aufrufen von 'receive' ohne Angabe eines Zeitlimits wird keine Nachricht angezeigt, bis die Verbindung gestartet oder gestoppt wurde, oder bis die Anwendung beendet wurde.
JMSCC0004.useraction = Stellen Sie die Verbindung durch Aufrufen von javax.jms.Connection.start() her. 

# JMSCC0005 is the same as JMSCC0003 except that JMSCC0003 throws a InvalidDestinationException
# whereas JMSCC0005 throws an JMSException.
JMSCC0005 = Der angegebene Wert ''{1}'' ist f\u00fcr ''{0}'' nicht zul\u00e4ssig.
JMSCC0005.explanation = Der festgelegte Wert ist f\u00fcr die angegebene Eigenschaft nicht zul\u00e4ssig.
JMSCC0005.useraction = \u00c4ndern Sie den Wert in einen f\u00fcr die Eigenschaft unterst\u00fctzten Wert.
JMSCC0005.inserts = XMSC_INSERT_NAME, XMSC_INSERT_VALUE

JMSCC0007 = Beim Aufrufen der Methode ''{1}'' wurde eine Ausnahmebedingung empfangen: ''{0}''
JMSCC0007.explanation = Von einer anderen Komponente wurde eine Ausnahmebedingung angezeigt, w\u00e4hrend die angegebene Methode ausgef\u00fchrt wurde.
JMSCC0007.useraction = Weitere Informationen finden Sie in der verkn\u00fcpften Ausnahmebedingung.
JMSCC0007.inserts = XMSC_INSERT_EXCEPTION, XMSC_INSERT_METHOD

JMSCC0008 = Diese Verbindung wurde aufgehoben.
JMSCC0008.explanation = Eine Anwendung hat eine Methode aufgerufen, die nach dem Aufheben der Verbindung nicht verwendet werden darf.
JMSCC0008.useraction = Stellen Sie vor dem Aufruf der Methode sicher, dass die Verbindung nicht aufgehoben wurde.
JMSCC0008.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0011 = Die Methode ''{0}'' ist in diesem Container nicht zul\u00e4ssig.
JMSCC0011.explanation = Es wurde eine Methode aufgerufen, die im aktuellen Container nicht zul\u00e4ssig ist.
JMSCC0011.useraction = Entfernen Sie den Aufruf der Methode.
JMSCC0011.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0011.inserts = XMSC_INSERT_METHOD

JMSCC0012 = Die Methode ''{0}'' wird unter Umst\u00e4nden nicht von einem {1} Listener aufgerufen.
JMSCC0012.explanation = Es wurde eine Methode aufgerufen, die im aktuellen Kontext nicht zul\u00e4ssig ist.
JMSCC0012.useraction = Entfernen Sie den Aufruf der Methode.
JMSCC0012.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0012.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_NAME

JMSCC0014 = Es ist nicht zul\u00e4ssig, die Methode ''{0}'' in einer nicht ausgef\u00fchrten Sitzung aufzurufen.
JMSCC0014.explanation = Eine Anwendung hat eine Methode aufgerufen, die in einer Sitzung ohne Transaktionsunterst\u00fctzung nicht zul\u00e4ssig ist.
JMSCC0014.useraction = \u00c4ndern Sie das Anwendungsprogramm, um dieses Verhalten zu verhindern.
JMSCC0014.inserts = XMSC_INSERT_METHOD
JMSCC0014.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0020 = Diese Sitzung wurde geschlossen.
JMSCC0020.explanation = Eine Anwendung hat eine Methode aufgerufen, die nach dem Schlie\u00dfen der Sitzung nicht verwendet werden darf.
JMSCC0020.useraction = Stellen Sie vor dem Aufruf der Methode sicher, dass die Sitzung nicht geschlossen wurde.
JMSCC0020.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0021 = Es ist nicht zul\u00e4ssig, die Methode ''{0}'' in einer ausgef\u00fchrten Sitzung aufzurufen.
JMSCC0021.explanation = Die Anwendung hat eine Methode aufgerufen, die in einer Sitzung mit Transaktionsunterst\u00fctzung nicht zul\u00e4ssig ist.
JMSCC0021.useraction = \u00c4ndern Sie das Anwendungsprogramm, um dieses Verhalten zu verhindern.
JMSCC0021.inserts = XMSC_INSERT_METHOD
JMSCC0021.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0026 = Dieser Nachrichtenproduzent wurde geschlossen.
JMSCC0026.explanation = Eine Anwendung hat eine Methode aufgerufen, die nach dem Schlie\u00dfen des Nachrichtenproduzenten nicht verwendet werden darf.
JMSCC0026.useraction = Stellen Sie vor dem Aufruf der Methode sicher, dass der Nachrichtenproduzent nicht geschlossen wurde.
JMSCC0026.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0029 = Beim Senden von diesem Produzenten muss eine Zieladresse angegeben werden.
JMSCC0029.explanation = Der Produzent wurde ohne Zieladresse erstellt, und in der Sendemethode wurde keine Zieladresse angegeben.
JMSCC0029.useraction = \u00c4ndern Sie die Anwendung so, dass eine Methode 'send()' verwendet wird, \u00fcber die eine Zieladresse angegeben wird, oder geben Sie beim Erstellen des Producers eine Zieladresse an.
JMSCC0029.exception = java.lang.UnsupportedOperationException

JMSCC0030 = Beim Senden von diesem Produzenten aus ist die Angabe einer Zieladresse unzul\u00e4ssig.
JMSCC0030.explanation = Der Produzent wurde mit einer angegebenen Zieladresse erstellt. Beim Senden einer Nachricht darf nicht noch einmal eine Zieladresse angegeben werden.
JMSCC0030.useraction = \u00c4ndern Sie die Anwendung, so dass eine Sendemethode ohne Angabe der Zieladresse verwendet wird, oder geben Sie beim Erstellen des Produzenten keine Zieladresse an.
JMSCC0030.exception = java.lang.UnsupportedOperationException

JMSCC0031 = Die Angabe eines Listeners mit Null-Abschluss ist ung\u00fcltig.
JMSCC0031.explanation = Der Aufruf an die Sendemethode beinhaltete einen Abschlusslistener, der Listener war jedoch null.
JMSCC0031.useraction = \u00c4ndern Sie die Anwendung, so dass eine Sendemethode ohne Angabe des Abchlusslisteners verwendet wird, oder geben Sie beim Aufruf einen Listener mit einem Abschluss ungleich null an.
JMSCC0031.exception = java.lang.IllegalArgumentException

JMSCC0032 = Dieser Nachrichtenkonsument wurde geschlossen.
JMSCC0032.explanation = Eine Anwendung hat eine Methode aufgerufen, die nach dem Schlie\u00dfen des Nachrichtenkonsumenten nicht verwendet werden darf.
JMSCC0032.useraction = Stellen Sie vor dem Aufruf der Methode sicher, dass der Nachrichtenkonsument nicht geschlossen wurde.
JMSCC0032.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0033 = Das Aufrufen einer synchronen Methode ist nicht zul\u00e4ssig, wenn eine Sitzung asynchron verwendet wird: ''{0}''.
JMSCC0033.explanation = Die JMS-Spezifikation l\u00e4sst die Verwendung einer Sitzung f\u00fcr synchrone Methoden nicht zu, wenn die asynchrone Nachrichten\u00fcbermittlung aktiv ist.
JMSCC0033.useraction = Erstellen Sie eine separate Sitzung, wenn Sie synchrone Methoden und asynchrone \u00dcbermittlung gleichzeitig verwenden m\u00f6chten.
JMSCC0033.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0033.inserts = XMSC_INSERT_METHOD

JMSCC0034 = Der asynchrone \u00dcbermittlungsmechanismus befindet sich in Methode ''{0}'' in einem inkonsistenten Status.
JMSCC0034.explanation = Eine nicht erwartete Folge von Ereignissen wurde bei der Nachrichten\u00fcbermittlung an eine Message-driven Bean (MDB) festgestellt. Dies wurde m\u00f6glicherweise durch Anwendungsfehler in der Cient-Programmierung verursacht.
JMSCC0034.useraction = \u00dcberpr\u00fcfen Sie die Protokolldateien des Anwendungsservers auf weitere Probleme im Zusammenhang mit der Message-driven Bean. Sichern Sie alle generierten Ausgabedateien. Ob bereits eine L\u00f6sung zur Verf\u00fcgung steht, erfahren Sie entweder \u00fcber die WMQ-Unterst\u00fctzungssite http://www.ibm.com/software/integration/wmq/support/ oder \u00fcber den IBM Support Assistant (ISA) unter http://www.ibm.com/software/support/isa/.  Wenn Sie keine passende L\u00f6sung finden, wenden Sie sich an Ihr IBM Support Center.
JMSCC0034.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0034.inserts = XMSC_INSERT_METHOD

JMSCC0037 = Von der Methode 'MessageListener.onMessage()' wurde eine Laufzeitausnahmebedingung ausgegeben.
JMSCC0037.explanation = Ein MessageConsumer mit einem registrierten Nachrichtenempfangsprogramm empfing eine Ausnahmebedingung von der Methode 'onMessage()'.
JMSCC0037.useraction = Die Methode 'onMessage()' muss ge\u00e4ndert werden, um das Ausgeben von Ausnahmebedingungen zu vermeiden.

JMSCC0038 = Der Benutzer ist nicht berechtigt, diese Operation durchzuf\u00fchren. Weitere Informationen finden Sie in der verkn\u00fcpften Ausnahmebedingung.
JMSCC0038.explanation = Weitere Informationen zu den Berechtigungen, die zum Ausf\u00fchren der Operation erforderlich sind, finden Sie in der verkn\u00fcpften Ausnahmebedingung.
JMSCC0038.useraction = Der Administrator muss dem entsprechenden Benutzer die erforderliche Berechtigung erteilen.

JMSCC0039 = Der Typ ''{0}'' darf nicht als Objekteigenschaft ''{1}'' verwendet werden.
JMSCC0039.explanation = Eine Anwendung hat versucht, ein Objektmerkmal mithilfe eines Objekttyps festzulegen, der von der JMS-Spezifikation nicht unterst\u00fctzt wird.
JMSCC0039.useraction = Verwenden Sie einen zul\u00e4ssigen Objekttyp. Zul\u00e4ssige Objekttypen sind primitive Wrapperklassen und Zeichenfolgenobjekte.
JMSCC0039.inserts = XMSC_INSERT_TYPE, XMSC_INSERT_PROPERTY
JMSCC0039.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0040 = Beim Empfangen einer Nachricht ist eine Ausnahmebedingung aufgetreten: ''{0}''
JMSCC0040.explanation = Beim Empfang einer Nachricht wurde eine Ausnahmebedingung ausgel\u00f6st, durch die die Operation fehlgeschlagen ist.
JMSCC0040.useraction = Weitere Informationen finden Sie in der angegebenen Ausnahmebedingung und im verkn\u00fcpften Ausnahmeobjekt.
JMSCC0040.inserts = XMSC_INSERT_EXCEPTION
JMSCC0040.exception = com.ibm.msg.client.jms.internal.JmsQueueBrowserImpl.MessageConversionFailed

JMSCC0041 = Die Konvertierung der Komponente ''{0}'' von Typ ''{1}'' in Typ ''{2}'' ist nicht zul\u00e4ssig.
JMSCC0041.explanation = Die Konvertierung zwischen den zwei angegebenen Datentypen ist wegen der JMS-Spezifikation nicht zul\u00e4ssig.
JMSCC0041.useraction = Laden Sie das benannte Element mithilfe einer der zul\u00e4ssigen Konvertierungen.
JMSCC0041.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE

JMSCC0042 = Das Nachrichtenfeld ''{0}'' wurde nicht festgelegt.
JMSCC0042.explanation = Eine Anwendung hat versucht, einen Wert aus einem nicht festgelegten Feld abzurufen.
JMSCC0042.useraction = Legen Sie den Wert des Felds fest, bevor Sie es abrufen.
JMSCC0042.inserts = XMSC_INSERT_FIELD

JMSCC0043 = Ein Feldname mit einem Nullwert oder einer leeren Zeichenfolge ist nicht zul\u00e4ssig.
JMSCC0043.explanation = Eine Benutzeranwendung hat versucht, ein Feld mit einem ung\u00fcltigen Namen (z. B. einem Nullwert oder einer leeren Zeichenfolge) festzulegen.
JMSCC0043.useraction = Verwenden Sie einen g\u00fcltigen Feldnamen.
JMSCC0043.exception = java.lang.IllegalArgumentException

JMSCC0044 = Es ist nicht zul\u00e4ssig, Methode ''{0}'' in der Nachricht aufzurufen, da der Nachrichtenhauptteil schreibgesch\u00fctzt ist.
JMSCC0044.explanation = Eine Benutzeranwendung hat versucht, einen schreibgesch\u00fctzten Nachrichtentext festzulegen.
JMSCC0044.useraction = Entfernen Sie die Einstellung f\u00fcr dieses Verhalten aus dem Anwendungsprogramm, oder rufen Sie zuerst die Methode 'clearBody()' auf.
JMSCC0044.inserts = XMSC_INSERT_METHOD
JMSCC0044.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSCC0045 = Es ist nicht zul\u00e4ssig, Methode ''{0}'' in der Nachricht aufzurufen, da die Nachrichteneigenschaften schreibgesch\u00fctzt sind.
JMSCC0045.explanation = Eine Benutzeranwendung hat versucht, eine schreibgesch\u00fctzte Nachrichteneigenschaft festzulegen.
JMSCC0045.useraction = Entfernen Sie die Einstellung f\u00fcr dieses Verhalten aus dem Anwendungsprogramm, oder rufen Sie zuerst die Methode 'clearProperties()' auf.
JMSCC0045.inserts = XMSC_INSERT_METHOD
JMSCC0045.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSCC0046 = Es ist nicht zul\u00e4ssig, Methode ''{0}'' in der Nachricht aufzurufen, da der Nachrichtenhauptteil lesegesch\u00fctzt ist.
JMSCC0046.explanation = Eine Benutzeranwendung hat versucht, einen schreibgesch\u00fctzten Nachrichtentext zu lesen.
JMSCC0046.useraction = Entfernen Sie die Einstellung f\u00fcr dieses Verhalten aus dem Anwendungsprogramm, oder rufen Sie zuerst die Methode 'reset()' auf.
JMSCC0046.inserts = XMSC_INSERT_METHOD
JMSCC0046.exception = com.ibm.msg.client.jms.DetailedMessageNotReadableException

JMSCC0048 = Beim Erstellen der Nachricht ist ein Fehler aufgetreten. Weitere Informationen finden Sie in der verkn\u00fcpften Ausnahmebedingung.
JMSCC0048.explanation = Die Nachricht konnte aufgrund eines Fehlers nicht erstellt werden.
JMSCC0048.useraction = Einzelheiten zu dem Fehler finden Sie unter der damit verbundenen Ausnahmebedingung.

JMSCC0049 = Der Eigenschaftsname ''{0}'' ist keine g\u00fcltige Java(tm)-ID.
JMSCC0049.explanation = Der angegebene Eigenschaftenname entspricht nicht dem in der JMS-Spezifikation beschriebenen zul\u00e4ssigen Format.
JMSCC0049.useraction = \u00dcberpr\u00fcfen Sie die im Eigenschaftsnamen verwendeten Zeichen, und modifizieren Sie diese bei Bedarf.
JMSCC0049.inserts = XMSC_INSERT_PROPERTY
JMSCC0049.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0050 = Der Eigenschaftsname ''{0}'' ist reserviert und kann nicht festgelegt werden.
JMSCC0050.explanation = Der angegebene Eigenschaftsname beginnt mit dem JMS-Pr\u00e4fix, geh\u00f6rt aber nicht zu den unterst\u00fctzten, festlegbaren Eigenschaften.
JMSCC0050.useraction = \u00dcberpr\u00fcfen Sie den Eigenschaftsnamen, und korrigieren Sie die Fehler.
JMSCC0050.inserts = XMSC_INSERT_PROPERTY
JMSCC0050.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0051 = Die Eigenschaft ''{0}'' muss mit dem Typ ''{1}'' festgelegt werden, nicht mit dem Typ ''{2}''.
JMSCC0051.explanation = JMS_IBM-Eigenschaften d\u00fcrfen nur mithilfe eines spezifischen Variablentyps festgelegt werden.
JMSCC0051.useraction = Korrigieren Sie den Anwendungscode, so dass beim Festlegen dieser JMS_IBM-Eigenschaft der erforderliche Variablentyp verwendet wird.
JMSCC0051.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE
JMSCC0051.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0052 = Beim Serialisieren des folgenden Objekts ist eine Ausnahmebedingung aufgetreten: ''{0}''
JMSCC0052.explanation = Das Objekt konnte aufgrund der Ausnahmebedingung nicht serialisiert werden.
JMSCC0052.useraction = Weitere Informationen zu dem Fehler finden Sie in der verkn\u00fcpften Ausnahmebedingung.
JMSCC0052.inserts = XMSC_INSERT_EXCEPTION
JMSCC0052.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0053 = Beim Deserialisieren einer Nachricht ist folgende Ausnahmebedingung aufgetreten: ''{0}''
JMSCC0053.explanation = Das Objekt konnte aufgrund der Ausnahmebedingung nicht deserialisiert werden.
JMSCC0053.useraction = Weitere Informationen zu dem Fehler finden Sie in der verkn\u00fcpften Ausnahmebedingung.
JMSCC0053.inserts = XMSC_INSERT_EXCEPTION
JMSCC0053.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0054 = Im Warteschlangenbrowser sind keine Nachrichten verf\u00fcgbar.
JMSCC0054.explanation = Eine Benutzeranwendung hat eine Nachricht von einem Warteschlangenbrowser angefordert, obwohl keine verf\u00fcgbar war.
JMSCC0054.useraction = Stellen Sie sicher, dass die Anwendung entweder diese Methode nicht aufruft, wenn keine Nachrichten verf\u00fcgbar sind, oder diese Ausnahmebedingung behandelt.
JMSCC0054.exception = java.util.NoSuchElementException

JMSCC0055 = Dieser Warteschlangenbrowser wurde geschlossen.
JMSCC0055.explanation = Eine Anwendung hat eine Methode aufgerufen, die nach dem Schlie\u00dfen des Warteschlangenbrowsers nicht verwendet werden darf.
JMSCC0055.useraction = Stellen Sie vor dem Aufruf der Methode sicher, dass der Warteschlangenbrowser nicht geschlossen wurde.
JMSCC0055.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0059 = Der Lesepuffer ist leer.
JMSCC0059.explanation = An die Methode 'StreamMessage.readBytes()' wurde ein Verweis \u00fcbergeben, der Nullwerte enthielt. Es konnten daher keine Daten zur\u00fcckgegeben werden.
JMSCC0059.useraction = \u00dcbergeben Sie einen Puffer mit einer geeigneten Gr\u00f6\u00dfe an die Methode 'readBytes()'.
JMSCC0059.exception = java.lang.NullPointerException

JMSCC0060 = Das Ende des Nachrichtendatenstroms wurde erreicht.
JMSCC0060.explanation = Das Ende des Nachrichteninhalts wurde erreicht. Dies ist normal, wenn die Leseanwendung die zu erwartende Datenmenge nicht kennt.
JMSCC0060.useraction = Keine Aktion erforderlich.
JMSCC0060.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCC0061 = Die Bytefeldgruppe "StreamMessage" wurde nicht vollst\u00e4ndig gelesen.
JMSCC0061.explanation = Es wurde versucht, das n\u00e4chste Feld im Datenstrom zu lesen, obwohl die Bytefeldgruppe erst teilweise gelesen wurde.
JMSCC0061.useraction = Stellen Sie sicher, dass der Benutzercode zuerst den Lesevorgang der Bytefeldgruppe beendet, bevor das n\u00e4chste Feld gelesen wird.
JMSCC0061.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0062 = Null kann nicht als Zeichen zur\u00fcckgegeben werden.
JMSCC0062.explanation = Es wurde versucht, \u00fcber die Methode 'readChar()' die Daten in einem Feld 'StreamMessage' zu lesen, das Nullwerte enthielt.
JMSCC0062.useraction = Vermeiden Sie das Lesen von Nullwerten \u00fcber die Methode 'readChar()'.
JMSCC0062.exception = java.lang.NullPointerException

JMSCC0063 = Die Codierung f\u00fcr die Zeichenfolge ''{0}'' ist nicht zul\u00e4ssig.
JMSCC0063.explanation = F\u00fcr den angegebenen Wert ist keine bekannte Codierung vorhanden.
JMSCC0063.useraction = Stellen Sie sicher, dass die Anwendung einen Wert aus der definierten Liste der Codierungen angibt.
JMSCC0063.inserts = JMS_IBM_Encoding

JMSCC0064 = Beim Schreiben in den Datenstrom ist ein interner Fehler aufgetreten.
JMSCC0064.explanation = Bei Datenstr\u00f6men zur Formatkonvertierung von variablen und doppelten Werten ist ein Fehler aufgetreten.
JMSCC0064.useraction = Sichern Sie alle generierten Ausgabedateien. Ob bereits eine L\u00f6sung zur Verf\u00fcgung steht, erfahren Sie entweder \u00fcber die WMQ-Unterst\u00fctzungssite http://www.ibm.com/software/integration/wmq/support/ oder \u00fcber den IBM Support Assistant (ISA) unter http://www.ibm.com/software/support/isa/.  Wenn Sie keine passende L\u00f6sung finden, wenden Sie sich an Ihr IBM Support Center.

JMSCC0065 = Es wurde versucht, den Lesevorgang am Ende der Nachricht fortzusetzen.
JMSCC0065.explanation = Es wurde versucht, den Lesevorgang am Ende der Nachricht fortzusetzen. Dieses Bedingung ist normal, wenn die Anwendung zum Lesen von Daten mit variabler L\u00e4nge unter Verwendung der JMS 1.0.2-Spezifikation codiert wurde.
JMSCC0065.useraction = Falls erforderlich, codieren Sie die Anwendung erneut, so dass die neue Methode 'getBodyLength()' verwendet wird.
JMSCC0065.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCC0066 = Die UTF-8-Konvertierung ist fehlgeschlagen.
JMSCC0066.explanation = Beim Lesen oder Schreiben einer UTF-8-Zeichenfolge ist ein Fehler aufgetreten. Der am h\u00e4ufigsten auftretende Fehler besteht darin, dass eine Zeichenfolge mit mehr als 65535 Zeichen geschrieben wird.
JMSCC0066.useraction = Weitere Informationen finden Sie in der verkn\u00fcpften Ausnahmebedingung.
JMSCC0066.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0067 = Ein interner Fehler ist aufgetreten. Beim Schreiben in die Nachricht ist ein Fehler aufgetreten.
JMSCC0067.explanation = Beim Schreiben eines Elements in die Nachricht ist ein Fehler aufgetreten.
JMSCC0067.useraction = Sichern Sie alle generierten Ausgabedateien. Ob bereits eine L\u00f6sung zur Verf\u00fcgung steht, erfahren Sie entweder \u00fcber die WMQ-Unterst\u00fctzungssite http://www.ibm.com/software/integration/wmq/support/ oder \u00fcber den IBM Support Assistant (ISA) unter http://www.ibm.com/software/support/isa/.  Wenn Sie keine passende L\u00f6sung finden, wenden Sie sich an Ihr IBM Support Center.
JMSCC0067.exception = com.ibm.msg.client.jms.DetailedResourceAllocationException

JMSCC0068 = Die Eigenschaft ''{0}'' muss auf einen Wert des Typs ''{1}'' oder eines Typs, der gem\u00e4\u00df JMS-Spezifikation in diesen Typ konvertierbar ist, festgelegt werden. Konvertierung des eingegebenen Typs ''{2}'' nicht m\u00f6glich . 
JMSCC0068.explanation = Die Konvertierung zwischen den zwei angegebenen Datentypen ist wegen der JMS-Spezifikation nicht zul\u00e4ssig.
JMSCC0068.useraction = Legen Sie die benannte Eigenschaft mithilfe einer der zul\u00e4ssigen Konvertierungen fest.
JMSCC0068.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC0068.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE

JMSCC0069 = Die Eigenschaft ''{0}'' muss auf einen Wert des Typs ''{1}'' festgelegt werden. Konvertierung des eingegebenen Typs ''{2}'' mit Wert ''{3}'' nicht m\u00f6glich. 
JMSCC0069.explanation = Beim Festlegen einer Nachrichteneigenschaft wurde ein Fehler festgestellt.
JMSCC0069.useraction = Legen Sie die benannte Eigenschaft mithilfe einer der zul\u00e4ssigen Konvertierungen auf einen geeigneten Wert fest.
JMSCC0069.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC0069.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE, XMSC_INSERT_VALUE

JMSCC0070 = Ein interner Fehler ist aufgetreten. Beim Festlegen der JMS-Nachrichteneigenschaft ''{0}'' ist ein Fehler aufgetreten; erwarteter Typ: ''{1}'', verwendeter Objekttyp: ''{2}''.
JMSCC0070.explanation = Beim Festlegen einer Nachrichteneigenschaft wurde ein Fehler festgestellt.
JMSCC0070.useraction = Sichern Sie alle generierten Ausgabedateien. Ob bereits eine L\u00f6sung zur Verf\u00fcgung steht, erfahren Sie entweder \u00fcber die WMQ-Unterst\u00fctzungssite http://www.ibm.com/software/integration/wmq/support/ oder \u00fcber den IBM Support Assistant (ISA) unter http://www.ibm.com/software/support/isa/.  Wenn Sie keine passende L\u00f6sung finden, wenden Sie sich an Ihr IBM Support Center.
JMSCC0070.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC0070.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE

JMSCC0083 = Es wurde ein falsches Objekt mit dem Typ ''{0}'' angegeben.
JMSCC0083.explanation = In der Methode 'writeObject()' wurde ein Objekt angegeben, das kein primitiver Java(tm)-Wrapper war.
JMSCC0083.useraction = Korrigieren Sie die Anwendung, und stellen Sie sicher, dass nur Objekte mit einem zul\u00e4ssigen Typ als Parameter an die Methode 'writeObject()' \u00fcbergeben werden.
JMSCC0083.inserts = XMSC_INSERT_OBJECT
JMSCC0083.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0084 = Eine Eigenschaft mit dem Namen ''{0}'' wurde nicht festgelegt.
JMSCC0084.inserts = XMSC_INSERT_PROPERTY

JMSCC0085 = Es wurde keine Zieladresse angegeben.
JMSCC0085.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0086 = Die Stapelgr\u00f6\u00dfe ''{0}'' war falsch.
JMSCC0086.inserts = XMSC_INSERT_BATCH_SIZE

JMSCC0087 = Es wurde kein Serversitzungspool angegeben.

JMSCC0088 = Aus dem angegebenen Serversitzungspool konnte keine Sitzung abgerufen werden.

JMSCC0089 = Die Sitzung ''{0}'' war nicht g\u00fcltig.
JMSCC0089.inserts = XMSC_INSERT_SESSION

JMSCC0091 = Die Provider-Factory f\u00fcr den Verbindungstyp ''{0}'' konnte nicht geladen werden.
JMSCC0091.inserts = XMSC_CONNECTION_TYPE

JMSCC0092 = Es wurde der Verbindungstyp ''{0}'' erwartet; dieser lautete allerdings ''{1}''.
JMSCC0092.inserts = XMSC_CONNECTION_TYPE_NAME, XMSC_CONNECTION_TYPE
JMSCC0092.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0093 = Die Zieladresse war nicht g\u00fcltig. Die permanente Subskription f\u00fcr eine tempor\u00e4re Zieladresse mit dem Typ ''{0}'' und dem Namen ''{1}'' kann nicht erstellt werden.
JMSCC0093.inserts = XMSC_INSERT_TYPE, XMSC_DESTINATION_NAME
JMSCC0093.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0094 = Der Browser f\u00fcr diese Verbindung wird geschlossen.
JMSCC0094.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0095 = Der Name der Zieladresse (''{0}'') ist nicht g\u00fcltig.
JMSCC0095.explanation = Der angegebene Name der Zieladresse stimmt nicht mit der ver\u00f6ffentlichen Syntax f\u00fcr Zieladressen \u00fcberein.
JMSCC0095.useraction = Korrigieren Sie den angegebenen Namen der Zieladresse, und wiederholen Sie den Vorgang.
JMSCC0095.inserts = XMSC_DESTINATION_NAME
JMSCC0095.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0097 = Fehlerhafter Best\u00e4tigungsmodus (''{0}''). Connection.createSession() wurde aufgefordert, eine nicht ausgef\u00fchrte Sitzung zu erstellen (f\u00fcr ausgef\u00fchrte Sitzungen wurde ''false'' festgelegt); der Best\u00e4tigungsmodus lautete jedoch nicht AUTO_ACKNOWLEDGE, DUPS_OK_ACKNOWLEDGE oder CLIENT_ACKNOWLEDGE.
JMSCC0097.inserts = XMSC_ACKNOWLEDGE_MODE

JMSCC0098 = Die Nachricht darf keine Nullwerte enthalten.
JMSCC0098.useraction = Geben Sie eine Nachricht an, die keine Nullwerte enth\u00e4lt.
JMSCC0098.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0099 = Die Zieladresse ''{0}'' ist keine Instanz von com.ibm.msg.client.jms.JmsDestination.
JMSCC0099.useraction = Geben Sie stattdessen eine Instanz von com.ibm.msg.client.jms.JmsDestination an.
JMSCC0099.inserts = XMSC_DESTINATION_NAME
JMSCC0099.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0100 = Der Name der Subskription darf keine Nullwerte enthalten.
JMSCC0100.useraction = Geben Sie den Namen einer Subskription an, der keine Nullwerte enth\u00e4lt.
JMSCC0100.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0101 = Die Client-ID darf keine Nullwerte enthalten.
JMSCC0101.useraction = Geben Sie eine Client-ID an, die keine Nullwerte enth\u00e4lt.
JMSCC0101.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0102 = Der in der Nachricht enthaltene Eigenschaftsname ''{0}'' ist keine zul\u00e4ssige Java(tm)-ID.
JMSCC0102.explanation = Der angegebene Eigenschaftenname entspricht nicht dem in der JMS-Spezifikation beschriebenen zul\u00e4ssigen Format.
JMSCC0102.useraction = \u00dcberpr\u00fcfen Sie die im Eigenschaftsnamen verwendeten Zeichen, und modifizieren Sie diese bei Bedarf.
JMSCC0102.inserts = XMSC_INSERT_PROPERTY
JMSCC0102.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0103 = Es wurde ein Objekt angegeben, das Nullwerte enthielt.
JMSCC0103.explanation = In der Methode 'writeObject()' wurde ein Objekt angegeben, das Nullwerte enthielt.
JMSCC0103.useraction = Korrigieren Sie die Anwendung, und stellen Sie sicher, dass nur Objekte, die keine Nullwerte enthalten, als Parameter an die Methode 'writeObject()' \u00fcbergeben werden.
JMSCC0103.exception = java.lang.NullPointerException

JMSCC0105 = Die Konvertierung der Komponente ''{0}'' von Typ ''{1}'' in Typ ''{2}'' ist nicht zul\u00e4ssig.
JMSCC0105.explanation = Die Konvertierung zwischen den beiden angegebenen Datentypen ist nach der JMS-Spezifikation nicht zul\u00e4ssig.
JMSCC0105.useraction = Laden Sie das benannte Element mithilfe einer der zul\u00e4ssigen Konvertierungen.
JMSCC0105.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE
JMSCC0105.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0106 = Fehler beim Abrufen einer XA-Ressource. ''{0}''.
JMSCC0106.useraction = Weitere Informationen finden Sie in der Erl\u00e4uterung der Ursache.
JMSCC0106.inserts = XMSC_INSERT_EXCEPTION
JMSCC0106.exception = java.lang.RuntimeException

JMSCC0107 = Fehlerhaftes Zeitlimit (''{0}'').
JMSCC0107.explanation = Der Wert f\u00fcr das Zeitlimit muss positiv oder Null sein (in Millisekunden).
JMSCC0107.useraction = \u00dcbergeben Sie keinen negativen Wert f\u00fcr das Zeitlimit.
JMSCC0107.inserts = XMSC_INSERT_TIMEOUT

# Message changed for APAR IT16300
JMSCC0108 = IBM MQ Classes for JMS hat eine Nachricht gefunden, die f\u00fcr die asynchrone \u00dcbermittlung an eine Anwendung bereit war. Als die \u00dcbermittlung versucht wurde, war die Nachricht nicht mehr verf\u00fcgbar. Schlagen Sie m\u00f6gliche Ursachen und Aktionen im Thema "Fehlerbehebung bei JMSCC0108-Nachrichten" im Abschnitt IBM MQ V9.0 des IBM Knowledge Center nach.
JMSCC0108.explanation = Ein interner Thread in IBM MQ Classes for JMS hat eine Nachricht gefunden und angefordert, dass ein anderer interner Thread die Nachricht abruft und zur Verarbeitung an eine Anwendung \u00fcbermittelt. Als der Thread versucht hat, die Nachricht abzurufen, war sie nicht mehr verf\u00fcgbar.
JMSCC0108.useraction = Sie finden weitere Informationen hierzu im Thema "Fehlerbehebung bei JMSCC0108-Nachrichten" im Abschnitt IBM MQ V9.0 des IBM Knowledge Center.

JMSCC0109 = Ein nachrichtengesteuertes Bean gab eine Laufzeitausnahmebedingung (''{0}'') aus.
JMSCC0109.explanation = Dies kann auf ein Problem im Nachrichtenempfangsprogramm hinweisen.
JMSCC0109.useraction = Falls die Laufzeitausnahmebedingung versehentlich durch das Nachrichtenempfangsprogramm ausgel\u00f6st wurde, bestimmen Sie anhand der verkn\u00fcpften Ausnahme die Ursache des Problems.
JMSCC0109.inserts = XMSC_INSERT_EXCEPTION
JMSCC0109.exception = java.lang.RuntimeException

JMSCC0110 = Beim Verarbeiten einer Nachrichten zur \u00dcbermittlung an ein nachrichtengesteuertes Bean wurde eine Ausnahmebedingung (''{0}'') ermittelt.
JMSCC0110.useraction = Weitere Informationen finden Sie in der verkn\u00fcpften Ausnahmebedingung.
JMSCC0110.inserts = XMSC_INSERT_EXCEPTION
JMSCC0110.exception = java.lang.RuntimeException

JMSCC0111 = IBM MQ Classes for JMS hat versucht, eine bereits existierende Client-ID auf einer Verbindung oder einem JMSContext festzulegen.
JMSCC0111.explanation = Eine Anwendung hat versucht, die Client-ID-Eigenschaft einer g\u00fcltigen Verbindung oder eines g\u00fcltigen JMSContext auf den Wert ''{0}'' zu setzen, aber dieser Wert wurde bereits verwendet.\n\
clientId wurde bereits von {1} festgelegt.
JMSCC0111.useraction = Stellen Sie sicher, dass die Verbindung zul\u00e4ssig ist und die Client-ID eindeutig ist.
JMSCC0111.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_STRING
JMSCC0111.exception = com.ibm.msg.client.jms.DetailedInvalidClientIDException

JMSCC0112 = Bereitstellungsverz\u00f6gerung wird von diesem Provider nicht unterst\u00fctzt
JMSCC0112.explanation = Eine Anwendung hat versucht, eine Bereitstellungsverz\u00f6gerung festzulegen, der JMS-Provider unterst\u00fctzt dies jedoch nicht.

JMSCC0113 = Bereitstellungsverz\u00f6gerung muss kleiner als als die Lebensdauer sein
JMSCC0113.explanation = Eine Anwendung hat versucht, eine Bereitstellungsverz\u00f6gerung festzulegen, die Lebensdauer war jedoch nicht gr\u00f6\u00dfer als diese Verz\u00f6gerung.

JMSCC0114 = Bereitstellungsverz\u00f6gerung wird f\u00fcr st\u00e4ndige Ver\u00f6ffentlichungen nicht unterst\u00fctzt
JMSCC0114.explanation = Eine Anwendung hat versucht, eine Bereitstellungsverz\u00f6gerung f\u00fcr eine st\u00e4ndige Nachricht festzulegen, dies wird jedoch nicht unterst\u00fctzt.

JMSCC0115 = Bereitstellungsverz\u00f6gerung wird f\u00fcr Gruppierungen nicht unterst\u00fctzt
JMSCC0115.explanation = Eine Anwendung hat versucht, eine Bereitstellungsverz\u00f6gerung f\u00fcr eine Nachricht mit einer Gruppen-ID bzw. einer Gruppenfolgenummer festzulegen, dies wird jedoch nicht unterst\u00fctzt.

# Message for FFST - additional fields not required
JMSCC1026 = W\u00e4hrend der Ausf\u00fchrung des Empfangsprogramms f\u00fcr Ausnahmebedingungen des Benutzers wurde eine Ausnahmebedingung ausgegeben.

# Message for FFST - additional fields not required
JMSCC1027 = Das Empfangsprogramm f\u00fcr Ausnahmebedingungen konnte nicht ausgef\u00fchrt werden.

JMSCC1069 = Die Operation f\u00fcr eine ausgef\u00fchrte XA-Sitzung war ung\u00fcltig.
JMSCC1069.explanation = Der Best\u00e4tigungsmodus f\u00fcr eine ausgef\u00fchrte Sitzung war ung\u00fcltig. In ausgef\u00fchrten Sitzungen d\u00fcrfen die Operationen 'Commit()', 'rollback()', 'acknowledge()' und 'recover()' nicht ausgef\u00fchrt werden.
JMSCC1069.useraction = Rufen Sie diese Methoden nicht bei Verwendung von XA auf.
JMSCC1069.exception = com.ibm.msg.client.jms.DetailedTransactionInProgressException

JMSCC1083 = Falsche Gr\u00f6\u00dfe des Nachrichtenstapels (muss gr\u00f6\u00dfer als Null sein).
JMSCC1083.explanation = An 'createConnectionConsumer()' oder 'createDurableConnectionConsumer()' wurde ein falscher Parameter f\u00fcr die Stapelgr\u00f6\u00dfe \u00fcbergeben.
JMSCC1083.useraction = Legen Sie f\u00fcr die Stapelgr\u00f6\u00dfe einen Wert gr\u00f6\u00dfer als Null fest. Auf einem JEE-kompatiblen Anwendungsserver kann dies einen Fehler auf dem Anwendungsserver darstellen. Weitere Informationen hierzu finden Sie in der Dokumentation zum Anwendungsserver.

JMSCC1084 = Es wurde ein Serversitzungspool angegeben, der Nullwerte enthielt.
JMSCC1084.explanation = Der in 'createConnectionConsumer()' oder 'createDurableConnectionConsumer()' angegebene Serversitzungspool enthielt Nullwerte.
JMSCC1084.useraction = Legen Sie einen geeigneten Serversitzungspool (ServerSessionPool) fest. Auf einem JEE-kompatiblen Anwendungsserver kann dies einen Fehler auf dem Anwendungsserver darstellen. Weitere Informationen hierzu finden Sie in der Dokumentation zum Anwendungsserver.

JMSCC1093 = Es wurde ein Parameter \u00fcbermittelt, der Nullwerte enthielt.
JMSCC1093.explanation = Ein f\u00fcr diese Methode erforderliches Objekt wurde nicht ordnungsgem\u00e4\u00df initialisiert.
JMSCC1093.useraction = Stellen Sie sicher, dass alle an diese Methode \u00fcbergebenen Parameter ordnungsgem\u00e4\u00df initialisiert wurden.

JMSCC1094 = 'QuantityHint' ist ung\u00fcltig.
JMSCC1094.explanation = Es wurde versucht, einen Verbindungs-Browser mit einem 'QuantityHint' mit falschen Daten zu erstellen.
JMSCC1094.useraction = Geben Sie entweder NO_DATA, HEADER_DATA oder FULL_DATA an.
JMSCC1094.exception = java.lang.IllegalArgumentException

JMSCC1096 = Die Nachrichtenreferenz ist ung\u00fcltig.
JMSCC1096.explanation = Eine Nachrichtenreferenz wurde im falschen Format an diese Methode \u00fcbergeben. Die Nachrichtenreferenz muss eine Instanz von JmsMessageReference sein.
JMSCC1096.useraction = Stellen Sie sicher, dass Nachrichtenreferenzen im richtigen Format verwendet werden.

JMSCC1112 = Die Operation f\u00fcr ein dom\u00e4nenspezifisches Objekt war ung\u00fcltig. Die Operation ''{0}'' ist nicht g\u00fcltig f\u00fcr den Typ ''{1}''.
JMSCC1112.explanation = Eine JMS-Anwendung versuchte, eine Operation f\u00fcr ein dom\u00e4nenspezifisches Objekt durchzuf\u00fchren. Diese Operation ist jedoch nur f\u00fcr die andere Nachrichtendom\u00e4ne g\u00fcltig.
JMSCC1112.useraction = Stellen Sie sicher, dass die JMS-Objekte und -Operationen, die Ihre Anwendung verwendet, f\u00fcr die erforderliche Nachrichtendom\u00e4ne relevant sind. Falls Ihre Anwendung beide Nachrichtendom\u00e4nen verwendet, empfiehlt es sich, dom\u00e4nenunabh\u00e4ngige Objekte in der gesamten Anwendung zu verwenden.
JMSCC1112.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_TYPE
JMSCC1112.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC1113 = Die Operation f\u00fcr ein dom\u00e4nenspezifisches Objekt war ung\u00fcltig. Die Operation ''{0}'' ist nicht g\u00fcltig f\u00fcr den Typ ''{1}'', da die Sitzung Typ ''{2}'' hat.
JMSCC1113.explanation = Eine JMS-Anwendung versuchte, eine Operation f\u00fcr ein dom\u00e4nenspezifisches Objekt durchzuf\u00fchren. Diese Operation ist jedoch nur f\u00fcr die andere Nachrichtendom\u00e4ne g\u00fcltig.
JMSCC1113.useraction = Stellen Sie sicher, dass die JMS-Objekte, -Operationen und -Verbindungsfactorys, die Ihre Anwendung verwendet, f\u00fcr die erforderliche Nachrichtendom\u00e4ne relevant sind. Falls Ihre Anwendung beide Nachrichtendom\u00e4nen verwendet, empfiehlt es sich, dom\u00e4nenunabh\u00e4ngige Objekte in der gesamten Anwendung zu verwenden.
JMSCC1113.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_TYPE,XMSC_INSERT_SESSION
JMSCC1113.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC3002 = Das tempor\u00e4re Warteschlangenziel ''{0}'' kann nicht gel\u00f6scht werden, da es weiterhin verwendet wird.
JMSCC3002.explanation = Es wurde versucht, eine tempor\u00e4re Zieladresse zu l\u00f6schen, w\u00e4hrend diese weiterhin von einem Benutzer oder Browser verwendet wird.
JMSCC3002.useraction = Beenden Sie vor dem L\u00f6schen alle Benutzer- oder Browsersitzungen, die von dieser Zieladresse abh\u00e4ngen.
JMSCC3002.inserts = XMSC_DESTINATION_NAME

JMSCC3003 = Falsche Verwendung der tempor\u00e4ren Zieladresse ''{0}''.
JMSCC3003.explanation = Die Verwendung tempor\u00e4rer Zieladressen durch Nachrichtenbenutzer und -browser ist auf diejenigen beschr\u00e4nkt, die \u00fcber dieselbe Verbindung erstellt wurden.
JMSCC3003.useraction = \u00c4ndern Sie die Anwendung so, dass eine tempor\u00e4re Zieladresse verwendet wird, die \u00fcber dieselbe Verbindung erstellt wurde, und wiederholen Sie den Vorgang.
JMSCC3003.inserts = XMSC_DESTINATION_NAME
JMSCC3003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException


JMSCC3019 = Die tempor\u00e4re Zieladresse (''{0}'') wurde bereits gel\u00f6scht.
JMSCC3019.explanation = Die tempor\u00e4re Zieladresse wurde bereits gel\u00f6scht, als versucht wurde, diese zu verwenden.
JMSCC3019.useraction = \u00c4ndern Sie die Anwendung so, dass die tempor\u00e4re Zieladresse nicht beendet wird, oder verwenden Sie eine andere Zieladresse.
JMSCC3019.inserts = XMSC_DESTINATION_NAME
JMSCC3019.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC3025 = Das tempor\u00e4re Themenziel ''{0}'' kann nicht gel\u00f6scht werden, da es weiterhin verwendet wird.
JMSCC3025.explanation = Es wurde versucht, eine tempor\u00e4re Zieladresse zu l\u00f6schen, w\u00e4hrend diese weiterhin von einem Benutzer oder Browser verwendet wird.
JMSCC3025.useraction = Beenden Sie vor dem L\u00f6schen alle Benutzer- oder Browsersitzungen, die von dieser Zieladresse abh\u00e4ngen.
JMSCC3025.inserts = XMSC_DESTINATION_NAME

JMSCC3031 = Eine Client-ID kann nicht nach Verwendung der Verbindung festgelegt werden.
JMSCC3031.explanation = Die Client-ID einer Verbindung kann nur einmal und nur vor Verwendung der Verbindung festgelegt werden.
JMSCC3031.useraction = Legen Sie vor Verwendung der Verbindung die Client-ID fest.
JMSCC3031.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC3032 = Das Zur\u00fccksetzen der Client-ID ist nicht zul\u00e4ssig.
JMSCC3032.explanation = Die Client-ID einer Verbindung kann nur einmal und nur vor Verwendung der Verbindung festgelegt werden.
JMSCC3032.useraction = Legen Sie vor Verwendung der Verbindung die Client-ID fest.
JMSCC3032.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC3033 = Der Aufruf 'close()' im Nachrichtenempfangsprogramm h\u00e4tte zu einem Deadlock gef\u00fchrt.
JMSCC3033.explanation = Die Methode 'close()' wurde \u00fcber ein Nachrichtenempfangsprogramm aufgerufen. Der Aufruf 'close()' darf keine Daten zur\u00fcckgegeben, w\u00e4hrend das Nachrichtenempfangsprogram ausgef\u00fchrt wird und f\u00fchrt daher zu einem Deadlock.
JMSCC3033.useraction = \u00c4ndern Sie die Anwendung so, dass keine Methode 'close()' \u00fcber ein Nachrichtenempfangsprogramm aufgerufen wird.
JMSCC3033.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

# Log message
JMSCC3034 = Die Ausnahmebedingung wird ignoriert, da kein Empfangsprogramm f\u00fcr Ausnahmebedingungen registriert ist: ''{0}''.
JMSCC3034.explanation = Es wurde versucht, eine Ausnahmebedingung an das Empfangsprogramm f\u00fcr Ausnahmebedingungen der Verbindung zu \u00fcbertragen; es wurde jedoch kein Empfangsprogramm registriert.
JMSCC3034.useraction = F\u00fcr die Verbindung muss ein Empfangsprogramm f\u00fcr Ausnahmebedingungen registriert sein, damit die zugeh\u00f6rigen Ausnahmebedingungen empfangen werden k\u00f6nnen.
JMSCC3034.inserts = XMSC_INSERT_EXCEPTION

# Log message
JMSCC3035 = Die Ausnahmebedingung wird ignoriert, da der zugeh\u00f6rige Typ nicht zu den f\u00fcr das Empfangsprogramm f\u00fcr Ausnahmebedingungen ausgew\u00e4hlten Typen geh\u00f6rt: ''{0}''
JMSCC3035.explanation = Die Ausnahmebedingung weist nicht einen der Typen auf, die f\u00fcr die \u00dcbertragung an das Empfangsprogramm f\u00fcr Ausnahmebedingungen der Verbindung ausgew\u00e4hlt wurden, und wurde daher ignoriert.
JMSCC3035.useraction = \u00dcberpr\u00fcfen Sie die Verbindungseinstellung f\u00fcr ASYNC_EXCEPTIONS, und stellen Sie sicher, dass die Filterung von Ausnahmebedingungen wie beabsichtigt festgelegt wurde.
JMSCC3035.inserts = XMSC_INSERT_EXCEPTION

# Log message
JMSCC3036 = An das Empfangsprogramm f\u00fcr Ausnahmebedingungen der Verbindung wurde folgende Ausnahmebedingung \u00fcbertragen: ''{0}''
JMSCC3036.useraction = Weitere Informationen hierzu finden Sie in den Details zur Ausnahmebedingung.
JMSCC3036.inserts = XMSC_INSERT_EXCEPTION

JMSCC3039 = Der Name der Subskription enthielt Nullwerte oder war eine leere Zeichenfolge.
JMSCC3039.explanation = Benutzer permanenter Verbindungen m\u00fcssen einen Namen einer Subskription haben, der keine Nullwerte enth\u00e4lt und keine leere Zeichenfolge ist.
JMSCC3039.useraction = \u00dcbergeben Sie einen Namen einer Subskription, der keine Nullwerte enth\u00e4lt und keine leere Zeichenfolge ist.

JMSCC3040 = Der Versuch, die Verbindungsmetadaten zu \u00e4ndern, wurde ignoriert. 
JMSCC3040.explanation = Die Verbindungsmetadaten sind schreibgesch\u00fctzt, Eigenschaften k\u00f6nnen nicht ge\u00e4ndert werden.
JMSCC3040.useraction = \u00c4ndern Sie die Anwendung so, dass sie nicht versucht, die Verbindungsmetadaten zu \u00e4ndern.

JMSCC3041 = Der Versuch, mehrere Eigenschaften auf einmal festzulegen, ist fehlgeschlagen. Die Eigenschaften sind ''{0}''.
JMSCC3041.explanation = Eine bzw. mehrere Eigenschaften haben die Validierung nicht bestanden, folglich wurden keine \u00c4nderungen durchgef\u00fchrt.
JMSCC3041.useraction = \u00dcberpr\u00fcfen Sie, ob die Kombination der Eigenschaften \u00fcber g\u00fcltige Werte verf\u00fcgt. 
JMSCC3041.inserts = XMSC_INSERT_PROPERTY

# XA unavailable. An attempt was made to perform and action that requires XA when XA is not supported.
JMSCC4001 = Verteilte Transaktionen stehen nicht zur Verf\u00fcgung.
JMSCC4001.explanation = Es wurde versucht, verteilte Transaktionen in einer Umgebung zu verwenden, in der diese nicht zur Verf\u00fcgung stehen.


JMSCC5001 = Hauptteil kann nicht abgerufen werden, da Nachricht eine Datenstromnachricht ist
JMSCC5001.explanation = Der Hauptteil konnte nicht abgerufen werden, da die Nachricht eine Datenstromnachricht ist und dies durch die JMS-Spezifikation nicht zugelassen ist.
JMSCC5001.useraction = Der gesendete Anwendungs- oder Nachrichtentyp muss ge\u00e4ndert werden.
JMSCC5001.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC5002 = Der Hauptteil der Nachricht des Typs {0} kann nicht zu {1} zugeordnet werden.
JMSCC5002.explanation = Die JMS-Spezifikation l\u00e4sst keine Zuordnung dieses Typs zu.
JMSCC5002.useraction = Der gesendete Anwendungs- oder Nachrichtentyp muss ge\u00e4ndert werden.
JMSCC5002.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC5002.inserts = XMSC_INSERT_MESSAGE_TYPE, XMSC_INSERT_BODY_TYPE

JMSCC5003 = Beim Deserialisieren einer Nachricht ist folgende Ausnahmebedingung aufgetreten: ''{0}''
JMSCC5003.explanation = Das Objekt konnte aufgrund der Ausnahmebedingung nicht deserialisiert werden.
JMSCC5003.useraction = Weitere Informationen zu dem Fehler finden Sie in der verkn\u00fcpften Ausnahmebedingung.
JMSCC5003.inserts = XMSC_INSERT_EXCEPTION
JMSCC5003.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC5004 = Nachricht verf\u00fcgt \u00fcber keinen Hauptteil
JMSCC5004.explanation = Die Nachricht verf\u00fcgt \u00fcber keinen Hauptteil und kann daher nicht in den angegebenen Typ umgewandelt werden.
JMSCC5004.useraction = Der gesendete Anwendungs- oder Nachrichtentyp muss ge\u00e4ndert werden.
JMSCC5004.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC5005 = Es ist nicht zul\u00e4ssig, diese Nachricht zu senden, da der Nachrichtentext schreibgesch\u00fctzt ist und ein JmsProducer.setProperty-Aufruf abgesetzt wurde.
JMSCC5005.explanation = Eine Benutzeranwendung hat versucht, einen schreibgesch\u00fctzten Nachrichtentext \u00fcber einen JmsProducer.setProperty-Aufruf festzulegen.
JMSCC5005.useraction = Entfernen Sie die Einstellung f\u00fcr dieses Verhalten aus dem Anwendungsprogramm, oder rufen Sie zuerst die Methode 'clearBody()' auf.
JMSCC5005.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSCC5006 = Es ist nicht zul\u00e4ssig, diese Nachricht zu senden, da der clientseitige asynchrone Sendepuffer voll ist
JMSCC5006.explanation = Eine Benutzeranwendung hat versucht, eine JMS-Nachricht asynchron zu senden, auf dem Client besteht jedoch schon ein R\u00fcckstand asynchron zu sendender Nachrichten.
JMSCC5006.useraction = \u00c4ndern Sie das Anwendungsprogramm, damit weniger h\u00e4ufig asynchrone Sendemethoden aufgerufen werden, oder passen Sie die Konfigurationsoptionen mithilfe der Dokumentation entsprechend an.

JMSCC5007 = Die Verwendung der JMS2.0-API ''{0}'' wird f\u00fcr diese Instanz dieser Verbindung nicht unterst\u00fctzt
JMSCC5007.explanation = Nur Verbindungen mit einem passenden Verbindungstyp unterst\u00fctzen die JMS2.0-API
JMSCC5007.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC5007.inserts =XMSC_INSERT_METHOD

JMSCC5008 = Die Verwendung der JMS2.0-Funktion ''{0}'' wird f\u00fcr diese Instanz dieser Verbindung nicht unterst\u00fctzt
JMSCC5008.explanation = Die Verwendung der in der Nachricht genannten JMS2.0-Funktion wird nur bei Verbindungen mit einem IBM MQ V8-Warteschlangenmanager unterst\u00fctzt, der im Modus von IBM MQ Messaging Provider V8 ausgef\u00fchrt wird.
JMSCC5008.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC5008.inserts =XMSC_INSERT_METHOD

JMSCC5009 = Keine Antwort vom sendenden Thread. Die Nachricht wurde m\u00f6glicherweise nicht gesendet.
JMSCC5009.explanation = Der asynchrone Sendethread antwortet nicht. M\u00f6glicherweise wurde der Thread unerwartet abgebrochen.

JMSCC5010 = ConnectionFactory-Eigenschaften aus PropertyStore werden \u00fcberschrieben:\n\
{0}
JMSCC5010.inserts = XMSC_INSERT_PROPERTY_OVERRIDE_LIST

JMSCC5011 = Eigenschaft {0} wird \u00fcberschrieben:\n\
\tUrspr\u00fcnglicher Wert = {1}\n\
\tNeuer Wert          = {2}
JMSCC5011.inserts = XMSC_OVERRIDDEN_PROPERTY, XMSC_ORIGINAL__PROPERTY_VALUE, XMSC_NEW_PROPERTY_VALUE

#CICS related messages. JMSCC6 used to prevent issues when back porting.
#The first two exceptions have the same text but different exception types
JMSCC6001 = Die ''{0}''-Methode wird nicht unterst\u00fctzt, wenn sie in einer CICS-Umgebung ausgef\u00fchrt wird.
JMSCC6001.explanation = Die angegebene Methode kann in einer CICS-Umgebung nicht mit einer Verbindung zu MQ im Bindungsmodus verwendet werden.
JMSCC6001.useraction = \u00c4ndern Sie die Anwendung, sodass sie die angegebene Methode nicht aufruft.
JMSCC6001.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6001.inserts = XMSC_INSERT_METHOD
 
JMSCC6002 = Die ''{0}''-Methode wird nicht unterst\u00fctzt, wenn sie in einer CICS-Umgebung ausgef\u00fchrt wird.
JMSCC6002.explanation = Die angegebene Methode kann in einer CICS-Umgebung nicht mit einer Verbindung zu MQ im Bindungsmodus verwendet werden.
JMSCC6002.useraction = \u00c4ndern Sie die Anwendung, sodass sie die angegebene Methode nicht aufruft.
JMSCC6002.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC6002.inserts = XMSC_INSERT_METHOD
 
JMSCC6003 = Bei Ausf\u00fchrung in einer CICS-Umgebung darf jeweils nur eine Sitzungsinstanz pro Verbindung aktiv sein.
JMSCC6003.explanation = In einer CICS-Umgebung darf jeweils nur eine Sitzungsinstanz pro Verbindung zu MQ im Bindungsmodus aktiv sein .
JMSCC6003.useraction = \u00c4ndern Sie die Anwendung, sodass sie entweder eine Sitzung \u00fcber eine andere Verbindung erstellt oder die bestehende Sitzung, die die aktuelle Verbindung verwendet, schlie\u00dft.
JMSCC6003.exception = com.ibm.msg.client.jms.DetailedJMSException
 
JMSCC6004 = Bei Ausf\u00fchrung in einer CICS-Umgebung wird das Erstellen einer Verbindung oder eines JMS-Kontexts mit einer Benutzer-ID oder einem Kennwort nicht unterst\u00fctzt.
JMSCC6004.explanation = In einer CICS-Umgebung unterst\u00fctzt der Warteschlangenmanager nicht die Authentifizierung oder Autorisierung mit Eingabe von Benutzer-ID und Kennwort bei der Erstellung einer Verbindung oder eines JMS-Kontexts im Bindungsmodus. Stattdessen wird die Benutzer-ID verwendet, die dem CICS-Adressraum bzw. der CICS-Transaktion zugeordnet ist.
JMSCC6004.useraction = \u00c4ndern Sie die Anwendung so, dass sie keine Benutzer-ID und kein Kennwort angibt.
JMSCC6004.exception = com.ibm.msg.client.jms.DetailedJMSException

#The first two exceptions have the same text but different exception types
JMSCC6011 = Die Methode ''{0}'' wird nicht unterst\u00fctzt, wenn sie in einer IMS-Umgebung ausgef\u00fchrt wird.
JMSCC6011.explanation = Die angegebene Methode kann in einer IMS-Umgebung nicht mit einer Verbindung zu MQ im Bindungsmodus verwendet werden.
JMSCC6011.useraction = \u00c4ndern Sie die Anwendung, sodass sie die angegebene Methode nicht aufruft.
JMSCC6011.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6011.inserts = XMSC_INSERT_METHOD
 
JMSCC6012 = Die Methode ''{0}'' wird nicht unterst\u00fctzt, wenn sie in einer IMS-Umgebung ausgef\u00fchrt wird.
JMSCC6012.explanation = Die angegebene Methode kann in einer IMS-Umgebung nicht mit einer Verbindung zu MQ im Bindungsmodus verwendet werden.
JMSCC6012.useraction = \u00c4ndern Sie die Anwendung, sodass sie die angegebene Methode nicht aufruft.
JMSCC6012.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC6012.inserts = XMSC_INSERT_METHOD
 
JMSCC6013 = Bei Ausf\u00fchrung in einer IMS-Umgebung darf jeweils nur eine Sitzungsinstanz pro Verbindung aktiv sein.
JMSCC6013.explanation = In einer IMS-Umgebung darf jeweils nur eine Sitzungsinstanz pro Verbindung zu MQ im Bindungsmodus aktiv sein .
JMSCC6013.useraction = \u00c4ndern Sie die Anwendung, sodass sie entweder eine Sitzung \u00fcber eine andere Verbindung erstellt oder die bestehende Sitzung, die die aktuelle Verbindung verwendet, schlie\u00dft.
JMSCC6013.exception = com.ibm.msg.client.jms.DetailedJMSException
 
JMSCC6014 = Bei Ausf\u00fchrung in einer IMS-Umgebung wird das Erstellen einer Verbindung oder eines JMS-Kontexts mit einer Benutzer-ID oder einem Kennwort nicht unterst\u00fctzt.
JMSCC6014.explanation = In einer IMS-Umgebung unterst\u00fctzt der Warteschlangenmanager nicht die Authentifizierung oder Autorisierung mit Eingabe von Benutzer-ID und Kennwort bei der Erstellung einer Verbindung oder eines JMS-Kontexts im Bindungsmodus. Stattdessen wird die Benutzer-ID verwendet, die dem IMS-Adressraum bzw. der IMS-Transaktion, dem LTERM-Namen oder PSNAME zugeordnet ist.
JMSCC6014.useraction = \u00c4ndern Sie die Anwendung so, dass sie keine Benutzer-ID und kein Kennwort angibt.
JMSCC6014.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSCC6015 = Die Methode ''{0}'' wird nicht unterst\u00fctzt, wenn sie in einem Anwendungsserver ausgef\u00fchrt wird.
JMSCC6015.explanation = Die angegebene Methode darf nicht in einer Java EE-EJB oder in einem Web-Container verwendet werden.
JMSCC6015.useraction = \u00c4ndern Sie die Anwendung, sodass sie die angegebene Methode nicht aufruft.
JMSCC6015.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6015.inserts = XMSC_INSERT_METHOD

JMSCC6016 = Beim Warten auf eine Serversitzung f\u00fcr den Anwendungsserver ist eine Zeitlimit\u00fcberschreitung aufgetreten. Das Zeitlimit wird auf ''{0}'' gesetzt
JMSCC6016.explanation = Nachdem der Zeitlimitwert abl\u00e4uft, muss der MQ-Ressourcenadapter das Warten auf eine Serversitzung abbrechen.
JMSCC6016.useraction = Erh\u00f6hen Sie eventuell diesen Zeitlimitwert mithilfe der JMS-Konfigurationseigenschaft 'com.ibm.msg.client.wmq.getServerSessionTimeout'
JMSCC6016.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6016.inserts = XMSC_INSERT_TIMEOUT
 
