# %Z% %W% %I% %E% %U%
#
#   <copyright 
#   notice="oco-source" 
#   pids="5724-H72" 
#   years="2008,2017" 
#   crc="775383328" > 
#   IBM Confidential 
#    
#   OCO Source Materials 
#    
#   5724-H72,5655-R36,5655-L82,5724-L26, 
#    
#   (C) Copyright IBM Corp. 2008, 2017 
#    
#   The source code for the program is not published 
#   or otherwise divested of its trade secrets, 
#   irrespective of what has been deposited with the 
#   U.S. Copyright Office. 
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR

JMSCC0001 = Une erreur interne s''est produite. Il n''a pas \u00e9t\u00e9 possible d''instancier une classe obligatoire : ''{0}''.
JMSCC0001.useraction = Sauvegardez les fichiers de sortie g\u00e9n\u00e9r\u00e9s et utilisez le site de support de MQ \
(http://www.ibm.com/software/integration/wmq/support) ou IBM Support Assistant (ISA) (http://www.ibm.com/software/support/isa/) pour d\u00e9terminer si une \
solution est d\u00e9j\u00e0 disponible.  Si vous n'en trouvez pas, adressez-vous \u00e0 votre service d'assistance IBM.
JMSCC0001.inserts = XMSC_INSERT_EXCEPTION

JMSCC0002 = IBM MQ classes for JMS a tent\u00e9 de d\u00e9finir un ID client non valide sur une connexion.
JMSCC0002.explanation = Une application a tent\u00e9 d'affecter \u00e0 la propri\u00e9t\u00e9 clientId d'une connexion valide la valeur null ou de d\u00e9finir la propri\u00e9t\u00e9 clientId d'une connexion non valide.
JMSCC0002.useraction = La propri\u00e9t\u00e9 clientId d'une connexion ne peut \u00eatre d\u00e9finie qu'une seule fois, il ne peut s'agir que d'une valeur non null et la propri\u00e9t\u00e9 ne peut \u00eatre d\u00e9finie qu'avant que la connexion ne soit utilis\u00e9e. V\u00e9rifiez que la connexion est valide et que l'ID client n'est pas null.
JMSCC0002.exception = com.ibm.msg.client.jms.DetailedInvalidClientIDException

JMSCC0003 = La valeur ''{1}'' sp\u00e9cifi\u00e9e n''est pas autoris\u00e9e pour ''{0}''.
JMSCC0003.explanation = La valeur indiqu\u00e9e n'est pas autoris\u00e9e pour cette propri\u00e9t\u00e9.
JMSCC0003.useraction = Indiquez une valeur prise en charge pour cette propri\u00e9t\u00e9.
JMSCC0003.inserts = XMSC_INSERT_NAME, XMSC_INSERT_VALUE
JMSCC0003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0004 = L'appel de la m\u00e9thode de r\u00e9ception ne renverra pas de message pour une connexion arr\u00eat\u00e9e.
JMSCC0004.explanation = La sp\u00e9cification JMS indique que l'appel de la m\u00e9thode receive() ne doit pas renvoyer de message si la connexion est arr\u00eat\u00e9e. L'appel de receiveNoWait ou de la m\u00e9thode de r\u00e9ception avec un d\u00e9lai d'expiration renverra la valeur null lorsque le d\u00e9lai arrive \u00e0 expiration. L'appel de la m\u00e9thode de r\u00e9ception sans d\u00e9lai d'expiration ne renverra rien avant que la connexion ne soit d\u00e9marr\u00e9e ou ferm\u00e9e ou que l'application soit arr\u00eat\u00e9e.
JMSCC0004.useraction = D\u00e9marrez la connexion en appelant javax.jms.Connection.start(). 

# JMSCC0005 is the same as JMSCC0003 except that JMSCC0003 throws a InvalidDestinationException
# whereas JMSCC0005 throws an JMSException.
JMSCC0005 = La valeur ''{1}'' sp\u00e9cifi\u00e9e n''est pas autoris\u00e9e pour ''{0}''.
JMSCC0005.explanation = La valeur indiqu\u00e9e n'est pas autoris\u00e9e pour cette propri\u00e9t\u00e9.
JMSCC0005.useraction = Indiquez une valeur prise en charge pour cette propri\u00e9t\u00e9.
JMSCC0005.inserts = XMSC_INSERT_NAME, XMSC_INSERT_VALUE

JMSCC0007 = Une exception a \u00e9t\u00e9 re\u00e7ue lors de l''appel \u00e0 la m\u00e9thode ''{1}'' : ''{0}''.
JMSCC0007.explanation = Une exception a \u00e9t\u00e9 g\u00e9n\u00e9r\u00e9e par un autre composant alors que la m\u00e9thode sp\u00e9cifi\u00e9e \u00e9tait en cours d'ex\u00e9cution.
JMSCC0007.useraction = Reportez-vous \u00e0 l'exception associ\u00e9e pour plus d'informations.
JMSCC0007.inserts = XMSC_INSERT_EXCEPTION, XMSC_INSERT_METHOD

JMSCC0008 = Cette connexion est ferm\u00e9e.
JMSCC0008.explanation = Une application a appel\u00e9 une m\u00e9thode qui ne doit pas \u00eatre utilis\u00e9e apr\u00e8s la fermeture de la connexion.
JMSCC0008.useraction = V\u00e9rifiez que la connexion n'est pas ferm\u00e9e avant d'appeler la m\u00e9thode.
JMSCC0008.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0011 = La m\u00e9thode ''{0}'' n''est pas autoris\u00e9e dans ce conteneur.
JMSCC0011.explanation = Une m\u00e9thode a \u00e9t\u00e9 appel\u00e9e qui n'est pas autoris\u00e9e dans le conteneur en cours.
JMSCC0011.useraction = Supprimez l'appel de la m\u00e9thode.
JMSCC0011.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0011.inserts = XMSC_INSERT_METHOD

JMSCC0012 = La m\u00e9thode ''{0}'' n''a peut-\u00eatre pas \u00e9t\u00e9 appel\u00e9e \u00e0 partir d''un programme d''\u00e9coute {1}.
JMSCC0012.explanation = Une m\u00e9thode a \u00e9t\u00e9 appel\u00e9e qui n'est pas autoris\u00e9e dans le contexte en cours.
JMSCC0012.useraction = Supprimez l'appel de la m\u00e9thode.
JMSCC0012.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0012.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_NAME

JMSCC0014 = L''appel de la m\u00e9thode ''{0}'' sur une session non transactionnelle est une op\u00e9ration non valide.
JMSCC0014.explanation = L'application a appel\u00e9 une m\u00e9thode qui ne doit pas \u00eatre appel\u00e9e sur une session non transactionnelle.
JMSCC0014.useraction = Modifiez le programme d'application pour supprimer ce comportement.
JMSCC0014.inserts = XMSC_INSERT_METHOD
JMSCC0014.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0020 = Cette session est ferm\u00e9e.
JMSCC0020.explanation = Une application a appel\u00e9 une m\u00e9thode qui ne doit pas \u00eatre utilis\u00e9e apr\u00e8s la fermeture de la session.
JMSCC0020.useraction = V\u00e9rifiez que la session n'est pas ferm\u00e9e avant d'appeler la m\u00e9thode.
JMSCC0020.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0021 = L''appel de la m\u00e9thode ''{0}'' sur une session transactionnelle est une op\u00e9ration non valide.
JMSCC0021.explanation = L'application a appel\u00e9 une m\u00e9thode qui ne doit pas \u00eatre appel\u00e9e sur une session transactionnelle.
JMSCC0021.useraction = Modifiez le programme d'application pour supprimer ce comportement.
JMSCC0021.inserts = XMSC_INSERT_METHOD
JMSCC0021.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0026 = Ce fournisseur de messages est ferm\u00e9.
JMSCC0026.explanation = Une application a appel\u00e9 une m\u00e9thode qui ne doit pas \u00eatre utilis\u00e9e apr\u00e8s la fermeture du fournisseur de messages.
JMSCC0026.useraction = V\u00e9rifiez que le fournisseur de messages n'est pas ferm\u00e9 avant d'appeler la m\u00e9thode.
JMSCC0026.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0029 = Une destination doit \u00eatre sp\u00e9cifi\u00e9e lors d'un envoi \u00e0 partir de ce fournisseur.
JMSCC0029.explanation = Le fournisseur a \u00e9t\u00e9 cr\u00e9\u00e9 avec une destination de type Null et aucune destination n'a \u00e9t\u00e9 fournie pour la m\u00e9thode d'envoi.
JMSCC0029.useraction = Modifiez l'application afin qu'une m\u00e9thode send() sp\u00e9cifiant une destination soit utilis\u00e9e ou sp\u00e9cifiez une destination lors de la cr\u00e9ation du fournisseur.
JMSCC0029.exception = java.lang.UnsupportedOperationException

JMSCC0030 = Vous ne pouvez pas sp\u00e9cifier de destination lors de l'envoi \u00e0 partir de ce fournisseur.
JMSCC0030.explanation = Le fournisseur a \u00e9t\u00e9 cr\u00e9\u00e9 avec une destination sp\u00e9cifi\u00e9e. Il n'est pas autoris\u00e9 de sp\u00e9cifier \u00e0 nouveau une destination lors de l'envoi d'un message.
JMSCC0030.useraction = Modifiez l'application afin qu'une m\u00e9thode d'envoi ne sp\u00e9cifiant pas de destination soit utilis\u00e9e ou sp\u00e9cifiez une destination de type Null lors de la cr\u00e9ation du fournisseur.
JMSCC0030.exception = java.lang.UnsupportedOperationException

JMSCC0031 = Vous ne pouvez pas sp\u00e9cifier un programme d'\u00e9coute de fin d'ex\u00e9cution nul.
JMSCC0031.explanation = L'appel \u00e0 la m\u00e9thode d'envoi comprenait un programme d'\u00e9coute de fin d'ex\u00e9cution, mais le programme d'\u00e9coute \u00e9tait nul.
JMSCC0031.useraction = Modifiez l'application afin qu'une m\u00e9thode d'envoi ne sp\u00e9cifiant pas de programme d'\u00e9coute de fin d'ex\u00e9cution soit utilis\u00e9e ou sp\u00e9cifiez un programme d'\u00e9coute de fin d'ex\u00e9cution non nul lors de l'appel d'envoi.
JMSCC0031.exception = java.lang.IllegalArgumentException

JMSCC0032 = Ce consommateur de messages est ferm\u00e9.
JMSCC0032.explanation = Une application a appel\u00e9 une m\u00e9thode qui ne doit pas \u00eatre utilis\u00e9e apr\u00e8s la fermeture du consommateur de messages.
JMSCC0032.useraction = V\u00e9rifiez que le consommateur de messages n'est pas ferm\u00e9 avant d'appeler la m\u00e9thode.
JMSCC0032.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0033 = Un appel de m\u00e9thode synchrone n''est pas permis lorsqu''une session est utilis\u00e9e de mani\u00e8re asynchrone : ''{0}''.
JMSCC0033.explanation = La sp\u00e9cification JMS ne permet pas l'utilisation d'une session pour les m\u00e9thodes synchrones lors de l'ex\u00e9cution de la livraison de messages asynchrones.
JMSCC0033.useraction = Cr\u00e9ez une session s\u00e9par\u00e9e si vous souhaitez utiliser les m\u00e9thodes synchrones et la livraison asynchrone simultan\u00e9ment.
JMSCC0033.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0033.inserts = XMSC_INSERT_METHOD

JMSCC0034 = Le m\u00e9canisme de distribution asynchrone est dans un \u00e9tat incoh\u00e9rent dans la m\u00e9thode : ''{0}''.
JMSCC0034.explanation = Une s\u00e9quence d'\u00e9v\u00e9nements inattendue a \u00e9t\u00e9 d\u00e9tect\u00e9e lors de la distribution des messages vers un bean g\u00e9r\u00e9 par message (MDB). Il peut s'agir d'erreurs d'application de programmation client.
JMSCC0034.useraction = V\u00e9rifiez dans les fichiers journaux du serveur d'applications s'il existe d'autres probl\u00e8mes associ\u00e9s au bean g\u00e9r\u00e9 par message. Sauvegardez les fichiers de sortie g\u00e9n\u00e9r\u00e9s et utilisez le site de support de WMQ (http://www.ibm.com/software/integration/wmq/support) ou IBM Support Assistant (ISA) (http://www.ibm.com/software/support/isa/) pour v\u00e9rifier si une solution est d\u00e9j\u00e0 disponible.  Si vous n'en trouvez pas, adressez-vous \u00e0 votre service d'assistance IBM.
JMSCC0034.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC0034.inserts = XMSC_INSERT_METHOD

JMSCC0037 = Une exception d'exception a \u00e9t\u00e9 g\u00e9n\u00e9r\u00e9e par la m\u00e9thode MessageListener.onMessage().
JMSCC0037.explanation = Un consommateur de message avec un programme d'\u00e9coute de messages enregistr\u00e9 a re\u00e7u une exception de la m\u00e9thode onMessage().
JMSCC0037.useraction = La m\u00e9thode onMessage() doit \u00eatre modifi\u00e9e pour \u00e9viter de g\u00e9n\u00e9rer des exceptions.

JMSCC0038 = L'utilisateur ne dispose pas des droits permettant d'effectuer cette op\u00e9ration. Reportez-vous \u00e0 l'exception associ\u00e9e pour plus d'informations.
JMSCC0038.explanation = L'exception associ\u00e9e contient des d\u00e9tails sur les droits requis pour mener \u00e0 bien cette op\u00e9ration.
JMSCC0038.useraction = L'administrateur doit accorder les droits requis \u00e0 l'utilisateur appropri\u00e9.

JMSCC0039 = Le type ''{0}'' n''est pas valide pour une utilisation comme propri\u00e9t\u00e9 d''objet ''{1}''.
JMSCC0039.explanation = Une application a tent\u00e9 de d\u00e9finir une propri\u00e9t\u00e9 d'objet \u00e0 l'aide d'un type d'objet qui n'est pas admis par la sp\u00e9cification JMS.
JMSCC0039.useraction = Utilisez un type d'objet autoris\u00e9. Les classes d'encapsulation primitives et les objets de cha\u00eene sont des types d'objet autoris\u00e9s.
JMSCC0039.inserts = XMSC_INSERT_TYPE, XMSC_INSERT_PROPERTY
JMSCC0039.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0040 = Une exception s''est produite lors de la r\u00e9ception d''un message : ''{0}''.
JMSCC0040.explanation = Lors de la r\u00e9ception d'un message, une exception a \u00e9t\u00e9 g\u00e9n\u00e9r\u00e9e qui a provoqu\u00e9 l'\u00e9chec de l'op\u00e9ration.
JMSCC0040.useraction = Pour obtenir plus d'informations, consultez l'exception sp\u00e9cifi\u00e9e et l'exception associ\u00e9e.
JMSCC0040.inserts = XMSC_INSERT_EXCEPTION
JMSCC0040.exception = com.ibm.msg.client.jms.internal.JmsQueueBrowserImpl.MessageConversionFailed

JMSCC0041 = La conversion de l''\u00e9l\u00e9ment ''{0}'' du type ''{1}'' en type ''{2}'' n''est pas autoris\u00e9e.
JMSCC0041.explanation = La conversion entre les deux types de donn\u00e9es sp\u00e9cifi\u00e9es n'est pas admise par la sp\u00e9cification JMS.
JMSCC0041.useraction = R\u00e9cup\u00e9rez l'\u00e9l\u00e9ment mentionn\u00e9 et convertissez-le selon l'une des m\u00e9thodes permises.
JMSCC0041.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE

JMSCC0042 = La zone de message ''{0}'' n''a pas \u00e9t\u00e9 d\u00e9finie.
JMSCC0042.explanation = Une application a tent\u00e9 d'extraire la valeur d'une zone qui n'a pas \u00e9t\u00e9 d\u00e9finie.
JMSCC0042.useraction = D\u00e9finissez la valeur de la zone avant de l'extraire.
JMSCC0042.inserts = XMSC_INSERT_FIELD

JMSCC0043 = Un nom de zone de cha\u00eene vide ou null n'est pas autoris\u00e9.
JMSCC0043.explanation = Une application utilisateur a tent\u00e9 de d\u00e9finir un nom qui n'est pas valide, par exemple cha\u00eene vide ou de type null.
JMSCC0043.useraction = Utilisez un nom de zone valide.
JMSCC0043.exception = java.lang.IllegalArgumentException

JMSCC0044 = L''appel de la m\u00e9thode ''{0}'' sur le message n''est pas autoris\u00e9 car le corps du message est en lecture seule.
JMSCC0044.explanation = Une application utilisateur a tent\u00e9 de d\u00e9finir un corps de message en lecture seule.
JMSCC0044.useraction = Modifiez le programme d'application en vue de supprimer ce comportement ou appelez tout d'abord la m\u00e9thode clearBody().
JMSCC0044.inserts = XMSC_INSERT_METHOD
JMSCC0044.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSCC0045 = L''appel de la m\u00e9thode ''{0}'' sur le message n''est pas autoris\u00e9 car les propri\u00e9t\u00e9s du message sont en lecture seule.
JMSCC0045.explanation = Une application utilisateur a tent\u00e9 de d\u00e9finir une propri\u00e9t\u00e9 de message en lecture seule.
JMSCC0045.useraction = Modifiez le programme d'application en vue de supprimer ce comportement ou appelez tout d'abord la m\u00e9thode clearProperties().
JMSCC0045.inserts = XMSC_INSERT_METHOD
JMSCC0045.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSCC0046 = L''appel de la m\u00e9thode ''{0}'' sur le message n''est pas autoris\u00e9 car le corps du message est en \u00e9criture seule.
JMSCC0046.explanation = Une application utilisateur a tent\u00e9 de lire un corps de message en \u00e9criture seule.
JMSCC0046.useraction = Modifiez le programme d'application en vue de supprimer ce comportement ou appelez tout d'abord la m\u00e9thode reset().
JMSCC0046.inserts = XMSC_INSERT_METHOD
JMSCC0046.exception = com.ibm.msg.client.jms.DetailedMessageNotReadableException

JMSCC0048 = Une erreur s'est produite lors de la tentative de cr\u00e9ation du message. Reportez-vous \u00e0 l'exception associ\u00e9e pour plus d'informations.
JMSCC0048.explanation = Il n'a pas \u00e9t\u00e9 possible de cr\u00e9er le message \u00e0 cause d'une erreur.
JMSCC0048.useraction = Pour obtenir plus de d\u00e9tails sur l'erreur, consultez l'exception associ\u00e9e.

JMSCC0049 = Le nom de propri\u00e9t\u00e9 ''{0}'' ne correspond pas \u00e0 un identificateur Java(tm) valide.
JMSCC0049.explanation = Le nom de propri\u00e9t\u00e9 indiqu\u00e9 ne correspond pas au format d\u00e9crit dans la sp\u00e9cification JMS.
JMSCC0049.useraction = V\u00e9rifiez les caract\u00e8res utilis\u00e9s dans le nom de la propri\u00e9t\u00e9 et modifiez-les.
JMSCC0049.inserts = XMSC_INSERT_PROPERTY
JMSCC0049.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0050 = Le nom de propri\u00e9t\u00e9 ''{0}'' est r\u00e9serv\u00e9 et ne peut pas \u00eatre d\u00e9fini.
JMSCC0050.explanation = Le nom de propri\u00e9t\u00e9 indiqu\u00e9 commence par le pr\u00e9fixe JMS, mais n'est pas une des propri\u00e9t\u00e9s prise en charge, pouvant \u00eatre d\u00e9finie.
JMSCC0050.useraction = V\u00e9rifiez le nom de la propri\u00e9t\u00e9 et corrigez les erreurs.
JMSCC0050.inserts = XMSC_INSERT_PROPERTY
JMSCC0050.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0051 = La propri\u00e9t\u00e9 ''{0}'' doit \u00eatre d\u00e9finie \u00e0 l''aide du type ''{1}'' et non ''{2}''.
JMSCC0051.explanation = Les propri\u00e9t\u00e9s JMS_IBM ne peuvent \u00eatre d\u00e9finies qu'\u00e0 l'aide d'un type de variable sp\u00e9cifique.
JMSCC0051.useraction = Corrigez le code de l'application afin d'utiliser le type de variable requis lors de la d\u00e9finition de cette propri\u00e9t\u00e9 JMS_IBM.
JMSCC0051.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE
JMSCC0051.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0052 = Une exception s''est produite lors de la s\u00e9rialisation de l''objet : ''{0}''.
JMSCC0052.explanation = Il n'a pas \u00e9t\u00e9 possible de s\u00e9rialiser l'objet \u00e0 cause de l'exception.
JMSCC0052.useraction = Pour obtenir plus de d\u00e9tails sur l'erreur, consultez l'exception associ\u00e9e.
JMSCC0052.inserts = XMSC_INSERT_EXCEPTION
JMSCC0052.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0053 = Une exception s''est produite lors de la d\u00e9s\u00e9rialisation d''un message ; exception : ''{0}''.
JMSCC0053.explanation = Il n'a pas \u00e9t\u00e9 possible de d\u00e9s\u00e9rialiser le message \u00e0 cause de l'exception affich\u00e9e.
JMSCC0053.useraction = Pour obtenir plus de d\u00e9tails sur l'erreur, consultez l'exception associ\u00e9e.
JMSCC0053.inserts = XMSC_INSERT_EXCEPTION
JMSCC0053.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0054 = Aucun message n'est disponible dans le navigateur de files d'attente.
JMSCC0054.explanation = Une application utilisateur a demand\u00e9 un message au navigateur de files d'attente alors qu'aucun message n'\u00e9tait disponible.
JMSCC0054.useraction = Veillez \u00e0 ce que, soit l'application n'appelle pas cette m\u00e9thode si aucun message n'est disponible, soit qu'elle g\u00e8re cette exception.
JMSCC0054.exception = java.util.NoSuchElementException

JMSCC0055 = Ce navigateur de files d'attente est ferm\u00e9.
JMSCC0055.explanation = Une application a appel\u00e9 une m\u00e9thode qui ne doit pas \u00eatre utilis\u00e9e apr\u00e8s la fermeture du navigateur de files d'attente.
JMSCC0055.useraction = V\u00e9rifiez que le navigateur de files d'attente ne soit pas ferm\u00e9 avant l'appel de la m\u00e9thode.
JMSCC0055.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0059 = La m\u00e9moire tampon de lecture est null.
JMSCC0059.explanation = Une r\u00e9f\u00e9rence null a \u00e9t\u00e9 transmise \u00e0 la m\u00e9thode StreamMessage.readBytes() ; aucune donn\u00e9e n'a donc \u00e9t\u00e9 renvoy\u00e9e.
JMSCC0059.useraction = Transmettez une m\u00e9moire tampon de taille appropri\u00e9e \u00e0 la m\u00e9thode readBytes().
JMSCC0059.exception = java.lang.NullPointerException

JMSCC0060 = La fin du flux de messages a \u00e9t\u00e9 atteinte.
JMSCC0060.explanation = La fin du contenu des messages a \u00e9t\u00e9 atteinte. Cette situation est normale si l'application de lecture ne conna\u00eet pas le montant de donn\u00e9es attendu.
JMSCC0060.useraction = Aucune action de l'utilisateur n'est n\u00e9cessaire.
JMSCC0060.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCC0061 = Le tableau d'octets StreamMessage n'a pas \u00e9t\u00e9 compl\u00e8tement lu.
JMSCC0061.explanation = Le syst\u00e8me a tent\u00e9 de lire la zone suivante du flux alors qu'un tableau d'octets \u00e9tait lu partiellement.
JMSCC0061.useraction = Veillez \u00e0 ce que le code utilisateur ach\u00e8ve la lecture des tableaux d'octets avant de lire la zone suivante.
JMSCC0061.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0062 = Il n'est pas possible de renvoyer Null en tant que caract\u00e8re.
JMSCC0062.explanation = Tentative de lecture d'une zone StreamMessage contenant Null \u00e0 l'aide de la m\u00e9thode readChar().
JMSCC0062.useraction = Evitez la lecture de valeurs Null \u00e0 l'aide de la m\u00e9thode readChar().
JMSCC0062.exception = java.lang.NullPointerException

JMSCC0063 = Le codage n''est pas valide pour la cha\u00eene ''{0}''.
JMSCC0063.explanation = La valeur fournie ne comporte pas de codage connu.
JMSCC0063.useraction = Veillez \u00e0 ce que l'application indique une valeur appartenant \u00e0 la liste d\u00e9finie de codages.
JMSCC0063.inserts = JMS_IBM_Encoding

JMSCC0064 = Une erreur interne s'est produite lors de l'\u00e9criture dans le flux de donn\u00e9es.
JMSCC0064.explanation = Un incident li\u00e9 aux flux de donn\u00e9es utilis\u00e9s pour la conversion de format des valeurs de type Float et Double est survenu.
JMSCC0064.useraction = Sauvegardez les fichiers de sortie g\u00e9n\u00e9r\u00e9s et utilisez le site de support de WMQ (http://www.ibm.com/software/integration/wmq/support) ou IBM Support Assistant (ISA) (http://www.ibm.com/software/support/isa/) pour v\u00e9rifier si une solution est d\u00e9j\u00e0 disponible.  Si vous n'en trouvez pas, adressez-vous \u00e0 votre service d'assistance IBM.

JMSCC0065 = Une tentative de lecture a \u00e9t\u00e9 effectu\u00e9e au-del\u00e0 de la fin du message.
JMSCC0065.explanation = Une tentative de lecture a \u00e9t\u00e9 effectu\u00e9e au-del\u00e0 de la fin du message. Il peut s'agir d'une condition normale si une application a \u00e9t\u00e9 cod\u00e9e afin de lire des donn\u00e9es de longueur variable \u00e0 l'aide de la sp\u00e9cification JMS 1.0.2.
JMSCC0065.useraction = Si n\u00e9cessaire, codez \u00e0 nouveau l'application afin d'utiliser la nouvelle m\u00e9thode getBodyLength().
JMSCC0065.exception = com.ibm.msg.client.jms.DetailedMessageEOFException

JMSCC0066 = La conversion UTF-8 a \u00e9chou\u00e9.
JMSCC0066.explanation = Un incident est survenu lors de la lecture ou de l'\u00e9criture d'une cha\u00eene UTF-8. Il s'agit g\u00e9n\u00e9ralement d'une tentative d'\u00e9criture d'une cha\u00eene d'une longueur sup\u00e9rieure \u00e0 65535 caract\u00e8res.
JMSCC0066.useraction = Reportez-vous \u00e0 l'exception associ\u00e9e pour plus d'informations.
JMSCC0066.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0067 = Une erreur interne s'est produite. Un incident est survenu lors de l'\u00e9criture dans le message.
JMSCC0067.explanation = Une erreur s'est produite lors de la tentative d'\u00e9criture d'un \u00e9l\u00e9ment dans le message.
JMSCC0067.useraction = Sauvegardez les fichiers de sortie g\u00e9n\u00e9r\u00e9s et utilisez le site de support de WMQ (http://www.ibm.com/software/integration/wmq/support) ou IBM Support Assistant (ISA) (http://www.ibm.com/software/support/isa/) pour v\u00e9rifier si une solution est d\u00e9j\u00e0 disponible.  Si vous n'en trouvez pas, adressez-vous \u00e0 votre service d'assistance IBM.
JMSCC0067.exception = com.ibm.msg.client.jms.DetailedResourceAllocationException

JMSCC0068 = La propri\u00e9t\u00e9 ''{0}'' doit \u00eatre d\u00e9finie avec une valeur de type ''{1}'' ou un type convertible dans ce type conform\u00e9ment \u00e0 \
la sp\u00e9cification JMS. Impossible de proc\u00e9der \u00e0 la conversion \u00e0 partir du type donn\u00e9 ''{2}''. 
JMSCC0068.explanation = La conversion entre les deux types de donn\u00e9es sp\u00e9cifi\u00e9es n'est pas admise par la sp\u00e9cification JMS.
JMSCC0068.useraction = D\u00e9finissez la propri\u00e9t\u00e9 indiqu\u00e9e en utilisant l'une des conversions admises.
JMSCC0068.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC0068.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE

JMSCC0069 = La propri\u00e9t\u00e9 ''{0}'' doit \u00eatre d\u00e9finie avec une valeur de type ''{1}''. Impossible de proc\u00e9der \u00e0 la conversion \u00e0 partir du \
type donn\u00e9 ''{2}'' avec la valeur ''{3}''. 
JMSCC0069.explanation = Une erreur est survenue lors de la tentative de d\u00e9finition d'une propri\u00e9t\u00e9 de message.
JMSCC0069.useraction = D\u00e9finissez la propri\u00e9t\u00e9 indiqu\u00e9e en utilisant l'une des conversions admises avec une valeur appropri\u00e9e.
JMSCC0069.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC0069.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE, XMSC_INSERT_VALUE

JMSCC0070 = Une erreur interne s''est produite. Un probl\u00e8me est survenu lors de la d\u00e9finition de la propri\u00e9t\u00e9 de message JMS ''{0}'', \
dont le type attendu est ''{1}'', avec un objet de type ''{2}''.
JMSCC0070.explanation = Une erreur est survenue lors de la tentative de d\u00e9finition d'une propri\u00e9t\u00e9 de message.
JMSCC0070.useraction = Sauvegardez les fichiers de sortie g\u00e9n\u00e9r\u00e9s et utilisez le site de support de WMQ (http://www.ibm.com/software/integration/wmq/support) ou IBM Support Assistant (ISA) (http://www.ibm.com/software/support/isa/) pour v\u00e9rifier si une solution est d\u00e9j\u00e0 disponible.  Si vous n'en trouvez pas, adressez-vous \u00e0 votre service d'assistance IBM.
JMSCC0070.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC0070.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE

JMSCC0083 = Un objet incorrect de type ''{0}'' a \u00e9t\u00e9 fourni.
JMSCC0083.explanation = Un objet a \u00e9t\u00e9 fourni \u00e0 la m\u00e9thode writeObject() qui n'\u00e9tait pas de type encapsuleur primitif Java(tm).
JMSCC0083.useraction = Corrigez l'application afin de vous assurer que seuls les objets des types autoris\u00e9s sont utilis\u00e9s comme param\u00e8tres de la m\u00e9thode writeObject().
JMSCC0083.inserts = XMSC_INSERT_OBJECT
JMSCC0083.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0084 = Une propri\u00e9t\u00e9 de nom ''{0}'' n''a pas \u00e9t\u00e9 d\u00e9finie.
JMSCC0084.inserts = XMSC_INSERT_PROPERTY

JMSCC0085 = Une destination n'a pas \u00e9t\u00e9 sp\u00e9cifi\u00e9e.
JMSCC0085.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0086 = La taille de lot ''{0}'' \u00e9tait incorrecte.
JMSCC0086.inserts = XMSC_INSERT_BATCH_SIZE

JMSCC0087 = Aucun pool de sessions serveur n'a \u00e9t\u00e9 sp\u00e9cifi\u00e9.

JMSCC0088 = Impossible d'obtenir une session du pool de sessions serveur sp\u00e9cifi\u00e9.

JMSCC0089 = La session ''{0}'' n''\u00e9tait pas valide.
JMSCC0089.inserts = XMSC_INSERT_SESSION

JMSCC0091 = La fabrique de fournisseurs du type de connexion ''{0}'' n''a pas pu \u00eatre charg\u00e9e.
JMSCC0091.inserts = XMSC_CONNECTION_TYPE

JMSCC0092 = Le type de connexion devait \u00eatre ''{0}'', mais il s''agit en fait du type ''{1}''.
JMSCC0092.inserts = XMSC_CONNECTION_TYPE_NAME, XMSC_CONNECTION_TYPE
JMSCC0092.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0093 = La destination n''\u00e9tait pas valide. L''abonnement durable sur une destination temporaire de type ''{0}'' et de nom ''{1}'' ne peut pas \u00eatre cr\u00e9\u00e9.
JMSCC0093.inserts = XMSC_INSERT_TYPE, XMSC_DESTINATION_NAME
JMSCC0093.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0094 = Ce navigateur de connexion est ferm\u00e9.
JMSCC0094.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0095 = Le nom de destination ''{0}'' n''est pas valide.
JMSCC0095.explanation = Le nom de destination sp\u00e9cifi\u00e9 ne respecte pas la syntaxe de destination publi\u00e9e.
JMSCC0095.useraction = Corrigez le nom de destination sp\u00e9cifi\u00e9 et recommencez.
JMSCC0095.inserts = XMSC_DESTINATION_NAME
JMSCC0095.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0097 = Mode d''accus\u00e9 de r\u00e9ception ''{0}'' incorrect. Connection.createSession() devait cr\u00e9er une session non transactionnelle (le \
param\u00e8tre transacted avait la valeur false), mais le mode d''accus\u00e9 de r\u00e9ception n''\u00e9tait pas AUTO_ACKNOWLEDGE, DUPS_OK_ACKNOWLEDGE ou CLIENT_ACKNOWLEDGE.
JMSCC0097.inserts = XMSC_ACKNOWLEDGE_MODE

JMSCC0098 = Le message ne peut pas \u00eatre null.
JMSCC0098.useraction = Sp\u00e9cifiez un message non null.
JMSCC0098.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0099 = La destination ''{0}'' n''est pas une instance de com.ibm.msg.client.jms.JmsDestination.
JMSCC0099.useraction = Sp\u00e9cifiez une instance de com.ibm.msg.client.jms.JmsDestination \u00e0 la place.
JMSCC0099.inserts = XMSC_DESTINATION_NAME
JMSCC0099.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0100 = Le nom d'abonnement ne peut pas \u00eatre null.
JMSCC0100.useraction = Sp\u00e9cifiez un nom d'abonnement non null.
JMSCC0100.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC0101 = L'ID client ne peut pas \u00eatre null.
JMSCC0101.useraction = Sp\u00e9cifiez un ID client non null.
JMSCC0101.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC0102 = Le nom de propri\u00e9t\u00e9 ''{0}'' dans le message ne correspond pas \u00e0 un identificateur Java(tm) valide.
JMSCC0102.explanation = Le nom de propri\u00e9t\u00e9 indiqu\u00e9 ne correspond pas au format d\u00e9crit dans la sp\u00e9cification JMS.
JMSCC0102.useraction = V\u00e9rifiez les caract\u00e8res utilis\u00e9s dans le nom de la propri\u00e9t\u00e9 et modifiez-les.
JMSCC0102.inserts = XMSC_INSERT_PROPERTY
JMSCC0102.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0103 = Un objet null a \u00e9t\u00e9 sp\u00e9cifi\u00e9.
JMSCC0103.explanation = Un objet null a \u00e9t\u00e9 fourni \u00e0 la m\u00e9thode writeObject().
JMSCC0103.useraction = Corrigez l'application afin de vous assurer que seuls les objets non null sont utilis\u00e9s comme param\u00e8tres de la m\u00e9thode writeObject().
JMSCC0103.exception = java.lang.NullPointerException

JMSCC0105 = La conversion de l''\u00e9l\u00e9ment ''{0}'' du type ''{1}'' en type ''{2}'' n''est pas autoris\u00e9e.
JMSCC0105.explanation = La conversion entre les deux types de donn\u00e9es sp\u00e9cifi\u00e9es n'est pas admise par la sp\u00e9cification JMS.
JMSCC0105.useraction = R\u00e9cup\u00e9rez l'\u00e9l\u00e9ment mentionn\u00e9 et convertissez-le selon l'une des m\u00e9thodes permises.
JMSCC0105.inserts = XMSC_INSERT_PROPERTY, XMSC_INSERT_TYPE, XMSC_INSERT_OTHER_TYPE
JMSCC0105.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC0106 = Impossible d''obtenir une ressource XA. ''{0}''.
JMSCC0106.useraction = Consultez le motif pour obtenir des informations suppl\u00e9mentaires.
JMSCC0106.inserts = XMSC_INSERT_EXCEPTION
JMSCC0106.exception = java.lang.RuntimeException

JMSCC0107 = D\u00e9lai d''expiration ''{0}'' incorrect.
JMSCC0107.explanation = Le d\u00e9lai d'expiration doit \u00eatre positif ou nul et \u00eatre exprim\u00e9 en millisecondes.
JMSCC0107.useraction = Ne transmettez pas de d\u00e9lai d'expiration n\u00e9gatif.
JMSCC0107.inserts = XMSC_INSERT_TIMEOUT

# Message changed for APAR IT16300
JMSCC0108 = IBM MQ classes for JMS avait d\u00e9tect\u00e9 un message, pr\u00eat pour \u00eatre distribu\u00e9 de mani\u00e8re asynchrone \u00e0 une application. Lors de la tentative de distribution, ce message n'\u00e9tait plus disponible. Pour les motifs possibles et les actions \u00e0 entreprendre, reportez-vous \u00e0 la rubrique relative \u00e0 l'identification et la r\u00e9solution des probl\u00e8mes des messages JMSCC01088, dans la section IBM MQ V9.0 de l'IBM Knowledge Center.
JMSCC0108.explanation = Une unit\u00e9 d'ex\u00e9cution interne \u00e0 IBM MQ classes for JMS a d\u00e9tect\u00e9 un message et demand\u00e9 qu'une autre unit\u00e9 d'ex\u00e9cution interne extrait ce message et le distribue \u00e0 une application pour traitement. Lorsque cette unit\u00e9 d'ex\u00e9cution a tent\u00e9 d'extraire le message, ce dernier n'\u00e9tait plus disponible.
JMSCC0108.useraction = Pour plus d'informations, reportez-vous \u00e0 la rubrique relative \u00e0 l'identification et la r\u00e9solution des probl\u00e8mes des messages JMSCC01088, dans la section IBM MQ V9.0 de l'IBM Knowledge Center.

JMSCC0109 = Un bean g\u00e9r\u00e9 par message a g\u00e9n\u00e9r\u00e9 une exception d''ex\u00e9cution ''{0}''.
JMSCC0109.explanation = L'erreur est peut-\u00eatre li\u00e9e au programme d'\u00e9coute des messages.
JMSCC0109.useraction = Si l'exception d'ex\u00e9cution a \u00e9t\u00e9 g\u00e9n\u00e9r\u00e9e involontairement par le programme d'\u00e9coute des messages, utilisez l'exception li\u00e9e pour d\u00e9terminer la cause de l'incident.
JMSCC0109.inserts = XMSC_INSERT_EXCEPTION
JMSCC0109.exception = java.lang.RuntimeException

JMSCC0110 = Une exception ''{0}'' a \u00e9t\u00e9 intercept\u00e9e lors du traitement d''un message pour le distribuer \u00e0 un bean g\u00e9r\u00e9 par message.
JMSCC0110.useraction = Reportez-vous \u00e0 l'exception associ\u00e9e pour plus d'informations.
JMSCC0110.inserts = XMSC_INSERT_EXCEPTION
JMSCC0110.exception = java.lang.RuntimeException

JMSCC0111 = IBM MQ classes for JMS a tent\u00e9 de d\u00e9finir un ID client pr\u00e9existant sur une connexion ou un contexte JMS (JMSContext).
JMSCC0111.explanation = Une application a tent\u00e9 de d\u00e9finir la valeur ''{0}'' pour la propri\u00e9t\u00e9 d''ID client d''une connexion valide ou de JMSContext, mais cette valeur est d\u00e9j\u00e0 utilis\u00e9e.\n\
L''ID client a d\u00e9j\u00e0 \u00e9t\u00e9 d\u00e9fini par {1}.
JMSCC0111.useraction = V\u00e9rifiez que la connexion est valide et que l'ID client est unique.
JMSCC0111.inserts = XMSC_INSERT_VALUE, XMSC_INSERT_STRING
JMSCC0111.exception = com.ibm.msg.client.jms.DetailedInvalidClientIDException

JMSCC0112 = Le d\u00e9lai de distribution n'est pas pris en charge par ce fournisseur
JMSCC0112.explanation = Une application a tent\u00e9 de d\u00e9finir un d\u00e9lai de distribution, mais le fournisseur JMS ne prend pas en charge cette fonction

JMSCC0113 = Le d\u00e9lai de distribution doit \u00eatre inf\u00e9rieur \u00e0 la dur\u00e9e de vie
JMSCC0113.explanation = Une application a tent\u00e9 de d\u00e9finir un d\u00e9lai de distribution, mais la dur\u00e9e de vie n'\u00e9tait pas sup\u00e9rieure \u00e0 ce d\u00e9lai

JMSCC0114 = Le d\u00e9lai de distribution n'est pas pris en charge pour les publications conserv\u00e9es
JMSCC0114.explanation = Une application a tent\u00e9 de d\u00e9finir un d\u00e9lai de distribution sur un message conserv\u00e9 ; cette fonction n'est pas prise en charge

JMSCC0115 = Le d\u00e9lai de distribution ne peut pas \u00eatre utilis\u00e9 avec le regroupement
JMSCC0115.explanation = Une application a tent\u00e9 de d\u00e9finir un d\u00e9lai de distribution pour un message qui poss\u00e8de \u00e9galement un ID de \
groupe et/ou un num\u00e9ro de s\u00e9quence de groupe ; cette fonction n'est pas prise en charge

# Message for FFST - additional fields not required
JMSCC1026 = Une exception a \u00e9t\u00e9 g\u00e9n\u00e9r\u00e9e alors que le programme d'\u00e9coute des exceptions de l'utilisateur \u00e9tait en cours d'ex\u00e9cution.

# Message for FFST - additional fields not required
JMSCC1027 = Le programme d'\u00e9coute des exceptions n'a pas pu \u00eatre ex\u00e9cut\u00e9.

JMSCC1069 = L'op\u00e9ration d'une session transactionnelle XA n'\u00e9tait pas valide.
JMSCC1069.explanation = Le mode d'accus\u00e9 de r\u00e9ception d'une session transactionnelle n'\u00e9tait pas valide. Les op\u00e9rations Commit(), rollback(), acknowledge() et recover() ne sont pas valides dans les sessions transactionnelles.
JMSCC1069.useraction = N'appelez pas ces m\u00e9thodes lorsque vous utilisez XA.
JMSCC1069.exception = com.ibm.msg.client.jms.DetailedTransactionInProgressException

JMSCC1083 = Taille de lot de message incorrecte (sa valeur elle doit \u00eatre sup\u00e9rieure \u00e0 z\u00e9ro).
JMSCC1083.explanation = Un param\u00e8tre de taille de lot incorrect a \u00e9t\u00e9 transmis \u00e0 createConnectionConsumer() ou createDurableConnectionConsumer().
JMSCC1083.useraction = D\u00e9finissez une taille de lot sup\u00e9rieure \u00e0 z\u00e9ro. Sur un serveur d'applications compatible JEE, cela peut repr\u00e9senter une erreur sur le serveur d'applications. Reportez-vous \u00e0 la documentation de votre serveur d'applications.

JMSCC1084 = Un pool de sessions serveur null a \u00e9t\u00e9 fourni.
JMSCC1084.explanation = Le pool de sessions serveur sp\u00e9cifi\u00e9 dans createConnectionConsumer() ou createDurableConnectionConsumer() \u00e9tait null.
JMSCC1084.useraction = D\u00e9finissez un pool de sessions serveur appropri\u00e9. Sur un serveur d'applications compatible JEE, cela peut repr\u00e9senter une erreur sur le serveur d'applications. Reportez-vous \u00e0 la documentation de votre serveur d'applications.

JMSCC1093 = Un param\u00e8tre null a \u00e9t\u00e9 transmis.
JMSCC1093.explanation = Un objet requis par cette m\u00e9thode n'a pas \u00e9t\u00e9 correctement initialis\u00e9.
JMSCC1093.useraction = V\u00e9rifiez que tous les param\u00e8tres transmis \u00e0 cette m\u00e9thode sont correctement initialis\u00e9s.

JMSCC1094 = QuantityHint n'est pas valide.
JMSCC1094.explanation = Tentative de cr\u00e9ation d'un navigateur de connexion avec un conseil de quantit\u00e9 de donn\u00e9es incorrect.
JMSCC1094.useraction = Sp\u00e9cifiez NO_DATA, HEADER_DATA ou FULL_DATA.
JMSCC1094.exception = java.lang.IllegalArgumentException

JMSCC1096 = La r\u00e9f\u00e9rence de message n'est pas valide.
JMSCC1096.explanation = Une r\u00e9f\u00e9rence de message dont la syntaxe est incorrecte a \u00e9t\u00e9 transmise \u00e0 cette m\u00e9thode. La r\u00e9f\u00e9rence de message doit \u00eatre une instance de JmsMessageReference.
JMSCC1096.useraction = Assurez-vous que les r\u00e9f\u00e9rences de message utilis\u00e9es sont correctes.

JMSCC1112 = L''op\u00e9ration pour un objet sp\u00e9cifique \u00e0 un domaine n''\u00e9tait pas valide. L''op\u00e9ration ''{0}'' n''est pas valide pour le type ''{1}''.
JMSCC1112.explanation = Une application JMS a essay\u00e9 d'effectuer une op\u00e9ration sur un objet sp\u00e9cifique \u00e0 un domaine, mais cette op\u00e9ration n'est valide que pour l'autre domaine de messagerie.
JMSCC1112.useraction = V\u00e9rifiez que les op\u00e9rations et les objets JMS utilis\u00e9s par votre application sont appropri\u00e9es pour le domaine de messagerie requis. Si votre application utilise les deux domaines de messagerie, il est conseill\u00e9 d'utiliser des objets ind\u00e9pendants du domaine dans l'application.
JMSCC1112.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_TYPE
JMSCC1112.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC1113 = L''op\u00e9ration pour un objet sp\u00e9cifique \u00e0 un domaine n''\u00e9tait pas valide. L''op\u00e9ration ''{0}'' n''est pas valide pour le type ''{1}'' car la session est de type ''{2}''.
JMSCC1113.explanation = Une application JMS a essay\u00e9 d'effectuer une op\u00e9ration sur un objet sp\u00e9cifique \u00e0 un domaine, mais cette op\u00e9ration n'est valide que pour l'autre domaine de messagerie.
JMSCC1113.useraction = V\u00e9rifiez que les objets JMS, les op\u00e9rations et les fabriques de connexions utilis\u00e9s par \
votre application sont appropri\u00e9s pour le domaine de \
messagerie requis. Si votre application utilise les deux domaines de messagerie, il est conseill\u00e9 d'utiliser des objets ind\u00e9pendants du domaine dans l'application.
JMSCC1113.inserts = XMSC_INSERT_METHOD, XMSC_INSERT_TYPE,XMSC_INSERT_SESSION
JMSCC1113.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC3002 = La destination de file d''attente temporaire ''{0}'' ne peut pas \u00eatre supprim\u00e9e car elle est toujours utilis\u00e9e.
JMSCC3002.explanation = Tentative de suppression d'une destination temporaire en cours d'utilisation par un consommateur ou un navigateur.
JMSCC3002.useraction = Fermez tous les consommateurs et navigateurs qui d\u00e9pendent de la destination avant de la supprimer.
JMSCC3002.inserts = XMSC_DESTINATION_NAME

JMSCC3003 = Utilisation incorrecte de la destination temporaire ''{0}'' .
JMSCC3003.explanation = L'utilisation de destinations temporaires par consommateurs de message et navigateurs est restreinte aux destinations cr\u00e9\u00e9es \u00e0 l'aide de la m\u00eame connexion.
JMSCC3003.useraction = Modifiez l'application pour utiliser une destination temporaire cr\u00e9\u00e9e par la m\u00eame connexion et recommencez.
JMSCC3003.inserts = XMSC_DESTINATION_NAME
JMSCC3003.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException


JMSCC3019 = La destination temporaire ''{0}'' a d\u00e9j\u00e0 \u00e9t\u00e9 supprim\u00e9e.
JMSCC3019.explanation = La destination temporaire avait d\u00e9j\u00e0 \u00e9t\u00e9 supprim\u00e9e lors de sa tentative d'utilisation.
JMSCC3019.useraction = Modifiez l'application, \u00e9vitez de fermer la destination temporaire ou utilisez une autre destination.
JMSCC3019.inserts = XMSC_DESTINATION_NAME
JMSCC3019.exception = com.ibm.msg.client.jms.DetailedInvalidDestinationException

JMSCC3025 = La destination de rubrique temporaire ''{0}'' ne peut pas \u00eatre supprim\u00e9e car elle est toujours utilis\u00e9e.
JMSCC3025.explanation = Tentative de suppression d'une destination temporaire en cours d'utilisation par un consommateur ou un navigateur.
JMSCC3025.useraction = Fermez tous les consommateurs et navigateurs qui d\u00e9pendent de la destination avant de la supprimer.
JMSCC3025.inserts = XMSC_DESTINATION_NAME

JMSCC3031 = Un ID client ne peut pas \u00eatre d\u00e9fini une fois que la connexion a \u00e9t\u00e9 utilis\u00e9e.
JMSCC3031.explanation = L'ID client d'une connexion ne peut \u00eatre d\u00e9fini qu'une seule fois, et uniquement avant que la connexion ne soit utilis\u00e9e.
JMSCC3031.useraction = D\u00e9finissez l'ID client avant d'utiliser la connexion.
JMSCC3031.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC3032 = Red\u00e9finition de l'ID client non admise.
JMSCC3032.explanation = L'ID client d'une connexion ne peut \u00eatre d\u00e9fini qu'une seule fois, et uniquement avant que la connexion ne soit utilis\u00e9e.
JMSCC3032.useraction = D\u00e9finissez l'ID client avant d'utiliser la connexion.
JMSCC3032.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

JMSCC3033 = L'appel close() du programme d'\u00e9coute des messages se serait bloqu\u00e9.
JMSCC3033.explanation = La m\u00e9thode close() a \u00e9t\u00e9 appel\u00e9e \u00e0 partir d'un programme d'\u00e9coute de messages. L'appel close() n'est pas autoris\u00e9 a renvoyer une valeur tant que le programme d'\u00e9coute des messages est actif et par cons\u00e9quent, il se bloque.
JMSCC3033.useraction = Modifiez l'application de sorte qu'elle n'appelle pas de m\u00e9thodes close() \u00e0 partir du programme d'\u00e9coute des messages.
JMSCC3033.exception = com.ibm.msg.client.jms.DetailedIllegalStateException

# Log message
JMSCC3034 = L''exception est ignor\u00e9e car aucun programme d''\u00e9coute des exceptions n''est enregistr\u00e9 : ''{0}''.
JMSCC3034.explanation = Tentative de distribution d'une exception au programme d'\u00e9coute des exception de connexion alors qu'aucun programme d'\u00e9coute n'a \u00e9t\u00e9 enregistr\u00e9.
JMSCC3034.useraction = Un programme d'\u00e9coute des exceptions doit \u00eatre enregistr\u00e9 avec la connexion pour recevoir ses exceptions.
JMSCC3034.inserts = XMSC_INSERT_EXCEPTION

# Log message
JMSCC3035 = L''exception est ignor\u00e9e car son type ne fait pas partie de ceux choisis pour le programme d''\u00e9coute des exceptions : ''{0}''.
JMSCC3035.explanation = L'exception n'est pas comprise dans les types d'exception choisis pour \u00eatre distribu\u00e9s au programme d'\u00e9coute des exceptions de connexion ; elle a donc \u00e9t\u00e9 ignor\u00e9e.
JMSCC3035.useraction = V\u00e9rifiez le param\u00e8tre de connexion ASYNC_EXCEPTIONS pour vous assurer que le filtrage des exceptions est d\u00e9fini correctement.
JMSCC3035.inserts = XMSC_INSERT_EXCEPTION

# Log message
JMSCC3036 = Une exception a \u00e9t\u00e9 distribu\u00e9e au programme d''\u00e9coute des exceptions de connexion : ''{0}''.
JMSCC3036.useraction = Pour plus d'informations, v\u00e9rifiez les d\u00e9tails de l'exception.
JMSCC3036.inserts = XMSC_INSERT_EXCEPTION

JMSCC3039 = Le nom d'abonnement \u00e9tait null ou sa cha\u00eene \u00e9tait vide.
JMSCC3039.explanation = Les consommateurs de connexion durable doivent poss\u00e9der un nom d'abonnement non null et dont la cha\u00eene n'est pas vide.
JMSCC3039.useraction = Transmettez un nom d'abonnement non null et ne correspondant pas \u00e0 une cha\u00eene vide.

JMSCC3040 = La tentative de modification des m\u00e9tadonn\u00e9es de connexion a \u00e9t\u00e9 ignor\u00e9e. 
JMSCC3040.explanation = Les m\u00e9tadonn\u00e9es de connexion sont en lecture seule. Les propri\u00e9t\u00e9s ne peuvent pas \u00eatre modifi\u00e9es.
JMSCC3040.useraction = Modifiez l'application afin qu'il n'y ait pas de tentative de modification des m\u00e9tadonn\u00e9es de connexion.

JMSCC3041 = La tentative de d\u00e9finition simultan\u00e9e de plusieurs propri\u00e9t\u00e9s a \u00e9chou\u00e9. Les propri\u00e9t\u00e9s sont ''{0}''.
JMSCC3041.explanation = Une ou plusieurs propri\u00e9t\u00e9s n'ont pas pu \u00eatre valid\u00e9es. Aucune modification n'a \u00e9t\u00e9 effectu\u00e9e.
JMSCC3041.useraction = V\u00e9rifiez que la combinaison de propri\u00e9t\u00e9s poss\u00e8de des valeurs admises. 
JMSCC3041.inserts = XMSC_INSERT_PROPERTY

# XA unavailable. An attempt was made to perform and action that requires XA when XA is not supported.
JMSCC4001 = Transactions distribu\u00e9es indisponibles.
JMSCC4001.explanation = Tentative d'utilisation de transactions distribu\u00e9es dans un environnement o\u00f9 elles ne sont pas disponibles.


JMSCC5001 = Impossible d'obtenir le corps du message car le message est un StreamMessage
JMSCC5001.explanation = Le corps du message n'a pas pu \u00eatre obtenu car le message est un StreamMessage, ce que ne permet pas la sp\u00e9cification JMS
JMSCC5001.useraction = L'application ou le type de message envoy\u00e9 devra \u00eatre modifi\u00e9
JMSCC5001.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC5002 = Le corps du message de type {0} ne peut pas \u00eatre affect\u00e9 \u00e0 {1}
JMSCC5002.explanation = La sp\u00e9cification JMS n'autorise pas les affectations de ce type
JMSCC5002.useraction = L'application ou le type de message envoy\u00e9 devra \u00eatre modifi\u00e9
JMSCC5002.exception = com.ibm.msg.client.jms.DetailedMessageFormatException
JMSCC5002.inserts = XMSC_INSERT_MESSAGE_TYPE, XMSC_INSERT_BODY_TYPE

JMSCC5003 = Une exception s''est produite lors de la d\u00e9s\u00e9rialisation d''un message ; exception : ''{0}''.
JMSCC5003.explanation = Il n'a pas \u00e9t\u00e9 possible de d\u00e9s\u00e9rialiser le message \u00e0 cause de l'exception affich\u00e9e.
JMSCC5003.useraction = Pour obtenir plus de d\u00e9tails sur l'erreur, consultez l'exception associ\u00e9e.
JMSCC5003.inserts = XMSC_INSERT_EXCEPTION
JMSCC5003.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC5004 = Ce message n'a pas de corps
JMSCC5004.explanation = Le message n'a pas de corps et ne peut donc pas \u00eatre converti dans le type sp\u00e9cifi\u00e9
JMSCC5004.useraction = L'application ou le type de message envoy\u00e9 devra \u00eatre modifi\u00e9
JMSCC5004.exception = com.ibm.msg.client.jms.DetailedMessageFormatException

JMSCC5005 = L'envoi de ce message n'est pas autoris\u00e9 car le corps du message est en lecture seule et qu'un appel JmsProducer.setProperty a \u00e9t\u00e9 effectu\u00e9.
JMSCC5005.explanation = Une application utilisateur a tent\u00e9 de d\u00e9finir un corps de message en lecture seule via un appel  JmsProducer.setProperty.
JMSCC5005.useraction = Modifiez le programme d'application en vue de supprimer ce comportement ou appelez tout d'abord la m\u00e9thode clearBody().
JMSCC5005.exception = com.ibm.msg.client.jms.DetailedMessageNotWriteableException

JMSCC5006 = Ce message ne peut pas \u00eatre envoy\u00e9 car la m\u00e9moire tampon d'envoi asynchrone c\u00f4t\u00e9 client est pleine
JMSCC5006.explanation = Une application utilisateur a tent\u00e9 d'envoyer de fa\u00e7on asynchrone un message JMS et il existe d\u00e9j\u00e0 un journal de \
messages asynchrones en attente sur le client.
JMSCC5006.useraction = Changez le programme d'application pour qu'il appelle des m\u00e9thodes d'envoi asynchrones moins fr\u00e9quemment ou \
reportez-vous \u00e0 votre documentation pour prendre connaissance des options de configuration.

JMSCC5007 = L''utilisation de l''API JMS2.0 ''{0}'' n''est pas prise en charge avec cette instance de cette connexion.
JMSCC5007.explanation = Seules les connexions dont le type est appropri\u00e9 peuvent prendre en charge l'API JMS2.0
JMSCC5007.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC5007.inserts =XMSC_INSERT_METHOD

JMSCC5008 = L''utilisation de la fonction JMS2.0 ''{0}'' n''est pas prise en charge avec cette instance de cette connexion.
JMSCC5008.explanation = L'utilisation de la fonctionnalit\u00e9 JMS2.0 mentionn\u00e9e dans le message n'est prise en charge qu'en cas de \
connexion \u00e0 un gestionnaire de files d'attente IBM MQ version 8 avec le mode de fournisseur de messagerie IBM MQ version 8.
JMSCC5008.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC5008.inserts =XMSC_INSERT_METHOD

JMSCC5009 = Aucune r\u00e9ponse de l'unit\u00e9 d'ex\u00e9cution \u00e0 l'origine de l'envoi. Il se peut que le message n'ait pas \u00e9t\u00e9 envoy\u00e9.
JMSCC5009.explanation = L'unit\u00e9 d'ex\u00e9cution d'envoi asynchrone ne r\u00e9pond pas. Il se peut qu'elle ait pris fin de mani\u00e8re inattendue.

JMSCC5010 = Substitution des propri\u00e9t\u00e9s ConnectionFactory depuis PropertyStore :\n\
{0}
JMSCC5010.inserts = XMSC_INSERT_PROPERTY_OVERRIDE_LIST

JMSCC5011 = Substitution de la propri\u00e9t\u00e9 {0} :\n\
\tValeur d''origine = {1}\n\
\tNouvelle valeur = {2}
JMSCC5011.inserts = XMSC_OVERRIDDEN_PROPERTY, XMSC_ORIGINAL__PROPERTY_VALUE, XMSC_NEW_PROPERTY_VALUE

#CICS related messages. JMSCC6 used to prevent issues when back porting.
#The first two exceptions have the same text but different exception types
JMSCC6001 = La m\u00e9thode ''{0}'' n''est pas prise en charge en cas d''ex\u00e9cution dans un environnement CICS.
JMSCC6001.explanation = La m\u00e9thode sp\u00e9cifi\u00e9e ne peut pas \u00eatre utilis\u00e9e avec une connexion en mode liaisons \u00e0 MQ dans un \
environnement CICS.
JMSCC6001.useraction = Modifiez l'application pour qu'elle n'appelle pas la m\u00e9thode sp\u00e9cifi\u00e9e.
JMSCC6001.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6001.inserts = XMSC_INSERT_METHOD
 
JMSCC6002 = La m\u00e9thode ''{0}'' n''est pas prise en charge en cas d''ex\u00e9cution dans un environnement CICS.
JMSCC6002.explanation = La m\u00e9thode sp\u00e9cifi\u00e9e ne peut pas \u00eatre utilis\u00e9e avec une connexion en mode liaisons \u00e0 MQ dans un \
environnement CICS.
JMSCC6002.useraction = Modifiez l'application pour qu'elle n'appelle pas la m\u00e9thode sp\u00e9cifi\u00e9e.
JMSCC6002.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC6002.inserts = XMSC_INSERT_METHOD
 
JMSCC6003 = Une instance de session seulement par connexion peut \u00eatre active \u00e0 la fois en cas d'ex\u00e9cution dans un environnement CICS.
JMSCC6003.explanation = Une instance de session unique par connexion en mode liaisons \u00e0 MQ peut \u00eatre active \u00e0 la fois dans un \
environnement CICS.
JMSCC6003.useraction = Modifiez l'application pour qu'elle cr\u00e9e une session \u00e0 partir d'une connexion diff\u00e9rente ou pour qu'elle ferme la session existante qui utilise la connexion en cours.
JMSCC6003.exception = com.ibm.msg.client.jms.DetailedJMSException
 
JMSCC6004 = La cr\u00e9ation d'une connexion ou d'un contexte JMS avec un ID utilisateur ou un mot de passe n'est pas prise en charge en cas \
d'ex\u00e9cution dans un environnement CICS.
JMSCC6004.explanation = Le gestionnaire de files d'attente ne prend pas en charge l'authentification ou l'autorisation avec un ID \
utilisateur et un mot de passe fournis lors de la cr\u00e9ation d'une connexion en mode liaisons ou d'un contexte JMS dans un environnement CICS. A la place, \
l'ID utilisateur associ\u00e9 \u00e0 l'espace adresse CICS ou \u00e0 la transaction est utilis\u00e9.
JMSCC6004.useraction = Modifiez l'application pour qu'elle ne sp\u00e9cifie pas d'ID utilisateur ou de mot de passe.
JMSCC6004.exception = com.ibm.msg.client.jms.DetailedJMSException

#The first two exceptions have the same text but different exception types
JMSCC6011 = La m\u00e9thode ''{0}'' n''est pas prise en charge lors de l''ex\u00e9cution dans un environnement IMS.
JMSCC6011.explanation = La m\u00e9thode sp\u00e9cifi\u00e9e ne peut pas \u00eatre utilis\u00e9e avec une connexion en mode liaisons dans un environnement \
IMS.
JMSCC6011.useraction = Modifiez l'application pour qu'elle n'appelle pas la m\u00e9thode sp\u00e9cifi\u00e9e.
JMSCC6011.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6011.inserts = XMSC_INSERT_METHOD
 
JMSCC6012 = La m\u00e9thode ''{0}'' n''est pas prise en charge lors de l''ex\u00e9cution dans un environnement IMS.
JMSCC6012.explanation = La m\u00e9thode sp\u00e9cifi\u00e9e ne peut pas \u00eatre utilis\u00e9e avec une connexion en mode liaisons dans un environnement \
IMS.
JMSCC6012.useraction = Modifiez l'application pour qu'elle n'appelle pas la m\u00e9thode sp\u00e9cifi\u00e9e.
JMSCC6012.exception = com.ibm.msg.client.jms.DetailedIllegalStateException
JMSCC6012.inserts = XMSC_INSERT_METHOD
 
JMSCC6013 = Une instance de session seulement par connexion peut \u00eatre active \u00e0 la fois en cas d'ex\u00e9cution dans un environnement IMS.
JMSCC6013.explanation = Une instance de session unique par connexion en mode liaisons \u00e0 MQ peut \u00eatre active \u00e0 la fois dans un \
environnement IMS.
JMSCC6013.useraction = Modifiez l'application pour qu'elle cr\u00e9e une session \u00e0 partir d'une connexion diff\u00e9rente ou pour qu'elle ferme la session existante qui utilise la connexion en cours.
JMSCC6013.exception = com.ibm.msg.client.jms.DetailedJMSException
 
JMSCC6014 = La cr\u00e9ation d'une connexion ou d'un contexte JMS avec un ID utilisateur ou un mot de passe n'est pas prise en charge en cas \
d'ex\u00e9cution dans un environnement IMS.
JMSCC6014.explanation = Le gestionnaire de files d'attente ne prend pas en charge l'authentification ou l'autorisation avec un ID \
utilisateur et un mot de passe fournis lors de la cr\u00e9ation d'une connexion en mode liaisons ou d'un contexte JMS dans un environnement IMS. A la place, \
l'ID utilisateur associ\u00e9 \u00e0 l'espace adresse IMS, \u00e0 la transaction, au nom LTERM ou PSBNAME, est utilis\u00e9.
JMSCC6014.useraction = Modifiez l'application pour qu'elle ne sp\u00e9cifie pas d'ID utilisateur ou de mot de passe.
JMSCC6014.exception = com.ibm.msg.client.jms.DetailedJMSException

JMSCC6015 = La m\u00e9thode ''{0}'' n''est pas prise en charge en cas d''ex\u00e9cution sur un serveur d''applications.
JMSCC6015.explanation = La m\u00e9thode sp\u00e9cifi\u00e9e ne doit pas \u00eatre utilis\u00e9e dans un conteneur Web ou d'EJB Java EE.
JMSCC6015.useraction = Modifiez l'application pour qu'elle n'appelle pas la m\u00e9thode sp\u00e9cifi\u00e9e.
JMSCC6015.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6015.inserts = XMSC_INSERT_METHOD

JMSCC6016 = Le d\u00e9lai d''attente a \u00e9t\u00e9 d\u00e9pass\u00e9 lors de l''attente de l''obtention d''une session serveur pour le serveur d''applications. Le d\u00e9lai d''attente est ''{0}''
JMSCC6016.explanation = Une fois le d\u00e9lai d'attente \u00e9coul\u00e9, l'adaptateur de ressources MQ doit cesser d'attendre une session serveur.
JMSCC6016.useraction = Envisagez d'augmenter ce d\u00e9lai d'attente avec la propri\u00e9t\u00e9 de configuration JMS 'com.ibm.msg.client.wmq.getServerSessionTimeout'
JMSCC6016.exception = com.ibm.msg.client.jms.DetailedJMSException
JMSCC6016.inserts = XMSC_INSERT_TIMEOUT
 
